[
    {
        "content": "\"http://www.oregonlive.com/opinion/index.ssf/2009/03/evangelicals_walk_a_fine_line.html\" quote: They're havens for secularism and sexual permissiveness. They indoctrinate our children against traditional American and family values. They're places where Jesus has been run out and moral weakness let in. Such is the environment of America's public schools, according to the rhetoric of many in conservative Christendom. The view helps explain why the number of home-schooled children in the United States has jumped 74 percent during the past eight years, according to the U.S. Department of Education. Not that they're all conservative religious people, but the vast majority of the parents of home-schooled kids cite \"providing religious or moral instruction\" as a reason for having their children taught at home rather than a public school... It is against this backdrop that something fascinating is happening with the church community here in the Portland area, something far more constructive than the bash-and-run approach typified by Perkins. Rather than fleeing from the public schools, many of the area's evangelical Christians are running toward them - toward schools such as Roosevelt High and Harvey Scott Elementary. Not to condemn the schools, but to serve them. Not to convert the kids, but to support them. As part of the 2009 Season of Service engineered by the Luis Palau Association, based in Beaverton, hundreds of the region's evangelicals are digging beneath the rhetoric and finding great human need. That they're diving in to address it in a government setting understandably raises separation of church and state concerns. It's raising something else, though, too: the spirits and hopes of a lot of students. Roosevelt Principal Deborah Peterson lights up when asked about the difference the church community is making at her school. \"They've brought incredible hope, energy and enthusiasm,\" she told me when I visited the school recently. In what organizers call one of the largest school cleanup projects ever in the city, more than 1,000 people from SouthLake Foursquare Church in West Linn flocked to Roosevelt last summer to paint, pull weeds and plant flowers and shrubs. The school district estimated the value of the work at $200,000. This was no one-and-done gambit aimed at good publicity and pats on the back. Following through on its pledge of sustained support for Roosevelt, SouthLake has maintained a steady and visible presence throughout the school year. So much so that Kristine Sommer, the church's director of missions and outreach, reports for work each day not at her church but to her desk in the cramped counseling center at the North Portland high school. In addition to overseeing ongoing church projects like the clothes closet - where students can pick out new hoodies and jeans they won't be ashamed of wearing - church employee Sommer has begun serving as the volunteers coordinator for the school... \"For the church, love has to be a verb,\" Sommer says, \"and this is what it looks like.\" Roosevelt junior Kelsey Jones, like the other finalists in the school's recent Rose Festival princess competition, worked closely with Sommer in preparing for the event. Despite getting to know Sommer, Jones told me she didn't know the name of Sommer's church and didn't know much about her mentor's beliefs, other than a commitment to \"helping people.\" Nor was Jones aware that it was Sommer's congregation that had done the massive aesthetic makeover at Roosevelt last summer... Isn't this just a ploy to convert kids? Talk to the church's school volunteers and you'll realize that they're keenly aware of the concern and committed to playing by the rules. Phrases like \"no strings attached\" and \"no agenda\" came up repeatedly at a recent organizing meeting of school-partnership coordinators from participating churches. These are not the evangelicals you might know from the film \"Jesus Camp\" or one of the televangelists' programs. Defying the straight-laced image of theologically conservative Christians, many at the organizing meeting sported sneakers, soul patches and distressed jeans. There are more substantive reasons to trust the Bible-believing school supporters when they insist they're not there to proselytize. The model for living out the faith and representing the Gospel is undergoing seismic change in evangelical America, and Portland's Christians are in the forefront. Open-eyed about the negative image the evangelical movement has developed in the age of the Christian right - and rather horrified by it - the emerging generation is determined to manifest the faith in a different way. As one participant quipped, \"We're not at the schools to float the Gospel blimp.\" Out: retreating behind the walls of evangelical subculture and railing against the things the old-guard Christian right doesn't understand or favor, like gays, government programs and progressive politics. In: forming relationships with the majority who are not evangelicals, listening rather than just shouting \"the truth,\" and representing the Gospel with idealistic action that reflects the church's teachings (especially \"love one another\"). They're doing this partly for the sake of effectiveness, but mainly because they believe the Bible tells them so. Certainly, some vigilance is required wherever private volunteers interact with a public institution - the schools - where the population is young and vulnerable and the stakes are high. But our communities need whatever infusion of talent, energy and heart they can get in a time when money is short and needs are great. So it's smart not to disqualify a ready source of that help just because they're serious Christians. Would that more Christians all over the country spent less time talking about their faith (and condemning others) and instead acted on their faith like these Christians in Portland, Oregon.", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "They're havens for secularism and sexual permissiveness. They indoctrinate our children against traditional American and family values. They're places where Jesus has been run out and moral weakness let in. Such is the environment of America's public schools, according to the rhetoric of many in conservative Christendom. The view helps explain why the number of home-schooled children in the United States has jumped 74 percent during the past eight years, according to the U.S. Department of Education. Not that they're all conservative religious people, but the vast majority of the parents of home-schooled kids cite \"providing religious or moral instruction\" as a reason for having their children taught at home rather than a public school... It is against this backdrop that something fascinating is happening with the church community here in the Portland area, something far more constructive than the bash-and-run approach typified by Perkins. Rather than fleeing from the public schools, many of the area's evangelical Christians are running toward them - toward schools such as Roosevelt High and Harvey Scott Elementary. Not to condemn the schools, but to serve them. Not to convert the kids, but to support them. As part of the 2009 Season of Service engineered by the Luis Palau Association, based in Beaverton, hundreds of the region's evangelicals are digging beneath the rhetoric and finding great human need. That they're diving in to address it in a government setting understandably raises separation of church and state concerns. It's raising something else, though, too: the spirits and hopes of a lot of students. Roosevelt Principal Deborah Peterson lights up when asked about the difference the church community is making at her school. \"They've brought incredible hope, energy and enthusiasm,\" she told me when I visited the school recently. In what organizers call one of the largest school cleanup projects ever in the city, more than 1,000 people from SouthLake Foursquare Church in West Linn flocked to Roosevelt last summer to paint, pull weeds and plant flowers and shrubs. The school district estimated the value of the work at $200,000. This was no one-and-done gambit aimed at good publicity and pats on the back. Following through on its pledge of sustained support for Roosevelt, SouthLake has maintained a steady and visible presence throughout the school year. So much so that Kristine Sommer, the church's director of missions and outreach, reports for work each day not at her church but to her desk in the cramped counseling center at the North Portland high school. In addition to overseeing ongoing church projects like the clothes closet - where students can pick out new hoodies and jeans they won't be ashamed of wearing - church employee Sommer has begun serving as the volunteers coordinator for the school... \"For the church, love has to be a verb,\" Sommer says, \"and this is what it looks like.\" Roosevelt junior Kelsey Jones, like the other finalists in the school's recent Rose Festival princess competition, worked closely with Sommer in preparing for the event. Despite getting to know Sommer, Jones told me she didn't know the name of Sommer's church and didn't know much about her mentor's beliefs, other than a commitment to \"helping people.\" Nor was Jones aware that it was Sommer's congregation that had done the massive aesthetic makeover at Roosevelt last summer... Isn't this just a ploy to convert kids? Talk to the church's school volunteers and you'll realize that they're keenly aware of the concern and committed to playing by the rules. Phrases like \"no strings attached\" and \"no agenda\" came up repeatedly at a recent organizing meeting of school-partnership coordinators from participating churches. These are not the evangelicals you might know from the film \"Jesus Camp\" or one of the televangelists' programs. Defying the straight-laced image of theologically conservative Christians, many at the organizing meeting sported sneakers, soul patches and distressed jeans. There are more substantive reasons to trust the Bible-believing school supporters when they insist they're not there to proselytize. The model for living out the faith and representing the Gospel is undergoing seismic change in evangelical America, and Portland's Christians are in the forefront. Open-eyed about the negative image the evangelical movement has developed in the age of the Christian right - and rather horrified by it - the emerging generation is determined to manifest the faith in a different way. As one participant quipped, \"We're not at the schools to float the Gospel blimp.\" Out: retreating behind the walls of evangelical subculture and railing against the things the old-guard Christian right doesn't understand or favor, like gays, government programs and progressive politics. In: forming relationships with the majority who are not evangelicals, listening rather than just shouting \"the truth,\" and representing the Gospel with idealistic action that reflects the church's teachings (especially \"love one another\"). They're doing this partly for the sake of effectiveness, but mainly because they believe the Bible tells them so. Certainly, some vigilance is required wherever private volunteers interact with a public institution - the schools - where the population is young and vulnerable and the stakes are high. But our communities need whatever infusion of talent, energy and heart they can get in a time when money is short and needs are great. So it's smart not to disqualify a ready source of that help just because they're serious Christians.", 
        "reply": "\"http://www.oregonlive.com/opinion/index.ssf/2009/03/evangelicals_walk_a_fine_line.html\"  Would that more Christians all over the country spent less time talking about their faith (and condemning others) and instead acted on their faith like these Christians in Portland, Oregon.", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-12 05:25:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "If more evangelicals worked like that, then more evangelicals would actually BE CHRISTIAN (ie. following the path of service taught by Jesus), and I'd respect them a lot more.", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "", 
        "reply": "If more evangelicals worked like that, then more evangelicals would actually BE CHRISTIAN (ie. following the path of service taught by Jesus), and I'd respect them a lot more.", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-12 09:57:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Huuhh, Ahem!!ahemmmm, What have I been telling you?", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "", 
        "reply": "Huuhh, Ahem!!ahemmmm, What have I been telling you?", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-12 11:44:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Huuhh, Ahem!!ahemmmm, What have I been telling you? And I've agreed with this part all along, Bruce! It's just not something people see often enough.", 
        "intTime": 20090312, 
        "postID": 4, 
        "quote": "Originally posted by tawodi: Huuhh, Ahem!!ahemmmm, What have I been telling you?", 
        "reply": " And I've agreed with this part all along, Bruce! It's just not something people see often enough.", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-12 12:23:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "RAmen! As I was reading this, I was thinking, \"Here are Christians that even BRUCE could agree with!\"", 
        "intTime": 20090312, 
        "postID": 5, 
        "quote": "", 
        "reply": "RAmen! As I was reading this, I was thinking, \"Here are Christians that even BRUCE could agree with!\"", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-12 14:54:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "\"Whatever their creeds, the faith-based groups must make sure their government-supported services \"don't cross the boundary between church and state,\" DuBois recently said. \"We understand it is a fine line. But it's a line we're comfortable walking.\" Who drew the line?", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"Whatever their creeds, the faith-based groups must make sure their government-supported services \"don't cross the boundary between church and state,\" DuBois recently said. \"We understand it is a fine line. But it's a line we're comfortable walking.\" Who drew the line?", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-12 15:01:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "billbright"
    }, 
    {
        "content": "YOU DID! Actually due to modern concepts of what the constitution is every body did.", 
        "intTime": 20090313, 
        "postID": 7, 
        "quote": "", 
        "reply": "YOU DID! Actually due to modern concepts of what the constitution is every body did.", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-13 05:48:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "tawodi"
    }, 
    {
        "content": "This looks all candy and dandy, but would they have accepted $200,000 worth of help from a Satanist cult if the cult promised not to proselytize? If these people didn't want faith to be the issue, why didn't they do it through the Lions Club or the Civic Club? Sugar coat it all you want, but this is an attempt to swing hearts to the one and only.", 
        "intTime": 20090313, 
        "postID": 8, 
        "quote": "", 
        "reply": "This looks all candy and dandy, but would they have accepted $200,000 worth of help from a Satanist cult if the cult promised not to proselytize? If these people didn't want faith to be the issue, why didn't they do it through the Lions Club or the Civic Club? Sugar coat it all you want, but this is an attempt to swing hearts to the one and only.", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-13 14:51:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "billbright"
    }, 
    {
        "content": "Good question Bill....... WHY... didn't the local civics club or the Lions club or the Rotarians or the P. T.O. of the school do it....or....or ....or.......How about the local chapter of ( fill in the blank ) Maybe because nobody else did..... the church stepped forward....evil underhanded people that they are, with those evil ulterior motives........", 
        "intTime": 20090313, 
        "postID": 9, 
        "quote": "", 
        "reply": "Good question Bill....... WHY... didn't the local civics club or the Lions club or the Rotarians or the P. T.O. of the school do it....or....or ....or.......How about the local chapter of ( fill in the blank ) Maybe because nobody else did..... the church stepped forward....evil underhanded people that they are, with those evil ulterior motives........", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-13 20:27:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Good question Bill....... WHY... didn't the local civics club or the Lions club or the Rotarians or the P. T.O. of the school do it....or....or ....or.......How about the local chapter of ( fill in the blank ) Maybe because nobody else did..... the church stepped forward....evil underhanded people that they are, with those evil ulterior motives........ No, Bruce. That wasn't my question. My question was these people who wanted to do this without bending the constitution, why didn't they do it without the auspices of the church? They could have joined any one of those other groups, but they chose to flaunt their own constitution to do \"the Lord's work.\" \"The Church\" didn't step forward. It was people who stepped forward and wanted to make sure everyone knew it was done in Jesus name without having to say it out loud. Now, don't get me wrong. I bless them for doing things that needed to be done. I just think the works in a school in the name of the Lord is disingenuous... not to mention illegal. The end doesn't justify the means. These people figure they've finally found a legal way to get Jesus back into the schools.", 
        "intTime": 20090313, 
        "postID": 10, 
        "quote": "Originally posted by tawodi: Good question Bill....... WHY... didn't the local civics club or the Lions club or the Rotarians or the P. T.O. of the school do it....or....or ....or.......How about the local chapter of ( fill in the blank ) Maybe because nobody else did..... the church stepped forward....evil underhanded people that they are, with those evil ulterior motives........", 
        "reply": " No, Bruce. That wasn't my question. My question was these people who wanted to do this without bending the constitution, why didn't they do it without the auspices of the church? They could have joined any one of those other groups, but they chose to flaunt their own constitution to do \"the Lord's work.\" \"The Church\" didn't step forward. It was people who stepped forward and wanted to make sure everyone knew it was done in Jesus name without having to say it out loud. Now, don't get me wrong. I bless them for doing things that needed to be done. I just think the works in a school in the name of the Lord is disingenuous... not to mention illegal. The end doesn't justify the means. These people figure they've finally found a legal way to get Jesus back into the schools.", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-13 22:17:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "billbright"
    }, 
    {
        "content": "Another article by the same fellow, Tom Krattenmaker, this guy is all about spreading the word and using sneaky ways of doing it. We will have to beat back these idiots and all their underhanded ways to gain access to our kids and public institutions even if we have to use big sticks to do it. quote: Following the Dodgers vs. Rockies game, fans with special tickets will gather in a corner of the parking lot for a concert by the Christian rock band Hawk Nelson, an appearance by characters from the \"Veggie Tales\" Christian television program and testimonials by several devout Dodgers. The purpose, according to event organizer Brent High, is to promote the Gospel of Jesus. High and his Christian events-promotion company, Third Coast Sports, have been organizing faith days and faith nights around minor league baseball for years. They reached the major leagues last season with three events at Turner Field, home of the Atlanta Braves, and will be in 10 major league cities this season. The event at Dodger Stadium will be the first in L.A. These events, which blend religion and commerce, are the product of a partnership between High's company and host teams. Third Coast undertakes energetic outreach to evangelical churches, getting baseball-loving church members (and, more important, their unconverted invitees) to turn out for the game and a special religious program. Believers nourish their faith and perhaps extend it to others, and teams welcome the typical surge in ticket sales and action at the merchandise and food stands. The result, according to High, \"is happy teams, happy churches.\" But not everyone is so happy. Critics of the Christianizing of pro sports -- including interfaith groups, Jewish leaders and secular progressives -- have voiced reservations about the seemingly ever-closer relationship between evangelical sports ministries and major professional sports teams. Frequent on-field religious gestures by players already rankle many -- does it really honor God to knock the snot of your opponent on the football field and then point to the sky? And shout-outs to God during live post-game interviews offend those fans who would prefer to enjoy their sports without a dose of in-your-face religion. Remember the owner and the coach of the Indianapolis Colts who both praised God before a worldwide television audience while collecting the Super Bowl trophy last winter? It's no accident that scenes like that have become a common feature of the pro sports landscape. The Fellowship of Christian Athletes and similar sports ministries have been operating behind the scenes for decades to minister to sports figures and encourage them to use their high-profile platform to spread the Christian message.", 
        "intTime": 20090314, 
        "postID": 11, 
        "quote": "Following the Dodgers vs. Rockies game, fans with special tickets will gather in a corner of the parking lot for a concert by the Christian rock band Hawk Nelson, an appearance by characters from the \"Veggie Tales\" Christian television program and testimonials by several devout Dodgers. The purpose, according to event organizer Brent High, is to promote the Gospel of Jesus. High and his Christian events-promotion company, Third Coast Sports, have been organizing faith days and faith nights around minor league baseball for years. They reached the major leagues last season with three events at Turner Field, home of the Atlanta Braves, and will be in 10 major league cities this season. The event at Dodger Stadium will be the first in L.A. These events, which blend religion and commerce, are the product of a partnership between High's company and host teams. Third Coast undertakes energetic outreach to evangelical churches, getting baseball-loving church members (and, more important, their unconverted invitees) to turn out for the game and a special religious program. Believers nourish their faith and perhaps extend it to others, and teams welcome the typical surge in ticket sales and action at the merchandise and food stands. The result, according to High, \"is happy teams, happy churches.\" But not everyone is so happy. Critics of the Christianizing of pro sports -- including interfaith groups, Jewish leaders and secular progressives -- have voiced reservations about the seemingly ever-closer relationship between evangelical sports ministries and major professional sports teams. Frequent on-field religious gestures by players already rankle many -- does it really honor God to knock the snot of your opponent on the football field and then point to the sky? And shout-outs to God during live post-game interviews offend those fans who would prefer to enjoy their sports without a dose of in-your-face religion. Remember the owner and the coach of the Indianapolis Colts who both praised God before a worldwide television audience while collecting the Super Bowl trophy last winter? It's no accident that scenes like that have become a common feature of the pro sports landscape. The Fellowship of Christian Athletes and similar sports ministries have been operating behind the scenes for decades to minister to sports figures and encourage them to use their high-profile platform to spread the Christian message.", 
        "reply": "Another article by the same fellow, Tom Krattenmaker, this guy is all about spreading the word and using sneaky ways of doing it. We will have to beat back these idiots and all their underhanded ways to gain access to our kids and public institutions even if we have to use big sticks to do it. ", 
        "threadID": "1270031990001_6470026712001", 
        "time": "2009-03-14 12:14:00", 
        "title": "Evangelicals walk a fine line in Oregon public schools", 
        "userID": "Another4Truth"
    }
]