[
    {
        "content": "Many do not know of her, so I thought I would share for general knowledge. According to the Hebrew Bible, Keturah or Ketura was the woman whom Abraham, the patriarch of the Israelites, married after the death of his wife, Sarah. Her nationality is unknown. Keturah bore Abraham six sons, Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. Abraham probably married her after Sarah's death. If that is correct, Abraham would have been at least 137 years old–his age at the time of Sarah's death. Keturah is referred to as \"Abraham's concubine\" in the Christian Bible, probably to indicate that she was not considered to be of the same dignity as Sarah, the mother of the \"chosen son\", Isaac. It is probably also for this reason that the sons of Abraham's concubines were separated from Isaac. There is no indication when that happened, other than during his lifetime. He died at the age of 175. Keturah was the mother of six sons, representing Arab tribes south and east of Palestine, so that through the offspring of Keturah Abraham became \"the father of many nations\". Some, but not all, Jewish philosophers identify Keturah with Hagar, stating that Abraham sought her out after Sarah's death. This interpretation is set forth in the Midrash and is supported by Rashi, Gur Aryeh, Keli Yakar, and Obadiah of Bertinoro. The contrary view (that Keturah was someone other than Hagar) is advocated by Rashbam, Abraham ibn Ezra, Radak, and Ramban. Adherents of the Bahá'í faith believe their founder, Bahá'u'lláh, to have been a descendant of both Keturah and Sarah.", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "", 
        "reply": "Many do not know of her, so I thought I would share for general knowledge. According to the Hebrew Bible, Keturah or Ketura was the woman whom Abraham, the patriarch of the Israelites, married after the death of his wife, Sarah. Her nationality is unknown. Keturah bore Abraham six sons, Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. Abraham probably married her after Sarah's death. If that is correct, Abraham would have been at least 137 years old–his age at the time of Sarah's death. Keturah is referred to as \"Abraham's concubine\" in the Christian Bible, probably to indicate that she was not considered to be of the same dignity as Sarah, the mother of the \"chosen son\", Isaac. It is probably also for this reason that the sons of Abraham's concubines were separated from Isaac. There is no indication when that happened, other than during his lifetime. He died at the age of 175. Keturah was the mother of six sons, representing Arab tribes south and east of Palestine, so that through the offspring of Keturah Abraham became \"the father of many nations\". Some, but not all, Jewish philosophers identify Keturah with Hagar, stating that Abraham sought her out after Sarah's death. This interpretation is set forth in the Midrash and is supported by Rashi, Gur Aryeh, Keli Yakar, and Obadiah of Bertinoro. The contrary view (that Keturah was someone other than Hagar) is advocated by Rashbam, Abraham ibn Ezra, Radak, and Ramban. Adherents of the Bahá'í faith believe their founder, Bahá'u'lláh, to have been a descendant of both Keturah and Sarah.", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-05 11:27:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Hi Robert; In the old testament it gives a fairly detailed account of Hagar and Ishmael final journey after they were ejected from Abrham's tribe. In this account God tells Abraham to do as Sarah says and he sends them out into the desert. We read of Hagar plascing the boy (then fourteen years old) under a bush and moving a bow shot away. (about 600 yards) So she can not here his cries for water. ( as the older story tells) The Angel shows up they are saved and They go and settle. The Bible states that God was with him as he grew and he grew strong and became the father of many nations as well. Do you feel there is confusion between these two stories, as to who is the founder of the Arab peoples?? T", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hi Robert; In the old testament it gives a fairly detailed account of Hagar and Ishmael final journey after they were ejected from Abrham's tribe. In this account God tells Abraham to do as Sarah says and he sends them out into the desert. We read of Hagar plascing the boy (then fourteen years old) under a bush and moving a bow shot away. (about 600 yards) So she can not here his cries for water. ( as the older story tells) The Angel shows up they are saved and They go and settle. The Bible states that God was with him as he grew and he grew strong and became the father of many nations as well. Do you feel there is confusion between these two stories, as to who is the founder of the Arab peoples?? T", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-05 18:07:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "tawodi"
    }, 
    {
        "content": "Naw, not really. It's pretty certain from both the Judaic and Islamic points of view that the father of the Arabs if you will is Ishmael. The details concerning how this came to be is the point of contention. The only agreement across the board is Abraham and Hagar had Ishmael 13-14 years before Isaac was born, sometime after that Hagar and Ishmael had to leave, upon cries of thirst God gave them a well and the brothers reunited at Abraham's funeral and intermarriage between the cousins was common at least up until Jacobs progeny. Keturah on the other hand, is a fairly new subject to me, but from what I have recently studied, she is the 3rd wife, just one of the many names of women omitted from common knowledge over time in lieu of remembrance of the patriarchs.", 
        "intTime": 20090306, 
        "postID": 3, 
        "quote": "", 
        "reply": "Naw, not really. It's pretty certain from both the Judaic and Islamic points of view that the father of the Arabs if you will is Ishmael. The details concerning how this came to be is the point of contention. The only agreement across the board is Abraham and Hagar had Ishmael 13-14 years before Isaac was born, sometime after that Hagar and Ishmael had to leave, upon cries of thirst God gave them a well and the brothers reunited at Abraham's funeral and intermarriage between the cousins was common at least up until Jacobs progeny. Keturah on the other hand, is a fairly new subject to me, but from what I have recently studied, she is the 3rd wife, just one of the many names of women omitted from common knowledge over time in lieu of remembrance of the patriarchs.", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 06:50:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Just a little set aside that I copied out of a newspaper while doing research. I left the spelling intact as it was in the article. quote: “Jewesses in the harem. Women Who Follow Moses and Mohomet at the Same Time. The New York Journal September 1890 says: From year to year the number of Jewish girls in the Orient is increasing. Daughters of pious parents, they leave their home and creed and are converted to Islam to spend their lives in the harem of some Pasha or Governor as chambermaid, companion, favorite of lawful wife, or in some other quality as the different ranks in the harem are designated. According to the official report of the Chacham Bashi, Rabbi Jacob Kovo of Salonica, eight Jewish girls were converted in that city, in Smyrna nine, in Diarbekir and Jasgat three, in Aleppo two, etc. In Tunis conversions are reported to take place almost every week. The reason of this state of affairs is of a twofold nature. Frst, the easy manner in which a conversion from Judaism to Islam is performed, as also the easy change from the Oriental family life to that of the Mahometans; and, second, the pleasant and permanent career which the harem provides. If a Jewess wishes to be converted to Islam she need not take lessons in the Koran four weeks ahead or learn by heart incomprehensible dogmas, but she simply visits a minister or a preacher of the town, who then sends for the rabbi and parents. In their presence she declares that she will leave Judaism by her own will. Then she raises her right hand and repeats the formula, “Eshded on le Allah illa elahi wa-Muhamad rassul Allah (I confess that there is no God but God alone, and Mahomet is his messenger), and by this declaration she becomes a Mahometan. By her new co-religionists she is not despised as a “converted Jewess,” but as an erring grandchild of Chalil (Abraham) who has not entered the right path. Every Mahometan woman knows that Amena, the mother of the Prophet, was a Jewess, the niece of the Cadi (Dayan) of Mecca, Chacham Wareka, and died as a Jewess. The Prophet also had two Jewish wives; one of them was his favorite, whom he would not leave even at the hour of prayer. But her former co-religionist also do not despise a neophyte. She has not denied the one God, nor Moses, nor the Bible. She has publicly confessed that Mohomet also was a messenger of God, and such a fact even an orthodox rabbi does not deny. Mohoment was the messenger of God to the nations of the East, to whom he communicated the revelations of Moses in smaller portions. Many of these Jewish ladies of the harem are renowned for their charitable acts. Some years ago the present Emir, or Sultan, of Khive, said Mohomet Khan, brought a Jewish girl from Russia, who is at present his favorite wife. She distributed alms in the palace every Friday, the Sabbath of the Mahometans. Sultan Baber Kean, the renowned Grand Mogul of India, who resided at Cabul, Afghanistan and Nadir Shah, the most renowned ruler of Persia (died 1748), had Jewish wives, and of the first it is related in Asia that after the death of her husband she resided at Balky, where she lived as a Jewess. Several members of the ruling dynasty of Afghanistan who boast of having descended from King Saul have Jewish wives, and are partly of Jewish descent. Islam and Judaism approach much more nearly than Judaism and Christianity, and hence the professors of those two creeds assimilate better.”", 
        "intTime": 20090306, 
        "postID": 4, 
        "quote": "“Jewesses in the harem. Women Who Follow Moses and Mohomet at the Same Time. The New York Journal September 1890 says: From year to year the number of Jewish girls in the Orient is increasing. Daughters of pious parents, they leave their home and creed and are converted to Islam to spend their lives in the harem of some Pasha or Governor as chambermaid, companion, favorite of lawful wife, or in some other quality as the different ranks in the harem are designated. According to the official report of the Chacham Bashi, Rabbi Jacob Kovo of Salonica, eight Jewish girls were converted in that city, in Smyrna nine, in Diarbekir and Jasgat three, in Aleppo two, etc. In Tunis conversions are reported to take place almost every week. The reason of this state of affairs is of a twofold nature. Frst, the easy manner in which a conversion from Judaism to Islam is performed, as also the easy change from the Oriental family life to that of the Mahometans; and, second, the pleasant and permanent career which the harem provides. If a Jewess wishes to be converted to Islam she need not take lessons in the Koran four weeks ahead or learn by heart incomprehensible dogmas, but she simply visits a minister or a preacher of the town, who then sends for the rabbi and parents. In their presence she declares that she will leave Judaism by her own will. Then she raises her right hand and repeats the formula, “Eshded on le Allah illa elahi wa-Muhamad rassul Allah (I confess that there is no God but God alone, and Mahomet is his messenger), and by this declaration she becomes a Mahometan. By her new co-religionists she is not despised as a “converted Jewess,” but as an erring grandchild of Chalil (Abraham) who has not entered the right path. Every Mahometan woman knows that Amena, the mother of the Prophet, was a Jewess, the niece of the Cadi (Dayan) of Mecca, Chacham Wareka, and died as a Jewess. The Prophet also had two Jewish wives; one of them was his favorite, whom he would not leave even at the hour of prayer. But her former co-religionist also do not despise a neophyte. She has not denied the one God, nor Moses, nor the Bible. She has publicly confessed that Mohomet also was a messenger of God, and such a fact even an orthodox rabbi does not deny. Mohoment was the messenger of God to the nations of the East, to whom he communicated the revelations of Moses in smaller portions. Many of these Jewish ladies of the harem are renowned for their charitable acts. Some years ago the present Emir, or Sultan, of Khive, said Mohomet Khan, brought a Jewish girl from Russia, who is at present his favorite wife. She distributed alms in the palace every Friday, the Sabbath of the Mahometans. Sultan Baber Kean, the renowned Grand Mogul of India, who resided at Cabul, Afghanistan and Nadir Shah, the most renowned ruler of Persia (died 1748), had Jewish wives, and of the first it is related in Asia that after the death of her husband she resided at Balky, where she lived as a Jewess. Several members of the ruling dynasty of Afghanistan who boast of having descended from King Saul have Jewish wives, and are partly of Jewish descent. Islam and Judaism approach much more nearly than Judaism and Christianity, and hence the professors of those two creeds assimilate better.”", 
        "reply": "Just a little set aside that I copied out of a newspaper while doing research. I left the spelling intact as it was in the article. ", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 10:02:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "Not sure where this article comes from, but I'm certain the author was neither Jewish or Muslim. Mahometan and Jewess?", 
        "intTime": 20090306, 
        "postID": 5, 
        "quote": "", 
        "reply": "Not sure where this article comes from, but I'm certain the author was neither Jewish or Muslim. Mahometan and Jewess?", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 11:46:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Actually, a pilgesh often had very similar rights to a wife in halacha- but it often depended on the woman's social status to begin with. Non-monogamous households often vary in terms of hierarchy, according to age, length of marriage, social status, number of children, bearing male children, etc.", 
        "intTime": 20090306, 
        "postID": 6, 
        "quote": "", 
        "reply": "Actually, a pilgesh often had very similar rights to a wife in halacha- but it often depended on the woman's social status to begin with. Non-monogamous households often vary in terms of hierarchy, according to age, length of marriage, social status, number of children, bearing male children, etc.", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 12:22:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "sweetsuds"
    }, 
    {
        "content": "\"Adherents of the Bahá'í faith believe their founder, Bahá'u'lláh, to have been a descendant of both Keturah and Sarah.\" This was part of an article in Wikipedia about Keturah. Would somebody explain to me how that could work?", 
        "intTime": 20090306, 
        "postID": 7, 
        "quote": "", 
        "reply": "\"Adherents of the Bahá'í faith believe their founder, Bahá'u'lláh, to have been a descendant of both Keturah and Sarah.\" This was part of an article in Wikipedia about Keturah. Would somebody explain to me how that could work?", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 13:24:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: \"Adherents of the Bahá'í faith believe their founder, Bahá'u'lláh, to have been a descendant of both Keturah and Sarah.\" This was part of an article in Wikipedia about Keturah. Would somebody explain to me how that could work? I know zero about the Bahai faith....", 
        "intTime": 20090306, 
        "postID": 8, 
        "quote": "Originally posted by billbright: \"Adherents of the Bahá'í faith believe their founder, Bahá'u'lláh, to have been a descendant of both Keturah and Sarah.\" This was part of an article in Wikipedia about Keturah. Would somebody explain to me how that could work?", 
        "reply": " I know zero about the Bahai faith....", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 13:33:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by billbright: My favorite Biblical first-wife tale is that of Lilith. You mentioned that in another thread, this one is about Keturah", 
        "intTime": 20090306, 
        "postID": 9, 
        "quote": "Originally posted by billbright: My favorite Biblical first-wife tale is that of Lilith.", 
        "reply": " You mentioned that in another thread, this one is about Keturah", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 13:34:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: quote: Originally posted by billbright: My favorite Biblical first-wife tale is that of Lilith. You mentioned that in another thread, this one is about Keturah Fine. I deleted it. Feel better?", 
        "intTime": 20090306, 
        "postID": 10, 
        "quote": "Originally posted by SgtSalaamv2: quote: Originally posted by billbright: My favorite Biblical first-wife tale is that of Lilith. You mentioned that in another thread, this one is about Keturah", 
        "reply": " Fine. I deleted it. Feel better?", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 13:43:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: \"Adherents of the Bahá'í faith believe their founder, Bahá'u'lláh, to have been a descendant of both Keturah and Sarah.\" This was part of an article in Wikipedia about Keturah. Would somebody explain to me how that could work? Quite simple, really. One of them would have to have a male descendant, the other a female descendant, and then if they were to marry, then the offspring of that union would be descended from both. If Jane has a son, and Mary a daughter, the child of Jane's son and Mary's daughter would be descended from Mary and Jane. It's a matrilineal view, but still perfectly valid.", 
        "intTime": 20090306, 
        "postID": 11, 
        "quote": "Originally posted by billbright: \"Adherents of the Bahá'í faith believe their founder, Bahá'u'lláh, to have been a descendant of both Keturah and Sarah.\" This was part of an article in Wikipedia about Keturah. Would somebody explain to me how that could work?", 
        "reply": " Quite simple, really. One of them would have to have a male descendant, the other a female descendant, and then if they were to marry, then the offspring of that union would be descended from both. If Jane has a son, and Mary a daughter, the child of Jane's son and Mary's daughter would be descended from Mary and Jane. It's a matrilineal view, but still perfectly valid.", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 13:56:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "sweetsuds"
    }, 
    {
        "content": "Oh.", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "", 
        "reply": "Oh.", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 14:02:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "billbright"
    }, 
    {
        "content": "Hi guy; As you have probably found out the story of Keturah and her progeny by Abraham, is indeed in the King James Bible But I will grant it is one that I NEVER heard in any Bible study class I ever attended!! T", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "", 
        "reply": "Hi guy; As you have probably found out the story of Keturah and her progeny by Abraham, is indeed in the King James Bible But I will grant it is one that I NEVER heard in any Bible study class I ever attended!! T", 
        "threadID": "1270031990001_7690099612001", 
        "time": "2009-03-06 15:13:00", 
        "title": "Keturah, the other wife of Abraham", 
        "userID": "tawodi"
    }
]