[
    {
        "content": "It is so good to see this forum, and read all of the posts which PRAISE AND THANK our CREATOR for the many blessings that are bestowed on each of us. I am so thankful for my family and the physical ability to write this. I am HONORED to walk with our LORD AND SAVIOR on a daily basis and with a personal \"connection\". Truly HE lives. I want to share a \"poem\" with whomever wants to read it. I was sitting her thinking about EASTER on this past Saturday, and these words \"came to me\" {please note; I submit them with a sense of humility-I do not take any \"credit\"}: April, 4th 2009 On this Saturday; Our Savior was getting ready to ride into the ‘Holy City as the King’, praised by all the people while being fanned by ‘Palm Leaves’ For a week in which He and His Disciples would gather ending in a ‘Last Supper’ in the room of the attic eaves After weeping in Gethsemanes’ Garden, Jesus would take up His ‘Heavy and Burdensome Cross’ And give His precious life to save all of our souls, even though we felt a terrible loss However, He came to bring the ‘Good News’ and in three days, He would be the ‘Living Christ’ When two wonderful Ladies would find His Tomb Empty with the promise of ‘Everlasting Life’ Edited: to remove email addy This message has been edited. Last edited by: pipedreamsandbabies, Wed 08 April 2009 04:47 PM", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "", 
        "reply": "It is so good to see this forum, and read all of the posts which PRAISE AND THANK our CREATOR for the many blessings that are bestowed on each of us. I am so thankful for my family and the physical ability to write this. I am HONORED to walk with our LORD AND SAVIOR on a daily basis and with a personal \"connection\". Truly HE lives. I want to share a \"poem\" with whomever wants to read it. I was sitting her thinking about EASTER on this past Saturday, and these words \"came to me\" {please note; I submit them with a sense of humility-I do not take any \"credit\"}: April, 4th 2009 On this Saturday; Our Savior was getting ready to ride into the ‘Holy City as the King’, praised by all the people while being fanned by ‘Palm Leaves’ For a week in which He and His Disciples would gather ending in a ‘Last Supper’ in the room of the attic eaves After weeping in Gethsemanes’ Garden, Jesus would take up His ‘Heavy and Burdensome Cross’ And give His precious life to save all of our souls, even though we felt a terrible loss However, He came to bring the ‘Good News’ and in three days, He would be the ‘Living Christ’ When two wonderful Ladies would find His Tomb Empty with the promise of ‘Everlasting Life’ Edited: to remove email addy This message has been edited. Last edited by: pipedreamsandbabies, Wed 08 April 2009 04:47 PM", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-08 07:59:00", 
        "title": "So happy to see THIS forum", 
        "userID": "graywolflive"
    }, 
    {
        "content": "Graywolf: Thanks so much for the post. It is so true ans so needed in these forums. Your post is a light in a dark place as I see it. God Bless and have a great Easter weekend. Buy the way, I have two beautiful full grown, full blood gray wolves and they are awesome.", 
        "intTime": 20090408, 
        "postID": 2, 
        "quote": "", 
        "reply": "Graywolf: Thanks so much for the post. It is so true ans so needed in these forums. Your post is a light in a dark place as I see it. God Bless and have a great Easter weekend. Buy the way, I have two beautiful full grown, full blood gray wolves and they are awesome.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-08 08:28:00", 
        "title": "So happy to see THIS forum", 
        "userID": "506EASY"
    }, 
    {
        "content": "Graywolf- Please do not use personal email address on this site as you may wind up getting the kind of email in your inbox you did not expect. If member wishes to contact you directly they must be part of your network. Welcome to the forums!", 
        "intTime": 20090408, 
        "postID": 3, 
        "quote": "", 
        "reply": "Graywolf- Please do not use personal email address on this site as you may wind up getting the kind of email in your inbox you did not expect. If member wishes to contact you directly they must be part of your network. Welcome to the forums!", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-08 17:01:00", 
        "title": "So happy to see THIS forum", 
        "userID": "pipedreamsandbabies"
    }, 
    {
        "content": "G.W.L. Welcome!! In the new set up in order to e mail members you must click on their name at the top left of a post ( usually where the little picture (avatar) is,) this will take you to their profile, click on \"make this person a friend\" they will receive your invitation, approve it, and THEN you can e mail them directly. You can invite others to contact you in the same way by posting a general invitation and they can do the same to contact you. Be well....Tawodi", 
        "intTime": 20090408, 
        "postID": 4, 
        "quote": "", 
        "reply": "G.W.L. Welcome!! In the new set up in order to e mail members you must click on their name at the top left of a post ( usually where the little picture (avatar) is,) this will take you to their profile, click on \"make this person a friend\" they will receive your invitation, approve it, and THEN you can e mail them directly. You can invite others to contact you in the same way by posting a general invitation and they can do the same to contact you. Be well....Tawodi", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-08 19:44:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "Thanks much for the \"welcome\" ... I'm not sure what I did wrong. I can't quite understand what I should do differently or where/what I need to change so that I don't advertise my e-mail. But, I WANT TO DO THE RIGHT THING - SO any suggestions \"like yours\" are greatly appreciated. Best regards to all", 
        "intTime": 20090409, 
        "postID": 5, 
        "quote": "", 
        "reply": "Thanks much for the \"welcome\" ... I'm not sure what I did wrong. I can't quite understand what I should do differently or where/what I need to change so that I don't advertise my e-mail. But, I WANT TO DO THE RIGHT THING - SO any suggestions \"like yours\" are greatly appreciated. Best regards to all", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-09 14:02:00", 
        "title": "So happy to see THIS forum", 
        "userID": "graywolflive"
    }, 
    {
        "content": "It's never a good idea to put up or give your personal e-mail address to some one you don't know or on an open forum such as these. There are all kinds of people who read here and not all are nice or military. The e-mail service here is called a blind service, some one can contact you but they will NOT have your personal e-mail address. They contact you through your profile with a form that comes up. They write what they choose and click send. Milcom then sends it \"in the blind\" and after a few contacts with that person you both can decide if you want to exchange addresses. It's a whole lot simpler to do, than it is to tell!! You didn't get in trouble, they just didn't want you to get stuck with a possible nutbag!!! T", 
        "intTime": 20090409, 
        "postID": 6, 
        "quote": "", 
        "reply": "It's never a good idea to put up or give your personal e-mail address to some one you don't know or on an open forum such as these. There are all kinds of people who read here and not all are nice or military. The e-mail service here is called a blind service, some one can contact you but they will NOT have your personal e-mail address. They contact you through your profile with a form that comes up. They write what they choose and click send. Milcom then sends it \"in the blind\" and after a few contacts with that person you both can decide if you want to exchange addresses. It's a whole lot simpler to do, than it is to tell!! You didn't get in trouble, they just didn't want you to get stuck with a possible nutbag!!! T", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-09 16:01:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "G.W.L. Thank you for your service, and welcome... CJ", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "", 
        "reply": "G.W.L. Thank you for your service, and welcome... CJ", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-13 13:55:00", 
        "title": "So happy to see THIS forum", 
        "userID": "TAH407"
    }, 
    {
        "content": "Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief.", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-13 19:52:00", 
        "title": "So happy to see THIS forum", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -[/QUOTE]", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief.", 
        "reply": " Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -[/QUOTE]", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-13 20:49:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon - [/QUOTE] LegionSon, I know you'd like to imagine that \"religion\" means your version of Christianity, and the rest of us are just trying to quash the bleating of the \"true believers,\" but as Bill said, this is a \"religion in the military\" forum. This is a discussion forum for how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian. Arrogance has been thrown both ways, of course, but the vast majority of the arrogance has been thrown BY some of the Christians on this forum. Sure, post your testimonials all you want. Post prayer threads. But when other people post about their religions, don't attack them unless you want them to come to your threads and attack you. That's the problem around here - some of you feel justified in hassling anyone of a different faith or no faith, but you throw a hissy fit when someone does the same to you. I do wish you well in your spiritual path. I just ALSO wish you and others would cease to harass those of other paths.", 
        "intTime": 20090414, 
        "postID": 10, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -", 
        "reply": " [/QUOTE] LegionSon, I know you'd like to imagine that \"religion\" means your version of Christianity, and the rest of us are just trying to quash the bleating of the \"true believers,\" but as Bill said, this is a \"religion in the military\" forum. This is a discussion forum for how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian. Arrogance has been thrown both ways, of course, but the vast majority of the arrogance has been thrown BY some of the Christians on this forum. Sure, post your testimonials all you want. Post prayer threads. But when other people post about their religions, don't attack them unless you want them to come to your threads and attack you. That's the problem around here - some of you feel justified in hassling anyone of a different faith or no faith, but you throw a hissy fit when someone does the same to you. I do wish you well in your spiritual path. I just ALSO wish you and others would cease to harass those of other paths.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 05:37:00", 
        "title": "So happy to see THIS forum", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon - LegionSon, I know you'd like to imagine that \"religion\" means your version of Christianity, and the rest of us are just trying to quash the bleating of the \"true believers,\" but as Bill said, this is a \"religion in the military\" forum. This is a discussion forum for how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian. Arrogance has been thrown both ways, of course, but the vast majority of the arrogance has been thrown BY some of the Christians on this forum. Sure, post your testimonials all you want. Post prayer threads. But when other people post about their religions, don't attack them unless you want them to come to your threads and attack you. That's the problem around here - some of you feel justified in hassling anyone of a different faith or no faith, but you throw a hissy fit when someone does the same to you. I do wish you well in your spiritual path. I just ALSO wish you and others would cease to harass those of other paths.[/QUOTE] ---------------------------------------------- ________________________________________________ Your first paragraph is Completely False. - I did not single out any \"religion\". I said \"The desired effect is to silence all those who believe in God.\" Also, I don't understand why some of you think you can dictate/limit the subject matter of this forum to the \"how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian.\" as you say. You then contradict yourself by stating \"Sure, post your testimonials all you want. Post prayer threads.\" I will agree with you in the arrogance factor that consumes us all from time to time, but I contest your singling out any group such as the Christians as being \"the vast majority\". What I see is man being tempted by intelligence to think he is above God. This is written. I would guess that your perception just might be a testament to your own bias against Christians. Most all of you threads are evidence of this bias you hold. Lastly, I thank you for ending with well wishes for me in my spiritual path. I believe you to be sincere and I am sincere in praying for the same to you. I like you Whirled_Peas. I always have. I do believe I have shown arrogance to you before as I was teasing you a bit in a couple of threads long ago. For this I am sorry and ask your forgiveness. I have come to feel that you maybe the way you are from falling victim to the bashing by some Christians for quite some time here and elsewhere and this saddens me. So I would like to state that I believe you have a good heart and sincerely want the best for all peoples. This is what we share in common. Just as this thread was by a new poster, for us to forgive and heal the past we need to be willing to start anew. This is what Easter is about to us Christians and I know you have similar beliefs. I believe it is what makes us grow straight and strong. - LegionSon -", 
        "intTime": 20090414, 
        "postID": 11, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -", 
        "reply": " LegionSon, I know you'd like to imagine that \"religion\" means your version of Christianity, and the rest of us are just trying to quash the bleating of the \"true believers,\" but as Bill said, this is a \"religion in the military\" forum. This is a discussion forum for how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian. Arrogance has been thrown both ways, of course, but the vast majority of the arrogance has been thrown BY some of the Christians on this forum. Sure, post your testimonials all you want. Post prayer threads. But when other people post about their religions, don't attack them unless you want them to come to your threads and attack you. That's the problem around here - some of you feel justified in hassling anyone of a different faith or no faith, but you throw a hissy fit when someone does the same to you. I do wish you well in your spiritual path. I just ALSO wish you and others would cease to harass those of other paths.[/QUOTE] ---------------------------------------------- ________________________________________________ Your first paragraph is Completely False. - I did not single out any \"religion\". I said \"The desired effect is to silence all those who believe in God.\" Also, I don't understand why some of you think you can dictate/limit the subject matter of this forum to the \"how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian.\" as you say. You then contradict yourself by stating \"Sure, post your testimonials all you want. Post prayer threads.\" I will agree with you in the arrogance factor that consumes us all from time to time, but I contest your singling out any group such as the Christians as being \"the vast majority\". What I see is man being tempted by intelligence to think he is above God. This is written. I would guess that your perception just might be a testament to your own bias against Christians. Most all of you threads are evidence of this bias you hold. Lastly, I thank you for ending with well wishes for me in my spiritual path. I believe you to be sincere and I am sincere in praying for the same to you. I like you Whirled_Peas. I always have. I do believe I have shown arrogance to you before as I was teasing you a bit in a couple of threads long ago. For this I am sorry and ask your forgiveness. I have come to feel that you maybe the way you are from falling victim to the bashing by some Christians for quite some time here and elsewhere and this saddens me. So I would like to state that I believe you have a good heart and sincerely want the best for all peoples. This is what we share in common. Just as this thread was by a new poster, for us to forgive and heal the past we need to be willing to start anew. This is what Easter is about to us Christians and I know you have similar beliefs. I believe it is what makes us grow straight and strong. - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 06:44:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: YES ,SHE HAS A GOOD HEART, AS MOST THAT VISIT THIS FORUM DO, EVEN BILL, EVERYONE HERE HAS THE FREEDOM TO EXPRESS THEIR BELIEFS, NO MATTER WHAT THEY BELIEVE,EVEN NOTHING AT ALL. HAVE A THICK SKIN HERE,DEBATE AT TIMES GETS VERY HEATED,JUST POST TO THE TOPIC NOT THE POSTER. BUT REMEMBER IF YOU BREAK THE TOS YOU WILL HAVE CAUSE TO FEAR THE REAPER...I ALWAYS WANTED TO SAY THAT HAVE FUN FOLKS ..LATER D.J.", 
        "intTime": 20090414, 
        "postID": 12, 
        "quote": "Originally posted by NEMESIS1960: YES ,SHE HAS A GOOD HEART, AS MOST THAT VISIT THIS FORUM DO, EVEN BILL, EVERYONE HERE HAS THE FREEDOM TO EXPRESS THEIR BELIEFS, NO MATTER WHAT THEY BELIEVE,EVEN NOTHING AT ALL. HAVE A THICK SKIN HERE,DEBATE AT TIMES GETS VERY HEATED,JUST POST TO THE TOPIC NOT THE POSTER. BUT REMEMBER IF YOU BREAK THE TOS YOU WILL HAVE CAUSE TO FEAR THE REAPER...I ALWAYS WANTED TO SAY THAT HAVE FUN FOLKS ..LATER", 
        "reply": " D.J.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 09:19:00", 
        "title": "So happy to see THIS forum", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!!", 
        "intTime": 20090414, 
        "postID": 13, 
        "quote": "", 
        "reply": "Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!!", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 10:40:00", 
        "title": "So happy to see THIS forum", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon - [/QUOTE] One man's negative is another's positive, I guess. Some see the \"light in a dark place\" as the light of reason in a place of dark superstition. Naturally, you being the superstitious one, feel attacked when your \"light\" is obviated for the fiction it is and you have to slink away because you've run out of epistemological ammunition and must resort to poetry and questionable moral platitude. I do sincerely welcome Paul with a welcome among honorable men, and not a welcome of religious blather and heretical mumblings. There are plenty of places in the world people can bring that stuff without trying to dominate the military with it. Take it to \"The Chapel\" over in the family forum, if that's your purpose. You will notice, when you get there, that there are actually very few people posting there because very few of them actually want to hear their own kind of blather, either. They'd rather bring it to a place of known integration where they can hassle someone else with it. Indeed, take a look at the prayer threads at the top of this forum. You'll notice that they are weakly populated, also, because there's no controversy [read that, fun] in praying where everyone agrees with you.", 
        "intTime": 20090414, 
        "postID": 14, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -", 
        "reply": " [/QUOTE] One man's negative is another's positive, I guess. Some see the \"light in a dark place\" as the light of reason in a place of dark superstition. Naturally, you being the superstitious one, feel attacked when your \"light\" is obviated for the fiction it is and you have to slink away because you've run out of epistemological ammunition and must resort to poetry and questionable moral platitude. I do sincerely welcome Paul with a welcome among honorable men, and not a welcome of religious blather and heretical mumblings. There are plenty of places in the world people can bring that stuff without trying to dominate the military with it. Take it to \"The Chapel\" over in the family forum, if that's your purpose. You will notice, when you get there, that there are actually very few people posting there because very few of them actually want to hear their own kind of blather, either. They'd rather bring it to a place of known integration where they can hassle someone else with it. Indeed, take a look at the prayer threads at the top of this forum. You'll notice that they are weakly populated, also, because there's no controversy [read that, fun] in praying where everyone agrees with you.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 13:59:00", 
        "title": "So happy to see THIS forum", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "intTime": 20090414, 
        "postID": 15, 
        "quote": "Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!!", 
        "reply": " ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 14:13:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon - Time to check your meds again?", 
        "intTime": 20090414, 
        "postID": 16, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "reply": " Time to check your meds again?", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 14:19:00", 
        "title": "So happy to see THIS forum", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. And as far as censorship goes, you are correct it is not an American thing. We are not Communists. Stalin was, and many religious have been censored through harrassement when they state their beliefs. It makes them feel unwelcome even with the satirical \"welcome\". The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "intTime": 20090414, 
        "postID": 17, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. And as far as censorship goes, you are correct it is not an American thing. We are not Communists. Stalin was, and many religious have been censored through harrassement when they state their beliefs. It makes them feel unwelcome even with the satirical \"welcome\". The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "reply": "", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 14:25:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "This is certainly why we would want to keep power out of the hands of the overly religious... they have historical run a muck with their zeal to establish their godliness... like Moses and his mob killing, raping, stealing all the way to Canaan because 'god said so'. So, when has more of God made it better? Of course the most atheistic nations today are in Scandinavia, and we know what war mongers, and murders of their citizenry they are! 70% of Sweden claims to be atheist. Scary! Next thing you know we'll be forced to eat Ludifisk! Can you say \"Ya, by golly\"?", 
        "intTime": 20090414, 
        "postID": 18, 
        "quote": "", 
        "reply": "This is certainly why we would want to keep power out of the hands of the overly religious... they have historical run a muck with their zeal to establish their godliness... like Moses and his mob killing, raping, stealing all the way to Canaan because 'god said so'. So, when has more of God made it better? Of course the most atheistic nations today are in Scandinavia, and we know what war mongers, and murders of their citizenry they are! 70% of Sweden claims to be atheist. Scary! Next thing you know we'll be forced to eat Ludifisk! Can you say \"Ya, by golly\"?", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 14:28:00", 
        "title": "So happy to see THIS forum", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: This is certainly why we would want to keep power out of the hands of the overly religious... they have historical run a muck with their zeal to establish their godliness... like Moses and his mob killing, raping, stealing all the way to Canaan because 'god said so'. So, when has more of God made it better? Of course the most atheistic nations today are in Scandinavia, and we know what war mongers, and murders of their citizenry they are! 70% of Sweden claims to be atheist. Scary! Next thing you know we'll be forced to eat Ludifisk! Can you say \"Ya, by golly\"? In answer to your question - \"So, when has more of God made it better?\" - It is when He sent Jesus Christ. You follow many of His teachings R.T. and you love Him but not some of the men that have failed to follow Him. \"Ya, by golly\" hehh, good one heheh - LegionSon -", 
        "intTime": 20090414, 
        "postID": 19, 
        "quote": "Originally posted by reducetension: This is certainly why we would want to keep power out of the hands of the overly religious... they have historical run a muck with their zeal to establish their godliness... like Moses and his mob killing, raping, stealing all the way to Canaan because 'god said so'. So, when has more of God made it better? Of course the most atheistic nations today are in Scandinavia, and we know what war mongers, and murders of their citizenry they are! 70% of Sweden claims to be atheist. Scary! Next thing you know we'll be forced to eat Ludifisk! Can you say \"Ya, by golly\"?", 
        "reply": " In answer to your question - \"So, when has more of God made it better?\" - It is when He sent Jesus Christ. You follow many of His teachings R.T. and you love Him but not some of the men that have failed to follow Him. \"Ya, by golly\" hehh, good one heheh - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 15:00:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!!", 
        "intTime": 20090414, 
        "postID": 20, 
        "quote": "", 
        "reply": "Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!!", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 21:37:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!! I'm sure Ixcatzin can read. Besides, has she \"gone after atheists\" with generalized statements? Moses is make believe. But his message of meanness is shared by all who claim the writings as guidance. However, Ixcatzin is not threatening anyone with her religion either.... except when she laces through the lies and deceit the Xians make to justify their cult. I can understand why the Xians over the centuries have so vehemently persecuted the Jews in an attempt to silence them. The Moses story is brutal.", 
        "intTime": 20090414, 
        "postID": 21, 
        "quote": "Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!!", 
        "reply": " I'm sure Ixcatzin can read. Besides, has she \"gone after atheists\" with generalized statements? Moses is make believe. But his message of meanness is shared by all who claim the writings as guidance. However, Ixcatzin is not threatening anyone with her religion either.... except when she laces through the lies and deceit the Xians make to justify their cult. I can understand why the Xians over the centuries have so vehemently persecuted the Jews in an attempt to silence them. The Moses story is brutal.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 22:32:00", 
        "title": "So happy to see THIS forum", 
        "userID": "reducetension"
    }, 
    {
        "content": "Thank you, that was illuminating...... as always.", 
        "intTime": 20090415, 
        "postID": 22, 
        "quote": "", 
        "reply": "Thank you, that was illuminating...... as always.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-15 06:31:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!! Same reason most of us are polite to you, even when we have differing viewpoints.", 
        "intTime": 20090423, 
        "postID": 23, 
        "quote": "Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!!", 
        "reply": " Same reason most of us are polite to you, even when we have differing viewpoints.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 05:32:00", 
        "title": "So happy to see THIS forum", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!! I'm sure Ixcatzin can read. Besides, has she \"gone after atheists\" with generalized statements? Moses is make believe. But his message of meanness is shared by all who claim the writings as guidance. However, Ixcatzin is not threatening anyone with her religion either.... except when she laces through the lies and deceit the Xians make to justify their cult. I can understand why the Xians over the centuries have so vehemently persecuted the Jews in an attempt to silence them. The Moses story is brutal. RT, I wonder why would Tawodi like to create animosity between you and me? Ixcatzin", 
        "intTime": 20090423, 
        "postID": 24, 
        "quote": "Originally posted by reducetension: quote: Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!! I'm sure Ixcatzin can read. Besides, has she \"gone after atheists\" with generalized statements? Moses is make believe. But his message of meanness is shared by all who claim the writings as guidance. However, Ixcatzin is not threatening anyone with her religion either.... except when she laces through the lies and deceit the Xians make to justify their cult. I can understand why the Xians over the centuries have so vehemently persecuted the Jews in an attempt to silence them. The Moses story is brutal.", 
        "reply": " RT, I wonder why would Tawodi like to create animosity between you and me? Ixcatzin", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 05:57:00", 
        "title": "So happy to see THIS forum", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "I have no interest in creating enmity, or discord, between you and/or anybody, Ixcatzin. The question was asked of Joe because he again mentioned the genocide practiced by Moses and his \"hoard\" as he usually does. Well since Moses was one of \"your\" guys I asked why he doesn't jab you the way he does Christians....kinda seems like a double standard doesn't it? I mean he is constantly saying people who believe in God are deluded, misled, liars, or simply crazy, so it stands to reason he would ask you the same types of questions doesn't it?? It couldn't possibly be a double standard could it??? I mean Joe is MUCH fairer than that isn't he??? And here is something else to ask....when did I ever tell somebody they are hell bound Atheists?? Or Jews, Or Muslims, or Catholics or some denomination other than Methodist?? To save you, and everybody else, a lot of research, NEVER!!! I never picked a fight with you Cat, but have responded to quite a few haven't I?? So you aren't my enemy, and I am not yours, but by this question, I can see once again, this may be my one sided opinion. T", 
        "intTime": 20090423, 
        "postID": 25, 
        "quote": "", 
        "reply": "I have no interest in creating enmity, or discord, between you and/or anybody, Ixcatzin. The question was asked of Joe because he again mentioned the genocide practiced by Moses and his \"hoard\" as he usually does. Well since Moses was one of \"your\" guys I asked why he doesn't jab you the way he does Christians....kinda seems like a double standard doesn't it? I mean he is constantly saying people who believe in God are deluded, misled, liars, or simply crazy, so it stands to reason he would ask you the same types of questions doesn't it?? It couldn't possibly be a double standard could it??? I mean Joe is MUCH fairer than that isn't he??? And here is something else to ask....when did I ever tell somebody they are hell bound Atheists?? Or Jews, Or Muslims, or Catholics or some denomination other than Methodist?? To save you, and everybody else, a lot of research, NEVER!!! I never picked a fight with you Cat, but have responded to quite a few haven't I?? So you aren't my enemy, and I am not yours, but by this question, I can see once again, this may be my one sided opinion. T", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 06:53:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: I have no interest in creating enmity, or discord, between you and/or anybody, Ixcatzin. The question was asked of Joe because he again mentioned the genocide practiced by Moses and his \"hoard\" as he usually does. The Moses story is brutal, is it not? Starting with him killing the cop. and running away. Why didn't god intervene then? ...and so on. I don't care which religion wants to claim it as a guide for moral standards, it's a mean spirited lesson in hate and ego mania (my secular view.) The Christian attempt to make it more user friendly still leaves the story there. (For the life of me, I can't see why Xians focus so much on what is attributed to Moses!??) I like the Bible stories, they are so human, etc. But I think it is silly to use the bible in its entirety for a rule for culture. It fails miserably. (Though it is obvious no one, not even the Jews, take it all seriously.) It needs yet again an other edit. (Jefferson tried that, make it more user friendly for the new nation.) Well since Moses was one of \"your\" guys I asked why he doesn't jab you the way he does Christians....kinda seems like a double standard doesn't it? She can own up to what she wants, ..you do. You plunder her book all the time. So be it. There is no double standard. I am much more familiar with the excitable Christian take on the scheme of the god business (Bible) than I am of the Jews. I have learned nothing new from the Christian posters but I have from the Jewish posters. I think they are more use to being \"rejected\" than you or the other Xians on here. They have their side of the story, and I happen to understand it better than yours. So, I appreciated their input. And I don't really expect her or the other Jews to get 'bent out of shape'. (Though I have notice their complaint about the way Christians use their bible.) I mean he is constantly saying people who believe in God are deluded, misled, liars, or simply crazy, so it stands to reason he would ask you the same types of questions doesn't it?? No, not true. Haven't said that about you, directly. I don't think your 'problem' is because you are a Christian. And I certainly do not believe everyone who believes in unseen being is 'crazy'. Humans believe all kinds of things that are not true... some of them are obnoxious about it. Others are not. Coming to grips with reality takes a while. Many of my closest friends believe in 'unseen' things and some are bible believing Christians. It couldn't possibly be a double standard could it??? I mean Joe is MUCH fairer than that isn't he??? Let's hope so! And here is something else to ask....when did I ever tell somebody they are hell bound Atheists?? Or Jews, Or Muslims, or Catholics or some denomination other than Methodist?? I don't know? When? To save you, and everybody else, a lot of research, NEVER!!! Oh, ok. You are \"absorbing\" unintended guilt, Bruce. I don't think your are mentioned in the post? You ask a generalized question and I gave a generalized answer. You want to defend yourself, go right ahead, but you are swinging at shadows. I never picked a fight with you Cat, but have responded to quite a few haven't I?? So who do you 'pick' fights with? So you aren't my enemy, and I am not yours, but by this question, I can see once again, this may be my one sided opinion. T quote: RT, I wonder why would Tawodi like to create animosity between you and me? Ixcatzin I think T was a bit excited, Ixcatzin, that maybe I like you (your) posts better? He either wants to be treated as well as he thinks I treat you or for me to treat you as badly as he thinks I treat him?? Anyway, historical, the Jews have not been a problem (since 70AD and the Masada madness, anyway.) But many Christians, on the other hand, have been a big problem!! So I have a somewhat sarcastic attitude to the Christian's self congratulatory attitude and the extolling of their hero 'messiah' when in fact it is problem, the number one cause of unjustified suffering on the planet.... even of the Jews. And some of them continue to \"terrorize\" many of us with the coming of their messianic hope and our eventual eradicate for the good of the Kingdom (but save the Jews, of course.) I wouldn't be a bit surprised in the nuttiness of that eschatologcal thinking that a great deal more grief can be brought about for the world in the future. It's crazy!", 
        "intTime": 20090423, 
        "postID": 26, 
        "quote": "Originally posted by tawodi: I have no interest in creating enmity, or discord, between you and/or anybody, Ixcatzin. The question was asked of Joe because he again mentioned the genocide practiced by Moses and his \"hoard\" as he usually does. The Moses story is brutal, is it not? Starting with him killing the cop. and running away. Why didn't god intervene then? ...and so on. I don't care which religion wants to claim it as a guide for moral standards, it's a mean spirited lesson in hate and ego mania (my secular view.) The Christian attempt to make it more user friendly still leaves the story there. (For the life of me, I can't see why Xians focus so much on what is attributed to Moses!??) I like the Bible stories, they are so human, etc. But I think it is silly to use the bible in its entirety for a rule for culture. It fails miserably. (Though it is obvious no one, not even the Jews, take it all seriously.) It needs yet again an other edit. (Jefferson tried that, make it more user friendly for the new nation.) Well since Moses was one of \"your\" guys I asked why he doesn't jab you the way he does Christians....kinda seems like a double standard doesn't it? She can own up to what she wants, ..you do. You plunder her book all the time. So be it. There is no double standard. I am much more familiar with the excitable Christian take on the scheme of the god business (Bible) than I am of the Jews. I have learned nothing new from the Christian posters but I have from the Jewish posters. I think they are more use to being \"rejected\" than you or the other Xians on here. They have their side of the story, and I happen to understand it better than yours. So, I appreciated their input. And I don't really expect her or the other Jews to get 'bent out of shape'. (Though I have notice their complaint about the way Christians use their bible.) I mean he is constantly saying people who believe in God are deluded, misled, liars, or simply crazy, so it stands to reason he would ask you the same types of questions doesn't it?? No, not true. Haven't said that about you, directly. I don't think your 'problem' is because you are a Christian. And I certainly do not believe everyone who believes in unseen being is 'crazy'. Humans believe all kinds of things that are not true... some of them are obnoxious about it. Others are not. Coming to grips with reality takes a while. Many of my closest friends believe in 'unseen' things and some are bible believing Christians. It couldn't possibly be a double standard could it??? I mean Joe is MUCH fairer than that isn't he??? Let's hope so! And here is something else to ask....when did I ever tell somebody they are hell bound Atheists?? Or Jews, Or Muslims, or Catholics or some denomination other than Methodist?? I don't know? When? To save you, and everybody else, a lot of research, NEVER!!! Oh, ok. You are \"absorbing\" unintended guilt, Bruce. I don't think your are mentioned in the post? You ask a generalized question and I gave a generalized answer. You want to defend yourself, go right ahead, but you are swinging at shadows. I never picked a fight with you Cat, but have responded to quite a few haven't I?? So who do you 'pick' fights with? So you aren't my enemy, and I am not yours, but by this question, I can see once again, this may be my one sided opinion. T", 
        "reply": " quote: RT, I wonder why would Tawodi like to create animosity between you and me? Ixcatzin I think T was a bit excited, Ixcatzin, that maybe I like you (your) posts better? He either wants to be treated as well as he thinks I treat you or for me to treat you as badly as he thinks I treat him?? Anyway, historical, the Jews have not been a problem (since 70AD and the Masada madness, anyway.) But many Christians, on the other hand, have been a big problem!! So I have a somewhat sarcastic attitude to the Christian's self congratulatory attitude and the extolling of their hero 'messiah' when in fact it is problem, the number one cause of unjustified suffering on the planet.... even of the Jews. And some of them continue to \"terrorize\" many of us with the coming of their messianic hope and our eventual eradicate for the good of the Kingdom (but save the Jews, of course.) I wouldn't be a bit surprised in the nuttiness of that eschatologcal thinking that a great deal more grief can be brought about for the world in the future. It's crazy!", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 11:32:00", 
        "title": "So happy to see THIS forum", 
        "userID": "reducetension"
    }, 
    {
        "content": "Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon -", 
        "intTime": 20090423, 
        "postID": 27, 
        "quote": "", 
        "reply": "Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 14:19:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon - OMG Legion, what are you smoking? Politics??? Tawodi wants to create division by inviting RT to treat me as badly as he thinks he is treated! I wonder how is that my name even came to be mentioned in this discusion!! Speaking of division, are Catholics and Protestants in the same page or are they still divided since the times where politics in the Vatican (no to mention corruption and other things like... Lucrecia Boriga) were the thing of the day? If you want to talk about politics and divisions, tell us more about the Catholic Church, that is a great example of that! Ixcatzin", 
        "intTime": 20090423, 
        "postID": 28, 
        "quote": "Originally posted by LegionSon: Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon -", 
        "reply": " OMG Legion, what are you smoking? Politics??? Tawodi wants to create division by inviting RT to treat me as badly as he thinks he is treated! I wonder how is that my name even came to be mentioned in this discusion!! Speaking of division, are Catholics and Protestants in the same page or are they still divided since the times where politics in the Vatican (no to mention corruption and other things like... Lucrecia Boriga) were the thing of the day? If you want to talk about politics and divisions, tell us more about the Catholic Church, that is a great example of that! Ixcatzin", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 14:58:00", 
        "title": "So happy to see THIS forum", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "quote: Originally posted by ixcatzin: quote: Originally posted by LegionSon: Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon - OMG Legion, what are you smoking? Politics??? Tawodi wants to create division by inviting RT to treat me as badly as he thinks he is treated! I wonder how is that my name even came to be mentioned in this discusion!! Speaking of division, are Catholics and Protestants in the same page or are they still divided since the times where politics in the Vatican (no to mention corruption and other things like... Lucrecia Boriga) were the thing of the day? If you want to talk about politics and divisions, tell us more about the Catholic Church, that is a great example of that! Ixcatzin Hehh, now calm down Ixcatzin...you know I admire you. It just seems obvious to me and Tawodi how some like to push your buttons. I thought you were aware of this and were just playing along for the desired effect. As Tawodi said he is not your enemy and I have not expressed any insult to you or your religion. You can't really say that of a few others. They do it in the manner of mentioning both our religions and have the desire to pit us against eachother. That's all. - peace - - and nice to see you again, i hope all is well with you and yours - Shalom - - LegionSon -", 
        "intTime": 20090423, 
        "postID": 29, 
        "quote": "Originally posted by ixcatzin: quote: Originally posted by LegionSon: Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon - OMG Legion, what are you smoking? Politics??? Tawodi wants to create division by inviting RT to treat me as badly as he thinks he is treated! I wonder how is that my name even came to be mentioned in this discusion!! Speaking of division, are Catholics and Protestants in the same page or are they still divided since the times where politics in the Vatican (no to mention corruption and other things like... Lucrecia Boriga) were the thing of the day? If you want to talk about politics and divisions, tell us more about the Catholic Church, that is a great example of that! Ixcatzin", 
        "reply": " Hehh, now calm down Ixcatzin...you know I admire you. It just seems obvious to me and Tawodi how some like to push your buttons. I thought you were aware of this and were just playing along for the desired effect. As Tawodi said he is not your enemy and I have not expressed any insult to you or your religion. You can't really say that of a few others. They do it in the manner of mentioning both our religions and have the desire to pit us against eachother. That's all. - peace - - and nice to see you again, i hope all is well with you and yours - Shalom - - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 15:11:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "It is so good to see this forum, and read all of the posts which PRAISE AND THANK our CREATOR for the many blessings that are bestowed on each of us. I am so thankful for my family and the physical ability to write this. I am HONORED to walk with our LORD AND SAVIOR on a daily basis and with a personal \"connection\". Truly HE lives. I want to share a \"poem\" with whomever wants to read it. I was sitting her thinking about EASTER on this past Saturday, and these words \"came to me\" {please note; I submit them with a sense of humility-I do not take any \"credit\"}: April, 4th 2009 On this Saturday; Our Savior was getting ready to ride into the ‘Holy City as the King’, praised by all the people while being fanned by ‘Palm Leaves’ For a week in which He and His Disciples would gather ending in a ‘Last Supper’ in the room of the attic eaves After weeping in Gethsemanes’ Garden, Jesus would take up His ‘Heavy and Burdensome Cross’ And give His precious life to save all of our souls, even though we felt a terrible loss However, He came to bring the ‘Good News’ and in three days, He would be the ‘Living Christ’ When two wonderful Ladies would find His Tomb Empty with the promise of ‘Everlasting Life’ Edited: to remove email addy This message has been edited. Last edited by: pipedreamsandbabies, Wed 08 April 2009 04:47 PM", 
        "intTime": 20090408, 
        "postID": 30, 
        "quote": "", 
        "reply": "It is so good to see this forum, and read all of the posts which PRAISE AND THANK our CREATOR for the many blessings that are bestowed on each of us. I am so thankful for my family and the physical ability to write this. I am HONORED to walk with our LORD AND SAVIOR on a daily basis and with a personal \"connection\". Truly HE lives. I want to share a \"poem\" with whomever wants to read it. I was sitting her thinking about EASTER on this past Saturday, and these words \"came to me\" {please note; I submit them with a sense of humility-I do not take any \"credit\"}: April, 4th 2009 On this Saturday; Our Savior was getting ready to ride into the ‘Holy City as the King’, praised by all the people while being fanned by ‘Palm Leaves’ For a week in which He and His Disciples would gather ending in a ‘Last Supper’ in the room of the attic eaves After weeping in Gethsemanes’ Garden, Jesus would take up His ‘Heavy and Burdensome Cross’ And give His precious life to save all of our souls, even though we felt a terrible loss However, He came to bring the ‘Good News’ and in three days, He would be the ‘Living Christ’ When two wonderful Ladies would find His Tomb Empty with the promise of ‘Everlasting Life’ Edited: to remove email addy This message has been edited. Last edited by: pipedreamsandbabies, Wed 08 April 2009 04:47 PM", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-08 07:59:00", 
        "title": "So happy to see THIS forum", 
        "userID": "graywolflive"
    }, 
    {
        "content": "Graywolf: Thanks so much for the post. It is so true ans so needed in these forums. Your post is a light in a dark place as I see it. God Bless and have a great Easter weekend. Buy the way, I have two beautiful full grown, full blood gray wolves and they are awesome.", 
        "intTime": 20090408, 
        "postID": 31, 
        "quote": "", 
        "reply": "Graywolf: Thanks so much for the post. It is so true ans so needed in these forums. Your post is a light in a dark place as I see it. God Bless and have a great Easter weekend. Buy the way, I have two beautiful full grown, full blood gray wolves and they are awesome.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-08 08:28:00", 
        "title": "So happy to see THIS forum", 
        "userID": "506EASY"
    }, 
    {
        "content": "Graywolf- Please do not use personal email address on this site as you may wind up getting the kind of email in your inbox you did not expect. If member wishes to contact you directly they must be part of your network. Welcome to the forums!", 
        "intTime": 20090408, 
        "postID": 32, 
        "quote": "", 
        "reply": "Graywolf- Please do not use personal email address on this site as you may wind up getting the kind of email in your inbox you did not expect. If member wishes to contact you directly they must be part of your network. Welcome to the forums!", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-08 17:01:00", 
        "title": "So happy to see THIS forum", 
        "userID": "pipedreamsandbabies"
    }, 
    {
        "content": "G.W.L. Welcome!! In the new set up in order to e mail members you must click on their name at the top left of a post ( usually where the little picture (avatar) is,) this will take you to their profile, click on \"make this person a friend\" they will receive your invitation, approve it, and THEN you can e mail them directly. You can invite others to contact you in the same way by posting a general invitation and they can do the same to contact you. Be well....Tawodi", 
        "intTime": 20090408, 
        "postID": 33, 
        "quote": "", 
        "reply": "G.W.L. Welcome!! In the new set up in order to e mail members you must click on their name at the top left of a post ( usually where the little picture (avatar) is,) this will take you to their profile, click on \"make this person a friend\" they will receive your invitation, approve it, and THEN you can e mail them directly. You can invite others to contact you in the same way by posting a general invitation and they can do the same to contact you. Be well....Tawodi", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-08 19:44:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "Thanks much for the \"welcome\" ... I'm not sure what I did wrong. I can't quite understand what I should do differently or where/what I need to change so that I don't advertise my e-mail. But, I WANT TO DO THE RIGHT THING - SO any suggestions \"like yours\" are greatly appreciated. Best regards to all", 
        "intTime": 20090409, 
        "postID": 34, 
        "quote": "", 
        "reply": "Thanks much for the \"welcome\" ... I'm not sure what I did wrong. I can't quite understand what I should do differently or where/what I need to change so that I don't advertise my e-mail. But, I WANT TO DO THE RIGHT THING - SO any suggestions \"like yours\" are greatly appreciated. Best regards to all", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-09 14:02:00", 
        "title": "So happy to see THIS forum", 
        "userID": "graywolflive"
    }, 
    {
        "content": "It's never a good idea to put up or give your personal e-mail address to some one you don't know or on an open forum such as these. There are all kinds of people who read here and not all are nice or military. The e-mail service here is called a blind service, some one can contact you but they will NOT have your personal e-mail address. They contact you through your profile with a form that comes up. They write what they choose and click send. Milcom then sends it \"in the blind\" and after a few contacts with that person you both can decide if you want to exchange addresses. It's a whole lot simpler to do, than it is to tell!! You didn't get in trouble, they just didn't want you to get stuck with a possible nutbag!!! T", 
        "intTime": 20090409, 
        "postID": 35, 
        "quote": "", 
        "reply": "It's never a good idea to put up or give your personal e-mail address to some one you don't know or on an open forum such as these. There are all kinds of people who read here and not all are nice or military. The e-mail service here is called a blind service, some one can contact you but they will NOT have your personal e-mail address. They contact you through your profile with a form that comes up. They write what they choose and click send. Milcom then sends it \"in the blind\" and after a few contacts with that person you both can decide if you want to exchange addresses. It's a whole lot simpler to do, than it is to tell!! You didn't get in trouble, they just didn't want you to get stuck with a possible nutbag!!! T", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-09 16:01:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "G.W.L. Thank you for your service, and welcome... CJ", 
        "intTime": 20090413, 
        "postID": 36, 
        "quote": "", 
        "reply": "G.W.L. Thank you for your service, and welcome... CJ", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-13 13:55:00", 
        "title": "So happy to see THIS forum", 
        "userID": "TAH407"
    }, 
    {
        "content": "Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief.", 
        "intTime": 20090413, 
        "postID": 37, 
        "quote": "", 
        "reply": "Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-13 19:52:00", 
        "title": "So happy to see THIS forum", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -[/QUOTE]", 
        "intTime": 20090413, 
        "postID": 38, 
        "quote": "Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief.", 
        "reply": " Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -[/QUOTE]", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-13 20:49:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon - [/QUOTE] LegionSon, I know you'd like to imagine that \"religion\" means your version of Christianity, and the rest of us are just trying to quash the bleating of the \"true believers,\" but as Bill said, this is a \"religion in the military\" forum. This is a discussion forum for how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian. Arrogance has been thrown both ways, of course, but the vast majority of the arrogance has been thrown BY some of the Christians on this forum. Sure, post your testimonials all you want. Post prayer threads. But when other people post about their religions, don't attack them unless you want them to come to your threads and attack you. That's the problem around here - some of you feel justified in hassling anyone of a different faith or no faith, but you throw a hissy fit when someone does the same to you. I do wish you well in your spiritual path. I just ALSO wish you and others would cease to harass those of other paths.", 
        "intTime": 20090414, 
        "postID": 39, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -", 
        "reply": " [/QUOTE] LegionSon, I know you'd like to imagine that \"religion\" means your version of Christianity, and the rest of us are just trying to quash the bleating of the \"true believers,\" but as Bill said, this is a \"religion in the military\" forum. This is a discussion forum for how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian. Arrogance has been thrown both ways, of course, but the vast majority of the arrogance has been thrown BY some of the Christians on this forum. Sure, post your testimonials all you want. Post prayer threads. But when other people post about their religions, don't attack them unless you want them to come to your threads and attack you. That's the problem around here - some of you feel justified in hassling anyone of a different faith or no faith, but you throw a hissy fit when someone does the same to you. I do wish you well in your spiritual path. I just ALSO wish you and others would cease to harass those of other paths.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 05:37:00", 
        "title": "So happy to see THIS forum", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon - LegionSon, I know you'd like to imagine that \"religion\" means your version of Christianity, and the rest of us are just trying to quash the bleating of the \"true believers,\" but as Bill said, this is a \"religion in the military\" forum. This is a discussion forum for how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian. Arrogance has been thrown both ways, of course, but the vast majority of the arrogance has been thrown BY some of the Christians on this forum. Sure, post your testimonials all you want. Post prayer threads. But when other people post about their religions, don't attack them unless you want them to come to your threads and attack you. That's the problem around here - some of you feel justified in hassling anyone of a different faith or no faith, but you throw a hissy fit when someone does the same to you. I do wish you well in your spiritual path. I just ALSO wish you and others would cease to harass those of other paths.[/QUOTE] ---------------------------------------------- ________________________________________________ Your first paragraph is Completely False. - I did not single out any \"religion\". I said \"The desired effect is to silence all those who believe in God.\" Also, I don't understand why some of you think you can dictate/limit the subject matter of this forum to the \"how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian.\" as you say. You then contradict yourself by stating \"Sure, post your testimonials all you want. Post prayer threads.\" I will agree with you in the arrogance factor that consumes us all from time to time, but I contest your singling out any group such as the Christians as being \"the vast majority\". What I see is man being tempted by intelligence to think he is above God. This is written. I would guess that your perception just might be a testament to your own bias against Christians. Most all of you threads are evidence of this bias you hold. Lastly, I thank you for ending with well wishes for me in my spiritual path. I believe you to be sincere and I am sincere in praying for the same to you. I like you Whirled_Peas. I always have. I do believe I have shown arrogance to you before as I was teasing you a bit in a couple of threads long ago. For this I am sorry and ask your forgiveness. I have come to feel that you maybe the way you are from falling victim to the bashing by some Christians for quite some time here and elsewhere and this saddens me. So I would like to state that I believe you have a good heart and sincerely want the best for all peoples. This is what we share in common. Just as this thread was by a new poster, for us to forgive and heal the past we need to be willing to start anew. This is what Easter is about to us Christians and I know you have similar beliefs. I believe it is what makes us grow straight and strong. - LegionSon -", 
        "intTime": 20090414, 
        "postID": 40, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -", 
        "reply": " LegionSon, I know you'd like to imagine that \"religion\" means your version of Christianity, and the rest of us are just trying to quash the bleating of the \"true believers,\" but as Bill said, this is a \"religion in the military\" forum. This is a discussion forum for how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian. Arrogance has been thrown both ways, of course, but the vast majority of the arrogance has been thrown BY some of the Christians on this forum. Sure, post your testimonials all you want. Post prayer threads. But when other people post about their religions, don't attack them unless you want them to come to your threads and attack you. That's the problem around here - some of you feel justified in hassling anyone of a different faith or no faith, but you throw a hissy fit when someone does the same to you. I do wish you well in your spiritual path. I just ALSO wish you and others would cease to harass those of other paths.[/QUOTE] ---------------------------------------------- ________________________________________________ Your first paragraph is Completely False. - I did not single out any \"religion\". I said \"The desired effect is to silence all those who believe in God.\" Also, I don't understand why some of you think you can dictate/limit the subject matter of this forum to the \"how religion impacts the life of ALL troops and veterans, and (thankfully) not all of us are Christian.\" as you say. You then contradict yourself by stating \"Sure, post your testimonials all you want. Post prayer threads.\" I will agree with you in the arrogance factor that consumes us all from time to time, but I contest your singling out any group such as the Christians as being \"the vast majority\". What I see is man being tempted by intelligence to think he is above God. This is written. I would guess that your perception just might be a testament to your own bias against Christians. Most all of you threads are evidence of this bias you hold. Lastly, I thank you for ending with well wishes for me in my spiritual path. I believe you to be sincere and I am sincere in praying for the same to you. I like you Whirled_Peas. I always have. I do believe I have shown arrogance to you before as I was teasing you a bit in a couple of threads long ago. For this I am sorry and ask your forgiveness. I have come to feel that you maybe the way you are from falling victim to the bashing by some Christians for quite some time here and elsewhere and this saddens me. So I would like to state that I believe you have a good heart and sincerely want the best for all peoples. This is what we share in common. Just as this thread was by a new poster, for us to forgive and heal the past we need to be willing to start anew. This is what Easter is about to us Christians and I know you have similar beliefs. I believe it is what makes us grow straight and strong. - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 06:44:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: YES ,SHE HAS A GOOD HEART, AS MOST THAT VISIT THIS FORUM DO, EVEN BILL, EVERYONE HERE HAS THE FREEDOM TO EXPRESS THEIR BELIEFS, NO MATTER WHAT THEY BELIEVE,EVEN NOTHING AT ALL. HAVE A THICK SKIN HERE,DEBATE AT TIMES GETS VERY HEATED,JUST POST TO THE TOPIC NOT THE POSTER. BUT REMEMBER IF YOU BREAK THE TOS YOU WILL HAVE CAUSE TO FEAR THE REAPER...I ALWAYS WANTED TO SAY THAT HAVE FUN FOLKS ..LATER D.J.", 
        "intTime": 20090414, 
        "postID": 41, 
        "quote": "Originally posted by NEMESIS1960: YES ,SHE HAS A GOOD HEART, AS MOST THAT VISIT THIS FORUM DO, EVEN BILL, EVERYONE HERE HAS THE FREEDOM TO EXPRESS THEIR BELIEFS, NO MATTER WHAT THEY BELIEVE,EVEN NOTHING AT ALL. HAVE A THICK SKIN HERE,DEBATE AT TIMES GETS VERY HEATED,JUST POST TO THE TOPIC NOT THE POSTER. BUT REMEMBER IF YOU BREAK THE TOS YOU WILL HAVE CAUSE TO FEAR THE REAPER...I ALWAYS WANTED TO SAY THAT HAVE FUN FOLKS ..LATER", 
        "reply": " D.J.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 09:19:00", 
        "title": "So happy to see THIS forum", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!!", 
        "intTime": 20090414, 
        "postID": 42, 
        "quote": "", 
        "reply": "Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!!", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 10:40:00", 
        "title": "So happy to see THIS forum", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon - [/QUOTE] One man's negative is another's positive, I guess. Some see the \"light in a dark place\" as the light of reason in a place of dark superstition. Naturally, you being the superstitious one, feel attacked when your \"light\" is obviated for the fiction it is and you have to slink away because you've run out of epistemological ammunition and must resort to poetry and questionable moral platitude. I do sincerely welcome Paul with a welcome among honorable men, and not a welcome of religious blather and heretical mumblings. There are plenty of places in the world people can bring that stuff without trying to dominate the military with it. Take it to \"The Chapel\" over in the family forum, if that's your purpose. You will notice, when you get there, that there are actually very few people posting there because very few of them actually want to hear their own kind of blather, either. They'd rather bring it to a place of known integration where they can hassle someone else with it. Indeed, take a look at the prayer threads at the top of this forum. You'll notice that they are weakly populated, also, because there's no controversy [read that, fun] in praying where everyone agrees with you.", 
        "intTime": 20090414, 
        "postID": 43, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by billbright: Yes, welcome, Paul. You'll find that this isn't the kind of religious forum that you may have been exposed to elsewhere, where the tendency is to constantly pray, share testimonials, etc. This is where we discuss religion's effects, especially In The Military. You'll find discussions about the attempts of Dominionists to influence our cadets; talk about gays in the military; and a ton of side issues, arguments, and jibes from every side of the aisle of belief. Much of what billy has posted above is sadly evidence and wishes through his and others constant barrage of posting in the negative. Arrogance and pride in maintaining this consumes a few of the \"we\" he dictates to. The desired effect is to silence all those who believe in God. The tactic used is belittlement disguised as intelligence. Yet there are those of us who understand and endure their affliction to constantly post in the negative. As 506EASY pointed out, you are a \"light in a dark place\". Maybe you would like to join me in a prayer for billy to one day reject the darkness that consumes him here on these threads. The \"welcome\" you received is yet another twist of truth, so allow me to give you a sincere welcome. I am sure you know the power of prayer. As we pray pray and pray some will always feel the need to prey prey and prey. We know there is good and evil. Some of us try to extinguish evil while others are consumed in trying to extinguish good. And so, the battle continues. Oh yeah, feel free to \"constantly pray, share testimonials, etc.\" - The Power Of Prayer can not be extinguished - - LegionSon -", 
        "reply": " [/QUOTE] One man's negative is another's positive, I guess. Some see the \"light in a dark place\" as the light of reason in a place of dark superstition. Naturally, you being the superstitious one, feel attacked when your \"light\" is obviated for the fiction it is and you have to slink away because you've run out of epistemological ammunition and must resort to poetry and questionable moral platitude. I do sincerely welcome Paul with a welcome among honorable men, and not a welcome of religious blather and heretical mumblings. There are plenty of places in the world people can bring that stuff without trying to dominate the military with it. Take it to \"The Chapel\" over in the family forum, if that's your purpose. You will notice, when you get there, that there are actually very few people posting there because very few of them actually want to hear their own kind of blather, either. They'd rather bring it to a place of known integration where they can hassle someone else with it. Indeed, take a look at the prayer threads at the top of this forum. You'll notice that they are weakly populated, also, because there's no controversy [read that, fun] in praying where everyone agrees with you.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 13:59:00", 
        "title": "So happy to see THIS forum", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "intTime": 20090414, 
        "postID": 44, 
        "quote": "Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!!", 
        "reply": " ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 14:13:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon - Time to check your meds again?", 
        "intTime": 20090414, 
        "postID": 45, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "reply": " Time to check your meds again?", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 14:19:00", 
        "title": "So happy to see THIS forum", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. And as far as censorship goes, you are correct it is not an American thing. We are not Communists. Stalin was, and many religious have been censored through harrassement when they state their beliefs. It makes them feel unwelcome even with the satirical \"welcome\". The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "intTime": 20090414, 
        "postID": 46, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by reducetension: Historically, Christians (and some other religions) when they can get the power to do so, love to censor others and attempt to enforce their own view of reality, history and future times. It has been attempted a few times on here. But, censorship of free thought is such an anti-American thing. Besides, the religious fundamentalist of Jesus day did the same thing to him. On with the show.....!!! ________________________________________________ You failed to mention Atheism. Unless you are including it when you mentioned - \"Christians (and some other religions)\" I believe that faith in ones self or man alone above a Divine being/God does constitue a religious belief. Either way, we must never forget to include the ultimate outcome we witnessed through Stalin...10's of millions killed...4 - 5 million every year...but it was deemed ok...not to a god or well defined religion, but under that evolutionary theory of survival of the fittest. And as far as censorship goes, you are correct it is not an American thing. We are not Communists. Stalin was, and many religious have been censored through harrassement when they state their beliefs. It makes them feel unwelcome even with the satirical \"welcome\". The key word in your post was \"power\". So then, it really comes down to man himself who is not capable of handling absolute power. Man will kill and has as many or more in Atheism. - just pointing out that slight discrepency - - LegionSon -", 
        "reply": "", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 14:25:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "This is certainly why we would want to keep power out of the hands of the overly religious... they have historical run a muck with their zeal to establish their godliness... like Moses and his mob killing, raping, stealing all the way to Canaan because 'god said so'. So, when has more of God made it better? Of course the most atheistic nations today are in Scandinavia, and we know what war mongers, and murders of their citizenry they are! 70% of Sweden claims to be atheist. Scary! Next thing you know we'll be forced to eat Ludifisk! Can you say \"Ya, by golly\"?", 
        "intTime": 20090414, 
        "postID": 47, 
        "quote": "", 
        "reply": "This is certainly why we would want to keep power out of the hands of the overly religious... they have historical run a muck with their zeal to establish their godliness... like Moses and his mob killing, raping, stealing all the way to Canaan because 'god said so'. So, when has more of God made it better? Of course the most atheistic nations today are in Scandinavia, and we know what war mongers, and murders of their citizenry they are! 70% of Sweden claims to be atheist. Scary! Next thing you know we'll be forced to eat Ludifisk! Can you say \"Ya, by golly\"?", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 14:28:00", 
        "title": "So happy to see THIS forum", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: This is certainly why we would want to keep power out of the hands of the overly religious... they have historical run a muck with their zeal to establish their godliness... like Moses and his mob killing, raping, stealing all the way to Canaan because 'god said so'. So, when has more of God made it better? Of course the most atheistic nations today are in Scandinavia, and we know what war mongers, and murders of their citizenry they are! 70% of Sweden claims to be atheist. Scary! Next thing you know we'll be forced to eat Ludifisk! Can you say \"Ya, by golly\"? In answer to your question - \"So, when has more of God made it better?\" - It is when He sent Jesus Christ. You follow many of His teachings R.T. and you love Him but not some of the men that have failed to follow Him. \"Ya, by golly\" hehh, good one heheh - LegionSon -", 
        "intTime": 20090414, 
        "postID": 48, 
        "quote": "Originally posted by reducetension: This is certainly why we would want to keep power out of the hands of the overly religious... they have historical run a muck with their zeal to establish their godliness... like Moses and his mob killing, raping, stealing all the way to Canaan because 'god said so'. So, when has more of God made it better? Of course the most atheistic nations today are in Scandinavia, and we know what war mongers, and murders of their citizenry they are! 70% of Sweden claims to be atheist. Scary! Next thing you know we'll be forced to eat Ludifisk! Can you say \"Ya, by golly\"?", 
        "reply": " In answer to your question - \"So, when has more of God made it better?\" - It is when He sent Jesus Christ. You follow many of His teachings R.T. and you love Him but not some of the men that have failed to follow Him. \"Ya, by golly\" hehh, good one heheh - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 15:00:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!!", 
        "intTime": 20090414, 
        "postID": 49, 
        "quote": "", 
        "reply": "Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!!", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 21:37:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!! I'm sure Ixcatzin can read. Besides, has she \"gone after atheists\" with generalized statements? Moses is make believe. But his message of meanness is shared by all who claim the writings as guidance. However, Ixcatzin is not threatening anyone with her religion either.... except when she laces through the lies and deceit the Xians make to justify their cult. I can understand why the Xians over the centuries have so vehemently persecuted the Jews in an attempt to silence them. The Moses story is brutal.", 
        "intTime": 20090414, 
        "postID": 50, 
        "quote": "Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!!", 
        "reply": " I'm sure Ixcatzin can read. Besides, has she \"gone after atheists\" with generalized statements? Moses is make believe. But his message of meanness is shared by all who claim the writings as guidance. However, Ixcatzin is not threatening anyone with her religion either.... except when she laces through the lies and deceit the Xians make to justify their cult. I can understand why the Xians over the centuries have so vehemently persecuted the Jews in an attempt to silence them. The Moses story is brutal.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-14 22:32:00", 
        "title": "So happy to see THIS forum", 
        "userID": "reducetension"
    }, 
    {
        "content": "Thank you, that was illuminating...... as always.", 
        "intTime": 20090415, 
        "postID": 51, 
        "quote": "", 
        "reply": "Thank you, that was illuminating...... as always.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-15 06:31:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!! Same reason most of us are polite to you, even when we have differing viewpoints.", 
        "intTime": 20090423, 
        "postID": 52, 
        "quote": "Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!!", 
        "reply": " Same reason most of us are polite to you, even when we have differing viewpoints.", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 05:32:00", 
        "title": "So happy to see THIS forum", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!! I'm sure Ixcatzin can read. Besides, has she \"gone after atheists\" with generalized statements? Moses is make believe. But his message of meanness is shared by all who claim the writings as guidance. However, Ixcatzin is not threatening anyone with her religion either.... except when she laces through the lies and deceit the Xians make to justify their cult. I can understand why the Xians over the centuries have so vehemently persecuted the Jews in an attempt to silence them. The Moses story is brutal. RT, I wonder why would Tawodi like to create animosity between you and me? Ixcatzin", 
        "intTime": 20090423, 
        "postID": 53, 
        "quote": "Originally posted by reducetension: quote: Originally posted by tawodi: Sooo, Joe..... how come you don't ever make a post like this to Ixcatzin?? After all, Moses was their guy ya know!! I'm sure Ixcatzin can read. Besides, has she \"gone after atheists\" with generalized statements? Moses is make believe. But his message of meanness is shared by all who claim the writings as guidance. However, Ixcatzin is not threatening anyone with her religion either.... except when she laces through the lies and deceit the Xians make to justify their cult. I can understand why the Xians over the centuries have so vehemently persecuted the Jews in an attempt to silence them. The Moses story is brutal.", 
        "reply": " RT, I wonder why would Tawodi like to create animosity between you and me? Ixcatzin", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 05:57:00", 
        "title": "So happy to see THIS forum", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "I have no interest in creating enmity, or discord, between you and/or anybody, Ixcatzin. The question was asked of Joe because he again mentioned the genocide practiced by Moses and his \"hoard\" as he usually does. Well since Moses was one of \"your\" guys I asked why he doesn't jab you the way he does Christians....kinda seems like a double standard doesn't it? I mean he is constantly saying people who believe in God are deluded, misled, liars, or simply crazy, so it stands to reason he would ask you the same types of questions doesn't it?? It couldn't possibly be a double standard could it??? I mean Joe is MUCH fairer than that isn't he??? And here is something else to ask....when did I ever tell somebody they are hell bound Atheists?? Or Jews, Or Muslims, or Catholics or some denomination other than Methodist?? To save you, and everybody else, a lot of research, NEVER!!! I never picked a fight with you Cat, but have responded to quite a few haven't I?? So you aren't my enemy, and I am not yours, but by this question, I can see once again, this may be my one sided opinion. T", 
        "intTime": 20090423, 
        "postID": 54, 
        "quote": "", 
        "reply": "I have no interest in creating enmity, or discord, between you and/or anybody, Ixcatzin. The question was asked of Joe because he again mentioned the genocide practiced by Moses and his \"hoard\" as he usually does. Well since Moses was one of \"your\" guys I asked why he doesn't jab you the way he does Christians....kinda seems like a double standard doesn't it? I mean he is constantly saying people who believe in God are deluded, misled, liars, or simply crazy, so it stands to reason he would ask you the same types of questions doesn't it?? It couldn't possibly be a double standard could it??? I mean Joe is MUCH fairer than that isn't he??? And here is something else to ask....when did I ever tell somebody they are hell bound Atheists?? Or Jews, Or Muslims, or Catholics or some denomination other than Methodist?? To save you, and everybody else, a lot of research, NEVER!!! I never picked a fight with you Cat, but have responded to quite a few haven't I?? So you aren't my enemy, and I am not yours, but by this question, I can see once again, this may be my one sided opinion. T", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 06:53:00", 
        "title": "So happy to see THIS forum", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: I have no interest in creating enmity, or discord, between you and/or anybody, Ixcatzin. The question was asked of Joe because he again mentioned the genocide practiced by Moses and his \"hoard\" as he usually does. The Moses story is brutal, is it not? Starting with him killing the cop. and running away. Why didn't god intervene then? ...and so on. I don't care which religion wants to claim it as a guide for moral standards, it's a mean spirited lesson in hate and ego mania (my secular view.) The Christian attempt to make it more user friendly still leaves the story there. (For the life of me, I can't see why Xians focus so much on what is attributed to Moses!??) I like the Bible stories, they are so human, etc. But I think it is silly to use the bible in its entirety for a rule for culture. It fails miserably. (Though it is obvious no one, not even the Jews, take it all seriously.) It needs yet again an other edit. (Jefferson tried that, make it more user friendly for the new nation.) Well since Moses was one of \"your\" guys I asked why he doesn't jab you the way he does Christians....kinda seems like a double standard doesn't it? She can own up to what she wants, ..you do. You plunder her book all the time. So be it. There is no double standard. I am much more familiar with the excitable Christian take on the scheme of the god business (Bible) than I am of the Jews. I have learned nothing new from the Christian posters but I have from the Jewish posters. I think they are more use to being \"rejected\" than you or the other Xians on here. They have their side of the story, and I happen to understand it better than yours. So, I appreciated their input. And I don't really expect her or the other Jews to get 'bent out of shape'. (Though I have notice their complaint about the way Christians use their bible.) I mean he is constantly saying people who believe in God are deluded, misled, liars, or simply crazy, so it stands to reason he would ask you the same types of questions doesn't it?? No, not true. Haven't said that about you, directly. I don't think your 'problem' is because you are a Christian. And I certainly do not believe everyone who believes in unseen being is 'crazy'. Humans believe all kinds of things that are not true... some of them are obnoxious about it. Others are not. Coming to grips with reality takes a while. Many of my closest friends believe in 'unseen' things and some are bible believing Christians. It couldn't possibly be a double standard could it??? I mean Joe is MUCH fairer than that isn't he??? Let's hope so! And here is something else to ask....when did I ever tell somebody they are hell bound Atheists?? Or Jews, Or Muslims, or Catholics or some denomination other than Methodist?? I don't know? When? To save you, and everybody else, a lot of research, NEVER!!! Oh, ok. You are \"absorbing\" unintended guilt, Bruce. I don't think your are mentioned in the post? You ask a generalized question and I gave a generalized answer. You want to defend yourself, go right ahead, but you are swinging at shadows. I never picked a fight with you Cat, but have responded to quite a few haven't I?? So who do you 'pick' fights with? So you aren't my enemy, and I am not yours, but by this question, I can see once again, this may be my one sided opinion. T quote: RT, I wonder why would Tawodi like to create animosity between you and me? Ixcatzin I think T was a bit excited, Ixcatzin, that maybe I like you (your) posts better? He either wants to be treated as well as he thinks I treat you or for me to treat you as badly as he thinks I treat him?? Anyway, historical, the Jews have not been a problem (since 70AD and the Masada madness, anyway.) But many Christians, on the other hand, have been a big problem!! So I have a somewhat sarcastic attitude to the Christian's self congratulatory attitude and the extolling of their hero 'messiah' when in fact it is problem, the number one cause of unjustified suffering on the planet.... even of the Jews. And some of them continue to \"terrorize\" many of us with the coming of their messianic hope and our eventual eradicate for the good of the Kingdom (but save the Jews, of course.) I wouldn't be a bit surprised in the nuttiness of that eschatologcal thinking that a great deal more grief can be brought about for the world in the future. It's crazy!", 
        "intTime": 20090423, 
        "postID": 55, 
        "quote": "Originally posted by tawodi: I have no interest in creating enmity, or discord, between you and/or anybody, Ixcatzin. The question was asked of Joe because he again mentioned the genocide practiced by Moses and his \"hoard\" as he usually does. The Moses story is brutal, is it not? Starting with him killing the cop. and running away. Why didn't god intervene then? ...and so on. I don't care which religion wants to claim it as a guide for moral standards, it's a mean spirited lesson in hate and ego mania (my secular view.) The Christian attempt to make it more user friendly still leaves the story there. (For the life of me, I can't see why Xians focus so much on what is attributed to Moses!??) I like the Bible stories, they are so human, etc. But I think it is silly to use the bible in its entirety for a rule for culture. It fails miserably. (Though it is obvious no one, not even the Jews, take it all seriously.) It needs yet again an other edit. (Jefferson tried that, make it more user friendly for the new nation.) Well since Moses was one of \"your\" guys I asked why he doesn't jab you the way he does Christians....kinda seems like a double standard doesn't it? She can own up to what she wants, ..you do. You plunder her book all the time. So be it. There is no double standard. I am much more familiar with the excitable Christian take on the scheme of the god business (Bible) than I am of the Jews. I have learned nothing new from the Christian posters but I have from the Jewish posters. I think they are more use to being \"rejected\" than you or the other Xians on here. They have their side of the story, and I happen to understand it better than yours. So, I appreciated their input. And I don't really expect her or the other Jews to get 'bent out of shape'. (Though I have notice their complaint about the way Christians use their bible.) I mean he is constantly saying people who believe in God are deluded, misled, liars, or simply crazy, so it stands to reason he would ask you the same types of questions doesn't it?? No, not true. Haven't said that about you, directly. I don't think your 'problem' is because you are a Christian. And I certainly do not believe everyone who believes in unseen being is 'crazy'. Humans believe all kinds of things that are not true... some of them are obnoxious about it. Others are not. Coming to grips with reality takes a while. Many of my closest friends believe in 'unseen' things and some are bible believing Christians. It couldn't possibly be a double standard could it??? I mean Joe is MUCH fairer than that isn't he??? Let's hope so! And here is something else to ask....when did I ever tell somebody they are hell bound Atheists?? Or Jews, Or Muslims, or Catholics or some denomination other than Methodist?? I don't know? When? To save you, and everybody else, a lot of research, NEVER!!! Oh, ok. You are \"absorbing\" unintended guilt, Bruce. I don't think your are mentioned in the post? You ask a generalized question and I gave a generalized answer. You want to defend yourself, go right ahead, but you are swinging at shadows. I never picked a fight with you Cat, but have responded to quite a few haven't I?? So who do you 'pick' fights with? So you aren't my enemy, and I am not yours, but by this question, I can see once again, this may be my one sided opinion. T", 
        "reply": " quote: RT, I wonder why would Tawodi like to create animosity between you and me? Ixcatzin I think T was a bit excited, Ixcatzin, that maybe I like you (your) posts better? He either wants to be treated as well as he thinks I treat you or for me to treat you as badly as he thinks I treat him?? Anyway, historical, the Jews have not been a problem (since 70AD and the Masada madness, anyway.) But many Christians, on the other hand, have been a big problem!! So I have a somewhat sarcastic attitude to the Christian's self congratulatory attitude and the extolling of their hero 'messiah' when in fact it is problem, the number one cause of unjustified suffering on the planet.... even of the Jews. And some of them continue to \"terrorize\" many of us with the coming of their messianic hope and our eventual eradicate for the good of the Kingdom (but save the Jews, of course.) I wouldn't be a bit surprised in the nuttiness of that eschatologcal thinking that a great deal more grief can be brought about for the world in the future. It's crazy!", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 11:32:00", 
        "title": "So happy to see THIS forum", 
        "userID": "reducetension"
    }, 
    {
        "content": "Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon -", 
        "intTime": 20090423, 
        "postID": 56, 
        "quote": "", 
        "reply": "Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 14:19:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon - OMG Legion, what are you smoking? Politics??? Tawodi wants to create division by inviting RT to treat me as badly as he thinks he is treated! I wonder how is that my name even came to be mentioned in this discusion!! Speaking of division, are Catholics and Protestants in the same page or are they still divided since the times where politics in the Vatican (no to mention corruption and other things like... Lucrecia Boriga) were the thing of the day? If you want to talk about politics and divisions, tell us more about the Catholic Church, that is a great example of that! Ixcatzin", 
        "intTime": 20090423, 
        "postID": 57, 
        "quote": "Originally posted by LegionSon: Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon -", 
        "reply": " OMG Legion, what are you smoking? Politics??? Tawodi wants to create division by inviting RT to treat me as badly as he thinks he is treated! I wonder how is that my name even came to be mentioned in this discusion!! Speaking of division, are Catholics and Protestants in the same page or are they still divided since the times where politics in the Vatican (no to mention corruption and other things like... Lucrecia Boriga) were the thing of the day? If you want to talk about politics and divisions, tell us more about the Catholic Church, that is a great example of that! Ixcatzin", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 14:58:00", 
        "title": "So happy to see THIS forum", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "quote: Originally posted by ixcatzin: quote: Originally posted by LegionSon: Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon - OMG Legion, what are you smoking? Politics??? Tawodi wants to create division by inviting RT to treat me as badly as he thinks he is treated! I wonder how is that my name even came to be mentioned in this discusion!! Speaking of division, are Catholics and Protestants in the same page or are they still divided since the times where politics in the Vatican (no to mention corruption and other things like... Lucrecia Boriga) were the thing of the day? If you want to talk about politics and divisions, tell us more about the Catholic Church, that is a great example of that! Ixcatzin Hehh, now calm down Ixcatzin...you know I admire you. It just seems obvious to me and Tawodi how some like to push your buttons. I thought you were aware of this and were just playing along for the desired effect. As Tawodi said he is not your enemy and I have not expressed any insult to you or your religion. You can't really say that of a few others. They do it in the manner of mentioning both our religions and have the desire to pit us against eachother. That's all. - peace - - and nice to see you again, i hope all is well with you and yours - Shalom - - LegionSon -", 
        "intTime": 20090423, 
        "postID": 58, 
        "quote": "Originally posted by ixcatzin: quote: Originally posted by LegionSon: Your right Tawodi. Rest assured we witness. The tactics have been clear for some time who wants to divide and conquer. I feel your frustration as you try to please all. But it appears they are using the same jab on this one, hehh, funny the cleverness of how they twisted it back toward you. It's politics. - in support - - LegionSon - OMG Legion, what are you smoking? Politics??? Tawodi wants to create division by inviting RT to treat me as badly as he thinks he is treated! I wonder how is that my name even came to be mentioned in this discusion!! Speaking of division, are Catholics and Protestants in the same page or are they still divided since the times where politics in the Vatican (no to mention corruption and other things like... Lucrecia Boriga) were the thing of the day? If you want to talk about politics and divisions, tell us more about the Catholic Church, that is a great example of that! Ixcatzin", 
        "reply": " Hehh, now calm down Ixcatzin...you know I admire you. It just seems obvious to me and Tawodi how some like to push your buttons. I thought you were aware of this and were just playing along for the desired effect. As Tawodi said he is not your enemy and I have not expressed any insult to you or your religion. You can't really say that of a few others. They do it in the manner of mentioning both our religions and have the desire to pit us against eachother. That's all. - peace - - and nice to see you again, i hope all is well with you and yours - Shalom - - LegionSon -", 
        "threadID": "1270031990001_7660051022001", 
        "time": "2009-04-23 15:11:00", 
        "title": "So happy to see THIS forum", 
        "userID": "LegionSon"
    }
]