[
    {
        "content": "A while ago, a friend who is a bit of a right wingnut, sent me a video from a group called \"Christian Nation\" or something like that. The video, regarding \"Muslim Terrorist Camps in America\" was picked up by Chris Hannity, who, as we know, isn't exactly centered in the political spectrum. So, a month later, Military.com sends me the email that I'm sure you all got, and it has a link to a similar video.... except that it doesn't link. So I go to Google Videos where I find that the Chris Hannity is one of the few places this video is available anymore, and Christian Nation, or whatever they called themselves, has pulled it. You all know I'm a pretty skeptical guy. This screwing around with videos, which for some dumb reason were only available from Uber-Christians makes me wonder what the heck is really going on. Are there actual terrorist training camps, or are there nervous Muslims simply training to protect themselves... sort of like the other survivalists on the other end of the religious spectrum across the country? Either way, it's a highly flammable situation.", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "A while ago, a friend who is a bit of a right wingnut, sent me a video from a group called \"Christian Nation\" or something like that. The video, regarding \"Muslim Terrorist Camps in America\" was picked up by Chris Hannity, who, as we know, isn't exactly centered in the political spectrum. So, a month later, Military.com sends me the email that I'm sure you all got, and it has a link to a similar video.... except that it doesn't link. So I go to Google Videos where I find that the Chris Hannity is one of the few places this video is available anymore, and Christian Nation, or whatever they called themselves, has pulled it. You all know I'm a pretty skeptical guy. This screwing around with videos, which for some dumb reason were only available from Uber-Christians makes me wonder what the heck is really going on. Are there actual terrorist training camps, or are there nervous Muslims simply training to protect themselves... sort of like the other survivalists on the other end of the religious spectrum across the country? Either way, it's a highly flammable situation.", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-10 12:08:00", 
        "title": "America's Jihadists", 
        "userID": "billbright"
    }, 
    {
        "content": "Who is Chris Hannity??", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "Who is Chris Hannity??", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-10 15:30:00", 
        "title": "America's Jihadists", 
        "userID": "tawodi"
    }, 
    {
        "content": "Oops. Sorry. Make that Sean Hannity. But, you probably knew that, didn't you?", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "Oops. Sorry. Make that Sean Hannity. But, you probably knew that, didn't you?", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-10 17:55:00", 
        "title": "America's Jihadists", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Oops. Sorry. Make that Sean Hannity. But, you probably knew that, didn't you? I think Bruce has better taste than to follow Hannity. I'll certainly give him the benefit of the doubt. But yeah, there are certainly extremist \"Christian\" groups in the USA and the world at large. They haven't done anything as large and as organized as Al Qaeda or the Taliban, but they exist, and we shouldn't ignore them. I don't know if \"Christian Nation\" is, itself, an extremist group, but I'm sure some of its members tip that end of the spectrum. It certainly warrants caution.", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by billbright: Oops. Sorry. Make that Sean Hannity. But, you probably knew that, didn't you?", 
        "reply": " I think Bruce has better taste than to follow Hannity. I'll certainly give him the benefit of the doubt. But yeah, there are certainly extremist \"Christian\" groups in the USA and the world at large. They haven't done anything as large and as organized as Al Qaeda or the Taliban, but they exist, and we shouldn't ignore them. I don't know if \"Christian Nation\" is, itself, an extremist group, but I'm sure some of its members tip that end of the spectrum. It certainly warrants caution.", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-11 06:51:00", 
        "title": "America's Jihadists", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Somewhwere else, just yesterday I believe I mentioned that the K.K.K. identifies itself with Christianity and other groups such as some of the summer camps that are VERY remeniscent of the Hitler youth, also do. All that said, it is a dis-service to lump me and others in the same category. Atheists scream loud and long if some body misplaces an \"A\" or some other letter of designation when referring to you, so I would humbly suggest you exhibit the same courtesy. You don't like to be classified as a group and niether do the christians. And please don't give me the old tired argument that nobody knows what a \"true\" Christian is. If that is so, then nobody knows what a true atheist is either, because you are constantly reminding us you're all different and unclassifiable. As for following Sean Hannity I do listen to him once in a great while, but don't like his sneering tone and expression while asking questions. It is demeaning to those of us with intelligence and, too remeniscent of watching Katie \"some would say\" Couric and other smarmy liberals do the same thing!! In our excuse for culture, this goes on far too much and lowers the level of discourse to a common street fight all too often....with the same progress being made by all parties!! T", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "", 
        "reply": "Somewhwere else, just yesterday I believe I mentioned that the K.K.K. identifies itself with Christianity and other groups such as some of the summer camps that are VERY remeniscent of the Hitler youth, also do. All that said, it is a dis-service to lump me and others in the same category. Atheists scream loud and long if some body misplaces an \"A\" or some other letter of designation when referring to you, so I would humbly suggest you exhibit the same courtesy. You don't like to be classified as a group and niether do the christians. And please don't give me the old tired argument that nobody knows what a \"true\" Christian is. If that is so, then nobody knows what a true atheist is either, because you are constantly reminding us you're all different and unclassifiable. As for following Sean Hannity I do listen to him once in a great while, but don't like his sneering tone and expression while asking questions. It is demeaning to those of us with intelligence and, too remeniscent of watching Katie \"some would say\" Couric and other smarmy liberals do the same thing!! In our excuse for culture, this goes on far too much and lowers the level of discourse to a common street fight all too often....with the same progress being made by all parties!! T", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-11 07:05:00", 
        "title": "America's Jihadists", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Somewhwere else, just yesterday I believe I mentioned that the K.K.K. identifies itself with Christianity...All that said, it is a dis-service to lump me and others in the same category. Bruce, I hope you don't think that's what I was saying. I did post a supposition that all KKK members would identify themselves as Christian, but that's a far cry from saying all Christians are KKK. All cars are vehicles, but not all vehicles are cars. Steve", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by tawodi: Somewhwere else, just yesterday I believe I mentioned that the K.K.K. identifies itself with Christianity...All that said, it is a dis-service to lump me and others in the same category.", 
        "reply": " Bruce, I hope you don't think that's what I was saying. I did post a supposition that all KKK members would identify themselves as Christian, but that's a far cry from saying all Christians are KKK. All cars are vehicles, but not all vehicles are cars. Steve", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-11 07:12:00", 
        "title": "America's Jihadists", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "No Steve I didn't mean you in your post but it is \"intimated\" time and again that we, as believers in anything, are \"enabelers\". And, sometimes boldly stated so. It IS tiresome and also unfair, for the reasons I stated. Glass houses and all that!! T", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "", 
        "reply": "No Steve I didn't mean you in your post but it is \"intimated\" time and again that we, as believers in anything, are \"enabelers\". And, sometimes boldly stated so. It IS tiresome and also unfair, for the reasons I stated. Glass houses and all that!! T", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-11 07:39:00", 
        "title": "America's Jihadists", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: No Steve I didn't mean you in your post but it is \"intimated\" time and again that we, as believers in anything, are \"enabelers\". And, sometimes boldly stated so. It IS tiresome and also unfair, for the reasons I stated. Glass houses and all that!! T At the risk of exciting you further, I'll say that it was I (me) who said so, and still do. When you see atheists starting to strap on bombs simply because they're atheists, I'll join you in your condemnation. Until then, show me.... I also feel like an enabler. Anyone who advocates something strongly is one of these people. Even people who don't openly advocate something but don't hide their affinity to it are enablers. I worry when I hear someone entered a church and started blasting away; I wonder until I hear otherwise if they were atheist. I wonder when churches in Alabama are burned. I'll continue to worry and wonder if people who don't believe are finally getting so fed up with those that do that they behave violently. Moderates do enable the fanatic in their midst. There's no question. The thing with the atheist enabler is that they aren't afraid to call out those in their ranks who become fanatic enough to hurt anyone. We're not afraid to police our own. Not many religious people can say that. People are all too willing to point out the atheistic tendencies of people who become a detriment to society. Hitler (though we now know it wasn't so); Mao; Pol Pot (who started out Catholic). But, no one can say that these people did what they did because they were atheist; they did it because of a political philosophy.... their rejection of religion was part of a means to an end and not a philosophy for life (which, by the way, atheism isn't. It's simply a rejection that anything supernatural exists). Yet you say it over and over, usually when you've take a bit of a hit in your rhetoric in some other thread, that atheists shouldn't throw stones... glass houses, and all that. But, this time, just like all other times, it's a non-starter.", 
        "intTime": 20090313, 
        "postID": 8, 
        "quote": "Originally posted by tawodi: No Steve I didn't mean you in your post but it is \"intimated\" time and again that we, as believers in anything, are \"enabelers\". And, sometimes boldly stated so. It IS tiresome and also unfair, for the reasons I stated. Glass houses and all that!! T", 
        "reply": " At the risk of exciting you further, I'll say that it was I (me) who said so, and still do. When you see atheists starting to strap on bombs simply because they're atheists, I'll join you in your condemnation. Until then, show me.... I also feel like an enabler. Anyone who advocates something strongly is one of these people. Even people who don't openly advocate something but don't hide their affinity to it are enablers. I worry when I hear someone entered a church and started blasting away; I wonder until I hear otherwise if they were atheist. I wonder when churches in Alabama are burned. I'll continue to worry and wonder if people who don't believe are finally getting so fed up with those that do that they behave violently. Moderates do enable the fanatic in their midst. There's no question. The thing with the atheist enabler is that they aren't afraid to call out those in their ranks who become fanatic enough to hurt anyone. We're not afraid to police our own. Not many religious people can say that. People are all too willing to point out the atheistic tendencies of people who become a detriment to society. Hitler (though we now know it wasn't so); Mao; Pol Pot (who started out Catholic). But, no one can say that these people did what they did because they were atheist; they did it because of a political philosophy.... their rejection of religion was part of a means to an end and not a philosophy for life (which, by the way, atheism isn't. It's simply a rejection that anything supernatural exists). Yet you say it over and over, usually when you've take a bit of a hit in your rhetoric in some other thread, that atheists shouldn't throw stones... glass houses, and all that. But, this time, just like all other times, it's a non-starter.", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-13 15:31:00", 
        "title": "America's Jihadists", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: There's no question. The thing with the atheist enabler is that they aren't afraid to call out those in their ranks who become fanatic enough to hurt anyone. We're not afraid to police our own. Not many religious people can say that. Bill Bright; Yeah Bill, I do agree with your post Do you recall the term Phelp's Whelps??? And perhaps other, less than choice descriptors that many religious people have used here, of certain groups that go over the line?? Now I grant, that we all see many times, less than charitable people post some things, but by and large I have been pretty impressed with the Self policing I see here and also in the world of late. Today though I saw the coverage on T.V. of the travelling hate show, brought to you by that self same group and the silent demonstration against them by hundreds of people, MOST from churches in the area that stood up to them here in Mass. And yes I, like you, wait sometimes for the description of the various perpetrators of some of the atrocities we see on the death tube. It does pain when the background of some comes to the fore. T", 
        "intTime": 20090313, 
        "postID": 9, 
        "quote": "There's no question. The thing with the atheist enabler is that they aren't afraid to call out those in their ranks who become fanatic enough to hurt anyone. We're not afraid to police our own. Not many religious people can say that.", 
        "reply": " Bill Bright; Yeah Bill, I do agree with your post Do you recall the term Phelp's Whelps??? And perhaps other, less than choice descriptors that many religious people have used here, of certain groups that go over the line?? Now I grant, that we all see many times, less than charitable people post some things, but by and large I have been pretty impressed with the Self policing I see here and also in the world of late. Today though I saw the coverage on T.V. of the travelling hate show, brought to you by that self same group and the silent demonstration against them by hundreds of people, MOST from churches in the area that stood up to them here in Mass. And yes I, like you, wait sometimes for the description of the various perpetrators of some of the atrocities we see on the death tube. It does pain when the background of some comes to the fore. T", 
        "threadID": "1270031990001_7560054712001", 
        "time": "2009-03-13 20:19:00", 
        "title": "America's Jihadists", 
        "userID": "tawodi"
    }
]