[
    {
        "content": "\"http://www.boston.com/news/nation/articles/2009/04/28/more_in_us_switch_religious_affiliations/\" quote: Catholics who leave their faith say they drifted away from the church because it did not meet their spiritual needs or they stopped believing in its teachings, according to a new study, while Protestants often tend to cite circumstantial factors, a move, a marriage, or a problem with a particular minister or congregation. Altogether, Americans are switching in and out of churches at unprecedented rates, with about half of Americans today saying that they have changed their religious affiliation at some point during their lives, according to a study released yesterday by the Pew Forum on Religion & Public Life... Among the most striking findings is that most people who change religious affiliation leave the denomination in which they were raised by age 24, and many change religious affiliation more than once. The study also explores the growing ranks of the unaffiliated, about 16 percent of American adults, according to Pew. The study finds many of the unaffiliated cite objections to religious people or religious institutions as the reason for leaving organized religion, rather than a conclusion that God does not exist. About one third of the unaffiliated say they are open to finding the right religion... Only 2 percent of former Catholics who are now unaffiliated volunteered the abuse scandal as the main reason they are no longer Catholic. Former Catholics who are now unaffiliated often said they left because of disagreements with the Catholic Church over homosexuality, abortion, birth control, or gender... Susan Spilecki, a 41-year-old English teacher from Brighton who was a lifelong and active Catholic until entering the Episcopal church last year, said she \"found plenty of company when I left. In the Episcopal churches where she now worships, I've met more disenfranchised Catholics and Unitarians who discovered Jesus than cradle Episcopalians.\"... \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone.", 
        "intTime": 20090428, 
        "postID": 1, 
        "quote": "Catholics who leave their faith say they drifted away from the church because it did not meet their spiritual needs or they stopped believing in its teachings, according to a new study, while Protestants often tend to cite circumstantial factors, a move, a marriage, or a problem with a particular minister or congregation. Altogether, Americans are switching in and out of churches at unprecedented rates, with about half of Americans today saying that they have changed their religious affiliation at some point during their lives, according to a study released yesterday by the Pew Forum on Religion & Public Life... Among the most striking findings is that most people who change religious affiliation leave the denomination in which they were raised by age 24, and many change religious affiliation more than once. The study also explores the growing ranks of the unaffiliated, about 16 percent of American adults, according to Pew. The study finds many of the unaffiliated cite objections to religious people or religious institutions as the reason for leaving organized religion, rather than a conclusion that God does not exist. About one third of the unaffiliated say they are open to finding the right religion... Only 2 percent of former Catholics who are now unaffiliated volunteered the abuse scandal as the main reason they are no longer Catholic. Former Catholics who are now unaffiliated often said they left because of disagreements with the Catholic Church over homosexuality, abortion, birth control, or gender... Susan Spilecki, a 41-year-old English teacher from Brighton who was a lifelong and active Catholic until entering the Episcopal church last year, said she \"found plenty of company when I left. In the Episcopal churches where she now worships, I've met more disenfranchised Catholics and Unitarians who discovered Jesus than cradle Episcopalians.\"... \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\"", 
        "reply": "\"http://www.boston.com/news/nation/articles/2009/04/28/more_in_us_switch_religious_affiliations/\"  As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 07:04:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. I agree - I think this is a good thing. I think it's good that people are making decisions for themselves about what they believe, why they believe it, and which leaders they are willing to follow. The days when children automatically grew up to follow their parents' religious footsteps - just as their parents had followed their grandparents - are over. People are aware of different philosophies. People are aware of the misbehavior of the leaders of various churches and religions, and have chosen to explore their spirituality and their understanding of the Divine without the blind adherence to the dogma and decrees of any given church. Whether a person grows up to follow their parents' religion by their own choice, or switches to a similar denomination, or decides to follow a completely different path; whether that person joins a megachurch or simply decides to pray on their own... I think it's always a wonderful thing when people follow their conscience when it comes to religion, as opposed to blindly following the dogma they've been fed since birth.", 
        "intTime": 20090428, 
        "postID": 2, 
        "quote": "Originally posted by Fightdirector: As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone.", 
        "reply": " I agree - I think this is a good thing. I think it's good that people are making decisions for themselves about what they believe, why they believe it, and which leaders they are willing to follow. The days when children automatically grew up to follow their parents' religious footsteps - just as their parents had followed their grandparents - are over. People are aware of different philosophies. People are aware of the misbehavior of the leaders of various churches and religions, and have chosen to explore their spirituality and their understanding of the Divine without the blind adherence to the dogma and decrees of any given church. Whether a person grows up to follow their parents' religion by their own choice, or switches to a similar denomination, or decides to follow a completely different path; whether that person joins a megachurch or simply decides to pray on their own... I think it's always a wonderful thing when people follow their conscience when it comes to religion, as opposed to blindly following the dogma they've been fed since birth.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 08:28:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "No one was 'affiliated' with a Church until after the 4th Century when it became more or less compulsory and remained that way for along time, the effects of which we find in academic survey's today, that's true with the Pew group, too. Church hopping is common in the US, sort of part of 'pursuit of happiness' thing and our great tradition of shopping (Pew calls is 'consumer religion', the true 'free market' example.) What Pew really doesn't tell you (but they know it) is that many of those who leave (or are kicked out) of the vast array of Protestant expressions (non-Catholics) often go out and start their own thing - thus the huge variety of \"cult\" or sects there are in this country... not to mention the wild eyed groups like Koresh's Branch Dravidian and Children of God or even the older Hutterites, etc. Anyway, that is also why you'll never see a Christian consensus on belief or ideas about politics, etc. The Catholics (the oldest continuous bureaucracy in the World) generally would eventually make room for its 'fanatics', thus all the \"orders\", etc. The Protestants (who's main aim was to break free) kick their 'fanatics' out and they run off and start a new improved brand. Church growth. I read the latest Pew report this morning as was surprised by how they divided up and explained the growth of 'unbelievers'. Anyway, the chase goes on! This message has been edited. Last edited by: reducetension, Tue 28 April 2009 02:12 PM", 
        "intTime": 20090428, 
        "postID": 3, 
        "quote": "", 
        "reply": "No one was 'affiliated' with a Church until after the 4th Century when it became more or less compulsory and remained that way for along time, the effects of which we find in academic survey's today, that's true with the Pew group, too. Church hopping is common in the US, sort of part of 'pursuit of happiness' thing and our great tradition of shopping (Pew calls is 'consumer religion', the true 'free market' example.) What Pew really doesn't tell you (but they know it) is that many of those who leave (or are kicked out) of the vast array of Protestant expressions (non-Catholics) often go out and start their own thing - thus the huge variety of \"cult\" or sects there are in this country... not to mention the wild eyed groups like Koresh's Branch Dravidian and Children of God or even the older Hutterites, etc. Anyway, that is also why you'll never see a Christian consensus on belief or ideas about politics, etc. The Catholics (the oldest continuous bureaucracy in the World) generally would eventually make room for its 'fanatics', thus all the \"orders\", etc. The Protestants (who's main aim was to break free) kick their 'fanatics' out and they run off and start a new improved brand. Church growth. I read the latest Pew report this morning as was surprised by how they divided up and explained the growth of 'unbelievers'. Anyway, the chase goes on! This message has been edited. Last edited by: reducetension, Tue 28 April 2009 02:12 PM", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 11:46:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. [/QUOTE] I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.", 
        "intTime": 20090428, 
        "postID": 4, 
        "quote": "Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\"", 
        "reply": " As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. [/QUOTE] I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 12:01:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.[/QUOTE] I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.", 
        "intTime": 20090428, 
        "postID": 5, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone.", 
        "reply": " I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.[/QUOTE] I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 15:42:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations. I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.[/QUOTE] When I became a literalist I had to quit going to church because we didn't have a Honda. The Bible says you should all be in one Accord. Consequently that lead to my unbelief and relief.", 
        "intTime": 20090428, 
        "postID": 6, 
        "quote": "Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.", 
        "reply": " I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.[/QUOTE] When I became a literalist I had to quit going to church because we didn't have a Honda. The Bible says you should all be in one Accord. Consequently that lead to my unbelief and relief.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 16:21:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "reducetension"
    }, 
    {
        "content": "Ron; I understand the changing of many to less structured and a free-er way of approaching God and worship. Check out the Hebrew word for worship when translated into Aramaic,then Greek, then Latin, then pre Elizabethan english or court French. If the t i t les are moved, it becomes the word love. As the word love does with the word fear!! Change the Jots and the word fear becomes love!?? Go figger!! But like you, I feel we must be very careful indeed about changing the strictures of behavior passed down in the commandments. All the rest of man's stuff you can take or leave for my money!!", 
        "intTime": 20090428, 
        "postID": 7, 
        "quote": "", 
        "reply": "Ron; I understand the changing of many to less structured and a free-er way of approaching God and worship. Check out the Hebrew word for worship when translated into Aramaic,then Greek, then Latin, then pre Elizabethan english or court French. If the t i t les are moved, it becomes the word love. As the word love does with the word fear!! Change the Jots and the word fear becomes love!?? Go figger!! But like you, I feel we must be very careful indeed about changing the strictures of behavior passed down in the commandments. All the rest of man's stuff you can take or leave for my money!!", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 19:29:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin?", 
        "intTime": 20090428, 
        "postID": 8, 
        "quote": "Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.", 
        "reply": " Hey Bill, how ya doin?", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 21:04:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin? Ron! Ya ol' sea dog. Doin' fine. Went fishing today... not catching, but fishing. And, how are you?", 
        "intTime": 20090429, 
        "postID": 9, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin?", 
        "reply": " Ron! Ya ol' sea dog. Doin' fine. Went fishing today... not catching, but fishing. And, how are you?", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 16:24:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in.", 
        "intTime": 20090429, 
        "postID": 10, 
        "quote": "If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists?", 
        "reply": "It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham:  One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 17:28:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems?", 
        "intTime": 20090429, 
        "postID": 11, 
        "quote": "Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in.", 
        "reply": " What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems?", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 17:40:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "AKinNC"
    }, 
    {
        "content": "quote: Originally posted by AKinNC: quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems? Things like this, even when said as a joke, remind me why I like being a Unitarian.", 
        "intTime": 20090429, 
        "postID": 12, 
        "quote": "Originally posted by AKinNC: quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems?", 
        "reply": " Things like this, even when said as a joke, remind me why I like being a Unitarian.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 18:38:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by AKinNC: quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems? Things like this, even when said as a joke, remind me why I like being a Unitarian. Things like this remind me of the need for all Christians and others to practice humility when trying to understand eachother with all of our flaws and limitations. Living The Mission to love all our brothers and sisters begins at home. Only then can we walk outwardly with the humility we have learned from within. And that is how we continue to serve. - in humble service - - LegionSon", 
        "intTime": 20090429, 
        "postID": 13, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by AKinNC: quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems? Things like this, even when said as a joke, remind me why I like being a Unitarian.", 
        "reply": " Things like this remind me of the need for all Christians and others to practice humility when trying to understand eachother with all of our flaws and limitations. Living The Mission to love all our brothers and sisters begins at home. Only then can we walk outwardly with the humility we have learned from within. And that is how we continue to serve. - in humble service - - LegionSon", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 19:18:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "We have noticed more and more people attending onlins disscussions we have. Most are in the process of leaving xtian churches but still wanting to learn what was being taught in the first books of the Bible, We do not try to bring people into our disscussions but more and more come in. We are taught by Rabi's but we are not taught the Jewish fath sence we are not jewish and even tho we could we do not wish to convert. D.J.", 
        "intTime": 20090429, 
        "postID": 14, 
        "quote": "", 
        "reply": "We have noticed more and more people attending onlins disscussions we have. Most are in the process of leaving xtian churches but still wanting to learn what was being taught in the first books of the Bible, We do not try to bring people into our disscussions but more and more come in. We are taught by Rabi's but we are not taught the Jewish fath sence we are not jewish and even tho we could we do not wish to convert. D.J.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 20:30:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin? Ron! Ya ol' sea dog. Doin' fine. Went fishing today... not catching, but fishing. And, how are you? Hanging in there my friend. Had to retire last December after 40 years on the job, eliminated my position. Oh well...... Not much of a fisherman myself but have been riding my ATV quite a bit. Guess I'll catch up on all those projects I've been meaning to get to for the last 40 yrs.", 
        "intTime": 20090429, 
        "postID": 15, 
        "quote": "Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin? Ron! Ya ol' sea dog. Doin' fine. Went fishing today... not catching, but fishing. And, how are you?", 
        "reply": " Hanging in there my friend. Had to retire last December after 40 years on the job, eliminated my position. Oh well...... Not much of a fisherman myself but have been riding my ATV quite a bit. Guess I'll catch up on all those projects I've been meaning to get to for the last 40 yrs.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 20:44:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News.", 
        "intTime": 20090429, 
        "postID": 16, 
        "quote": "Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in.", 
        "reply": " Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 20:48:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "I just returned from a 4 day camp out here in oklahoma went to Skiatook Lake and the whole 4 days was a wast as far as fishing go's too much East wind. We didnt catch a dang thing here eather. Now they are opening the gates on the dams to reliese water comming from North so the fishing wont be very good for a long while. D.J.", 
        "intTime": 20090429, 
        "postID": 17, 
        "quote": "", 
        "reply": "I just returned from a 4 day camp out here in oklahoma went to Skiatook Lake and the whole 4 days was a wast as far as fishing go's too much East wind. We didnt catch a dang thing here eather. Now they are opening the gates on the dams to reliese water comming from North so the fishing wont be very good for a long while. D.J.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 20:51:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc?", 
        "intTime": 20090430, 
        "postID": 18, 
        "quote": "Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News.", 
        "reply": " Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc?", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 12:25:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations.", 
        "intTime": 20090430, 
        "postID": 19, 
        "quote": "Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc?", 
        "reply": " Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 13:17:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations. No, fantasy-boy, he's not a believer now. He's worm dirt. Nor was he a theologian; just a very humorous guy who liked to take aim at the pretentious, sublime and ridiculous religious apprehensions of his time. Have you ever actually seen any believable descriptions of heaven? Play a harp much, yourself? Could you imagine spending an eternity doing it? And, who are you when you get to heaven? Are you the hamburger you were after the accident? Are you the senile drooler you were when you died in the home? Heaven sounds like a place of questionable provenance, to me. How would you actually fare at the right hand of God, the character in the bible who likes to kill babies even more than the crack *****; who likes to play with people's lives, ala Job; who kicked out his best angel and made him in charge of a burning nether-world? Doesn't sound like such a great assignment to me, sitting there not knowing when the Jealous One is going to turn on you. No thanks... I'm happy it'll be all over when I'm gone. TYVM.", 
        "intTime": 20090430, 
        "postID": 20, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations.", 
        "reply": " No, fantasy-boy, he's not a believer now. He's worm dirt. Nor was he a theologian; just a very humorous guy who liked to take aim at the pretentious, sublime and ridiculous religious apprehensions of his time. Have you ever actually seen any believable descriptions of heaven? Play a harp much, yourself? Could you imagine spending an eternity doing it? And, who are you when you get to heaven? Are you the hamburger you were after the accident? Are you the senile drooler you were when you died in the home? Heaven sounds like a place of questionable provenance, to me. How would you actually fare at the right hand of God, the character in the bible who likes to kill babies even more than the crack *****; who likes to play with people's lives, ala Job; who kicked out his best angel and made him in charge of a burning nether-world? Doesn't sound like such a great assignment to me, sitting there not knowing when the Jealous One is going to turn on you. No thanks... I'm happy it'll be all over when I'm gone. TYVM.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 13:47:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations. No, fantasy-boy, he's not a believer now. He's worm dirt. (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) Nor was he a theologian; ( it's call Humor of the Absurd Bill) just a very humorous guy who liked to take aim at the pretentious, sublime and ridiculous religious apprehensions of his time. (Much like you but with the humor? ) Have you ever actually seen any believable descriptions of heaven? Play a harp much, yourself? Could you imagine spending an eternity doing it? And, who are you when you get to heaven? Are you the hamburger you were after the accident? Are you the senile drooler you were when you died in the home? Heaven sounds like a place of questionable provenance, to me. How would you actually fare at the right hand of God, the character in the bible who likes to kill babies even more than the crack *****; who likes to play with people's lives, ala Job; who kicked out his best angel and made him in charge of a burning nether-world? Doesn't sound like such a great assignment to me, sitting there not knowing when the Jealous One is going to turn on you. No thanks... I'm happy it'll be all over when I'm gone. TYVM. Take a pill Bill and come back when you aren't so strident. This message has been edited. Last edited by: Raunchy, Thu 30 April 2009 03:20 PM", 
        "intTime": 20090430, 
        "postID": 21, 
        "quote": "Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations. No, fantasy-boy, he's not a believer now. He's worm dirt. (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) Nor was he a theologian; ( it's call Humor of the Absurd Bill) just a very humorous guy who liked to take aim at the pretentious, sublime and ridiculous religious apprehensions of his time. (Much like you but with the humor? ) Have you ever actually seen any believable descriptions of heaven? Play a harp much, yourself? Could you imagine spending an eternity doing it? And, who are you when you get to heaven? Are you the hamburger you were after the accident? Are you the senile drooler you were when you died in the home? Heaven sounds like a place of questionable provenance, to me. How would you actually fare at the right hand of God, the character in the bible who likes to kill babies even more than the crack *****; who likes to play with people's lives, ala Job; who kicked out his best angel and made him in charge of a burning nether-world? Doesn't sound like such a great assignment to me, sitting there not knowing when the Jealous One is going to turn on you. No thanks... I'm happy it'll be all over when I'm gone. TYVM.", 
        "reply": " Take a pill Bill and come back when you aren't so strident. This message has been edited. Last edited by: Raunchy, Thu 30 April 2009 03:20 PM", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 14:04:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive.", 
        "intTime": 20090430, 
        "postID": 22, 
        "quote": "(you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.)", 
        "reply": " I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 19:57:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive. Seems between the two of us I'm the only one able to enjoy our give and take. Sorry about the burr under your saddle.", 
        "intTime": 20090430, 
        "postID": 23, 
        "quote": "Originally posted by billbright: quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive.", 
        "reply": " Seems between the two of us I'm the only one able to enjoy our give and take. Sorry about the burr under your saddle.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 20:37:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by billbright: quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive. Seems between the two of us I'm the only one able to enjoy our give and take. Sorry about the burr under your saddle. Living and giving you hell is sometimes all that remains of oneself so diminished of good. So we pray for a glimmer of hope to produce more light. - LegionSon -", 
        "intTime": 20090430, 
        "postID": 24, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by billbright: quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive. Seems between the two of us I'm the only one able to enjoy our give and take. Sorry about the burr under your saddle.", 
        "reply": " Living and giving you hell is sometimes all that remains of oneself so diminished of good. So we pray for a glimmer of hope to produce more light. - LegionSon -", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 20:59:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day.", 
        "intTime": 20090430, 
        "postID": 25, 
        "quote": "", 
        "reply": "Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 21:00:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon -", 
        "intTime": 20090430, 
        "postID": 26, 
        "quote": "Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day.", 
        "reply": " Heh...Voila!!! - the power of prayer - - LegionSon -", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 21:08:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon - Speaking of the power of prayer.... ages ago I mentioned that when the Xians dutifully prayed for me as their founder ordered, that I needed a newer truck. Well, here we are, many months down the road and I am still driving my old beat up 1985 Nissan King Cab... what the hell gives with this 'power of prayer'? Aren't you Xians obeying your Master or is it just a hoax? (But, you know, in 1985 I never thought I'd own one!) Come on now, down on the knees and speaking in tongues, get the guy in the sky to give me a better, newer pickup! I'm not even fussy about the color... though I am anticipating an other Nissan. Rrrrrrrrrmen!", 
        "intTime": 20090430, 
        "postID": 27, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon -", 
        "reply": " Speaking of the power of prayer.... ages ago I mentioned that when the Xians dutifully prayed for me as their founder ordered, that I needed a newer truck. Well, here we are, many months down the road and I am still driving my old beat up 1985 Nissan King Cab... what the hell gives with this 'power of prayer'? Aren't you Xians obeying your Master or is it just a hoax? (But, you know, in 1985 I never thought I'd own one!) Come on now, down on the knees and speaking in tongues, get the guy in the sky to give me a better, newer pickup! I'm not even fussy about the color... though I am anticipating an other Nissan. Rrrrrrrrrmen!", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 21:37:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by LegionSon: quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon - Speaking of the power of prayer.... ages ago I mentioned that when the Xians dutifully prayed for me as their founder ordered, that I needed a newer truck. Well, here we are, many months down the road and I am still driving my old beat up 1985 Nissan King Cab... what the hell gives with this 'power of prayer'? Aren't you Xians obeying your Master or is it just a hoax? (But, you know, in 1985 I never thought I'd own one!) Come on now, down on the knees and speaking in tongues, get the guy in the sky to give me a better, newer pickup! I'm not even fussy about the color... though I am anticipating an other Nissan. Rrrrrrrrrmen! I seem to remember all4truth was going to get it for you heheh, thats why we stopped praying for it...but it is really you who should pray for it. we already got ours...hehh. - LegionSon -", 
        "intTime": 20090430, 
        "postID": 28, 
        "quote": "Originally posted by reducetension: quote: Originally posted by LegionSon: quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon - Speaking of the power of prayer.... ages ago I mentioned that when the Xians dutifully prayed for me as their founder ordered, that I needed a newer truck. Well, here we are, many months down the road and I am still driving my old beat up 1985 Nissan King Cab... what the hell gives with this 'power of prayer'? Aren't you Xians obeying your Master or is it just a hoax? (But, you know, in 1985 I never thought I'd own one!) Come on now, down on the knees and speaking in tongues, get the guy in the sky to give me a better, newer pickup! I'm not even fussy about the color... though I am anticipating an other Nissan. Rrrrrrrrrmen!", 
        "reply": " I seem to remember all4truth was going to get it for you heheh, thats why we stopped praying for it...but it is really you who should pray for it. we already got ours...hehh. - LegionSon -", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 22:22:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "Joe; RE; your truck........ God helps those, who help themselves........ Of course, God help you if you get CAUGHT...... helping your self!!!!!", 
        "intTime": 20090501, 
        "postID": 29, 
        "quote": "", 
        "reply": "Joe; RE; your truck........ God helps those, who help themselves........ Of course, God help you if you get CAUGHT...... helping your self!!!!!", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-05-01 06:31:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: Heh...Voila!!! - the power of prayer - - LegionSon - Go rub the wax off your cucumber.", 
        "intTime": 20090501, 
        "postID": 30, 
        "quote": "Originally posted by LegionSon: Heh...Voila!!! - the power of prayer - - LegionSon -", 
        "reply": " Go rub the wax off your cucumber.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-05-01 08:05:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "\"http://www.boston.com/news/nation/articles/2009/04/28/more_in_us_switch_religious_affiliations/\" quote: Catholics who leave their faith say they drifted away from the church because it did not meet their spiritual needs or they stopped believing in its teachings, according to a new study, while Protestants often tend to cite circumstantial factors, a move, a marriage, or a problem with a particular minister or congregation. Altogether, Americans are switching in and out of churches at unprecedented rates, with about half of Americans today saying that they have changed their religious affiliation at some point during their lives, according to a study released yesterday by the Pew Forum on Religion & Public Life... Among the most striking findings is that most people who change religious affiliation leave the denomination in which they were raised by age 24, and many change religious affiliation more than once. The study also explores the growing ranks of the unaffiliated, about 16 percent of American adults, according to Pew. The study finds many of the unaffiliated cite objections to religious people or religious institutions as the reason for leaving organized religion, rather than a conclusion that God does not exist. About one third of the unaffiliated say they are open to finding the right religion... Only 2 percent of former Catholics who are now unaffiliated volunteered the abuse scandal as the main reason they are no longer Catholic. Former Catholics who are now unaffiliated often said they left because of disagreements with the Catholic Church over homosexuality, abortion, birth control, or gender... Susan Spilecki, a 41-year-old English teacher from Brighton who was a lifelong and active Catholic until entering the Episcopal church last year, said she \"found plenty of company when I left. In the Episcopal churches where she now worships, I've met more disenfranchised Catholics and Unitarians who discovered Jesus than cradle Episcopalians.\"... \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone.", 
        "intTime": 20090428, 
        "postID": 31, 
        "quote": "Catholics who leave their faith say they drifted away from the church because it did not meet their spiritual needs or they stopped believing in its teachings, according to a new study, while Protestants often tend to cite circumstantial factors, a move, a marriage, or a problem with a particular minister or congregation. Altogether, Americans are switching in and out of churches at unprecedented rates, with about half of Americans today saying that they have changed their religious affiliation at some point during their lives, according to a study released yesterday by the Pew Forum on Religion & Public Life... Among the most striking findings is that most people who change religious affiliation leave the denomination in which they were raised by age 24, and many change religious affiliation more than once. The study also explores the growing ranks of the unaffiliated, about 16 percent of American adults, according to Pew. The study finds many of the unaffiliated cite objections to religious people or religious institutions as the reason for leaving organized religion, rather than a conclusion that God does not exist. About one third of the unaffiliated say they are open to finding the right religion... Only 2 percent of former Catholics who are now unaffiliated volunteered the abuse scandal as the main reason they are no longer Catholic. Former Catholics who are now unaffiliated often said they left because of disagreements with the Catholic Church over homosexuality, abortion, birth control, or gender... Susan Spilecki, a 41-year-old English teacher from Brighton who was a lifelong and active Catholic until entering the Episcopal church last year, said she \"found plenty of company when I left. In the Episcopal churches where she now worships, I've met more disenfranchised Catholics and Unitarians who discovered Jesus than cradle Episcopalians.\"... \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\"", 
        "reply": "\"http://www.boston.com/news/nation/articles/2009/04/28/more_in_us_switch_religious_affiliations/\"  As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 07:04:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. I agree - I think this is a good thing. I think it's good that people are making decisions for themselves about what they believe, why they believe it, and which leaders they are willing to follow. The days when children automatically grew up to follow their parents' religious footsteps - just as their parents had followed their grandparents - are over. People are aware of different philosophies. People are aware of the misbehavior of the leaders of various churches and religions, and have chosen to explore their spirituality and their understanding of the Divine without the blind adherence to the dogma and decrees of any given church. Whether a person grows up to follow their parents' religion by their own choice, or switches to a similar denomination, or decides to follow a completely different path; whether that person joins a megachurch or simply decides to pray on their own... I think it's always a wonderful thing when people follow their conscience when it comes to religion, as opposed to blindly following the dogma they've been fed since birth.", 
        "intTime": 20090428, 
        "postID": 32, 
        "quote": "Originally posted by Fightdirector: As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone.", 
        "reply": " I agree - I think this is a good thing. I think it's good that people are making decisions for themselves about what they believe, why they believe it, and which leaders they are willing to follow. The days when children automatically grew up to follow their parents' religious footsteps - just as their parents had followed their grandparents - are over. People are aware of different philosophies. People are aware of the misbehavior of the leaders of various churches and religions, and have chosen to explore their spirituality and their understanding of the Divine without the blind adherence to the dogma and decrees of any given church. Whether a person grows up to follow their parents' religion by their own choice, or switches to a similar denomination, or decides to follow a completely different path; whether that person joins a megachurch or simply decides to pray on their own... I think it's always a wonderful thing when people follow their conscience when it comes to religion, as opposed to blindly following the dogma they've been fed since birth.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 08:28:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "No one was 'affiliated' with a Church until after the 4th Century when it became more or less compulsory and remained that way for along time, the effects of which we find in academic survey's today, that's true with the Pew group, too. Church hopping is common in the US, sort of part of 'pursuit of happiness' thing and our great tradition of shopping (Pew calls is 'consumer religion', the true 'free market' example.) What Pew really doesn't tell you (but they know it) is that many of those who leave (or are kicked out) of the vast array of Protestant expressions (non-Catholics) often go out and start their own thing - thus the huge variety of \"cult\" or sects there are in this country... not to mention the wild eyed groups like Koresh's Branch Dravidian and Children of God or even the older Hutterites, etc. Anyway, that is also why you'll never see a Christian consensus on belief or ideas about politics, etc. The Catholics (the oldest continuous bureaucracy in the World) generally would eventually make room for its 'fanatics', thus all the \"orders\", etc. The Protestants (who's main aim was to break free) kick their 'fanatics' out and they run off and start a new improved brand. Church growth. I read the latest Pew report this morning as was surprised by how they divided up and explained the growth of 'unbelievers'. Anyway, the chase goes on! This message has been edited. Last edited by: reducetension, Tue 28 April 2009 02:12 PM", 
        "intTime": 20090428, 
        "postID": 33, 
        "quote": "", 
        "reply": "No one was 'affiliated' with a Church until after the 4th Century when it became more or less compulsory and remained that way for along time, the effects of which we find in academic survey's today, that's true with the Pew group, too. Church hopping is common in the US, sort of part of 'pursuit of happiness' thing and our great tradition of shopping (Pew calls is 'consumer religion', the true 'free market' example.) What Pew really doesn't tell you (but they know it) is that many of those who leave (or are kicked out) of the vast array of Protestant expressions (non-Catholics) often go out and start their own thing - thus the huge variety of \"cult\" or sects there are in this country... not to mention the wild eyed groups like Koresh's Branch Dravidian and Children of God or even the older Hutterites, etc. Anyway, that is also why you'll never see a Christian consensus on belief or ideas about politics, etc. The Catholics (the oldest continuous bureaucracy in the World) generally would eventually make room for its 'fanatics', thus all the \"orders\", etc. The Protestants (who's main aim was to break free) kick their 'fanatics' out and they run off and start a new improved brand. Church growth. I read the latest Pew report this morning as was surprised by how they divided up and explained the growth of 'unbelievers'. Anyway, the chase goes on! This message has been edited. Last edited by: reducetension, Tue 28 April 2009 02:12 PM", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 11:46:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. [/QUOTE] I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.", 
        "intTime": 20090428, 
        "postID": 34, 
        "quote": "Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\"", 
        "reply": " As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. [/QUOTE] I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 12:01:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.[/QUOTE] I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.", 
        "intTime": 20090428, 
        "postID": 35, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone.", 
        "reply": " I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.[/QUOTE] I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 15:42:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations. I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.[/QUOTE] When I became a literalist I had to quit going to church because we didn't have a Honda. The Bible says you should all be in one Accord. Consequently that lead to my unbelief and relief.", 
        "intTime": 20090428, 
        "postID": 36, 
        "quote": "Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by Fightdirector: \"A lot of the switching is intra-Protestant switching, and I think at this point that's not even switching,\" said Stephen Prothero, a professor of religion at Boston University. \"Hardly anyone knows the difference between a Lutheran and an Episcopalian or even a Methodist and a Baptist. We live in a postdenominational time.\" As a Christian who doesn't belong to any organized church because of the un-Christian human-invented dogma found in every organized \"Christian\" church I have been in, I find it encouraging that 16% of those studied are also \"unaffiliated\". I always knew I wasn't alone. I agree with the repulsion felt by true believers concerning \"human invented dogma\". For this reason I belong to an independent church. If it's in God's Word, then it is not human invented and is profitable for study. I was always uncomfortable with those who monitored hair length, mode of dress, etc. When I started seeing Rolex watches on the pastors I usually prepared to make my exit. That being said, even an independent group needs accountability, generally that is accomplished by multiple elders and studied congregations.", 
        "reply": " I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.[/QUOTE] When I became a literalist I had to quit going to church because we didn't have a Honda. The Bible says you should all be in one Accord. Consequently that lead to my unbelief and relief.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 16:21:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "reducetension"
    }, 
    {
        "content": "Ron; I understand the changing of many to less structured and a free-er way of approaching God and worship. Check out the Hebrew word for worship when translated into Aramaic,then Greek, then Latin, then pre Elizabethan english or court French. If the t i t les are moved, it becomes the word love. As the word love does with the word fear!! Change the Jots and the word fear becomes love!?? Go figger!! But like you, I feel we must be very careful indeed about changing the strictures of behavior passed down in the commandments. All the rest of man's stuff you can take or leave for my money!!", 
        "intTime": 20090428, 
        "postID": 37, 
        "quote": "", 
        "reply": "Ron; I understand the changing of many to less structured and a free-er way of approaching God and worship. Check out the Hebrew word for worship when translated into Aramaic,then Greek, then Latin, then pre Elizabethan english or court French. If the t i t les are moved, it becomes the word love. As the word love does with the word fear!! Change the Jots and the word fear becomes love!?? Go figger!! But like you, I feel we must be very careful indeed about changing the strictures of behavior passed down in the commandments. All the rest of man's stuff you can take or leave for my money!!", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 19:29:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin?", 
        "intTime": 20090428, 
        "postID": 38, 
        "quote": "Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so.", 
        "reply": " Hey Bill, how ya doin?", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-28 21:04:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin? Ron! Ya ol' sea dog. Doin' fine. Went fishing today... not catching, but fishing. And, how are you?", 
        "intTime": 20090429, 
        "postID": 39, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin?", 
        "reply": " Ron! Ya ol' sea dog. Doin' fine. Went fishing today... not catching, but fishing. And, how are you?", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 16:24:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in.", 
        "intTime": 20090429, 
        "postID": 40, 
        "quote": "If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists?", 
        "reply": "It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham:  One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 17:28:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems?", 
        "intTime": 20090429, 
        "postID": 41, 
        "quote": "Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in.", 
        "reply": " What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems?", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 17:40:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "AKinNC"
    }, 
    {
        "content": "quote: Originally posted by AKinNC: quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems? Things like this, even when said as a joke, remind me why I like being a Unitarian.", 
        "intTime": 20090429, 
        "postID": 42, 
        "quote": "Originally posted by AKinNC: quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems?", 
        "reply": " Things like this, even when said as a joke, remind me why I like being a Unitarian.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 18:38:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by AKinNC: quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems? Things like this, even when said as a joke, remind me why I like being a Unitarian. Things like this remind me of the need for all Christians and others to practice humility when trying to understand eachother with all of our flaws and limitations. Living The Mission to love all our brothers and sisters begins at home. Only then can we walk outwardly with the humility we have learned from within. And that is how we continue to serve. - in humble service - - LegionSon", 
        "intTime": 20090429, 
        "postID": 43, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by AKinNC: quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. What if they had to work with ...gasp... Catholics or even Mormons?!?!? Ahhhhhhrrghh, run for the hills!!!!!!! Or even worse, what if they had to work with Mooos-lems? Things like this, even when said as a joke, remind me why I like being a Unitarian.", 
        "reply": " Things like this remind me of the need for all Christians and others to practice humility when trying to understand eachother with all of our flaws and limitations. Living The Mission to love all our brothers and sisters begins at home. Only then can we walk outwardly with the humility we have learned from within. And that is how we continue to serve. - in humble service - - LegionSon", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 19:18:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "We have noticed more and more people attending onlins disscussions we have. Most are in the process of leaving xtian churches but still wanting to learn what was being taught in the first books of the Bible, We do not try to bring people into our disscussions but more and more come in. We are taught by Rabi's but we are not taught the Jewish fath sence we are not jewish and even tho we could we do not wish to convert. D.J.", 
        "intTime": 20090429, 
        "postID": 44, 
        "quote": "", 
        "reply": "We have noticed more and more people attending onlins disscussions we have. Most are in the process of leaving xtian churches but still wanting to learn what was being taught in the first books of the Bible, We do not try to bring people into our disscussions but more and more come in. We are taught by Rabi's but we are not taught the Jewish fath sence we are not jewish and even tho we could we do not wish to convert. D.J.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 20:30:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin? Ron! Ya ol' sea dog. Doin' fine. Went fishing today... not catching, but fishing. And, how are you? Hanging in there my friend. Had to retire last December after 40 years on the job, eliminated my position. Oh well...... Not much of a fisherman myself but have been riding my ATV quite a bit. Guess I'll catch up on all those projects I've been meaning to get to for the last 40 yrs.", 
        "intTime": 20090429, 
        "postID": 45, 
        "quote": "Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by billbright: [QUOTE]Originally posted by Raunchy: I belong to a REALLY independent church. I'm a church of one who doesn't believe any of the typical religious malarkey and is unafraid to say so. Hey Bill, how ya doin? Ron! Ya ol' sea dog. Doin' fine. Went fishing today... not catching, but fishing. And, how are you?", 
        "reply": " Hanging in there my friend. Had to retire last December after 40 years on the job, eliminated my position. Oh well...... Not much of a fisherman myself but have been riding my ATV quite a bit. Guess I'll catch up on all those projects I've been meaning to get to for the last 40 yrs.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 20:44:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in. Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News.", 
        "intTime": 20090429, 
        "postID": 46, 
        "quote": "Originally posted by Fightdirector: It's interesting, at least to me, to be \"unaffiliated\" and read this comment attributed to Fredrick Graham, son of Billy Graham: quote: If faith-based communities are going to be required by the government to accept people with different thinking, that’s going to weaken the entire initiative. If Baptists work well with other Baptists and Presbyterians work well with other Presbyterians, why should the Baptists be forced to work with Presbyterians, or the Presbyterians forced to work with Baptists? One COULD interpret his statement to indicate that he doesn't believe Presbyterians and Baptists to both be \"Christians\" - otherwise why would it be \"forcing them to work together\" to do God's work? If Presbyterians and Baptists are both \"Christians\" - why are they separate? IMO, at the heart of denominationalism is the belief that only your denomination is the true \"Christian\" one and all others are at best flawed Christians for not believing each and every dogma and doctrine your denomination believes in.", 
        "reply": " Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 20:48:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "I just returned from a 4 day camp out here in oklahoma went to Skiatook Lake and the whole 4 days was a wast as far as fishing go's too much East wind. We didnt catch a dang thing here eather. Now they are opening the gates on the dams to reliese water comming from North so the fishing wont be very good for a long while. D.J.", 
        "intTime": 20090429, 
        "postID": 47, 
        "quote": "", 
        "reply": "I just returned from a 4 day camp out here in oklahoma went to Skiatook Lake and the whole 4 days was a wast as far as fishing go's too much East wind. We didnt catch a dang thing here eather. Now they are opening the gates on the dams to reliese water comming from North so the fishing wont be very good for a long while. D.J.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-29 20:51:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc?", 
        "intTime": 20090430, 
        "postID": 48, 
        "quote": "Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News.", 
        "reply": " Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc?", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 12:25:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations.", 
        "intTime": 20090430, 
        "postID": 49, 
        "quote": "Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc?", 
        "reply": " Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 13:17:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations. No, fantasy-boy, he's not a believer now. He's worm dirt. Nor was he a theologian; just a very humorous guy who liked to take aim at the pretentious, sublime and ridiculous religious apprehensions of his time. Have you ever actually seen any believable descriptions of heaven? Play a harp much, yourself? Could you imagine spending an eternity doing it? And, who are you when you get to heaven? Are you the hamburger you were after the accident? Are you the senile drooler you were when you died in the home? Heaven sounds like a place of questionable provenance, to me. How would you actually fare at the right hand of God, the character in the bible who likes to kill babies even more than the crack *****; who likes to play with people's lives, ala Job; who kicked out his best angel and made him in charge of a burning nether-world? Doesn't sound like such a great assignment to me, sitting there not knowing when the Jealous One is going to turn on you. No thanks... I'm happy it'll be all over when I'm gone. TYVM.", 
        "intTime": 20090430, 
        "postID": 50, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations.", 
        "reply": " No, fantasy-boy, he's not a believer now. He's worm dirt. Nor was he a theologian; just a very humorous guy who liked to take aim at the pretentious, sublime and ridiculous religious apprehensions of his time. Have you ever actually seen any believable descriptions of heaven? Play a harp much, yourself? Could you imagine spending an eternity doing it? And, who are you when you get to heaven? Are you the hamburger you were after the accident? Are you the senile drooler you were when you died in the home? Heaven sounds like a place of questionable provenance, to me. How would you actually fare at the right hand of God, the character in the bible who likes to kill babies even more than the crack *****; who likes to play with people's lives, ala Job; who kicked out his best angel and made him in charge of a burning nether-world? Doesn't sound like such a great assignment to me, sitting there not knowing when the Jealous One is going to turn on you. No thanks... I'm happy it'll be all over when I'm gone. TYVM.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 13:47:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations. No, fantasy-boy, he's not a believer now. He's worm dirt. (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) Nor was he a theologian; ( it's call Humor of the Absurd Bill) just a very humorous guy who liked to take aim at the pretentious, sublime and ridiculous religious apprehensions of his time. (Much like you but with the humor? ) Have you ever actually seen any believable descriptions of heaven? Play a harp much, yourself? Could you imagine spending an eternity doing it? And, who are you when you get to heaven? Are you the hamburger you were after the accident? Are you the senile drooler you were when you died in the home? Heaven sounds like a place of questionable provenance, to me. How would you actually fare at the right hand of God, the character in the bible who likes to kill babies even more than the crack *****; who likes to play with people's lives, ala Job; who kicked out his best angel and made him in charge of a burning nether-world? Doesn't sound like such a great assignment to me, sitting there not knowing when the Jealous One is going to turn on you. No thanks... I'm happy it'll be all over when I'm gone. TYVM. Take a pill Bill and come back when you aren't so strident. This message has been edited. Last edited by: Raunchy, Thu 30 April 2009 03:20 PM", 
        "intTime": 20090430, 
        "postID": 51, 
        "quote": "Originally posted by billbright: quote: Originally posted by Raunchy: quote: Originally posted by billbright: quote: Originally posted by Raunchy: Yeah Rich, it's strange indeed. Especially since there are no Baptists, Presbyterians, Catholics, etc in heaven, only believers. The different denominations create far too much distraction from the main mission of spreading the Good News. Well, God-damn... Ron's been to heaven and has come back to report. Did you ever read any of Mark Twain's reports on heaven? Cap'n Stormfield, etc? Oh, you mean Mark Twain the noted theologian? It's a shame some of his insightful writings have never been incorporated in the New Testament. I'll bet though, that he's a believer now. BTW, no, I haven't been to heaven, all I know is that all the descriptions of heaven never mention different sections for different denominations. No, fantasy-boy, he's not a believer now. He's worm dirt. (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) Nor was he a theologian; ( it's call Humor of the Absurd Bill) just a very humorous guy who liked to take aim at the pretentious, sublime and ridiculous religious apprehensions of his time. (Much like you but with the humor? ) Have you ever actually seen any believable descriptions of heaven? Play a harp much, yourself? Could you imagine spending an eternity doing it? And, who are you when you get to heaven? Are you the hamburger you were after the accident? Are you the senile drooler you were when you died in the home? Heaven sounds like a place of questionable provenance, to me. How would you actually fare at the right hand of God, the character in the bible who likes to kill babies even more than the crack *****; who likes to play with people's lives, ala Job; who kicked out his best angel and made him in charge of a burning nether-world? Doesn't sound like such a great assignment to me, sitting there not knowing when the Jealous One is going to turn on you. No thanks... I'm happy it'll be all over when I'm gone. TYVM.", 
        "reply": " Take a pill Bill and come back when you aren't so strident. This message has been edited. Last edited by: Raunchy, Thu 30 April 2009 03:20 PM", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 14:04:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive.", 
        "intTime": 20090430, 
        "postID": 52, 
        "quote": "(you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.)", 
        "reply": " I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 19:57:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive. Seems between the two of us I'm the only one able to enjoy our give and take. Sorry about the burr under your saddle.", 
        "intTime": 20090430, 
        "postID": 53, 
        "quote": "Originally posted by billbright: quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive.", 
        "reply": " Seems between the two of us I'm the only one able to enjoy our give and take. Sorry about the burr under your saddle.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 20:37:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by billbright: quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive. Seems between the two of us I'm the only one able to enjoy our give and take. Sorry about the burr under your saddle. Living and giving you hell is sometimes all that remains of oneself so diminished of good. So we pray for a glimmer of hope to produce more light. - LegionSon -", 
        "intTime": 20090430, 
        "postID": 54, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by billbright: quote: (you miss my point, either one goes to heaven or hell. Either way one now believes, problem is that for those in hell it's too late.) I didn't miss your point. I negated it. There is no... can't be any... heaven or hell. So... lighten up your damned self... and live a little while you're still alive. Seems between the two of us I'm the only one able to enjoy our give and take. Sorry about the burr under your saddle.", 
        "reply": " Living and giving you hell is sometimes all that remains of oneself so diminished of good. So we pray for a glimmer of hope to produce more light. - LegionSon -", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 20:59:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day.", 
        "intTime": 20090430, 
        "postID": 55, 
        "quote": "", 
        "reply": "Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 21:00:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon -", 
        "intTime": 20090430, 
        "postID": 56, 
        "quote": "Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day.", 
        "reply": " Heh...Voila!!! - the power of prayer - - LegionSon -", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 21:08:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon - Speaking of the power of prayer.... ages ago I mentioned that when the Xians dutifully prayed for me as their founder ordered, that I needed a newer truck. Well, here we are, many months down the road and I am still driving my old beat up 1985 Nissan King Cab... what the hell gives with this 'power of prayer'? Aren't you Xians obeying your Master or is it just a hoax? (But, you know, in 1985 I never thought I'd own one!) Come on now, down on the knees and speaking in tongues, get the guy in the sky to give me a better, newer pickup! I'm not even fussy about the color... though I am anticipating an other Nissan. Rrrrrrrrrmen!", 
        "intTime": 20090430, 
        "postID": 57, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon -", 
        "reply": " Speaking of the power of prayer.... ages ago I mentioned that when the Xians dutifully prayed for me as their founder ordered, that I needed a newer truck. Well, here we are, many months down the road and I am still driving my old beat up 1985 Nissan King Cab... what the hell gives with this 'power of prayer'? Aren't you Xians obeying your Master or is it just a hoax? (But, you know, in 1985 I never thought I'd own one!) Come on now, down on the knees and speaking in tongues, get the guy in the sky to give me a better, newer pickup! I'm not even fussy about the color... though I am anticipating an other Nissan. Rrrrrrrrrmen!", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 21:37:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by LegionSon: quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon - Speaking of the power of prayer.... ages ago I mentioned that when the Xians dutifully prayed for me as their founder ordered, that I needed a newer truck. Well, here we are, many months down the road and I am still driving my old beat up 1985 Nissan King Cab... what the hell gives with this 'power of prayer'? Aren't you Xians obeying your Master or is it just a hoax? (But, you know, in 1985 I never thought I'd own one!) Come on now, down on the knees and speaking in tongues, get the guy in the sky to give me a better, newer pickup! I'm not even fussy about the color... though I am anticipating an other Nissan. Rrrrrrrrrmen! I seem to remember all4truth was going to get it for you heheh, thats why we stopped praying for it...but it is really you who should pray for it. we already got ours...hehh. - LegionSon -", 
        "intTime": 20090430, 
        "postID": 58, 
        "quote": "Originally posted by reducetension: quote: Originally posted by LegionSon: quote: Originally posted by billbright: Oh, sure Ron... you got me wrong again. I was being funny as hell. And I'm enjoying myself to the max. It's been a great day, all told. I rode my bike fourteen miles, paid for a house on the outer banks for a week with my kids and grandkids this summer, paid my bills, cleaned up the house, washed the clothes, made dinner for my teen, and still had time to mess with hyper-Christians. Great day. Heh...Voila!!! - the power of prayer - - LegionSon - Speaking of the power of prayer.... ages ago I mentioned that when the Xians dutifully prayed for me as their founder ordered, that I needed a newer truck. Well, here we are, many months down the road and I am still driving my old beat up 1985 Nissan King Cab... what the hell gives with this 'power of prayer'? Aren't you Xians obeying your Master or is it just a hoax? (But, you know, in 1985 I never thought I'd own one!) Come on now, down on the knees and speaking in tongues, get the guy in the sky to give me a better, newer pickup! I'm not even fussy about the color... though I am anticipating an other Nissan. Rrrrrrrrrmen!", 
        "reply": " I seem to remember all4truth was going to get it for you heheh, thats why we stopped praying for it...but it is really you who should pray for it. we already got ours...hehh. - LegionSon -", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-04-30 22:22:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "Joe; RE; your truck........ God helps those, who help themselves........ Of course, God help you if you get CAUGHT...... helping your self!!!!!", 
        "intTime": 20090501, 
        "postID": 59, 
        "quote": "", 
        "reply": "Joe; RE; your truck........ God helps those, who help themselves........ Of course, God help you if you get CAUGHT...... helping your self!!!!!", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-05-01 06:31:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: Heh...Voila!!! - the power of prayer - - LegionSon - Go rub the wax off your cucumber.", 
        "intTime": 20090501, 
        "postID": 60, 
        "quote": "Originally posted by LegionSon: Heh...Voila!!! - the power of prayer - - LegionSon -", 
        "reply": " Go rub the wax off your cucumber.", 
        "threadID": "1270031990001_1360059122001", 
        "time": "2009-05-01 08:05:00", 
        "title": "Americans switching religious affiliations - Is it a good or bad thing?", 
        "userID": "billbright"
    }
]