[
    {
        "content": "IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!!", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": "IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!!", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-17 16:06:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "I thought the royal rear only went into the air for Saudi Princes????? It ascends for the Turks as well....WoW!!! Well....he DID say he was proud of his Muslim faith during the campaign.............. Matbe somebody needs to explain to the young man that he is president FIRST!!! Everything ELSE second!!!!!!", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "", 
        "reply": "I thought the royal rear only went into the air for Saudi Princes????? It ascends for the Turks as well....WoW!!! Well....he DID say he was proud of his Muslim faith during the campaign.............. Matbe somebody needs to explain to the young man that he is president FIRST!!! Everything ELSE second!!!!!!", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-17 16:19:00", 
        "title": "IHS", 
        "userID": "tawodi"
    }, 
    {
        "content": "I am not sure how far he bowed in Turkey but he certaily did lowcrawl ot the \"SaudiPri(n)c(e)\". Maybe oil prices will remain low because of the low bow. Never saw a \"messiah\" bow before!", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "I am not sure how far he bowed in Turkey but he certaily did lowcrawl ot the \"SaudiPri(n)c(e)\". Maybe oil prices will remain low because of the low bow. Never saw a \"messiah\" bow before!", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-17 16:40:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "Ya know....neither have I!!! Could that mean, he's not REALLY the Massiah???!!??? Maybe he's just the massiah with a small \"m\" ya think????", 
        "intTime": 20090419, 
        "postID": 4, 
        "quote": "", 
        "reply": "Ya know....neither have I!!! Could that mean, he's not REALLY the Massiah???!!??? Maybe he's just the massiah with a small \"m\" ya think????", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-19 07:30:00", 
        "title": "IHS", 
        "userID": "tawodi"
    }, 
    {
        "content": "Do I sense some competition among the notion of a Messiah? They all fail, you know. Only way a Messiah can work is wishful thinking for the future. Myths are important, people need something to believe in, even if it's just various version of the old Messiah message that is never fulfillable. Any way, it is obvious there is nothing this Pres. could do to sway the right wing-nuts hung up on a conservative Messiah image justifying kicking aszzsssss for the cause. Any more so than the previous wing-nut's Messianic notions could do much good. What did GWB do for the conservative religious right but lead them around by the nostrils?", 
        "intTime": 20090419, 
        "postID": 5, 
        "quote": "", 
        "reply": "Do I sense some competition among the notion of a Messiah? They all fail, you know. Only way a Messiah can work is wishful thinking for the future. Myths are important, people need something to believe in, even if it's just various version of the old Messiah message that is never fulfillable. Any way, it is obvious there is nothing this Pres. could do to sway the right wing-nuts hung up on a conservative Messiah image justifying kicking aszzsssss for the cause. Any more so than the previous wing-nut's Messianic notions could do much good. What did GWB do for the conservative religious right but lead them around by the nostrils?", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-19 14:37:00", 
        "title": "IHS", 
        "userID": "reducetension"
    }, 
    {
        "content": "Well he sure kept the left wingnuts running around chasing their tails for eight years didn't he!!!!", 
        "intTime": 20090419, 
        "postID": 6, 
        "quote": "", 
        "reply": "Well he sure kept the left wingnuts running around chasing their tails for eight years didn't he!!!!", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-19 17:34:00", 
        "title": "IHS", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Well he sure kept the left wingnuts running around chasing their tails for eight years didn't he!!!! Maybe, but look who got bit in the assssz!", 
        "intTime": 20090419, 
        "postID": 7, 
        "quote": "Originally posted by tawodi: Well he sure kept the left wingnuts running around chasing their tails for eight years didn't he!!!!", 
        "reply": " Maybe, but look who got bit in the assssz!", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-19 18:50:00", 
        "title": "IHS", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. -snip- I agree. It is also these type of actions that are soon to hasten the exact response you suggest. Also, there are many who did not know this man before he was elected, many who thought they knew and few who actually did. Now we have greater disappointment by transparency. - LegionSon -", 
        "intTime": 20090419, 
        "postID": 8, 
        "quote": "Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. -snip-", 
        "reply": " I agree. It is also these type of actions that are soon to hasten the exact response you suggest. Also, there are many who did not know this man before he was elected, many who thought they knew and few who actually did. Now we have greater disappointment by transparency. - LegionSon -", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-19 19:42:00", 
        "title": "IHS", 
        "userID": "LegionSon"
    }, 
    {
        "content": "Yep Joe righty-o once again!! They ALL failed....except the real one!! Although I didn't ever look on G.W.B. as the Massiah, personally speaking I though he blew it when he trusted Kennedy about the \"no child left behind bill. All my teacher friends are still bit*** about that one having no funding!! It was kinda hard to fund when Teddy the \"K\" went in the day after the signing ceremony and killed 40% of the funding for it!! Really strange how that never made the front pages!!?? This ......person... will too, the only thing left to be seen, is if anyone will be left to comment on it!!", 
        "intTime": 20090419, 
        "postID": 9, 
        "quote": "", 
        "reply": "Yep Joe righty-o once again!! They ALL failed....except the real one!! Although I didn't ever look on G.W.B. as the Massiah, personally speaking I though he blew it when he trusted Kennedy about the \"no child left behind bill. All my teacher friends are still bit*** about that one having no funding!! It was kinda hard to fund when Teddy the \"K\" went in the day after the signing ceremony and killed 40% of the funding for it!! Really strange how that never made the front pages!!?? This ......person... will too, the only thing left to be seen, is if anyone will be left to comment on it!!", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-19 20:44:00", 
        "title": "IHS", 
        "userID": "tawodi"
    }, 
    {
        "content": "You mean like suddenly the human race will go extinct? Or the mean messiah will take away or pen and paper and computers so we can't post nasty things about our rulers? You mean that kind 'no one left to comment' or do you mean no one will be on the left politically to enjoy it? If we could get through GWB we can get through anyone!", 
        "intTime": 20090419, 
        "postID": 10, 
        "quote": "", 
        "reply": "You mean like suddenly the human race will go extinct? Or the mean messiah will take away or pen and paper and computers so we can't post nasty things about our rulers? You mean that kind 'no one left to comment' or do you mean no one will be on the left politically to enjoy it? If we could get through GWB we can get through anyone!", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-19 20:47:00", 
        "title": "IHS", 
        "userID": "reducetension"
    }, 
    {
        "content": "I meant exactly what I wrote...you figure it out.", 
        "intTime": 20090419, 
        "postID": 11, 
        "quote": "", 
        "reply": "I meant exactly what I wrote...you figure it out.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-19 20:50:00", 
        "title": "IHS", 
        "userID": "tawodi"
    }, 
    {
        "content": "This thread will be moving to Point/Counterpoint soon. I see no reason to leave it in the religious forums, other than the original post.", 
        "intTime": 20090420, 
        "postID": 12, 
        "quote": "", 
        "reply": "This thread will be moving to Point/Counterpoint soon. I see no reason to leave it in the religious forums, other than the original post.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 03:55:00", 
        "title": "IHS", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Well he sure kept the left wingnuts running around chasing their tails for eight years didn't he!!!! The real Messiah still has wing nuts of many stripes still chasing their tails (as in Tense man).", 
        "intTime": 20090420, 
        "postID": 13, 
        "quote": "Originally posted by tawodi: Well he sure kept the left wingnuts running around chasing their tails for eight years didn't he!!!!", 
        "reply": " The real Messiah still has wing nuts of many stripes still chasing their tails (as in Tense man).", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 10:42:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! So, are you mad at, the President for asking that IHS be covered or the school who caved in, deciding that the prestige of the President giving the address was more important that their religious belief?", 
        "intTime": 20090420, 
        "postID": 14, 
        "quote": "Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!!", 
        "reply": " So, are you mad at, the President for asking that IHS be covered or the school who caved in, deciding that the prestige of the President giving the address was more important that their religious belief?", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 11:35:00", 
        "title": "IHS", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by PSimon572: quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! So, are you mad at, the President for asking that IHS be covered or the school who caved in, deciding that the prestige of the President giving the address was more important that their religious belief? The Presidential messiah may request whatever he wants but you are correct. The schoolcave-in. The present CIC does not impress me so IMHO I feel him to be prestige free and that he denigrates the office. Many felt the same of our previous CIC and stated so in these mil.com pages. Also, I did not agree w/ everything GWB did but it seems like our Pres. right now may end up to be generally troublesome. Wait til the EPA enacts some of his and the rest of the left's green nonsense! Contact your Senators and rep. to stop the EPA with legislation.", 
        "intTime": 20090420, 
        "postID": 15, 
        "quote": "Originally posted by PSimon572: quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! So, are you mad at, the President for asking that IHS be covered or the school who caved in, deciding that the prestige of the President giving the address was more important that their religious belief?", 
        "reply": " The Presidential messiah may request whatever he wants but you are correct. The schoolcave-in. The present CIC does not impress me so IMHO I feel him to be prestige free and that he denigrates the office. Many felt the same of our previous CIC and stated so in these mil.com pages. Also, I did not agree w/ everything GWB did but it seems like our Pres. right now may end up to be generally troublesome. Wait til the EPA enacts some of his and the rest of the left's green nonsense! Contact your Senators and rep. to stop the EPA with legislation.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 12:26:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! The way I read it, it wasn't Obama's choice to cover everything up. He asked for a particular style of assembly, and the providers of this soiree made the choice to cover up everything, including those inconsequential items like the IHS, which don't mean a hell of a lot to most folks until someone explains the significance. Whoever covered it up probably had no idea of the actual religious significance of the letters. Looks like it was just a simple mistake. But, you boys go ahead and get yourselves all excited.", 
        "intTime": 20090420, 
        "postID": 16, 
        "quote": "Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!!", 
        "reply": " The way I read it, it wasn't Obama's choice to cover everything up. He asked for a particular style of assembly, and the providers of this soiree made the choice to cover up everything, including those inconsequential items like the IHS, which don't mean a hell of a lot to most folks until someone explains the significance. Whoever covered it up probably had no idea of the actual religious significance of the letters. Looks like it was just a simple mistake. But, you boys go ahead and get yourselves all excited.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 15:29:00", 
        "title": "IHS", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! The way I read it, it wasn't Obama's choice to cover everything up. He asked for a particular style of assembly, and the providers of this soiree made the choice to cover up everything, including those inconsequential items like the IHS, which don't mean a hell of a lot to most folks until someone explains the significance. Whoever covered it up probably had no idea of the actual religious significance of the letters. Looks like it was just a simple mistake. But, you boys go ahead and get yourselves all excited. You certainly appear to be out of touch from what really went on. No mistake about what happened or occurred. You could care less about it so the point is really moot in respect to your position. It occurred as stated above. The messiah requested it and that 's about it.", 
        "intTime": 20090420, 
        "postID": 17, 
        "quote": "Originally posted by billbright: quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! The way I read it, it wasn't Obama's choice to cover everything up. He asked for a particular style of assembly, and the providers of this soiree made the choice to cover up everything, including those inconsequential items like the IHS, which don't mean a hell of a lot to most folks until someone explains the significance. Whoever covered it up probably had no idea of the actual religious significance of the letters. Looks like it was just a simple mistake. But, you boys go ahead and get yourselves all excited.", 
        "reply": " You certainly appear to be out of touch from what really went on. No mistake about what happened or occurred. You could care less about it so the point is really moot in respect to your position. It occurred as stated above. The messiah requested it and that 's about it.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 16:17:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "Since the thread seems to have gotten back on track, I'll leave it here.", 
        "intTime": 20090420, 
        "postID": 18, 
        "quote": "", 
        "reply": "Since the thread seems to have gotten back on track, I'll leave it here.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 18:16:00", 
        "title": "IHS", 
        "userID": "stillkit"
    }, 
    {
        "content": "You know, in may respects IHS represents violence in its origin. The Latin initials IHS is \"In Hoc Signo (Vinces)\" (By this Sign (Conquer)) and was adopted by the Roman Emperor Constantine for his legions when he converted to Christianity in the early 4th Century. As the story goes, prior to the battle with Maxentius near the Milvian Bridge at Rome, Constantine dreamed of a cross of light in the sky and the words \"In hoc signo vinces.\" Thus, Constantine, being the superstitious man he was, had the cross (or Greek letters Chi and Rho) inscribed on his soldiers' shields. Constantine won the battle and converted the Empire to Christianity forceably. Much later the Jesuits (Society of Jesus), who were known for their violent ways of \"converting\" people to the true faith, probably had this story in mind when they incorporated an \"IHS\" inside a sun for their insignia. Of course the cross itself is a symbol of violence and punishment for those who rebel against the status quo. Many a Protestant reject the symbol as being \"Papist\" and some even refuse to acknowledge it because it was on the shields of Roman soldiers as they forced the masses into conversion to Christianity and then to punish the \"wrong\" kind of Christians who questioned the whole deal of the faith selling out to Caesar. It's not as clean and simple symbol as one might think. I can understand why an educated man like Obama might have his misgivings about it. He wouldn't be the first. So did some of the Reformers did likewise.", 
        "intTime": 20090420, 
        "postID": 19, 
        "quote": "", 
        "reply": "You know, in may respects IHS represents violence in its origin. The Latin initials IHS is \"In Hoc Signo (Vinces)\" (By this Sign (Conquer)) and was adopted by the Roman Emperor Constantine for his legions when he converted to Christianity in the early 4th Century. As the story goes, prior to the battle with Maxentius near the Milvian Bridge at Rome, Constantine dreamed of a cross of light in the sky and the words \"In hoc signo vinces.\" Thus, Constantine, being the superstitious man he was, had the cross (or Greek letters Chi and Rho) inscribed on his soldiers' shields. Constantine won the battle and converted the Empire to Christianity forceably. Much later the Jesuits (Society of Jesus), who were known for their violent ways of \"converting\" people to the true faith, probably had this story in mind when they incorporated an \"IHS\" inside a sun for their insignia. Of course the cross itself is a symbol of violence and punishment for those who rebel against the status quo. Many a Protestant reject the symbol as being \"Papist\" and some even refuse to acknowledge it because it was on the shields of Roman soldiers as they forced the masses into conversion to Christianity and then to punish the \"wrong\" kind of Christians who questioned the whole deal of the faith selling out to Caesar. It's not as clean and simple symbol as one might think. I can understand why an educated man like Obama might have his misgivings about it. He wouldn't be the first. So did some of the Reformers did likewise.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 19:24:00", 
        "title": "IHS", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by 5727609: quote: Originally posted by billbright: quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! The way I read it, it wasn't Obama's choice to cover everything up. He asked for a particular style of assembly, and the providers of this soiree made the choice to cover up everything, including those inconsequential items like the IHS, which don't mean a hell of a lot to most folks until someone explains the significance. Whoever covered it up probably had no idea of the actual religious significance of the letters. Looks like it was just a simple mistake. But, you boys go ahead and get yourselves all excited. You certainly appear to be out of touch from what really went on. No mistake about what happened or occurred. You could care less about it so the point is really moot in respect to your position. It occurred as stated above. The messiah requested it and that 's about it. I'm glad he did, if only to see a bunch of religious nuts crying. The people who say it's nothing and that people shouldn't be upset if someone has children pray in school are the same ones who want to be all yurked off when a president who is the representative of all of us tries to remain neutral and not show a lot of favoritism. Figures. You mooks won't be happy until every last atheist is on his knees every Sunday. Well, guess what.... You're going to be unhappy a lo-o-ong time.", 
        "intTime": 20090420, 
        "postID": 20, 
        "quote": "Originally posted by 5727609: quote: Originally posted by billbright: quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! The way I read it, it wasn't Obama's choice to cover everything up. He asked for a particular style of assembly, and the providers of this soiree made the choice to cover up everything, including those inconsequential items like the IHS, which don't mean a hell of a lot to most folks until someone explains the significance. Whoever covered it up probably had no idea of the actual religious significance of the letters. Looks like it was just a simple mistake. But, you boys go ahead and get yourselves all excited. You certainly appear to be out of touch from what really went on. No mistake about what happened or occurred. You could care less about it so the point is really moot in respect to your position. It occurred as stated above. The messiah requested it and that 's about it.", 
        "reply": " I'm glad he did, if only to see a bunch of religious nuts crying. The people who say it's nothing and that people shouldn't be upset if someone has children pray in school are the same ones who want to be all yurked off when a president who is the representative of all of us tries to remain neutral and not show a lot of favoritism. Figures. You mooks won't be happy until every last atheist is on his knees every Sunday. Well, guess what.... You're going to be unhappy a lo-o-ong time.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-20 20:51:00", 
        "title": "IHS", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by 5727609: quote: Originally posted by billbright: quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! The way I read it, it wasn't Obama's choice to cover everything up. He asked for a particular style of assembly, and the providers of this soiree made the choice to cover up everything, including those inconsequential items like the IHS, which don't mean a hell of a lot to most folks until someone explains the significance. Whoever covered it up probably had no idea of the actual religious significance of the letters. Looks like it was just a simple mistake. But, you boys go ahead and get yourselves all excited. You certainly appear to be out of touch from what really went on. No mistake about what happened or occurred. You could care less about it so the point is really moot in respect to your position. It occurred as stated above. The messiah requested it and that 's about it. I'm glad he did, if only to see a bunch of religious nuts crying. The people who say it's nothing and that people shouldn't be upset if someone has children pray in school are the same ones who want to be all yurked off when a president who is the representative of all of us tries to remain neutral and not show a lot of favoritism. Figures. You mooks won't be happy until every last atheist is on his knees every Sunday. Well, guess what.... You're going to be unhappy a lo-o-ong time. You will bow the knee to Christ one day. What you do or think or say holds no more sway with me or other Christians than we hold with you and you have no control over any happiness any more than a preten \"neutered\" political leader. I will pray for our leaders as the Lord says to. God will hold plenty of sway with you. Let not your heart be troubled (yet).", 
        "intTime": 20090421, 
        "postID": 21, 
        "quote": "Originally posted by billbright: quote: Originally posted by 5727609: quote: Originally posted by billbright: quote: Originally posted by 5727609: IHS is a statement or as it were the name of Jesus. The President spoke at Georgetown University which is a Jesuit run school. Before he would speak he wanted the initials IHS covered because he figured the name of Jesus in that form would distract from his comments. Would I were the \"Chief Jesuit in Charge\" I would have told the \"messiah\" to pack it up and leave. While in Turkey this same messiah removed his shoes but I do not know if the \"messiah\"pointed his royal ass skywards!!! The way I read it, it wasn't Obama's choice to cover everything up. He asked for a particular style of assembly, and the providers of this soiree made the choice to cover up everything, including those inconsequential items like the IHS, which don't mean a hell of a lot to most folks until someone explains the significance. Whoever covered it up probably had no idea of the actual religious significance of the letters. Looks like it was just a simple mistake. But, you boys go ahead and get yourselves all excited. You certainly appear to be out of touch from what really went on. No mistake about what happened or occurred. You could care less about it so the point is really moot in respect to your position. It occurred as stated above. The messiah requested it and that 's about it. I'm glad he did, if only to see a bunch of religious nuts crying. The people who say it's nothing and that people shouldn't be upset if someone has children pray in school are the same ones who want to be all yurked off when a president who is the representative of all of us tries to remain neutral and not show a lot of favoritism. Figures. You mooks won't be happy until every last atheist is on his knees every Sunday. Well, guess what.... You're going to be unhappy a lo-o-ong time.", 
        "reply": " You will bow the knee to Christ one day. What you do or think or say holds no more sway with me or other Christians than we hold with you and you have no control over any happiness any more than a preten \"neutered\" political leader. I will pray for our leaders as the Lord says to. God will hold plenty of sway with you. Let not your heart be troubled (yet).", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 07:54:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by reducetension: You know, in may respects IHS represents violence in its origin. The Latin initials IHS is \"In Hoc Signo (Vinces)\" (By this Sign (Conquer)) and was adopted by the Roman Emperor Constantine for his legions when he converted to Christianity in the early 4th Century. As the story goes, prior to the battle with Maxentius near the Milvian Bridge at Rome, Constantine dreamed of a cross of light in the sky and the words \"In hoc signo vinces.\" Thus, Constantine, being the superstitious man he was, had the cross (or Greek letters Chi and Rho) inscribed on his soldiers' shields. Constantine won the battle and converted the Empire to Christianity forceably. Much later the Jesuits (Society of Jesus), who were known for their violent ways of \"converting\" people to the true faith, probably had this story in mind when they incorporated an \"IHS\" inside a sun for their insignia. Of course the cross itself is a symbol of violence and punishment for those who rebel against the status quo. Many a Protestant reject the symbol as being \"Papist\" and some even refuse to acknowledge it because it was on the shields of Roman soldiers as they forced the masses into conversion to Christianity and then to punish the \"wrong\" kind of Christians who questioned the whole deal of the faith selling out to Caesar. It's not as clean and simple symbol as one might think. I can understand why an educated man like Obama might have his misgivings about it. He wouldn't be the first. So did some of the Reformers did likewise. Deal w/ this Tense; not everyone believes Constantine was a Christian. The Pope at the time held much sway and he used his \"conversion\" for his political benefit as did the Catholic Church. So in truth both benefitted in this colusion and many people suffered and died. As usual you tell your reinvented historical version. Obama may be educated but it appears he is NO christian and may well be more comfortable as a Muslim. He is certainly a smooth talker but that does not make him a leader everyone would like to have. His education is as a point of contention for many people and his governing abilities are equally suspect. As to the Reformers, they were a more purist sort of beliver and made great strides to reset a course more in line with scripture. That ain't Nobama by any means bud! If you think so then you are spouting more of yo remanufactured truth as we know you have done before.(don't we). I missed a point with you. Christians are not superstitious as was the Con man.Pecalling that sc ripture that \"satan can appear as an angel of light\" may be an appropriate point to remember. Crosses are visible by looking at the sun in a number of circumstances so the story, true or not, would hold little if any sway with the reformers or me or oothers of Faith in Christ.", 
        "intTime": 20090421, 
        "postID": 22, 
        "quote": "Originally posted by reducetension: You know, in may respects IHS represents violence in its origin. The Latin initials IHS is \"In Hoc Signo (Vinces)\" (By this Sign (Conquer)) and was adopted by the Roman Emperor Constantine for his legions when he converted to Christianity in the early 4th Century. As the story goes, prior to the battle with Maxentius near the Milvian Bridge at Rome, Constantine dreamed of a cross of light in the sky and the words \"In hoc signo vinces.\" Thus, Constantine, being the superstitious man he was, had the cross (or Greek letters Chi and Rho) inscribed on his soldiers' shields. Constantine won the battle and converted the Empire to Christianity forceably. Much later the Jesuits (Society of Jesus), who were known for their violent ways of \"converting\" people to the true faith, probably had this story in mind when they incorporated an \"IHS\" inside a sun for their insignia. Of course the cross itself is a symbol of violence and punishment for those who rebel against the status quo. Many a Protestant reject the symbol as being \"Papist\" and some even refuse to acknowledge it because it was on the shields of Roman soldiers as they forced the masses into conversion to Christianity and then to punish the \"wrong\" kind of Christians who questioned the whole deal of the faith selling out to Caesar. It's not as clean and simple symbol as one might think. I can understand why an educated man like Obama might have his misgivings about it. He wouldn't be the first. So did some of the Reformers did likewise.", 
        "reply": " Deal w/ this Tense; not everyone believes Constantine was a Christian. The Pope at the time held much sway and he used his \"conversion\" for his political benefit as did the Catholic Church. So in truth both benefitted in this colusion and many people suffered and died. As usual you tell your reinvented historical version. Obama may be educated but it appears he is NO christian and may well be more comfortable as a Muslim. He is certainly a smooth talker but that does not make him a leader everyone would like to have. His education is as a point of contention for many people and his governing abilities are equally suspect. As to the Reformers, they were a more purist sort of beliver and made great strides to reset a course more in line with scripture. That ain't Nobama by any means bud! If you think so then you are spouting more of yo remanufactured truth as we know you have done before.(don't we). I missed a point with you. Christians are not superstitious as was the Con man.Pecalling that sc ripture that \"satan can appear as an angel of light\" may be an appropriate point to remember. Crosses are visible by looking at the sun in a number of circumstances so the story, true or not, would hold little if any sway with the reformers or me or oothers of Faith in Christ.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 08:27:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "Most protestant denominations use I.N.R.I. as the palleas at the top of the cross.....go look it up!! T", 
        "intTime": 20090421, 
        "postID": 23, 
        "quote": "", 
        "reply": "Most protestant denominations use I.N.R.I. as the palleas at the top of the cross.....go look it up!! T", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 09:13:00", 
        "title": "IHS", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Most protestant denominations use I.N.R.I. as the palleas at the top of the cross.....go look it up!! T As a Catholic youth that inscription was always at the top of the crucifix if I recall.", 
        "intTime": 20090421, 
        "postID": 24, 
        "quote": "Originally posted by tawodi: Most protestant denominations use I.N.R.I. as the palleas at the top of the cross.....go look it up!! T", 
        "reply": " As a Catholic youth that inscription was always at the top of the crucifix if I recall.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 09:42:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "It is the Latin letters for the words \"Jesus King of the Jews\" The Pharisies threw a fit, but Pilate told them...\"I have written what I have written.\"", 
        "intTime": 20090421, 
        "postID": 25, 
        "quote": "", 
        "reply": "It is the Latin letters for the words \"Jesus King of the Jews\" The Pharisies threw a fit, but Pilate told them...\"I have written what I have written.\"", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 09:53:00", 
        "title": "IHS", 
        "userID": "tawodi"
    }, 
    {
        "content": "I remember that now. Thanks Brother.", 
        "intTime": 20090421, 
        "postID": 26, 
        "quote": "", 
        "reply": "I remember that now. Thanks Brother.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 09:59:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by 5727609: You will bow the knee to Christ one day. What you do or think or say holds no more sway with me or other Christians than we hold with you and you have no control over any happiness any more than a preten \"neutered\" political leader. I will pray for our leaders as the Lord says to. God will hold plenty of sway with you. Let not your heart be troubled (yet). It's this pompous, pretentious crap I love the most from you holy-Joes. I've seen guys like you at intersections, blathering away... one step from the nuthouse.", 
        "intTime": 20090421, 
        "postID": 27, 
        "quote": "Originally posted by 5727609: You will bow the knee to Christ one day. What you do or think or say holds no more sway with me or other Christians than we hold with you and you have no control over any happiness any more than a preten \"neutered\" political leader. I will pray for our leaders as the Lord says to. God will hold plenty of sway with you. Let not your heart be troubled (yet).", 
        "reply": " It's this pompous, pretentious crap I love the most from you holy-Joes. I've seen guys like you at intersections, blathering away... one step from the nuthouse.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 10:31:00", 
        "title": "IHS", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by 5727609: You will bow the knee to Christ one day. What you do or think or say holds no more sway with me or other Christians than we hold with you and you have no control over any happiness any more than a preten \"neutered\" political leader. I will pray for our leaders as the Lord says to. God will hold plenty of sway with you. Let not your heart be troubled (yet). It's this pompous, pretentious crap I love the most from you holy-Joes. I've seen guys like you at intersections, blathering away... one step from the nuthouse. Better to be away fro the nuthouse than where you dwell. I'm done with this infantile conversation with the likes of you. You add nothing that has not been heard/ read before.", 
        "intTime": 20090421, 
        "postID": 28, 
        "quote": "Originally posted by billbright: quote: Originally posted by 5727609: You will bow the knee to Christ one day. What you do or think or say holds no more sway with me or other Christians than we hold with you and you have no control over any happiness any more than a preten \"neutered\" political leader. I will pray for our leaders as the Lord says to. God will hold plenty of sway with you. Let not your heart be troubled (yet). It's this pompous, pretentious crap I love the most from you holy-Joes. I've seen guys like you at intersections, blathering away... one step from the nuthouse.", 
        "reply": " Better to be away fro the nuthouse than where you dwell. I'm done with this infantile conversation with the likes of you. You add nothing that has not been heard/ read before.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 10:59:00", 
        "title": "IHS", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: I'm done with this infantile conversation with the likes of you. You add nothing that has not been heard/ read before. Beats what you add.", 
        "intTime": 20090421, 
        "postID": 29, 
        "quote": "I'm done with this infantile conversation with the likes of you. You add nothing that has not been heard/ read before.", 
        "reply": " Beats what you add.", 
        "threadID": "1270031990001_2240060122001", 
        "time": "2009-04-21 11:24:00", 
        "title": "IHS", 
        "userID": "billbright"
    }
]