[
    {
        "content": "\"http://www.boston.com/bostonglobe/editorial_opinion/oped/articles/2009/05/25/war_room_is_no_place_for_bible_study/\" quote: That Defense Secretary Donald Rumsfeld supplied President Bush with Bible-laced Pentagon intelligence briefings might only seem like more Bush-era loopiness, but wait a minute. The deeper, and still current, question is: What in heaven (or, what the hell) is going on inside the US military? Sent by God. Protected by God. Sure to succeed. The righteous nation. A war defined not merely as just, but as holy. Such manifestations are one thing from eccentric religious groups operating on the fringe of the US military, in space guaranteed by freedom of religion. It is another when they show up at the peak of the chain of command - and from inside the intelligence community, which is charged with nothing less than defining the character of America's wars. No matter what the down-players say, this revelation is only the latest of many that show a US military unduly influenced by an extreme kind of Christian evangelicalism. Why should that appall and alarm? Let me suggest a biblical seven reasons: * Single-minded religious zealotry bedevils critical thinking, and not just about religion. Military and political thinking suffers when the righteousness of born-again faith leads to self-righteousness. Critical thinking includes a self-criticism of which the \"saved\" know little. * Military proselytizers use Jesus to build up \"unit cohesion\" by eradicating doubt about the mission, the command, and the self. But doubt - the capacity for second thought - is a military leader's best friend. Commanders, especially, need the skill of skepticism - the opposite of true belief. * Otherworldly religion defining the afterlife as ultimate can undervalue the present life. Religion that looks forward to apocalypse, God's kingdom established by cosmic violence, can help ignite such violence. Armageddon, no mere metaphor now, is the nuclear arsenal. * Religious fundamentalism affirms ideas apart from the context that produced them, reading the Bible literally or dogma ahistorically. Such a mindset can sponsor military fundamentalism, denying the context from which threats arise - refusing to ask, for example, what prompts so many insurgents to become willing suicides? Missing this, we keep producing more. * A military that sees itself as divinely commissioned can all too readily act like God in battle - using mortal force from afar, without personal involvement. An Olympian aloofness makes America's new drone weapon the perfect slayer of civilians. * A bifurcated religious imagination, dividing the world between good and evil, can misread the real character of an \"enemy\" population, many of whom want no part of war with us. * The Middle East is the worst place in which to set loose a military force even partly informed by Christian Zionism, seeing the state of Israel as God's instrument for ushering in the Messianic Age - damning Muslims, while defending Jews for the sake of their eventual destruction. The Pentagon is the wrong place for unbound Christian zealotry, not just because it violates the separation of church and state (and the rights of non-believers in the chain of command), but even more because it is inimical to the prudent use of force. When the history of America's failures in Iraq, and now Afghanistan, is written, expect to find that US military decision-making was made blind by faith. I'm concerned about fundamentalists of any kind running the U.S. military - or the U.S. civilian government, for that matter.", 
        "intTime": 20090528, 
        "postID": 1, 
        "quote": "That Defense Secretary Donald Rumsfeld supplied President Bush with Bible-laced Pentagon intelligence briefings might only seem like more Bush-era loopiness, but wait a minute. The deeper, and still current, question is: What in heaven (or, what the hell) is going on inside the US military? Sent by God. Protected by God. Sure to succeed. The righteous nation. A war defined not merely as just, but as holy. Such manifestations are one thing from eccentric religious groups operating on the fringe of the US military, in space guaranteed by freedom of religion. It is another when they show up at the peak of the chain of command - and from inside the intelligence community, which is charged with nothing less than defining the character of America's wars. No matter what the down-players say, this revelation is only the latest of many that show a US military unduly influenced by an extreme kind of Christian evangelicalism. Why should that appall and alarm? Let me suggest a biblical seven reasons: * Single-minded religious zealotry bedevils critical thinking, and not just about religion. Military and political thinking suffers when the righteousness of born-again faith leads to self-righteousness. Critical thinking includes a self-criticism of which the \"saved\" know little. * Military proselytizers use Jesus to build up \"unit cohesion\" by eradicating doubt about the mission, the command, and the self. But doubt - the capacity for second thought - is a military leader's best friend. Commanders, especially, need the skill of skepticism - the opposite of true belief. * Otherworldly religion defining the afterlife as ultimate can undervalue the present life. Religion that looks forward to apocalypse, God's kingdom established by cosmic violence, can help ignite such violence. Armageddon, no mere metaphor now, is the nuclear arsenal. * Religious fundamentalism affirms ideas apart from the context that produced them, reading the Bible literally or dogma ahistorically. Such a mindset can sponsor military fundamentalism, denying the context from which threats arise - refusing to ask, for example, what prompts so many insurgents to become willing suicides? Missing this, we keep producing more. * A military that sees itself as divinely commissioned can all too readily act like God in battle - using mortal force from afar, without personal involvement. An Olympian aloofness makes America's new drone weapon the perfect slayer of civilians. * A bifurcated religious imagination, dividing the world between good and evil, can misread the real character of an \"enemy\" population, many of whom want no part of war with us. * The Middle East is the worst place in which to set loose a military force even partly informed by Christian Zionism, seeing the state of Israel as God's instrument for ushering in the Messianic Age - damning Muslims, while defending Jews for the sake of their eventual destruction. The Pentagon is the wrong place for unbound Christian zealotry, not just because it violates the separation of church and state (and the rights of non-believers in the chain of command), but even more because it is inimical to the prudent use of force. When the history of America's failures in Iraq, and now Afghanistan, is written, expect to find that US military decision-making was made blind by faith.", 
        "reply": "\"http://www.boston.com/bostonglobe/editorial_opinion/oped/articles/2009/05/25/war_room_is_no_place_for_bible_study/\"  I'm concerned about fundamentalists of any kind running the U.S. military - or the U.S. civilian government, for that matter.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 19:17:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Additionally, fundamentalists who think in that manner will treat Soldiers of other religions with cruelty, negatively impacting unit cohesion, and creating a hostile situation WITHIN the ranks.", 
        "intTime": 20090528, 
        "postID": 2, 
        "quote": "", 
        "reply": "Additionally, fundamentalists who think in that manner will treat Soldiers of other religions with cruelty, negatively impacting unit cohesion, and creating a hostile situation WITHIN the ranks.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 20:14:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Chaplins are still in the military and it is all paid for by the US Tax payer. Thank you. Now go cry to your ACLU lawyer.", 
        "intTime": 20090528, 
        "postID": 3, 
        "quote": "", 
        "reply": "Chaplins are still in the military and it is all paid for by the US Tax payer. Thank you. Now go cry to your ACLU lawyer.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 20:43:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Lonny333"
    }, 
    {
        "content": "quote: Originally posted by Lonny333: Now go cry to your ACLU lawyer. And how is that relevant to religious fundamentalism in the U.S. Military?", 
        "intTime": 20090529, 
        "postID": 4, 
        "quote": "Originally posted by Lonny333: Now go cry to your ACLU lawyer.", 
        "reply": " And how is that relevant to religious fundamentalism in the U.S. Military?", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 03:32:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Glad you asked. About as relevant as the rantings of an ex-Catholic Priest turned novelist who never served a day in uniform. Caroll is a dyed-in-the-wool liberal whose valuable ideas and knowledge of the military wouldn't fill a thimble. An op-ed piece from the Boston Globe? Do you seriously take that at face value? Sullivan013", 
        "intTime": 20090529, 
        "postID": 5, 
        "quote": "", 
        "reply": "Glad you asked. About as relevant as the rantings of an ex-Catholic Priest turned novelist who never served a day in uniform. Caroll is a dyed-in-the-wool liberal whose valuable ideas and knowledge of the military wouldn't fill a thimble. An op-ed piece from the Boston Globe? Do you seriously take that at face value? Sullivan013", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 05:15:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "To say the Boston Globe has a liberal slant is like saying Custer had a bad hair day. Or the eruption of Vesuvius was a real inconvenience for the weekend plans of the people of Pompey and Herculaneum. All three, marvelous in their understatement!! I have read stuff by this guy before and his take is shall we say just a smidgen biased....just a smidgen. He LIVES for the accolades of his \"progressive\" supporters and the palpable teenaged angst ridden, hormonal soupy, tumult in which they prefer to live. Now, when one takes that into account it is easy to dismiss this drivel. BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "intTime": 20090529, 
        "postID": 6, 
        "quote": "", 
        "reply": "To say the Boston Globe has a liberal slant is like saying Custer had a bad hair day. Or the eruption of Vesuvius was a real inconvenience for the weekend plans of the people of Pompey and Herculaneum. All three, marvelous in their understatement!! I have read stuff by this guy before and his take is shall we say just a smidgen biased....just a smidgen. He LIVES for the accolades of his \"progressive\" supporters and the palpable teenaged angst ridden, hormonal soupy, tumult in which they prefer to live. Now, when one takes that into account it is easy to dismiss this drivel. BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 05:44:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T This guy probably is biased, but the dominionist evangelicals trying to take over the US (military) for Jesus started it. You don't have to spin the story to see the facts at hand. The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. If you say the Bible, like Rumsfeld, Bush, and a host of others, then you're an enemy within and if you say a secular democracy, then you're simply supporting the Constitution and current laws as written. Jason", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "Originally posted by tawodi: BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "reply": " This guy probably is biased, but the dominionist evangelicals trying to take over the US (military) for Jesus started it. You don't have to spin the story to see the facts at hand. The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. If you say the Bible, like Rumsfeld, Bush, and a host of others, then you're an enemy within and if you say a secular democracy, then you're simply supporting the Constitution and current laws as written. Jason", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 16:05:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "dday76"
    }, 
    {
        "content": "Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "intTime": 20090530, 
        "postID": 8, 
        "quote": "", 
        "reply": "Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 17:24:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Aye. Dday, Tawodi is a Christian, AND he's also a true American who supports the Constitution. The two are not mutually exclusive. SOME Christians seem to like rewriting the Constitution to suit their religion; Tawodi is not one of them. You're correct about the Dominionists - those Christian sects that would love to impose Biblical law the way that some Muslim nations impose Shari'a law. Those people are a threat to our Constitution and our freedoms. It scares me to think what would happen if enough of them were elected to offices at various levels of government, and whose freedoms they would trample in the name of their version of Christianity. But please, get to know Tawodi a bit more before you jump to assumptions. He may not see the extent of the threat of the Dommies working their way up the chain of command, but he wasn't in the military in recent years, and hasn't experienced it. He'd be one of the first people here to speak out against an injustice or a violation of our Constitutional freedoms.", 
        "intTime": 20090530, 
        "postID": 9, 
        "quote": "Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "reply": " Aye. Dday, Tawodi is a Christian, AND he's also a true American who supports the Constitution. The two are not mutually exclusive. SOME Christians seem to like rewriting the Constitution to suit their religion; Tawodi is not one of them. You're correct about the Dominionists - those Christian sects that would love to impose Biblical law the way that some Muslim nations impose Shari'a law. Those people are a threat to our Constitution and our freedoms. It scares me to think what would happen if enough of them were elected to offices at various levels of government, and whose freedoms they would trample in the name of their version of Christianity. But please, get to know Tawodi a bit more before you jump to assumptions. He may not see the extent of the threat of the Dommies working their way up the chain of command, but he wasn't in the military in recent years, and hasn't experienced it. He'd be one of the first people here to speak out against an injustice or a violation of our Constitutional freedoms.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 17:49:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Doing well, my friend? (I hope!)", 
        "intTime": 20090530, 
        "postID": 10, 
        "quote": "Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "reply": " Doing well, my friend? (I hope!)", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 18:34:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "AKinNC"
    }, 
    {
        "content": "AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "intTime": 20090531, 
        "postID": 11, 
        "quote": "", 
        "reply": "AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 15:24:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "D'DAY; I started a thread a month ago and bumped it just now there is a U.R.L. there that wil take you to my show that I did and the thread is titled \"Religion in the military\" You can see we are on the same page as I said on my post above that you commented on. I acknowledged the \"upward creep in the chain of command that needs to be addressed as well as on the show there is NO DOUBT what my position is. Be well.............Tawodi", 
        "intTime": 20090531, 
        "postID": 12, 
        "quote": "", 
        "reply": "D'DAY; I started a thread a month ago and bumped it just now there is a U.R.L. there that wil take you to my show that I did and the thread is titled \"Religion in the military\" You can see we are on the same page as I said on my post above that you commented on. I acknowledged the \"upward creep in the chain of command that needs to be addressed as well as on the show there is NO DOUBT what my position is. Be well.............Tawodi", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 15:36:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T T, My congratulations to your daughter and TAH407. I am certain that you are proud of their accomplishments. I spent a little bit of my youth summertime around Chatham (Eastham and Orleans, MA). I wish your daughter the best in her journey through the faith. I'm in the PCS mode right now. The house is up for sale and I PCS in July to Germany. If you would, say a prayer for a reasonable buyer. I'll be north of you next month for a few days (Portland, ME), but then come back home to finish my clearing and moving on to the next step of life. Then, I have to pop back up to AK to renew my driver's license! It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "intTime": 20090531, 
        "postID": 13, 
        "quote": "Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "reply": " T, My congratulations to your daughter and TAH407. I am certain that you are proud of their accomplishments. I spent a little bit of my youth summertime around Chatham (Eastham and Orleans, MA). I wish your daughter the best in her journey through the faith. I'm in the PCS mode right now. The house is up for sale and I PCS in July to Germany. If you would, say a prayer for a reasonable buyer. I'll be north of you next month for a few days (Portland, ME), but then come back home to finish my clearing and moving on to the next step of life. Then, I have to pop back up to AK to renew my driver's license! It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 16:19:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "AKinNC"
    }, 
    {
        "content": "quote: Originally posted by dday76: The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Just for the record, that wasn't meant to be a personal attack. It was an honest question, not a rhetorical characterization. I really did want an answer. Also, it was meant to be phrased in the universal, not really 2nd person. To rephrase - \"the question one has to ask oneself\" and so forth. My apologies to all for the confusion. Jason", 
        "intTime": 20090531, 
        "postID": 14, 
        "quote": "Originally posted by dday76: The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy.", 
        "reply": " quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Just for the record, that wasn't meant to be a personal attack. It was an honest question, not a rhetorical characterization. I really did want an answer. Also, it was meant to be phrased in the universal, not really 2nd person. To rephrase - \"the question one has to ask oneself\" and so forth. My apologies to all for the confusion. Jason", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 19:55:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "dday76"
    }, 
    {
        "content": "I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "intTime": 20090531, 
        "postID": 15, 
        "quote": "", 
        "reply": "I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 19:59:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "11933037"
    }, 
    {
        "content": "quote: Originally posted by 11933037: I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America... Good post! Thanks for joining in.", 
        "intTime": 20090531, 
        "postID": 16, 
        "quote": "Originally posted by 11933037: I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "reply": " Good post! Thanks for joining in.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 20:16:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T My congrats as well, Bruce. As a Dad, I know how proud you must feel about your daughter's decision.", 
        "intTime": 20090601, 
        "postID": 17, 
        "quote": "Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "reply": " My congrats as well, Bruce. As a Dad, I know how proud you must feel about your daughter's decision.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 05:18:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK It sounds anything BUT silly!! I count the honor as mine completely, to know you and many of the others here. You have the prayers and the well wishes for a buyer and a safe trip and prosperous P.C.S. RE; Germany. Check out the Holzrichter Inn at the edge of the Black Forest, Bad Wurtzburgh, if you get the a chance while you're there! I include you D'day in those honors T", 
        "intTime": 20090601, 
        "postID": 18, 
        "quote": "It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "reply": " It sounds anything BUT silly!! I count the honor as mine completely, to know you and many of the others here. You have the prayers and the well wishes for a buyer and a safe trip and prosperous P.C.S. RE; Germany. Check out the Holzrichter Inn at the edge of the Black Forest, Bad Wurtzburgh, if you get the a chance while you're there! I include you D'day in those honors T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 06:40:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "11933037; Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. T", 
        "intTime": 20090601, 
        "postID": 19, 
        "quote": "", 
        "reply": "11933037; Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 06:43:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. Numbers here, Just because your people are not on the receiving end anymore does not give you or anyone else the right to prohibit others from having the same rights as you and I are allowed. My wife and I recently sent slogan ideas for equality in the workplace back to some our friends in our hometown. People are still being discriminated against in our country, and the main oppressor is the religious majority. \"The majority, oppressing an individual, is guilty of a crime, abuses its strength, and by acting on the law of the strongest breaks up the foundations of society.\" --Thomas Jefferson to Pierre Samuel Dupont de Nemours, 1816. ME 14:490 \"Those who bear equally the burthens of Government should equally participate of its benefits.\" --Thomas Jefferson: Virginia Resolutions, 1775. Papers 1:172 Food for thought...", 
        "intTime": 20090601, 
        "postID": 20, 
        "quote": "Originally posted by tawodi: Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop.", 
        "reply": " Numbers here, Just because your people are not on the receiving end anymore does not give you or anyone else the right to prohibit others from having the same rights as you and I are allowed. My wife and I recently sent slogan ideas for equality in the workplace back to some our friends in our hometown. People are still being discriminated against in our country, and the main oppressor is the religious majority. \"The majority, oppressing an individual, is guilty of a crime, abuses its strength, and by acting on the law of the strongest breaks up the foundations of society.\" --Thomas Jefferson to Pierre Samuel Dupont de Nemours, 1816. ME 14:490 \"Those who bear equally the burthens of Government should equally participate of its benefits.\" --Thomas Jefferson: Virginia Resolutions, 1775. Papers 1:172 Food for thought...", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 14:19:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Trevlac"
    }, 
    {
        "content": "\"http://www.boston.com/bostonglobe/editorial_opinion/oped/articles/2009/05/25/war_room_is_no_place_for_bible_study/\" quote: That Defense Secretary Donald Rumsfeld supplied President Bush with Bible-laced Pentagon intelligence briefings might only seem like more Bush-era loopiness, but wait a minute. The deeper, and still current, question is: What in heaven (or, what the hell) is going on inside the US military? Sent by God. Protected by God. Sure to succeed. The righteous nation. A war defined not merely as just, but as holy. Such manifestations are one thing from eccentric religious groups operating on the fringe of the US military, in space guaranteed by freedom of religion. It is another when they show up at the peak of the chain of command - and from inside the intelligence community, which is charged with nothing less than defining the character of America's wars. No matter what the down-players say, this revelation is only the latest of many that show a US military unduly influenced by an extreme kind of Christian evangelicalism. Why should that appall and alarm? Let me suggest a biblical seven reasons: * Single-minded religious zealotry bedevils critical thinking, and not just about religion. Military and political thinking suffers when the righteousness of born-again faith leads to self-righteousness. Critical thinking includes a self-criticism of which the \"saved\" know little. * Military proselytizers use Jesus to build up \"unit cohesion\" by eradicating doubt about the mission, the command, and the self. But doubt - the capacity for second thought - is a military leader's best friend. Commanders, especially, need the skill of skepticism - the opposite of true belief. * Otherworldly religion defining the afterlife as ultimate can undervalue the present life. Religion that looks forward to apocalypse, God's kingdom established by cosmic violence, can help ignite such violence. Armageddon, no mere metaphor now, is the nuclear arsenal. * Religious fundamentalism affirms ideas apart from the context that produced them, reading the Bible literally or dogma ahistorically. Such a mindset can sponsor military fundamentalism, denying the context from which threats arise - refusing to ask, for example, what prompts so many insurgents to become willing suicides? Missing this, we keep producing more. * A military that sees itself as divinely commissioned can all too readily act like God in battle - using mortal force from afar, without personal involvement. An Olympian aloofness makes America's new drone weapon the perfect slayer of civilians. * A bifurcated religious imagination, dividing the world between good and evil, can misread the real character of an \"enemy\" population, many of whom want no part of war with us. * The Middle East is the worst place in which to set loose a military force even partly informed by Christian Zionism, seeing the state of Israel as God's instrument for ushering in the Messianic Age - damning Muslims, while defending Jews for the sake of their eventual destruction. The Pentagon is the wrong place for unbound Christian zealotry, not just because it violates the separation of church and state (and the rights of non-believers in the chain of command), but even more because it is inimical to the prudent use of force. When the history of America's failures in Iraq, and now Afghanistan, is written, expect to find that US military decision-making was made blind by faith. I'm concerned about fundamentalists of any kind running the U.S. military - or the U.S. civilian government, for that matter.", 
        "intTime": 20090528, 
        "postID": 31, 
        "quote": "That Defense Secretary Donald Rumsfeld supplied President Bush with Bible-laced Pentagon intelligence briefings might only seem like more Bush-era loopiness, but wait a minute. The deeper, and still current, question is: What in heaven (or, what the hell) is going on inside the US military? Sent by God. Protected by God. Sure to succeed. The righteous nation. A war defined not merely as just, but as holy. Such manifestations are one thing from eccentric religious groups operating on the fringe of the US military, in space guaranteed by freedom of religion. It is another when they show up at the peak of the chain of command - and from inside the intelligence community, which is charged with nothing less than defining the character of America's wars. No matter what the down-players say, this revelation is only the latest of many that show a US military unduly influenced by an extreme kind of Christian evangelicalism. Why should that appall and alarm? Let me suggest a biblical seven reasons: * Single-minded religious zealotry bedevils critical thinking, and not just about religion. Military and political thinking suffers when the righteousness of born-again faith leads to self-righteousness. Critical thinking includes a self-criticism of which the \"saved\" know little. * Military proselytizers use Jesus to build up \"unit cohesion\" by eradicating doubt about the mission, the command, and the self. But doubt - the capacity for second thought - is a military leader's best friend. Commanders, especially, need the skill of skepticism - the opposite of true belief. * Otherworldly religion defining the afterlife as ultimate can undervalue the present life. Religion that looks forward to apocalypse, God's kingdom established by cosmic violence, can help ignite such violence. Armageddon, no mere metaphor now, is the nuclear arsenal. * Religious fundamentalism affirms ideas apart from the context that produced them, reading the Bible literally or dogma ahistorically. Such a mindset can sponsor military fundamentalism, denying the context from which threats arise - refusing to ask, for example, what prompts so many insurgents to become willing suicides? Missing this, we keep producing more. * A military that sees itself as divinely commissioned can all too readily act like God in battle - using mortal force from afar, without personal involvement. An Olympian aloofness makes America's new drone weapon the perfect slayer of civilians. * A bifurcated religious imagination, dividing the world between good and evil, can misread the real character of an \"enemy\" population, many of whom want no part of war with us. * The Middle East is the worst place in which to set loose a military force even partly informed by Christian Zionism, seeing the state of Israel as God's instrument for ushering in the Messianic Age - damning Muslims, while defending Jews for the sake of their eventual destruction. The Pentagon is the wrong place for unbound Christian zealotry, not just because it violates the separation of church and state (and the rights of non-believers in the chain of command), but even more because it is inimical to the prudent use of force. When the history of America's failures in Iraq, and now Afghanistan, is written, expect to find that US military decision-making was made blind by faith.", 
        "reply": "\"http://www.boston.com/bostonglobe/editorial_opinion/oped/articles/2009/05/25/war_room_is_no_place_for_bible_study/\"  I'm concerned about fundamentalists of any kind running the U.S. military - or the U.S. civilian government, for that matter.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 19:17:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Additionally, fundamentalists who think in that manner will treat Soldiers of other religions with cruelty, negatively impacting unit cohesion, and creating a hostile situation WITHIN the ranks.", 
        "intTime": 20090528, 
        "postID": 32, 
        "quote": "", 
        "reply": "Additionally, fundamentalists who think in that manner will treat Soldiers of other religions with cruelty, negatively impacting unit cohesion, and creating a hostile situation WITHIN the ranks.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 20:14:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Chaplins are still in the military and it is all paid for by the US Tax payer. Thank you. Now go cry to your ACLU lawyer.", 
        "intTime": 20090528, 
        "postID": 33, 
        "quote": "", 
        "reply": "Chaplins are still in the military and it is all paid for by the US Tax payer. Thank you. Now go cry to your ACLU lawyer.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 20:43:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Lonny333"
    }, 
    {
        "content": "quote: Originally posted by Lonny333: Now go cry to your ACLU lawyer. And how is that relevant to religious fundamentalism in the U.S. Military?", 
        "intTime": 20090529, 
        "postID": 34, 
        "quote": "Originally posted by Lonny333: Now go cry to your ACLU lawyer.", 
        "reply": " And how is that relevant to religious fundamentalism in the U.S. Military?", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 03:32:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Glad you asked. About as relevant as the rantings of an ex-Catholic Priest turned novelist who never served a day in uniform. Caroll is a dyed-in-the-wool liberal whose valuable ideas and knowledge of the military wouldn't fill a thimble. An op-ed piece from the Boston Globe? Do you seriously take that at face value? Sullivan013", 
        "intTime": 20090529, 
        "postID": 35, 
        "quote": "", 
        "reply": "Glad you asked. About as relevant as the rantings of an ex-Catholic Priest turned novelist who never served a day in uniform. Caroll is a dyed-in-the-wool liberal whose valuable ideas and knowledge of the military wouldn't fill a thimble. An op-ed piece from the Boston Globe? Do you seriously take that at face value? Sullivan013", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 05:15:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "To say the Boston Globe has a liberal slant is like saying Custer had a bad hair day. Or the eruption of Vesuvius was a real inconvenience for the weekend plans of the people of Pompey and Herculaneum. All three, marvelous in their understatement!! I have read stuff by this guy before and his take is shall we say just a smidgen biased....just a smidgen. He LIVES for the accolades of his \"progressive\" supporters and the palpable teenaged angst ridden, hormonal soupy, tumult in which they prefer to live. Now, when one takes that into account it is easy to dismiss this drivel. BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "intTime": 20090529, 
        "postID": 36, 
        "quote": "", 
        "reply": "To say the Boston Globe has a liberal slant is like saying Custer had a bad hair day. Or the eruption of Vesuvius was a real inconvenience for the weekend plans of the people of Pompey and Herculaneum. All three, marvelous in their understatement!! I have read stuff by this guy before and his take is shall we say just a smidgen biased....just a smidgen. He LIVES for the accolades of his \"progressive\" supporters and the palpable teenaged angst ridden, hormonal soupy, tumult in which they prefer to live. Now, when one takes that into account it is easy to dismiss this drivel. BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 05:44:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T This guy probably is biased, but the dominionist evangelicals trying to take over the US (military) for Jesus started it. You don't have to spin the story to see the facts at hand. The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. If you say the Bible, like Rumsfeld, Bush, and a host of others, then you're an enemy within and if you say a secular democracy, then you're simply supporting the Constitution and current laws as written. Jason", 
        "intTime": 20090530, 
        "postID": 37, 
        "quote": "Originally posted by tawodi: BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "reply": " This guy probably is biased, but the dominionist evangelicals trying to take over the US (military) for Jesus started it. You don't have to spin the story to see the facts at hand. The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. If you say the Bible, like Rumsfeld, Bush, and a host of others, then you're an enemy within and if you say a secular democracy, then you're simply supporting the Constitution and current laws as written. Jason", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 16:05:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "dday76"
    }, 
    {
        "content": "Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "intTime": 20090530, 
        "postID": 38, 
        "quote": "", 
        "reply": "Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 17:24:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Aye. Dday, Tawodi is a Christian, AND he's also a true American who supports the Constitution. The two are not mutually exclusive. SOME Christians seem to like rewriting the Constitution to suit their religion; Tawodi is not one of them. You're correct about the Dominionists - those Christian sects that would love to impose Biblical law the way that some Muslim nations impose Shari'a law. Those people are a threat to our Constitution and our freedoms. It scares me to think what would happen if enough of them were elected to offices at various levels of government, and whose freedoms they would trample in the name of their version of Christianity. But please, get to know Tawodi a bit more before you jump to assumptions. He may not see the extent of the threat of the Dommies working their way up the chain of command, but he wasn't in the military in recent years, and hasn't experienced it. He'd be one of the first people here to speak out against an injustice or a violation of our Constitutional freedoms.", 
        "intTime": 20090530, 
        "postID": 39, 
        "quote": "Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "reply": " Aye. Dday, Tawodi is a Christian, AND he's also a true American who supports the Constitution. The two are not mutually exclusive. SOME Christians seem to like rewriting the Constitution to suit their religion; Tawodi is not one of them. You're correct about the Dominionists - those Christian sects that would love to impose Biblical law the way that some Muslim nations impose Shari'a law. Those people are a threat to our Constitution and our freedoms. It scares me to think what would happen if enough of them were elected to offices at various levels of government, and whose freedoms they would trample in the name of their version of Christianity. But please, get to know Tawodi a bit more before you jump to assumptions. He may not see the extent of the threat of the Dommies working their way up the chain of command, but he wasn't in the military in recent years, and hasn't experienced it. He'd be one of the first people here to speak out against an injustice or a violation of our Constitutional freedoms.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 17:49:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Doing well, my friend? (I hope!)", 
        "intTime": 20090530, 
        "postID": 40, 
        "quote": "Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "reply": " Doing well, my friend? (I hope!)", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 18:34:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "AKinNC"
    }, 
    {
        "content": "AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "intTime": 20090531, 
        "postID": 41, 
        "quote": "", 
        "reply": "AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 15:24:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "D'DAY; I started a thread a month ago and bumped it just now there is a U.R.L. there that wil take you to my show that I did and the thread is titled \"Religion in the military\" You can see we are on the same page as I said on my post above that you commented on. I acknowledged the \"upward creep in the chain of command that needs to be addressed as well as on the show there is NO DOUBT what my position is. Be well.............Tawodi", 
        "intTime": 20090531, 
        "postID": 42, 
        "quote": "", 
        "reply": "D'DAY; I started a thread a month ago and bumped it just now there is a U.R.L. there that wil take you to my show that I did and the thread is titled \"Religion in the military\" You can see we are on the same page as I said on my post above that you commented on. I acknowledged the \"upward creep in the chain of command that needs to be addressed as well as on the show there is NO DOUBT what my position is. Be well.............Tawodi", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 15:36:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T T, My congratulations to your daughter and TAH407. I am certain that you are proud of their accomplishments. I spent a little bit of my youth summertime around Chatham (Eastham and Orleans, MA). I wish your daughter the best in her journey through the faith. I'm in the PCS mode right now. The house is up for sale and I PCS in July to Germany. If you would, say a prayer for a reasonable buyer. I'll be north of you next month for a few days (Portland, ME), but then come back home to finish my clearing and moving on to the next step of life. Then, I have to pop back up to AK to renew my driver's license! It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "intTime": 20090531, 
        "postID": 43, 
        "quote": "Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "reply": " T, My congratulations to your daughter and TAH407. I am certain that you are proud of their accomplishments. I spent a little bit of my youth summertime around Chatham (Eastham and Orleans, MA). I wish your daughter the best in her journey through the faith. I'm in the PCS mode right now. The house is up for sale and I PCS in July to Germany. If you would, say a prayer for a reasonable buyer. I'll be north of you next month for a few days (Portland, ME), but then come back home to finish my clearing and moving on to the next step of life. Then, I have to pop back up to AK to renew my driver's license! It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 16:19:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "AKinNC"
    }, 
    {
        "content": "quote: Originally posted by dday76: The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Just for the record, that wasn't meant to be a personal attack. It was an honest question, not a rhetorical characterization. I really did want an answer. Also, it was meant to be phrased in the universal, not really 2nd person. To rephrase - \"the question one has to ask oneself\" and so forth. My apologies to all for the confusion. Jason", 
        "intTime": 20090531, 
        "postID": 44, 
        "quote": "Originally posted by dday76: The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy.", 
        "reply": " quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Just for the record, that wasn't meant to be a personal attack. It was an honest question, not a rhetorical characterization. I really did want an answer. Also, it was meant to be phrased in the universal, not really 2nd person. To rephrase - \"the question one has to ask oneself\" and so forth. My apologies to all for the confusion. Jason", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 19:55:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "dday76"
    }, 
    {
        "content": "I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "intTime": 20090531, 
        "postID": 45, 
        "quote": "", 
        "reply": "I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 19:59:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "11933037"
    }, 
    {
        "content": "quote: Originally posted by 11933037: I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America... Good post! Thanks for joining in.", 
        "intTime": 20090531, 
        "postID": 46, 
        "quote": "Originally posted by 11933037: I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "reply": " Good post! Thanks for joining in.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 20:16:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T My congrats as well, Bruce. As a Dad, I know how proud you must feel about your daughter's decision.", 
        "intTime": 20090601, 
        "postID": 47, 
        "quote": "Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "reply": " My congrats as well, Bruce. As a Dad, I know how proud you must feel about your daughter's decision.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 05:18:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK It sounds anything BUT silly!! I count the honor as mine completely, to know you and many of the others here. You have the prayers and the well wishes for a buyer and a safe trip and prosperous P.C.S. RE; Germany. Check out the Holzrichter Inn at the edge of the Black Forest, Bad Wurtzburgh, if you get the a chance while you're there! I include you D'day in those honors T", 
        "intTime": 20090601, 
        "postID": 48, 
        "quote": "It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "reply": " It sounds anything BUT silly!! I count the honor as mine completely, to know you and many of the others here. You have the prayers and the well wishes for a buyer and a safe trip and prosperous P.C.S. RE; Germany. Check out the Holzrichter Inn at the edge of the Black Forest, Bad Wurtzburgh, if you get the a chance while you're there! I include you D'day in those honors T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 06:40:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "11933037; Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. T", 
        "intTime": 20090601, 
        "postID": 49, 
        "quote": "", 
        "reply": "11933037; Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 06:43:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. Numbers here, Just because your people are not on the receiving end anymore does not give you or anyone else the right to prohibit others from having the same rights as you and I are allowed. My wife and I recently sent slogan ideas for equality in the workplace back to some our friends in our hometown. People are still being discriminated against in our country, and the main oppressor is the religious majority. \"The majority, oppressing an individual, is guilty of a crime, abuses its strength, and by acting on the law of the strongest breaks up the foundations of society.\" --Thomas Jefferson to Pierre Samuel Dupont de Nemours, 1816. ME 14:490 \"Those who bear equally the burthens of Government should equally participate of its benefits.\" --Thomas Jefferson: Virginia Resolutions, 1775. Papers 1:172 Food for thought...", 
        "intTime": 20090601, 
        "postID": 50, 
        "quote": "Originally posted by tawodi: Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop.", 
        "reply": " Numbers here, Just because your people are not on the receiving end anymore does not give you or anyone else the right to prohibit others from having the same rights as you and I are allowed. My wife and I recently sent slogan ideas for equality in the workplace back to some our friends in our hometown. People are still being discriminated against in our country, and the main oppressor is the religious majority. \"The majority, oppressing an individual, is guilty of a crime, abuses its strength, and by acting on the law of the strongest breaks up the foundations of society.\" --Thomas Jefferson to Pierre Samuel Dupont de Nemours, 1816. ME 14:490 \"Those who bear equally the burthens of Government should equally participate of its benefits.\" --Thomas Jefferson: Virginia Resolutions, 1775. Papers 1:172 Food for thought...", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 14:19:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Trevlac"
    }, 
    {
        "content": "\"http://www.boston.com/bostonglobe/editorial_opinion/oped/articles/2009/05/25/war_room_is_no_place_for_bible_study/\" quote: That Defense Secretary Donald Rumsfeld supplied President Bush with Bible-laced Pentagon intelligence briefings might only seem like more Bush-era loopiness, but wait a minute. The deeper, and still current, question is: What in heaven (or, what the hell) is going on inside the US military? Sent by God. Protected by God. Sure to succeed. The righteous nation. A war defined not merely as just, but as holy. Such manifestations are one thing from eccentric religious groups operating on the fringe of the US military, in space guaranteed by freedom of religion. It is another when they show up at the peak of the chain of command - and from inside the intelligence community, which is charged with nothing less than defining the character of America's wars. No matter what the down-players say, this revelation is only the latest of many that show a US military unduly influenced by an extreme kind of Christian evangelicalism. Why should that appall and alarm? Let me suggest a biblical seven reasons: * Single-minded religious zealotry bedevils critical thinking, and not just about religion. Military and political thinking suffers when the righteousness of born-again faith leads to self-righteousness. Critical thinking includes a self-criticism of which the \"saved\" know little. * Military proselytizers use Jesus to build up \"unit cohesion\" by eradicating doubt about the mission, the command, and the self. But doubt - the capacity for second thought - is a military leader's best friend. Commanders, especially, need the skill of skepticism - the opposite of true belief. * Otherworldly religion defining the afterlife as ultimate can undervalue the present life. Religion that looks forward to apocalypse, God's kingdom established by cosmic violence, can help ignite such violence. Armageddon, no mere metaphor now, is the nuclear arsenal. * Religious fundamentalism affirms ideas apart from the context that produced them, reading the Bible literally or dogma ahistorically. Such a mindset can sponsor military fundamentalism, denying the context from which threats arise - refusing to ask, for example, what prompts so many insurgents to become willing suicides? Missing this, we keep producing more. * A military that sees itself as divinely commissioned can all too readily act like God in battle - using mortal force from afar, without personal involvement. An Olympian aloofness makes America's new drone weapon the perfect slayer of civilians. * A bifurcated religious imagination, dividing the world between good and evil, can misread the real character of an \"enemy\" population, many of whom want no part of war with us. * The Middle East is the worst place in which to set loose a military force even partly informed by Christian Zionism, seeing the state of Israel as God's instrument for ushering in the Messianic Age - damning Muslims, while defending Jews for the sake of their eventual destruction. The Pentagon is the wrong place for unbound Christian zealotry, not just because it violates the separation of church and state (and the rights of non-believers in the chain of command), but even more because it is inimical to the prudent use of force. When the history of America's failures in Iraq, and now Afghanistan, is written, expect to find that US military decision-making was made blind by faith. I'm concerned about fundamentalists of any kind running the U.S. military - or the U.S. civilian government, for that matter.", 
        "intTime": 20090528, 
        "postID": 61, 
        "quote": "That Defense Secretary Donald Rumsfeld supplied President Bush with Bible-laced Pentagon intelligence briefings might only seem like more Bush-era loopiness, but wait a minute. The deeper, and still current, question is: What in heaven (or, what the hell) is going on inside the US military? Sent by God. Protected by God. Sure to succeed. The righteous nation. A war defined not merely as just, but as holy. Such manifestations are one thing from eccentric religious groups operating on the fringe of the US military, in space guaranteed by freedom of religion. It is another when they show up at the peak of the chain of command - and from inside the intelligence community, which is charged with nothing less than defining the character of America's wars. No matter what the down-players say, this revelation is only the latest of many that show a US military unduly influenced by an extreme kind of Christian evangelicalism. Why should that appall and alarm? Let me suggest a biblical seven reasons: * Single-minded religious zealotry bedevils critical thinking, and not just about religion. Military and political thinking suffers when the righteousness of born-again faith leads to self-righteousness. Critical thinking includes a self-criticism of which the \"saved\" know little. * Military proselytizers use Jesus to build up \"unit cohesion\" by eradicating doubt about the mission, the command, and the self. But doubt - the capacity for second thought - is a military leader's best friend. Commanders, especially, need the skill of skepticism - the opposite of true belief. * Otherworldly religion defining the afterlife as ultimate can undervalue the present life. Religion that looks forward to apocalypse, God's kingdom established by cosmic violence, can help ignite such violence. Armageddon, no mere metaphor now, is the nuclear arsenal. * Religious fundamentalism affirms ideas apart from the context that produced them, reading the Bible literally or dogma ahistorically. Such a mindset can sponsor military fundamentalism, denying the context from which threats arise - refusing to ask, for example, what prompts so many insurgents to become willing suicides? Missing this, we keep producing more. * A military that sees itself as divinely commissioned can all too readily act like God in battle - using mortal force from afar, without personal involvement. An Olympian aloofness makes America's new drone weapon the perfect slayer of civilians. * A bifurcated religious imagination, dividing the world between good and evil, can misread the real character of an \"enemy\" population, many of whom want no part of war with us. * The Middle East is the worst place in which to set loose a military force even partly informed by Christian Zionism, seeing the state of Israel as God's instrument for ushering in the Messianic Age - damning Muslims, while defending Jews for the sake of their eventual destruction. The Pentagon is the wrong place for unbound Christian zealotry, not just because it violates the separation of church and state (and the rights of non-believers in the chain of command), but even more because it is inimical to the prudent use of force. When the history of America's failures in Iraq, and now Afghanistan, is written, expect to find that US military decision-making was made blind by faith.", 
        "reply": "\"http://www.boston.com/bostonglobe/editorial_opinion/oped/articles/2009/05/25/war_room_is_no_place_for_bible_study/\"  I'm concerned about fundamentalists of any kind running the U.S. military - or the U.S. civilian government, for that matter.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 19:17:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Additionally, fundamentalists who think in that manner will treat Soldiers of other religions with cruelty, negatively impacting unit cohesion, and creating a hostile situation WITHIN the ranks.", 
        "intTime": 20090528, 
        "postID": 62, 
        "quote": "", 
        "reply": "Additionally, fundamentalists who think in that manner will treat Soldiers of other religions with cruelty, negatively impacting unit cohesion, and creating a hostile situation WITHIN the ranks.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 20:14:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Chaplins are still in the military and it is all paid for by the US Tax payer. Thank you. Now go cry to your ACLU lawyer.", 
        "intTime": 20090528, 
        "postID": 63, 
        "quote": "", 
        "reply": "Chaplins are still in the military and it is all paid for by the US Tax payer. Thank you. Now go cry to your ACLU lawyer.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-28 20:43:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Lonny333"
    }, 
    {
        "content": "quote: Originally posted by Lonny333: Now go cry to your ACLU lawyer. And how is that relevant to religious fundamentalism in the U.S. Military?", 
        "intTime": 20090529, 
        "postID": 64, 
        "quote": "Originally posted by Lonny333: Now go cry to your ACLU lawyer.", 
        "reply": " And how is that relevant to religious fundamentalism in the U.S. Military?", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 03:32:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Glad you asked. About as relevant as the rantings of an ex-Catholic Priest turned novelist who never served a day in uniform. Caroll is a dyed-in-the-wool liberal whose valuable ideas and knowledge of the military wouldn't fill a thimble. An op-ed piece from the Boston Globe? Do you seriously take that at face value? Sullivan013", 
        "intTime": 20090529, 
        "postID": 65, 
        "quote": "", 
        "reply": "Glad you asked. About as relevant as the rantings of an ex-Catholic Priest turned novelist who never served a day in uniform. Caroll is a dyed-in-the-wool liberal whose valuable ideas and knowledge of the military wouldn't fill a thimble. An op-ed piece from the Boston Globe? Do you seriously take that at face value? Sullivan013", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 05:15:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "To say the Boston Globe has a liberal slant is like saying Custer had a bad hair day. Or the eruption of Vesuvius was a real inconvenience for the weekend plans of the people of Pompey and Herculaneum. All three, marvelous in their understatement!! I have read stuff by this guy before and his take is shall we say just a smidgen biased....just a smidgen. He LIVES for the accolades of his \"progressive\" supporters and the palpable teenaged angst ridden, hormonal soupy, tumult in which they prefer to live. Now, when one takes that into account it is easy to dismiss this drivel. BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "intTime": 20090529, 
        "postID": 66, 
        "quote": "", 
        "reply": "To say the Boston Globe has a liberal slant is like saying Custer had a bad hair day. Or the eruption of Vesuvius was a real inconvenience for the weekend plans of the people of Pompey and Herculaneum. All three, marvelous in their understatement!! I have read stuff by this guy before and his take is shall we say just a smidgen biased....just a smidgen. He LIVES for the accolades of his \"progressive\" supporters and the palpable teenaged angst ridden, hormonal soupy, tumult in which they prefer to live. Now, when one takes that into account it is easy to dismiss this drivel. BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-29 05:44:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T This guy probably is biased, but the dominionist evangelicals trying to take over the US (military) for Jesus started it. You don't have to spin the story to see the facts at hand. The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. If you say the Bible, like Rumsfeld, Bush, and a host of others, then you're an enemy within and if you say a secular democracy, then you're simply supporting the Constitution and current laws as written. Jason", 
        "intTime": 20090530, 
        "postID": 67, 
        "quote": "Originally posted by tawodi: BUT!! That is not to say that the evangelicals are not pushy as all hell!! Their influence is divisive within individual units. The \"upward creep\" into the chains of command needs to be curtailed as well, but this isn't the way to do it. T", 
        "reply": " This guy probably is biased, but the dominionist evangelicals trying to take over the US (military) for Jesus started it. You don't have to spin the story to see the facts at hand. The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. If you say the Bible, like Rumsfeld, Bush, and a host of others, then you're an enemy within and if you say a secular democracy, then you're simply supporting the Constitution and current laws as written. Jason", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 16:05:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "dday76"
    }, 
    {
        "content": "Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "intTime": 20090530, 
        "postID": 68, 
        "quote": "", 
        "reply": "Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 17:24:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Aye. Dday, Tawodi is a Christian, AND he's also a true American who supports the Constitution. The two are not mutually exclusive. SOME Christians seem to like rewriting the Constitution to suit their religion; Tawodi is not one of them. You're correct about the Dominionists - those Christian sects that would love to impose Biblical law the way that some Muslim nations impose Shari'a law. Those people are a threat to our Constitution and our freedoms. It scares me to think what would happen if enough of them were elected to offices at various levels of government, and whose freedoms they would trample in the name of their version of Christianity. But please, get to know Tawodi a bit more before you jump to assumptions. He may not see the extent of the threat of the Dommies working their way up the chain of command, but he wasn't in the military in recent years, and hasn't experienced it. He'd be one of the first people here to speak out against an injustice or a violation of our Constitutional freedoms.", 
        "intTime": 20090530, 
        "postID": 69, 
        "quote": "Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "reply": " Aye. Dday, Tawodi is a Christian, AND he's also a true American who supports the Constitution. The two are not mutually exclusive. SOME Christians seem to like rewriting the Constitution to suit their religion; Tawodi is not one of them. You're correct about the Dominionists - those Christian sects that would love to impose Biblical law the way that some Muslim nations impose Shari'a law. Those people are a threat to our Constitution and our freedoms. It scares me to think what would happen if enough of them were elected to offices at various levels of government, and whose freedoms they would trample in the name of their version of Christianity. But please, get to know Tawodi a bit more before you jump to assumptions. He may not see the extent of the threat of the Dommies working their way up the chain of command, but he wasn't in the military in recent years, and hasn't experienced it. He'd be one of the first people here to speak out against an injustice or a violation of our Constitutional freedoms.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 17:49:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Doing well, my friend? (I hope!)", 
        "intTime": 20090530, 
        "postID": 70, 
        "quote": "Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T", 
        "reply": " Doing well, my friend? (I hope!)", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-30 18:34:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "AKinNC"
    }, 
    {
        "content": "AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "intTime": 20090531, 
        "postID": 71, 
        "quote": "", 
        "reply": "AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 15:24:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "D'DAY; I started a thread a month ago and bumped it just now there is a U.R.L. there that wil take you to my show that I did and the thread is titled \"Religion in the military\" You can see we are on the same page as I said on my post above that you commented on. I acknowledged the \"upward creep in the chain of command that needs to be addressed as well as on the show there is NO DOUBT what my position is. Be well.............Tawodi", 
        "intTime": 20090531, 
        "postID": 72, 
        "quote": "", 
        "reply": "D'DAY; I started a thread a month ago and bumped it just now there is a U.R.L. there that wil take you to my show that I did and the thread is titled \"Religion in the military\" You can see we are on the same page as I said on my post above that you commented on. I acknowledged the \"upward creep in the chain of command that needs to be addressed as well as on the show there is NO DOUBT what my position is. Be well.............Tawodi", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 15:36:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T T, My congratulations to your daughter and TAH407. I am certain that you are proud of their accomplishments. I spent a little bit of my youth summertime around Chatham (Eastham and Orleans, MA). I wish your daughter the best in her journey through the faith. I'm in the PCS mode right now. The house is up for sale and I PCS in July to Germany. If you would, say a prayer for a reasonable buyer. I'll be north of you next month for a few days (Portland, ME), but then come back home to finish my clearing and moving on to the next step of life. Then, I have to pop back up to AK to renew my driver's license! It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "intTime": 20090531, 
        "postID": 73, 
        "quote": "Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "reply": " T, My congratulations to your daughter and TAH407. I am certain that you are proud of their accomplishments. I spent a little bit of my youth summertime around Chatham (Eastham and Orleans, MA). I wish your daughter the best in her journey through the faith. I'm in the PCS mode right now. The house is up for sale and I PCS in July to Germany. If you would, say a prayer for a reasonable buyer. I'll be north of you next month for a few days (Portland, ME), but then come back home to finish my clearing and moving on to the next step of life. Then, I have to pop back up to AK to renew my driver's license! It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 16:19:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "AKinNC"
    }, 
    {
        "content": "quote: Originally posted by dday76: The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy. quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Just for the record, that wasn't meant to be a personal attack. It was an honest question, not a rhetorical characterization. I really did want an answer. Also, it was meant to be phrased in the universal, not really 2nd person. To rephrase - \"the question one has to ask oneself\" and so forth. My apologies to all for the confusion. Jason", 
        "intTime": 20090531, 
        "postID": 74, 
        "quote": "Originally posted by dday76: The question you have to ask yourself is if you think it's a good thing or not a good thing for US law and policy to be executed according to the Christian Bible rather than secular democracy.", 
        "reply": " quote: Originally posted by tawodi: Take a look around and find a place, or time, when I have done anything else, but support the constitution. T Just for the record, that wasn't meant to be a personal attack. It was an honest question, not a rhetorical characterization. I really did want an answer. Also, it was meant to be phrased in the universal, not really 2nd person. To rephrase - \"the question one has to ask oneself\" and so forth. My apologies to all for the confusion. Jason", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 19:55:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "dday76"
    }, 
    {
        "content": "I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "intTime": 20090531, 
        "postID": 75, 
        "quote": "", 
        "reply": "I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 19:59:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "11933037"
    }, 
    {
        "content": "quote: Originally posted by 11933037: I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America... Good post! Thanks for joining in.", 
        "intTime": 20090531, 
        "postID": 76, 
        "quote": "Originally posted by 11933037: I'm a bit concerned about how much religious pressure is put on us in a government organization that is supposedly operating under the guise of religious freedom. As an enlisted member, I was required to go to a (Christian) religious-based service for unaccompanied Soldiers in Korea. While going through WOCS, not only did we have a (Christian) Chaplain come and \"motivate\" us with stories from his holy book, but the only people allowed to visit with their families during the course were those that went to church. All of the \"heathens\" were left back at the barracks performing labor while the others were holding hands and hugging their loved ones. After the first week, this atheist decided to give church a try... What defense is there for these mandatory religious events that we have been subjected to? We're still WAY behind as far as equal rights in this country because of a religious majority. My marriage wasn't legal in all states until 1967, and now I'm seeing others being denied their rights based on the same platform that upheld slavery, hindered women's suffrage, and prohibited inter-racial marriage. Apparently a homosexual isn't good enough to volunteer to take a bullet like the rest of us either! Oh, America...", 
        "reply": " Good post! Thanks for joining in.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-05-31 20:16:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T My congrats as well, Bruce. As a Dad, I know how proud you must feel about your daughter's decision.", 
        "intTime": 20090601, 
        "postID": 77, 
        "quote": "Originally posted by tawodi: AK; I've had a marvelous day today!! My Daughter was confirmed in faith. In the First United methodist Church of chatham Massachusetts this morning. She did us proud I gots to tell ya!! Our friend yours and mine C.J. Tillinghast was also Ordained today out his way (of TAH407 fame!!) So two great people in service today YAY!! Hope you are well also and settling in after your trip....how was it by the way?? T", 
        "reply": " My congrats as well, Bruce. As a Dad, I know how proud you must feel about your daughter's decision.", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 05:18:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK It sounds anything BUT silly!! I count the honor as mine completely, to know you and many of the others here. You have the prayers and the well wishes for a buyer and a safe trip and prosperous P.C.S. RE; Germany. Check out the Holzrichter Inn at the edge of the Black Forest, Bad Wurtzburgh, if you get the a chance while you're there! I include you D'day in those honors T", 
        "intTime": 20090601, 
        "postID": 78, 
        "quote": "It may sound silly, but as always, it is an honor to name you as a friend and mentor. I wish you all the best and I absolutely enjoy our dialogue. I wish all the blessings in the world upon you and your family. Your friend, AK", 
        "reply": " It sounds anything BUT silly!! I count the honor as mine completely, to know you and many of the others here. You have the prayers and the well wishes for a buyer and a safe trip and prosperous P.C.S. RE; Germany. Check out the Holzrichter Inn at the edge of the Black Forest, Bad Wurtzburgh, if you get the a chance while you're there! I include you D'day in those honors T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 06:40:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "11933037; Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. T", 
        "intTime": 20090601, 
        "postID": 79, 
        "quote": "", 
        "reply": "11933037; Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. T", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 06:43:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop. Numbers here, Just because your people are not on the receiving end anymore does not give you or anyone else the right to prohibit others from having the same rights as you and I are allowed. My wife and I recently sent slogan ideas for equality in the workplace back to some our friends in our hometown. People are still being discriminated against in our country, and the main oppressor is the religious majority. \"The majority, oppressing an individual, is guilty of a crime, abuses its strength, and by acting on the law of the strongest breaks up the foundations of society.\" --Thomas Jefferson to Pierre Samuel Dupont de Nemours, 1816. ME 14:490 \"Those who bear equally the burthens of Government should equally participate of its benefits.\" --Thomas Jefferson: Virginia Resolutions, 1775. Papers 1:172 Food for thought...", 
        "intTime": 20090601, 
        "postID": 80, 
        "quote": "Originally posted by tawodi: Welcome to the threads numbers, but don't feel bad, they were still shooting my people like rabbits in the early twentieth century At least that is one thing Nixon helped stop.", 
        "reply": " Numbers here, Just because your people are not on the receiving end anymore does not give you or anyone else the right to prohibit others from having the same rights as you and I are allowed. My wife and I recently sent slogan ideas for equality in the workplace back to some our friends in our hometown. People are still being discriminated against in our country, and the main oppressor is the religious majority. \"The majority, oppressing an individual, is guilty of a crime, abuses its strength, and by acting on the law of the strongest breaks up the foundations of society.\" --Thomas Jefferson to Pierre Samuel Dupont de Nemours, 1816. ME 14:490 \"Those who bear equally the burthens of Government should equally participate of its benefits.\" --Thomas Jefferson: Virginia Resolutions, 1775. Papers 1:172 Food for thought...", 
        "threadID": "1270031990001_8620055422001", 
        "time": "2009-06-01 14:19:00", 
        "title": "Is the evangelical fundamentalist in the U.S. military an \"enemy within\"?", 
        "userID": "Trevlac"
    }
]