[
    {
        "content": "Transcendentalists seem to believe that there is ethereal structure outside the physical... that there are structures of good and evil, of beauty and ugly, of... whatever... similar to actual, physical structures that can be observed, touched, heard, or felt. There seems to be constant friction among them because some feel that these things are godly in origin and some find them to be merely the workings of physical neurology. How feeleth the society of great military free-thinkers about this?", 
        "intTime": 20090424, 
        "postID": 1, 
        "quote": "", 
        "reply": "Transcendentalists seem to believe that there is ethereal structure outside the physical... that there are structures of good and evil, of beauty and ugly, of... whatever... similar to actual, physical structures that can be observed, touched, heard, or felt. There seems to be constant friction among them because some feel that these things are godly in origin and some find them to be merely the workings of physical neurology. How feeleth the society of great military free-thinkers about this?", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-24 10:30:00", 
        "title": "Transcendentalism", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Transcendentalists seem to believe that there is ethereal structure outside the physical... that there are structures of good and evil, of beauty and ugly, of... whatever... similar to actual, physical structures that can be observed, touched, heard, or felt. There seems to be constant friction among them because some feel that these things are godly in origin and some find them to be merely the workings of physical neurology. How feeleth the society of great military free-thinkers about this? Meh! Whatever get's them through the day, I suppose! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090424, 
        "postID": 2, 
        "quote": "Originally posted by billbright: Transcendentalists seem to believe that there is ethereal structure outside the physical... that there are structures of good and evil, of beauty and ugly, of... whatever... similar to actual, physical structures that can be observed, touched, heard, or felt. There seems to be constant friction among them because some feel that these things are godly in origin and some find them to be merely the workings of physical neurology. How feeleth the society of great military free-thinkers about this?", 
        "reply": " Meh! Whatever get's them through the day, I suppose! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-24 15:21:00", 
        "title": "Transcendentalism", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by billbright: Transcendentalists seem to believe that there is ethereal structure outside the physical... that there are structures of good and evil, of beauty and ugly, of... whatever... similar to actual, physical structures that can be observed, touched, heard, or felt. There seems to be constant friction among them because some feel that these things are godly in origin and some find them to be merely the workings of physical neurology. How feeleth the society of great military free-thinkers about this? Meh! Whatever get's them through the day, I suppose! Yep, I generally feel the same way about TM. They are not 'pushy' nor are they 'terrorizing' the citizenry with a big bad god thing coming to straighten us out. As far as what they believe, it's just their imagination. Like any of the rest. TM was a big thing in the 1960s when I was a young man and some of my friends got 'into it' (Beatles enthusiasts, of course - but it didn't last... much like any other 'trip' they were on. Is that still the same TM?) There are a lot of NRMs (New Religious Movements) since the 1960s. Humans can believe anything.", 
        "intTime": 20090424, 
        "postID": 3, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by billbright: Transcendentalists seem to believe that there is ethereal structure outside the physical... that there are structures of good and evil, of beauty and ugly, of... whatever... similar to actual, physical structures that can be observed, touched, heard, or felt. There seems to be constant friction among them because some feel that these things are godly in origin and some find them to be merely the workings of physical neurology. How feeleth the society of great military free-thinkers about this? Meh! Whatever get's them through the day, I suppose!", 
        "reply": " Yep, I generally feel the same way about TM. They are not 'pushy' nor are they 'terrorizing' the citizenry with a big bad god thing coming to straighten us out. As far as what they believe, it's just their imagination. Like any of the rest. TM was a big thing in the 1960s when I was a young man and some of my friends got 'into it' (Beatles enthusiasts, of course - but it didn't last... much like any other 'trip' they were on. Is that still the same TM?) There are a lot of NRMs (New Religious Movements) since the 1960s. Humans can believe anything.", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-24 20:30:00", 
        "title": "Transcendentalism", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by KJ1110: quote: Originally posted by billbright: Transcendentalists seem to believe that there is ethereal structure outside the physical... that there are structures of good and evil, of beauty and ugly, of... whatever... similar to actual, physical structures that can be observed, touched, heard, or felt. There seems to be constant friction among them because some feel that these things are godly in origin and some find them to be merely the workings of physical neurology. How feeleth the society of great military free-thinkers about this? Meh! Whatever get's them through the day, I suppose! Yep, I generally feel the same way about TM. They are not 'pushy' nor are they 'terrorizing' the citizenry with a big bad god thing coming to straighten us out. As far as what they believe, it's just their imagination. Like any of the rest. TM was a big thing in the 1960s when I was a young man and some of my friends got 'into it' (Beatles enthusiasts, of course - but it didn't last... much like any other 'trip' they were on. Is that still the same TM?) There are a lot of NRMs (New Religious Movements) since the 1960s. Humans can believe anything. Yep! I got a Sister living on the west coast who was heavy into new age stuff, tm, hypnotherapy (certified), etc., etc. She wasn't a Hippie by any means, but definately the \"Blue-fuzzy\" type of person! I kept expecting to get a post card from her from one of the Wicker-man gatherings (No, I don't know if she ever attended). It helps her in her life so who am I to cast Asparagus? As long as people don't get Evangelical on me, I'm content to leave sleeping dogs lie! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "Originally posted by reducetension: quote: Originally posted by KJ1110: quote: Originally posted by billbright: Transcendentalists seem to believe that there is ethereal structure outside the physical... that there are structures of good and evil, of beauty and ugly, of... whatever... similar to actual, physical structures that can be observed, touched, heard, or felt. There seems to be constant friction among them because some feel that these things are godly in origin and some find them to be merely the workings of physical neurology. How feeleth the society of great military free-thinkers about this? Meh! Whatever get's them through the day, I suppose! Yep, I generally feel the same way about TM. They are not 'pushy' nor are they 'terrorizing' the citizenry with a big bad god thing coming to straighten us out. As far as what they believe, it's just their imagination. Like any of the rest. TM was a big thing in the 1960s when I was a young man and some of my friends got 'into it' (Beatles enthusiasts, of course - but it didn't last... much like any other 'trip' they were on. Is that still the same TM?) There are a lot of NRMs (New Religious Movements) since the 1960s. Humans can believe anything.", 
        "reply": " Yep! I got a Sister living on the west coast who was heavy into new age stuff, tm, hypnotherapy (certified), etc., etc. She wasn't a Hippie by any means, but definately the \"Blue-fuzzy\" type of person! I kept expecting to get a post card from her from one of the Wicker-man gatherings (No, I don't know if she ever attended). It helps her in her life so who am I to cast Asparagus? As long as people don't get Evangelical on me, I'm content to leave sleeping dogs lie! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-25 05:40:00", 
        "title": "Transcendentalism", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Did anybody happen to notice when transendental meditation morphed into transactional analysis?? back in the seventies?? GADS!!! It was a hoot watching everybody discover the keys to the entire universe!! My first wife and I would listen for hours to friends expound on their theories of everything and after they left look at each other and begin laughing......sometimes, for days after with out warning, one or the other of us would look at the other and bust out laughing all over again!! Man those could be fun discussions as long as you didn't lose it in the middle of one and pizz off the protagonists....bad form don'tcha know! T", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "Did anybody happen to notice when transendental meditation morphed into transactional analysis?? back in the seventies?? GADS!!! It was a hoot watching everybody discover the keys to the entire universe!! My first wife and I would listen for hours to friends expound on their theories of everything and after they left look at each other and begin laughing......sometimes, for days after with out warning, one or the other of us would look at the other and bust out laughing all over again!! Man those could be fun discussions as long as you didn't lose it in the middle of one and pizz off the protagonists....bad form don'tcha know! T", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-25 21:31:00", 
        "title": "Transcendentalism", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Did anybody happen to notice when transendental meditation morphed into transactional analysis?? back in the seventies?? GADS!!! It was a hoot watching everybody discover the keys to the entire universe!! My first wife and I would listen for hours to friends expound on their theories of everything and after they left look at each other and begin laughing......sometimes, for days after with out warning, one or the other of us would look at the other and bust out laughing all over again!! Man those could be fun discussions as long as you didn't lose it in the middle of one and pizz off the protagonists....bad form don'tcha know! T I noticed when the Army required all of we Reserve Drill SGT's to attend transactional analysis training. Yawn!", 
        "intTime": 20090426, 
        "postID": 6, 
        "quote": "Originally posted by tawodi: Did anybody happen to notice when transendental meditation morphed into transactional analysis?? back in the seventies?? GADS!!! It was a hoot watching everybody discover the keys to the entire universe!! My first wife and I would listen for hours to friends expound on their theories of everything and after they left look at each other and begin laughing......sometimes, for days after with out warning, one or the other of us would look at the other and bust out laughing all over again!! Man those could be fun discussions as long as you didn't lose it in the middle of one and pizz off the protagonists....bad form don'tcha know! T", 
        "reply": " I noticed when the Army required all of we Reserve Drill SGT's to attend transactional analysis training. Yawn!", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-26 03:50:00", 
        "title": "Transcendentalism", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Did anybody happen to notice when transendental meditation morphed into transactional analysis?? back in the seventies?? GADS!!! It was a hoot watching everybody discover the keys to the entire universe!! My first wife and I would listen for hours to friends expound on their theories of everything and after they left look at each other and begin laughing......sometimes, for days after with out warning, one or the other of us would look at the other and bust out laughing all over again!! Man those could be fun discussions as long as you didn't lose it in the middle of one and pizz off the protagonists....bad form don'tcha know! T Sound's more as if they were into dropping Acid! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "Originally posted by tawodi: Did anybody happen to notice when transendental meditation morphed into transactional analysis?? back in the seventies?? GADS!!! It was a hoot watching everybody discover the keys to the entire universe!! My first wife and I would listen for hours to friends expound on their theories of everything and after they left look at each other and begin laughing......sometimes, for days after with out warning, one or the other of us would look at the other and bust out laughing all over again!! Man those could be fun discussions as long as you didn't lose it in the middle of one and pizz off the protagonists....bad form don'tcha know! T", 
        "reply": " Sound's more as if they were into dropping Acid! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-26 07:41:00", 
        "title": "Transcendentalism", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by tawodi: Did anybody happen to notice when transendental meditation morphed into transactional analysis?? back in the seventies?? GADS!!! It was a hoot watching everybody discover the keys to the entire universe!! My first wife and I would listen for hours to friends expound on their theories of everything and after they left look at each other and begin laughing......sometimes, for days after with out warning, one or the other of us would look at the other and bust out laughing all over again!! Man those could be fun discussions as long as you didn't lose it in the middle of one and pizz off the protagonists....bad form don'tcha know! T I noticed when the Army required all of we Reserve Drill SGT's to attend transactional analysis training. Yawn! Amazing, too, how it usually morphed into this sort of home-spun pan-theism... everything being connected, and all. I never got transactional analysis training as a drill sgt. Must have been before my time. Or, maybe it didn't fall right, timing wise. At least I don't remember it. I was getting so much management hocus-pocus from my civilian job at Kraft in those days that it might have escaped my memory as anything significant. I do remember a very meaningful training I received once when I was in the Air Guard: It was called \"You are what you were when.\" At bottom the theory says that your attitudes are established by the time you're twelve, and it takes trauma or significant happenstance to make any change to them after that. What that meant for the senior NCO or manager was that you had to consider the airman/employee individually, and consider his circumstance when he was twelve to better communicate with him. I think that has a big connection to understanding a person's religion, too. And to understanding why it's so hard to unseat religious bias/mentality that's passed from generation to generation.", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "Originally posted by stillkit: quote: Originally posted by tawodi: Did anybody happen to notice when transendental meditation morphed into transactional analysis?? back in the seventies?? GADS!!! It was a hoot watching everybody discover the keys to the entire universe!! My first wife and I would listen for hours to friends expound on their theories of everything and after they left look at each other and begin laughing......sometimes, for days after with out warning, one or the other of us would look at the other and bust out laughing all over again!! Man those could be fun discussions as long as you didn't lose it in the middle of one and pizz off the protagonists....bad form don'tcha know! T I noticed when the Army required all of we Reserve Drill SGT's to attend transactional analysis training. Yawn!", 
        "reply": " Amazing, too, how it usually morphed into this sort of home-spun pan-theism... everything being connected, and all. I never got transactional analysis training as a drill sgt. Must have been before my time. Or, maybe it didn't fall right, timing wise. At least I don't remember it. I was getting so much management hocus-pocus from my civilian job at Kraft in those days that it might have escaped my memory as anything significant. I do remember a very meaningful training I received once when I was in the Air Guard: It was called \"You are what you were when.\" At bottom the theory says that your attitudes are established by the time you're twelve, and it takes trauma or significant happenstance to make any change to them after that. What that meant for the senior NCO or manager was that you had to consider the airman/employee individually, and consider his circumstance when he was twelve to better communicate with him. I think that has a big connection to understanding a person's religion, too. And to understanding why it's so hard to unseat religious bias/mentality that's passed from generation to generation.", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-26 07:45:00", 
        "title": "Transcendentalism", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: And to understanding why it's so hard to unseat religious bias/mentality that's passed from generation to generation. It's called socialization. Humans have to learn how to be humans and we learn it from other humans, not from beings unseen. But, having said that, you can unlearn that which is learned and people do that with all sorts of belief systems or customs, etc, though it can be difficult. Some people socialized to be Catholics might 'rebel' and become a Protestant and get 'resocialized' in a \"total institution\" (i.e. Church.) I guess you can call it deprogramming. I've help many a fundamentalist \"deprogram\" themselves... sometimes it works completely, and sometimes they just adjust to a more 'user-friendly' version of the faith. It's very common in the US. We have roles, we learn them young beginning with the scrips our parents write, then our peers and the culture. Sometimes we even get to decided what scrip we'll play. Modern humans, especially in the US, are relativists, I guess you could say!", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "And to understanding why it's so hard to unseat religious bias/mentality that's passed from generation to generation.", 
        "reply": " It's called socialization. Humans have to learn how to be humans and we learn it from other humans, not from beings unseen. But, having said that, you can unlearn that which is learned and people do that with all sorts of belief systems or customs, etc, though it can be difficult. Some people socialized to be Catholics might 'rebel' and become a Protestant and get 'resocialized' in a \"total institution\" (i.e. Church.) I guess you can call it deprogramming. I've help many a fundamentalist \"deprogram\" themselves... sometimes it works completely, and sometimes they just adjust to a more 'user-friendly' version of the faith. It's very common in the US. We have roles, we learn them young beginning with the scrips our parents write, then our peers and the culture. Sometimes we even get to decided what scrip we'll play. Modern humans, especially in the US, are relativists, I guess you could say!", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-26 10:05:00", 
        "title": "Transcendentalism", 
        "userID": "reducetension"
    }, 
    {
        "content": "Per THE transcendentalist, the one the UU goes gaga over, in his \"Civil Disobedience:\" I HEARTILY ACCEPT the motto, — \"That government is best which governs least\";(1) and I should like to see it acted up to more rapidly and systematically. Carried out, it finally amounts to this, which also I believe, — \"That government is best which governs not at all\"; and when men are prepared for it, that will be the kind of government which they will have. ********************************** This sounds much like the most conservative members of this forum. And from \"THE\" liberal progressive of his age. Hm-m-mmm. And is he right? About anything? Who can even understand him? Go ahead. read him; then get back to me.", 
        "intTime": 20090426, 
        "postID": 10, 
        "quote": "", 
        "reply": "Per THE transcendentalist, the one the UU goes gaga over, in his \"Civil Disobedience:\" I HEARTILY ACCEPT the motto, — \"That government is best which governs least\";(1) and I should like to see it acted up to more rapidly and systematically. Carried out, it finally amounts to this, which also I believe, — \"That government is best which governs not at all\"; and when men are prepared for it, that will be the kind of government which they will have. ********************************** This sounds much like the most conservative members of this forum. And from \"THE\" liberal progressive of his age. Hm-m-mmm. And is he right? About anything? Who can even understand him? Go ahead. read him; then get back to me.", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-26 18:37:00", 
        "title": "Transcendentalism", 
        "userID": "billbright"
    }, 
    {
        "content": "Who is him??", 
        "intTime": 20090429, 
        "postID": 11, 
        "quote": "", 
        "reply": "Who is him??", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-29 20:42:00", 
        "title": "Transcendentalism", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Who is him?? Thoreau was an itinerant who had amazing influence on a generation. One of the people he influenced was Spinoza. And Spinoza had quite the effect on Einstein. When people argue that Einstein was or wasn't an atheist, I think we'll find that he was the inveterate diplomat, not wanting to disappoint either camp. Check out his \"God of Spinoza\" quote: \"We followers of Spinoza seek out God in the wonderful order and lawfulness of all that exists and in its soul as it reveals itself in man and animal.It is a different question whether belief in a personal God should be contested. Freud endorsed this view in his latest publication. I myself would never engage in such a task. For such a belief seems to me to the lack of any transcendental outlook of life, and I wonder whether one can ever successfully render to the majority of mankind a more sublime means in order to satisfy its metaphysical needs.\" At least it's claimed that he said these things. I wasn't there.", 
        "intTime": 20090430, 
        "postID": 12, 
        "quote": "Originally posted by tawodi: Who is him??", 
        "reply": " Thoreau was an itinerant who had amazing influence on a generation. One of the people he influenced was Spinoza. And Spinoza had quite the effect on Einstein. When people argue that Einstein was or wasn't an atheist, I think we'll find that he was the inveterate diplomat, not wanting to disappoint either camp. Check out his \"God of Spinoza\" quote: \"We followers of Spinoza seek out God in the wonderful order and lawfulness of all that exists and in its soul as it reveals itself in man and animal.It is a different question whether belief in a personal God should be contested. Freud endorsed this view in his latest publication. I myself would never engage in such a task. For such a belief seems to me to the lack of any transcendental outlook of life, and I wonder whether one can ever successfully render to the majority of mankind a more sublime means in order to satisfy its metaphysical needs.\" At least it's claimed that he said these things. I wasn't there.", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-04-30 20:39:00", 
        "title": "Transcendentalism", 
        "userID": "billbright"
    }, 
    {
        "content": "O.K. I was thinking that the quote was Savonarolesque as well, but I will of course defer to you as to it being Thoreau. It does sound more like him doesn't it?? T This message has been edited. Last edited by: tawodi, Fri 01 May 2009 09:28 PM", 
        "intTime": 20090501, 
        "postID": 13, 
        "quote": "", 
        "reply": "O.K. I was thinking that the quote was Savonarolesque as well, but I will of course defer to you as to it being Thoreau. It does sound more like him doesn't it?? T This message has been edited. Last edited by: tawodi, Fri 01 May 2009 09:28 PM", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-05-01 06:37:00", 
        "title": "Transcendentalism", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: O.K. I was thinking that the quote was Savonarolesque as well, but I will of course defer to you as to it being Thoreau. It does sound more like him doesn't it?? T That made absolutely no sense. Savonarola was the friar who nearly put an end to the humanist movement of the late fifteenth/early sixteenth century. His was the Bonfires of the Vanities; the burning of all freethought. He was as far from a transcendentalist as you could possibly get. He detested anything but a strictly Christian, by-the-book, personally-held god.", 
        "intTime": 20090501, 
        "postID": 14, 
        "quote": "Originally posted by tawodi: O.K. I was thinking that the quote was Savonarolesque as well, but I will of course defer to you as to it being Thoreau. It does sound more like him doesn't it?? T", 
        "reply": " That made absolutely no sense. Savonarola was the friar who nearly put an end to the humanist movement of the late fifteenth/early sixteenth century. His was the Bonfires of the Vanities; the burning of all freethought. He was as far from a transcendentalist as you could possibly get. He detested anything but a strictly Christian, by-the-book, personally-held god.", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-05-01 23:11:00", 
        "title": "Transcendentalism", 
        "userID": "billbright"
    }, 
    {
        "content": "Spinoza held basically the same beliefs. They killed Savonarola for them as a Naturist and heretic!! Simplicity of attire and the churches, doing away with pomp and circumstance, as well as doing good and living a \"good\" life were among his basic ideas. The point where he went bad was, once again, fusing religion with secular power which he of course promptly abused as the leader pro-tempore of the city he commanded after the French were the victors in war. After he descended from power the church persecuted, arrested and condemned him to death. He was tortured and wrote a confession, after which, he then wrote a missive beseaching God to forgive his human weakness for writing under the pressures of torture. That's just the bare bones of it. There is much more to study about the man and his life. I don't believe he was a Jansenist, as has been said in the past. He was far too complicated for such a simple dismissal as such. They both used the term \"nature's God\" a term most Christians still don't understand is NOT blasphemy. After all, according to our beliefs, (supposedly) God made everything including the laws of nature and science, so why is it wrong to call Him Nature's God?? They were more properly called deists, as you are no doubt, very aware! Go figure!! This message has been edited. Last edited by: tawodi, Sat 02 May 2009 07:36 AM", 
        "intTime": 20090502, 
        "postID": 15, 
        "quote": "", 
        "reply": "Spinoza held basically the same beliefs. They killed Savonarola for them as a Naturist and heretic!! Simplicity of attire and the churches, doing away with pomp and circumstance, as well as doing good and living a \"good\" life were among his basic ideas. The point where he went bad was, once again, fusing religion with secular power which he of course promptly abused as the leader pro-tempore of the city he commanded after the French were the victors in war. After he descended from power the church persecuted, arrested and condemned him to death. He was tortured and wrote a confession, after which, he then wrote a missive beseaching God to forgive his human weakness for writing under the pressures of torture. That's just the bare bones of it. There is much more to study about the man and his life. I don't believe he was a Jansenist, as has been said in the past. He was far too complicated for such a simple dismissal as such. They both used the term \"nature's God\" a term most Christians still don't understand is NOT blasphemy. After all, according to our beliefs, (supposedly) God made everything including the laws of nature and science, so why is it wrong to call Him Nature's God?? They were more properly called deists, as you are no doubt, very aware! Go figure!! This message has been edited. Last edited by: tawodi, Sat 02 May 2009 07:36 AM", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-05-02 07:19:00", 
        "title": "Transcendentalism", 
        "userID": "tawodi"
    }, 
    {
        "content": "", 
        "intTime": 20090502, 
        "postID": 16, 
        "quote": "", 
        "reply": "", 
        "threadID": "1270031990001_2420066122001", 
        "time": "2009-05-02 17:25:00", 
        "title": "Transcendentalism", 
        "userID": "21335484"
    }
]