[
    {
        "content": "quote: Originally posted by Another4Truth: Just an observation, The Christian religion is the only religion I know of or heard of that is based on Capitol Punishment. What is the Christians fascination with execution? Why do they revere it so? With all these Christians enraptured by the passion of the cross, I have to wonder what it would be like if Jesus was executed in modern times with modern executions devices. What if Christ was executed by the electric chair? Would all the Christians be wearing little gold electric chairs around their necks? Would they have electric chairs on top and in front of their churches? What if Christ was hung around the neck by a noose? Would all the Christians have little gold nooses around their necks? Maybe, they would have a gallows in front of their churches. Don’t you find it odd that the symbol of the Christian Church is an execution device? Just wondering……… Wondering are you or are attempting to be sarcastic? I have read a few of your beginning forays on to this board and you came in like someone with a grudge. I had read your lead in posts multiple times over many days to try and be as fair minded as I could, given that you will probably not like me very much since I fall into a category that you seem to have a disdain towards (Christian that is). To answer in my opinion your wondering question, the Cross of Christianity as I have found in my STUDY is one of substitution and not of worship. Jesus' act of dying on the cross is a symbol that the Christians physical dying will not result in a final separation from God. In my study there have been many additions and traditions added to this simple message until many just argue about things that no Christian is authoritative to teach. So may you have a wonderful life free from condemnation from any who claim to be Christian. And just so you know you will never hear me say anything of the sort about condemnation, I have no authority to do so and avoid these acts like the plague. If I have done so in the past, let me apologize and pledge to work to stay far away from any such act in the future. LJ", 
        "intTime": 20090301, 
        "postID": 15, 
        "quote": "Originally posted by Another4Truth: Just an observation, The Christian religion is the only religion I know of or heard of that is based on Capitol Punishment. What is the Christians fascination with execution? Why do they revere it so? With all these Christians enraptured by the passion of the cross, I have to wonder what it would be like if Jesus was executed in modern times with modern executions devices. What if Christ was executed by the electric chair? Would all the Christians be wearing little gold electric chairs around their necks? Would they have electric chairs on top and in front of their churches? What if Christ was hung around the neck by a noose? Would all the Christians have little gold nooses around their necks? Maybe, they would have a gallows in front of their churches. Don’t you find it odd that the symbol of the Christian Church is an execution device? Just wondering………", 
        "reply": " Wondering are you or are attempting to be sarcastic? I have read a few of your beginning forays on to this board and you came in like someone with a grudge. I had read your lead in posts multiple times over many days to try and be as fair minded as I could, given that you will probably not like me very much since I fall into a category that you seem to have a disdain towards (Christian that is). To answer in my opinion your wondering question, the Cross of Christianity as I have found in my STUDY is one of substitution and not of worship. Jesus' act of dying on the cross is a symbol that the Christians physical dying will not result in a final separation from God. In my study there have been many additions and traditions added to this simple message until many just argue about things that no Christian is authoritative to teach. So may you have a wonderful life free from condemnation from any who claim to be Christian. And just so you know you will never hear me say anything of the sort about condemnation, I have no authority to do so and avoid these acts like the plague. If I have done so in the past, let me apologize and pledge to work to stay far away from any such act in the future. LJ", 
        "threadID": "1270031990001_6500099512001", 
        "time": "2009-03-01 12:07:00", 
        "title": "The symbol of peace?", 
        "userID": "all4truth"
    }, 
    {
        "content": "quote: Originally posted by sabow: I would be interested in hearing why the ACLU believes the memorial is unconstitutional... From what I have read so far, the memorial was not commissioned, funded or otherwise maintained by government tax dollars; it was donated. The government has owned, maintained and EXPANDED it since 1934 using tax money. From original post \"The VFW erected the memorial and originally owned the land on which the memorial sits, and had donated it to the government in 1934. \" Some facts: * The original wooden cross was replaced by a larger metal using tax money * The National park service refused to allow the religious symbols of veterans from other religions at what is supposed to be a war memorial. * The sign at the foot of the cross stating it is a war memorial disappeared years ago and was never replaced. Is it a war memorial if there is nothing at the site that says it is? * The ACLU filed the case in 2001 on behalf of a retired park employee", 
        "intTime": 20090301, 
        "postID": 16, 
        "quote": "Originally posted by sabow: I would be interested in hearing why the ACLU believes the memorial is unconstitutional... From what I have read so far, the memorial was not commissioned, funded or otherwise maintained by government tax dollars; it was donated.", 
        "reply": " The government has owned, maintained and EXPANDED it since 1934 using tax money. From original post \"The VFW erected the memorial and originally owned the land on which the memorial sits, and had donated it to the government in 1934. \" Some facts: * The original wooden cross was replaced by a larger metal using tax money * The National park service refused to allow the religious symbols of veterans from other religions at what is supposed to be a war memorial. * The sign at the foot of the cross stating it is a war memorial disappeared years ago and was never replaced. Is it a war memorial if there is nothing at the site that says it is? * The ACLU filed the case in 2001 on behalf of a retired park employee", 
        "threadID": "1270031990001_6500099512001", 
        "time": "2009-03-01 12:30:00", 
        "title": "The symbol of peace?", 
        "userID": "rayld2"
    }
]