[
    {
        "content": "Blessed Ostara! This ancient holiday was once called Ēostre (also Ēastre) in Old English, and Ôstarâ in German. It celebrates the return of Spring. This celebration is traditionally held on the first full moon after the spring equinox, as this is traditionally a LUNAR month, not a Solar month. This is why the date is marked by the moon cycle, not the equinox. It is also the precise reason why the modern Easter celebration is held on the first Sunday after the first full moon after the spring equinox. (Easter is merely a Pagan holiday that was usurped by the Catholic church.) The Goddess Ostara (who may be merged from multiple traditions, and is known by several similar names from various languages) is known as the harbinger of the Sun. It is she who announces the rebirth of life in the Spring and holds the promise of new beginnings and summer growth. Ostara is a Goddess of fertility, rebirth, agriculture, purification, and health and healing Eggs were symbols of fertility, and were decorated and given as gifts in baskets made to resemble birds' nests. Rabbits and hares are symbols of fertility, and were considered sacred to Ostara. By tradition, Ostara is often pictured as having a rabbit's head or ears. The Easter Bunny and Easter Egg are absolutely Pagan symbols. But wait! This celebration traces even further back to the story of the Goddess Inanna (Ishtar), from whom the original \"Easter\" story comes. It's the ancient Sumerian story of 'Inanna's Descent to the Underworld'. According to the myth, the goddess plans to visit the underworld ruled by her dark sister Ereshkigal. After dressing in jewels and fine clothing, Inanna descends and is met by Ereshkigal’s servant, who at each of the seven gates to the underworld removes one of her garments. Finally she approaches her sister naked and humiliated. An angry Ereshkigal orders that she be killed and hangs her body on a peg to rot. After three days Inanna's servant becomes worried by her absence and fashions little creatures who descend unseen to the underworld with materials to breathe life back into the goddess. They resurrect her and she reascends to heaven. Sounds a bit familiar, doesn't it? As Ishtar descended, she was stripped and humiliated; according to the Bible mythos, Jesus was stripped, beaten and humbled. Ishtar was killed and hung on a stake; Jesus was hung on a cross. Ishtar was resurrected after three days; Jesus rose from the dead on the third day. Both achieved eternal life. Easter is in fact the same story as Ishtar. Easter is the celebration of an ancient Pagan holiday. Different cultures throughout history added their own minor twists, but the origin of the holiday remains the same. This is an ancient lunar Pagan holiday, which celebrates fertility, rebirth, and the return of spring. A joyful time indeed! It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. Blessed Ostara!", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "", 
        "reply": "Blessed Ostara! This ancient holiday was once called Ēostre (also Ēastre) in Old English, and Ôstarâ in German. It celebrates the return of Spring. This celebration is traditionally held on the first full moon after the spring equinox, as this is traditionally a LUNAR month, not a Solar month. This is why the date is marked by the moon cycle, not the equinox. It is also the precise reason why the modern Easter celebration is held on the first Sunday after the first full moon after the spring equinox. (Easter is merely a Pagan holiday that was usurped by the Catholic church.) The Goddess Ostara (who may be merged from multiple traditions, and is known by several similar names from various languages) is known as the harbinger of the Sun. It is she who announces the rebirth of life in the Spring and holds the promise of new beginnings and summer growth. Ostara is a Goddess of fertility, rebirth, agriculture, purification, and health and healing Eggs were symbols of fertility, and were decorated and given as gifts in baskets made to resemble birds' nests. Rabbits and hares are symbols of fertility, and were considered sacred to Ostara. By tradition, Ostara is often pictured as having a rabbit's head or ears. The Easter Bunny and Easter Egg are absolutely Pagan symbols. But wait! This celebration traces even further back to the story of the Goddess Inanna (Ishtar), from whom the original \"Easter\" story comes. It's the ancient Sumerian story of 'Inanna's Descent to the Underworld'. According to the myth, the goddess plans to visit the underworld ruled by her dark sister Ereshkigal. After dressing in jewels and fine clothing, Inanna descends and is met by Ereshkigal’s servant, who at each of the seven gates to the underworld removes one of her garments. Finally she approaches her sister naked and humiliated. An angry Ereshkigal orders that she be killed and hangs her body on a peg to rot. After three days Inanna's servant becomes worried by her absence and fashions little creatures who descend unseen to the underworld with materials to breathe life back into the goddess. They resurrect her and she reascends to heaven. Sounds a bit familiar, doesn't it? As Ishtar descended, she was stripped and humiliated; according to the Bible mythos, Jesus was stripped, beaten and humbled. Ishtar was killed and hung on a stake; Jesus was hung on a cross. Ishtar was resurrected after three days; Jesus rose from the dead on the third day. Both achieved eternal life. Easter is in fact the same story as Ishtar. Easter is the celebration of an ancient Pagan holiday. Different cultures throughout history added their own minor twists, but the origin of the holiday remains the same. This is an ancient lunar Pagan holiday, which celebrates fertility, rebirth, and the return of spring. A joyful time indeed! It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. Blessed Ostara!", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-08 11:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "", 
        "intTime": 20090409, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 10:22:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus?", 
        "intTime": 20090409, 
        "postID": 3, 
        "quote": "It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts.", 
        "reply": " So you admit satan works to deceive the masses from his Lord Jesus?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 11:50:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I just heard from Flying Spaghetti Monster. Ar-r-r... He says He don't give a cannoli. Capisce?", 
        "intTime": 20090409, 
        "postID": 4, 
        "quote": "", 
        "reply": "I just heard from Flying Spaghetti Monster. Ar-r-r... He says He don't give a cannoli. Capisce?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 12:29:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus? So, Jesus is Satan's Lord, too? Sounds like quite a relationship. Who do you suppose will win? I wonder who is fooling who? How many 'old pagan traditions' do you suppose Christians observe (change the name to make them Christian?) I take it you'll avoid egg coloring and hunts this weekend? No chocolate bunnies or such? What happens to those faithful Christians who will be in their Sunday best this Sunday, after or before the Easter egg hunt? Going to hell for being deceived? How about grandma sending her grandkids cute bunny Easter cards, going to hell? Isn't Hell the mythical realm of Satan? Which Pagans worship human sacrifice, cannibalism and drinking of human-god's blood? Which Pagans believe the dead rise? Which Pagans have a god that killed it's own kid? Have a nice pagan weekend.", 
        "intTime": 20090409, 
        "postID": 5, 
        "quote": "Originally posted by soscorpio: quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus?", 
        "reply": " So, Jesus is Satan's Lord, too? Sounds like quite a relationship. Who do you suppose will win? I wonder who is fooling who? How many 'old pagan traditions' do you suppose Christians observe (change the name to make them Christian?) I take it you'll avoid egg coloring and hunts this weekend? No chocolate bunnies or such? What happens to those faithful Christians who will be in their Sunday best this Sunday, after or before the Easter egg hunt? Going to hell for being deceived? How about grandma sending her grandkids cute bunny Easter cards, going to hell? Isn't Hell the mythical realm of Satan? Which Pagans worship human sacrifice, cannibalism and drinking of human-god's blood? Which Pagans believe the dead rise? Which Pagans have a god that killed it's own kid? Have a nice pagan weekend.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 13:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus? Where the heck do you get anything about Satan out of what I posted? Satan is not part of any religious tradition I believe. There is no deception... except the deception of Catholics and Christians by their own church and historians. They're taking a holiday based on an older myth and pretending that the holiday is based on their own myth. Easter is the Christianized incarnation of Ostara, a much older holiday celebrating the return of spring, which has been celebrated by many cultures with variations on the same theme. And there's your daily dose of fact.", 
        "intTime": 20090409, 
        "postID": 6, 
        "quote": "Originally posted by soscorpio: quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus?", 
        "reply": " Where the heck do you get anything about Satan out of what I posted? Satan is not part of any religious tradition I believe. There is no deception... except the deception of Catholics and Christians by their own church and historians. They're taking a holiday based on an older myth and pretending that the holiday is based on their own myth. Easter is the Christianized incarnation of Ostara, a much older holiday celebrating the return of spring, which has been celebrated by many cultures with variations on the same theme. And there's your daily dose of fact.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 18:22:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Whirled Peas - Thanks for posting this.", 
        "intTime": 20090410, 
        "postID": 7, 
        "quote": "", 
        "reply": "Whirled Peas - Thanks for posting this.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 00:27:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "dekeoboe"
    }, 
    {
        "content": "quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. Why would it warm your heart? Nobody gives a hooey about Easter being an ode to some goblin, it isn't. That's your psychosis believing we're all celebrating your witches. Paganism is satan's attempt to destroy catholicism. Catholics have folded in many ways to satan's charms, but they, like every individual with free-will do not represent the Words of God, only the Words and our Lord, Jesus Christ. He is your Lord, whether you recognize it or not. Show me where the flying monsters or trolls of your faith have a time-tested book from their supreme, or anything that matches the facts of the life of Jesus and the miracles He performed. The Bible has over 300 prophecies of the coming of Christ, it is easier to have someone elses fingerprint than to fulfill those prophesies. The romans knew they had killed the Messiah after His final breath. The earth shook and became dark at that moment. So again, you heart is warmed because why? It's not because we celebrate Easter it's because you think the masses are being decieved into celbrating something they are not, and to a certain extent it's true about your vile paganistic ceremony, but deception shouldn't warm you, you should advocate change, so that those that follow your sick rituals know they are flirting with the fate of their souls. Where does your soul go BTW? What has Kroolu told you?", 
        "intTime": 20090410, 
        "postID": 8, 
        "quote": "It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts.", 
        "reply": " Why would it warm your heart? Nobody gives a hooey about Easter being an ode to some goblin, it isn't. That's your psychosis believing we're all celebrating your witches. Paganism is satan's attempt to destroy catholicism. Catholics have folded in many ways to satan's charms, but they, like every individual with free-will do not represent the Words of God, only the Words and our Lord, Jesus Christ. He is your Lord, whether you recognize it or not. Show me where the flying monsters or trolls of your faith have a time-tested book from their supreme, or anything that matches the facts of the life of Jesus and the miracles He performed. The Bible has over 300 prophecies of the coming of Christ, it is easier to have someone elses fingerprint than to fulfill those prophesies. The romans knew they had killed the Messiah after His final breath. The earth shook and became dark at that moment. So again, you heart is warmed because why? It's not because we celebrate Easter it's because you think the masses are being decieved into celbrating something they are not, and to a certain extent it's true about your vile paganistic ceremony, but deception shouldn't warm you, you should advocate change, so that those that follow your sick rituals know they are flirting with the fate of their souls. Where does your soul go BTW? What has Kroolu told you?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 08:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: He is your Lord, whether you recognize it or not. Nope. Nice try, but no. quote: Show me where the flying monsters or trolls of your faith have a time-tested book from their supreme, or anything that matches the facts of the life of Jesus and the miracles He performed. Stop pretending you know anything about my beliefs, when it's clear that you don't. There are no \"flying monsters or trolls\" according to my beliefs. There's the sun, the moon, the seasons, the earth, and whimsical interpretations that are used to teach about spirituality. Stop reading Harry Potter under the delusion that you're reading about anyone's beliefs. quote: The romans knew they had killed the Messiah after His final breath. The earth shook and became dark at that moment. That's your myth, not mine. quote: So again, you heart is warmed because why? Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. quote: It's not because we celebrate Easter it's because you think the masses are being decieved into celbrating something they are not, and to a certain extent it's true about your vile paganistic ceremony, but deception shouldn't warm you, you should advocate change, so that those that follow your sick rituals know they are flirting with the fate of their souls. Vile paganistic ceremony? Sick rituals? What the heck are you talking about? Don't speak gibberish. What is this alleged ceremony you think you know about? Because I haven't heard about it. So how about qualifying that statement, because you're clearly fabricating some bizarre mental image about this which in no way resembles reality. For that matter... there's a lovely thread about Easter on this forum, if you wish to discuss Easter. I started this thread to wish people a happy Ostara, and welcome the return of spring with an acknowledgment of the old traditions and the origins of the holiday, not to listen to someone preach about another religion. Why not go talk about Easter on the Easter thread, and let those who wish to enjoy the season according to the old ways enjoy the wish of the happy holiday without your vitriol? quote: Where does your soul go BTW? What has Kroolu told you? What the heck is Kroolu? You really need to stop reading science fiction and fantasy books and mistaking them for reality. Where does the soul go? Eventually, back to its unity with the rest of the universe and God. Some of us just have a different perspective regarding the fairy tales you both love and hate. To me, they're all the same.", 
        "intTime": 20090410, 
        "postID": 9, 
        "quote": "Originally posted by soscorpio: He is your Lord, whether you recognize it or not.", 
        "reply": " Nope. Nice try, but no. quote: Show me where the flying monsters or trolls of your faith have a time-tested book from their supreme, or anything that matches the facts of the life of Jesus and the miracles He performed. Stop pretending you know anything about my beliefs, when it's clear that you don't. There are no \"flying monsters or trolls\" according to my beliefs. There's the sun, the moon, the seasons, the earth, and whimsical interpretations that are used to teach about spirituality. Stop reading Harry Potter under the delusion that you're reading about anyone's beliefs. quote: The romans knew they had killed the Messiah after His final breath. The earth shook and became dark at that moment. That's your myth, not mine. quote: So again, you heart is warmed because why? Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. quote: It's not because we celebrate Easter it's because you think the masses are being decieved into celbrating something they are not, and to a certain extent it's true about your vile paganistic ceremony, but deception shouldn't warm you, you should advocate change, so that those that follow your sick rituals know they are flirting with the fate of their souls. Vile paganistic ceremony? Sick rituals? What the heck are you talking about? Don't speak gibberish. What is this alleged ceremony you think you know about? Because I haven't heard about it. So how about qualifying that statement, because you're clearly fabricating some bizarre mental image about this which in no way resembles reality. For that matter... there's a lovely thread about Easter on this forum, if you wish to discuss Easter. I started this thread to wish people a happy Ostara, and welcome the return of spring with an acknowledgment of the old traditions and the origins of the holiday, not to listen to someone preach about another religion. Why not go talk about Easter on the Easter thread, and let those who wish to enjoy the season according to the old ways enjoy the wish of the happy holiday without your vitriol? quote: Where does your soul go BTW? What has Kroolu told you? What the heck is Kroolu? You really need to stop reading science fiction and fantasy books and mistaking them for reality. Where does the soul go? Eventually, back to its unity with the rest of the universe and God. Some of us just have a different perspective regarding the fairy tales you both love and hate. To me, they're all the same.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 09:39:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: What the heck is Kroolu? I think he was trying to invoke the Name of Our Dread Lord, Cthulu. Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "intTime": 20090410, 
        "postID": 10, 
        "quote": "What the heck is Kroolu?", 
        "reply": " I think he was trying to invoke the Name of Our Dread Lord, Cthulu. Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 10:32:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "BonoboJones"
    }, 
    {
        "content": "quote: What the heck is Kroolu? You really need to stop reading science fiction and fantasy books and mistaking them for reality. Me thinketh it's too late! soscorpio is no doubt observing this weekend something akin to the Jerusalem 'chain saw massacre' and the very popular horror story about dead coming back to life and returning to a far away planet from whenst it will return to vanquish the Earth and capture the faithful.... nearly sounds like Scientology or Planet of the Apes or .... and it's way too late for him to stop believing in sci-fi, horror stories and such, as one distinguished poster puts it, the Buy Bull.", 
        "intTime": 20090410, 
        "postID": 11, 
        "quote": "What the heck is Kroolu? You really need to stop reading science fiction and fantasy books and mistaking them for reality.", 
        "reply": " Me thinketh it's too late! soscorpio is no doubt observing this weekend something akin to the Jerusalem 'chain saw massacre' and the very popular horror story about dead coming back to life and returning to a far away planet from whenst it will return to vanquish the Earth and capture the faithful.... nearly sounds like Scientology or Planet of the Apes or .... and it's way too late for him to stop believing in sci-fi, horror stories and such, as one distinguished poster puts it, the Buy Bull.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 10:48:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me.", 
        "intTime": 20090410, 
        "postID": 12, 
        "quote": "Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression.", 
        "reply": " NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:11:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me. Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J.", 
        "intTime": 20090410, 
        "postID": 13, 
        "quote": "Originally posted by soscorpio: quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me.", 
        "reply": " Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:26:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Dung gods, wow that’s harsh.", 
        "intTime": 20090410, 
        "postID": 14, 
        "quote": "", 
        "reply": "Dung gods, wow that’s harsh.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:34:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. There he goes with the sci-fi and fantasy stories again. You really need to be careful about what you read, seeing as you have a hard time separating fact from fiction. Sorry, no black robes here. Also no animal sacrifice, no chicken blood, no voodoo dolls, and no virgin sacrifice. We don't do those sorts of things - we find them disgusting, violent, and distasteful. Actually... human sacrifice is what YOU are celebrating this weekend. Bloody, brutal murder. quote: Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Lovely insinuation. You just HAVE to hassle anyone who doesn't believe the same thing you do. Notice that I haven't pestered anyone on the Easter thread. Clearly, you're happy to sink to that level. Sure, it's Easter. It's also Ostara. Come May Day, we'll be celebrating Beltane. And Christmas has always been Yule... hence the Yule log, which was burned to keep the fire alive through the longest night of the year while everyone waits to welcome the rebirth of the sun. You celebrate your holidays your way, and I'll celebrate my holidays my way. I won't hassle you as long as you don't hassle me. Are you capable of not hassling others? Or do you need to attack anyone of a different faith than your own under the twisted notion that the mere EXISTENCE of other religions is an attack on your own?", 
        "intTime": 20090410, 
        "postID": 15, 
        "quote": "Originally posted by soscorpio: NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones.", 
        "reply": " There he goes with the sci-fi and fantasy stories again. You really need to be careful about what you read, seeing as you have a hard time separating fact from fiction. Sorry, no black robes here. Also no animal sacrifice, no chicken blood, no voodoo dolls, and no virgin sacrifice. We don't do those sorts of things - we find them disgusting, violent, and distasteful. Actually... human sacrifice is what YOU are celebrating this weekend. Bloody, brutal murder. quote: Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Lovely insinuation. You just HAVE to hassle anyone who doesn't believe the same thing you do. Notice that I haven't pestered anyone on the Easter thread. Clearly, you're happy to sink to that level. Sure, it's Easter. It's also Ostara. Come May Day, we'll be celebrating Beltane. And Christmas has always been Yule... hence the Yule log, which was burned to keep the fire alive through the longest night of the year while everyone waits to welcome the rebirth of the sun. You celebrate your holidays your way, and I'll celebrate my holidays my way. I won't hassle you as long as you don't hassle me. Are you capable of not hassling others? Or do you need to attack anyone of a different faith than your own under the twisted notion that the mere EXISTENCE of other religions is an attack on your own?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:37:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J. Yeah, WorldPee goes on & on about the evils of Christianity. If someone shoots someone and mentions god in their death rant, she gleefully says \"SEE!, it's EEEVIL! There is no greater love than the love of our only God. He loves her, but it won't last forever, only for the duration of her earthly life, then the just God must do the right thing. She can escape her punishments as we all have our sins, the blood of the Christ is the payment for our crimes, but can only be redeemed by repenting. Good work yourself, on that other lunatic thread about the 2nd Amendment. There are some real nutcases here. They think momma gov't is doing all she can to tuck us in each night, when she's really trying to suffocate us.", 
        "intTime": 20090410, 
        "postID": 16, 
        "quote": "Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J.", 
        "reply": " Yeah, WorldPee goes on & on about the evils of Christianity. If someone shoots someone and mentions god in their death rant, she gleefully says \"SEE!, it's EEEVIL! There is no greater love than the love of our only God. He loves her, but it won't last forever, only for the duration of her earthly life, then the just God must do the right thing. She can escape her punishments as we all have our sins, the blood of the Christ is the payment for our crimes, but can only be redeemed by repenting. Good work yourself, on that other lunatic thread about the 2nd Amendment. There are some real nutcases here. They think momma gov't is doing all she can to tuck us in each night, when she's really trying to suffocate us.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:42:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Please don't suspend me. I don't think today is the day Christians should be asking not to be 'suspended'! And, btw, the Ten Commands assumes there are other \"gods\".... you are the one who is not to have others, evidently. She can worship whatever and whoever she wants. You are the one ascribing to \"theory\" in the bible. It's written to you, not her. May the farce be with you!", 
        "intTime": 20090410, 
        "postID": 17, 
        "quote": "Please don't suspend me.", 
        "reply": " I don't think today is the day Christians should be asking not to be 'suspended'! And, btw, the Ten Commands assumes there are other \"gods\".... you are the one who is not to have others, evidently. She can worship whatever and whoever she wants. You are the one ascribing to \"theory\" in the bible. It's written to you, not her. May the farce be with you!", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 12:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Hey WP. Love the pie chart. Click Save Archived Oh, and my you & yours have a happy Ostara. Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "intTime": 20090410, 
        "postID": 18, 
        "quote": "", 
        "reply": "Hey WP. Love the pie chart. Click Save Archived Oh, and my you & yours have a happy Ostara. Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 13:01:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "BonoboJones"
    }, 
    {
        "content": "quote: Originally posted by BonoboJones: Hey WP. Love the pie chart. Click Save Archived Oh, and my you & yours have a happy Ostara. Ditto! Welcome back, AJ! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090410, 
        "postID": 19, 
        "quote": "Originally posted by BonoboJones: Hey WP. Love the pie chart. Click Save Archived Oh, and my you & yours have a happy Ostara.", 
        "reply": " Ditto! Welcome back, AJ! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 14:03:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "KJ1110"
    }, 
    {
        "content": "A.J.; The pie chart is wrong. There are approx. two point three billion Christians.....there are approx. one point five billion Muslims...as you can see the tiny splinter depicted for the people of Islam is WAaay off!! So is the one for Hindu there are over a billion of them!! Jews...about eighteen million Buddhist....about nine hundred million These are world wide figures, if you are talking those who identify themselves as Christians in the U.S....well then, about eighty six percent of Americans do, then the chart is not so far out. T", 
        "intTime": 20090410, 
        "postID": 20, 
        "quote": "", 
        "reply": "A.J.; The pie chart is wrong. There are approx. two point three billion Christians.....there are approx. one point five billion Muslims...as you can see the tiny splinter depicted for the people of Islam is WAaay off!! So is the one for Hindu there are over a billion of them!! Jews...about eighteen million Buddhist....about nine hundred million These are world wide figures, if you are talking those who identify themselves as Christians in the U.S....well then, about eighty six percent of Americans do, then the chart is not so far out. T", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 17:53:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "tawodi"
    }, 
    {
        "content": "The pie is colorful however, you, too, are mistaken, T. Here’s the more likely demographics as of 2008: Various Christian: 76% (down .6% from 2001) (Catholics remaining the largest at 25%) Jewish: 1.2% (down .1% from 2001) Muslim/Islam .6% (up .1% from 2001) Buddhist .5% remaining the same that past decade. New Religious/New Age 1.2% (an increase of .3% since 2001) No religion, atheist, etc has grown from 14.1% in 2001 to 15%... the fastest growing “religious” demographics. It is anticipated the “non-believers” demographics will continue to grow and the Christians/Jewish decline for the next decade or two. See>>>http://www.gc.cuny.edu/faculty/research_briefs/aris/key_findings.htm There is a nice pie on that link, too. Only 37% of the US population consider themselves seriously religious. Take a look. Have a nice Easter. I may even go across the street to the big fancy Lutheran Church because I anticipate a big 'cookies and coffee' feed! May the farce be with you! This message has been edited. Last edited by: reducetension, Fri 10 April 2009 06:55 PM", 
        "intTime": 20090410, 
        "postID": 21, 
        "quote": "", 
        "reply": "The pie is colorful however, you, too, are mistaken, T. Here’s the more likely demographics as of 2008: Various Christian: 76% (down .6% from 2001) (Catholics remaining the largest at 25%) Jewish: 1.2% (down .1% from 2001) Muslim/Islam .6% (up .1% from 2001) Buddhist .5% remaining the same that past decade. New Religious/New Age 1.2% (an increase of .3% since 2001) No religion, atheist, etc has grown from 14.1% in 2001 to 15%... the fastest growing “religious” demographics. It is anticipated the “non-believers” demographics will continue to grow and the Christians/Jewish decline for the next decade or two. See>>>http://www.gc.cuny.edu/faculty/research_briefs/aris/key_findings.htm There is a nice pie on that link, too. Only 37% of the US population consider themselves seriously religious. Take a look. Have a nice Easter. I may even go across the street to the big fancy Lutheran Church because I anticipate a big 'cookies and coffee' feed! May the farce be with you! This message has been edited. Last edited by: reducetension, Fri 10 April 2009 06:55 PM", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 18:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "reducetension"
    }, 
    {
        "content": "I didn't make that pie chart myself. Someone else made it based on the results of one of the religion census-type polls from a couple of years ago. But while the exact numbers might vary slightly, the overall message is still the same - the religious group that comprises the vast majority (numerically) in the United States loves to claim that they're being oppressed or persecuted if another religious group makes so much as a peep. *Disclaimer: Not every member of every group thinks or acts the same way as other members of their group, and I know this. Some groups have a LOT of variation within the group. But anyway, the point of this thread was to wish people a happy Ostara, or the traditional start of spring in conjunction with the old lunar calendar.", 
        "intTime": 20090410, 
        "postID": 22, 
        "quote": "", 
        "reply": "I didn't make that pie chart myself. Someone else made it based on the results of one of the religion census-type polls from a couple of years ago. But while the exact numbers might vary slightly, the overall message is still the same - the religious group that comprises the vast majority (numerically) in the United States loves to claim that they're being oppressed or persecuted if another religious group makes so much as a peep. *Disclaimer: Not every member of every group thinks or acts the same way as other members of their group, and I know this. Some groups have a LOT of variation within the group. But anyway, the point of this thread was to wish people a happy Ostara, or the traditional start of spring in conjunction with the old lunar calendar.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 22:43:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Well then.... Belle Oester!!", 
        "intTime": 20090411, 
        "postID": 23, 
        "quote": "", 
        "reply": "Well then.... Belle Oester!!", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-11 08:39:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Well then.... Belle Oester!! Thank you kindly! We just finished the egg hunt. Our niece found 63 out of 65 eggs that I hid... with a lot of help. And now, our ADHD niece is getting ready to experience the ultimate sugar high. I think I'll go hide now.", 
        "intTime": 20090411, 
        "postID": 24, 
        "quote": "Originally posted by tawodi: Well then.... Belle Oester!!", 
        "reply": " Thank you kindly! We just finished the egg hunt. Our niece found 63 out of 65 eggs that I hid... with a lot of help. And now, our ADHD niece is getting ready to experience the ultimate sugar high. I think I'll go hide now.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-11 15:25:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: quote: Originally posted by soscorpio: quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me. Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J. That is because soscorpio thinks ignorance is a virtue and insults are a Christian act as long as they are to people that don't believe what he has been \"told to believe\" about \"his\" translation of \"his\" religious book.", 
        "intTime": 20090414, 
        "postID": 25, 
        "quote": "Originally posted by donniejanuarysr: quote: Originally posted by soscorpio: quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me. Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J.", 
        "reply": " That is because soscorpio thinks ignorance is a virtue and insults are a Christian act as long as they are to people that don't believe what he has been \"told to believe\" about \"his\" translation of \"his\" religious book.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-14 10:10:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: That is because soscorpio thinks ignorance is a virtue and insults Are you feeling guilty there buddy? Where's my insults?", 
        "intTime": 20090414, 
        "postID": 26, 
        "quote": "That is because soscorpio thinks ignorance is a virtue and insults", 
        "reply": " Are you feeling guilty there buddy? Where's my insults?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-14 11:16:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: That is because soscorpio thinks ignorance is a virtue and insults Are you feeling guilty there buddy? Where's my insults? NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones.", 
        "intTime": 20090414, 
        "postID": 27, 
        "quote": "Originally posted by soscorpio: quote: That is because soscorpio thinks ignorance is a virtue and insults Are you feeling guilty there buddy? Where's my insults?", 
        "reply": " NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-14 11:28:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. I don't care to know anything about paganism, but what is circulating around is the priestess wears black robes and worships deities that exist in all matter, right?", 
        "intTime": 20090414, 
        "postID": 28, 
        "quote": "NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones.", 
        "reply": " I don't care to know anything about paganism, but what is circulating around is the priestess wears black robes and worships deities that exist in all matter, right?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-14 11:32:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Blessed Ostara! This ancient holiday was once called Ēostre (also Ēastre) in Old English, and Ôstarâ in German. It celebrates the return of Spring. This celebration is traditionally held on the first full moon after the spring equinox, as this is traditionally a LUNAR month, not a Solar month. This is why the date is marked by the moon cycle, not the equinox. It is also the precise reason why the modern Easter celebration is held on the first Sunday after the first full moon after the spring equinox. (Easter is merely a Pagan holiday that was usurped by the Catholic church.) The Goddess Ostara (who may be merged from multiple traditions, and is known by several similar names from various languages) is known as the harbinger of the Sun. It is she who announces the rebirth of life in the Spring and holds the promise of new beginnings and summer growth. Ostara is a Goddess of fertility, rebirth, agriculture, purification, and health and healing Eggs were symbols of fertility, and were decorated and given as gifts in baskets made to resemble birds' nests. Rabbits and hares are symbols of fertility, and were considered sacred to Ostara. By tradition, Ostara is often pictured as having a rabbit's head or ears. The Easter Bunny and Easter Egg are absolutely Pagan symbols. But wait! This celebration traces even further back to the story of the Goddess Inanna (Ishtar), from whom the original \"Easter\" story comes. It's the ancient Sumerian story of 'Inanna's Descent to the Underworld'. According to the myth, the goddess plans to visit the underworld ruled by her dark sister Ereshkigal. After dressing in jewels and fine clothing, Inanna descends and is met by Ereshkigal’s servant, who at each of the seven gates to the underworld removes one of her garments. Finally she approaches her sister naked and humiliated. An angry Ereshkigal orders that she be killed and hangs her body on a peg to rot. After three days Inanna's servant becomes worried by her absence and fashions little creatures who descend unseen to the underworld with materials to breathe life back into the goddess. They resurrect her and she reascends to heaven. Sounds a bit familiar, doesn't it? As Ishtar descended, she was stripped and humiliated; according to the Bible mythos, Jesus was stripped, beaten and humbled. Ishtar was killed and hung on a stake; Jesus was hung on a cross. Ishtar was resurrected after three days; Jesus rose from the dead on the third day. Both achieved eternal life. Easter is in fact the same story as Ishtar. Easter is the celebration of an ancient Pagan holiday. Different cultures throughout history added their own minor twists, but the origin of the holiday remains the same. This is an ancient lunar Pagan holiday, which celebrates fertility, rebirth, and the return of spring. A joyful time indeed! It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. Blessed Ostara!", 
        "intTime": 20090408, 
        "postID": 29, 
        "quote": "", 
        "reply": "Blessed Ostara! This ancient holiday was once called Ēostre (also Ēastre) in Old English, and Ôstarâ in German. It celebrates the return of Spring. This celebration is traditionally held on the first full moon after the spring equinox, as this is traditionally a LUNAR month, not a Solar month. This is why the date is marked by the moon cycle, not the equinox. It is also the precise reason why the modern Easter celebration is held on the first Sunday after the first full moon after the spring equinox. (Easter is merely a Pagan holiday that was usurped by the Catholic church.) The Goddess Ostara (who may be merged from multiple traditions, and is known by several similar names from various languages) is known as the harbinger of the Sun. It is she who announces the rebirth of life in the Spring and holds the promise of new beginnings and summer growth. Ostara is a Goddess of fertility, rebirth, agriculture, purification, and health and healing Eggs were symbols of fertility, and were decorated and given as gifts in baskets made to resemble birds' nests. Rabbits and hares are symbols of fertility, and were considered sacred to Ostara. By tradition, Ostara is often pictured as having a rabbit's head or ears. The Easter Bunny and Easter Egg are absolutely Pagan symbols. But wait! This celebration traces even further back to the story of the Goddess Inanna (Ishtar), from whom the original \"Easter\" story comes. It's the ancient Sumerian story of 'Inanna's Descent to the Underworld'. According to the myth, the goddess plans to visit the underworld ruled by her dark sister Ereshkigal. After dressing in jewels and fine clothing, Inanna descends and is met by Ereshkigal’s servant, who at each of the seven gates to the underworld removes one of her garments. Finally she approaches her sister naked and humiliated. An angry Ereshkigal orders that she be killed and hangs her body on a peg to rot. After three days Inanna's servant becomes worried by her absence and fashions little creatures who descend unseen to the underworld with materials to breathe life back into the goddess. They resurrect her and she reascends to heaven. Sounds a bit familiar, doesn't it? As Ishtar descended, she was stripped and humiliated; according to the Bible mythos, Jesus was stripped, beaten and humbled. Ishtar was killed and hung on a stake; Jesus was hung on a cross. Ishtar was resurrected after three days; Jesus rose from the dead on the third day. Both achieved eternal life. Easter is in fact the same story as Ishtar. Easter is the celebration of an ancient Pagan holiday. Different cultures throughout history added their own minor twists, but the origin of the holiday remains the same. This is an ancient lunar Pagan holiday, which celebrates fertility, rebirth, and the return of spring. A joyful time indeed! It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. Blessed Ostara!", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-08 11:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "", 
        "intTime": 20090409, 
        "postID": 30, 
        "quote": "", 
        "reply": "", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 10:22:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus?", 
        "intTime": 20090409, 
        "postID": 31, 
        "quote": "It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts.", 
        "reply": " So you admit satan works to deceive the masses from his Lord Jesus?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 11:50:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I just heard from Flying Spaghetti Monster. Ar-r-r... He says He don't give a cannoli. Capisce?", 
        "intTime": 20090409, 
        "postID": 32, 
        "quote": "", 
        "reply": "I just heard from Flying Spaghetti Monster. Ar-r-r... He says He don't give a cannoli. Capisce?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 12:29:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus? So, Jesus is Satan's Lord, too? Sounds like quite a relationship. Who do you suppose will win? I wonder who is fooling who? How many 'old pagan traditions' do you suppose Christians observe (change the name to make them Christian?) I take it you'll avoid egg coloring and hunts this weekend? No chocolate bunnies or such? What happens to those faithful Christians who will be in their Sunday best this Sunday, after or before the Easter egg hunt? Going to hell for being deceived? How about grandma sending her grandkids cute bunny Easter cards, going to hell? Isn't Hell the mythical realm of Satan? Which Pagans worship human sacrifice, cannibalism and drinking of human-god's blood? Which Pagans believe the dead rise? Which Pagans have a god that killed it's own kid? Have a nice pagan weekend.", 
        "intTime": 20090409, 
        "postID": 33, 
        "quote": "Originally posted by soscorpio: quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus?", 
        "reply": " So, Jesus is Satan's Lord, too? Sounds like quite a relationship. Who do you suppose will win? I wonder who is fooling who? How many 'old pagan traditions' do you suppose Christians observe (change the name to make them Christian?) I take it you'll avoid egg coloring and hunts this weekend? No chocolate bunnies or such? What happens to those faithful Christians who will be in their Sunday best this Sunday, after or before the Easter egg hunt? Going to hell for being deceived? How about grandma sending her grandkids cute bunny Easter cards, going to hell? Isn't Hell the mythical realm of Satan? Which Pagans worship human sacrifice, cannibalism and drinking of human-god's blood? Which Pagans believe the dead rise? Which Pagans have a god that killed it's own kid? Have a nice pagan weekend.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 13:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus? Where the heck do you get anything about Satan out of what I posted? Satan is not part of any religious tradition I believe. There is no deception... except the deception of Catholics and Christians by their own church and historians. They're taking a holiday based on an older myth and pretending that the holiday is based on their own myth. Easter is the Christianized incarnation of Ostara, a much older holiday celebrating the return of spring, which has been celebrated by many cultures with variations on the same theme. And there's your daily dose of fact.", 
        "intTime": 20090409, 
        "postID": 34, 
        "quote": "Originally posted by soscorpio: quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. So you admit satan works to deceive the masses from his Lord Jesus?", 
        "reply": " Where the heck do you get anything about Satan out of what I posted? Satan is not part of any religious tradition I believe. There is no deception... except the deception of Catholics and Christians by their own church and historians. They're taking a holiday based on an older myth and pretending that the holiday is based on their own myth. Easter is the Christianized incarnation of Ostara, a much older holiday celebrating the return of spring, which has been celebrated by many cultures with variations on the same theme. And there's your daily dose of fact.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-09 18:22:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Whirled Peas - Thanks for posting this.", 
        "intTime": 20090410, 
        "postID": 35, 
        "quote": "", 
        "reply": "Whirled Peas - Thanks for posting this.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 00:27:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "dekeoboe"
    }, 
    {
        "content": "quote: It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts. Why would it warm your heart? Nobody gives a hooey about Easter being an ode to some goblin, it isn't. That's your psychosis believing we're all celebrating your witches. Paganism is satan's attempt to destroy catholicism. Catholics have folded in many ways to satan's charms, but they, like every individual with free-will do not represent the Words of God, only the Words and our Lord, Jesus Christ. He is your Lord, whether you recognize it or not. Show me where the flying monsters or trolls of your faith have a time-tested book from their supreme, or anything that matches the facts of the life of Jesus and the miracles He performed. The Bible has over 300 prophecies of the coming of Christ, it is easier to have someone elses fingerprint than to fulfill those prophesies. The romans knew they had killed the Messiah after His final breath. The earth shook and became dark at that moment. So again, you heart is warmed because why? It's not because we celebrate Easter it's because you think the masses are being decieved into celbrating something they are not, and to a certain extent it's true about your vile paganistic ceremony, but deception shouldn't warm you, you should advocate change, so that those that follow your sick rituals know they are flirting with the fate of their souls. Where does your soul go BTW? What has Kroolu told you?", 
        "intTime": 20090410, 
        "postID": 36, 
        "quote": "It warms my heart to see so many people across the nation celebrating old pagan traditions such as egg coloring and egg hunts.", 
        "reply": " Why would it warm your heart? Nobody gives a hooey about Easter being an ode to some goblin, it isn't. That's your psychosis believing we're all celebrating your witches. Paganism is satan's attempt to destroy catholicism. Catholics have folded in many ways to satan's charms, but they, like every individual with free-will do not represent the Words of God, only the Words and our Lord, Jesus Christ. He is your Lord, whether you recognize it or not. Show me where the flying monsters or trolls of your faith have a time-tested book from their supreme, or anything that matches the facts of the life of Jesus and the miracles He performed. The Bible has over 300 prophecies of the coming of Christ, it is easier to have someone elses fingerprint than to fulfill those prophesies. The romans knew they had killed the Messiah after His final breath. The earth shook and became dark at that moment. So again, you heart is warmed because why? It's not because we celebrate Easter it's because you think the masses are being decieved into celbrating something they are not, and to a certain extent it's true about your vile paganistic ceremony, but deception shouldn't warm you, you should advocate change, so that those that follow your sick rituals know they are flirting with the fate of their souls. Where does your soul go BTW? What has Kroolu told you?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 08:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: He is your Lord, whether you recognize it or not. Nope. Nice try, but no. quote: Show me where the flying monsters or trolls of your faith have a time-tested book from their supreme, or anything that matches the facts of the life of Jesus and the miracles He performed. Stop pretending you know anything about my beliefs, when it's clear that you don't. There are no \"flying monsters or trolls\" according to my beliefs. There's the sun, the moon, the seasons, the earth, and whimsical interpretations that are used to teach about spirituality. Stop reading Harry Potter under the delusion that you're reading about anyone's beliefs. quote: The romans knew they had killed the Messiah after His final breath. The earth shook and became dark at that moment. That's your myth, not mine. quote: So again, you heart is warmed because why? Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. quote: It's not because we celebrate Easter it's because you think the masses are being decieved into celbrating something they are not, and to a certain extent it's true about your vile paganistic ceremony, but deception shouldn't warm you, you should advocate change, so that those that follow your sick rituals know they are flirting with the fate of their souls. Vile paganistic ceremony? Sick rituals? What the heck are you talking about? Don't speak gibberish. What is this alleged ceremony you think you know about? Because I haven't heard about it. So how about qualifying that statement, because you're clearly fabricating some bizarre mental image about this which in no way resembles reality. For that matter... there's a lovely thread about Easter on this forum, if you wish to discuss Easter. I started this thread to wish people a happy Ostara, and welcome the return of spring with an acknowledgment of the old traditions and the origins of the holiday, not to listen to someone preach about another religion. Why not go talk about Easter on the Easter thread, and let those who wish to enjoy the season according to the old ways enjoy the wish of the happy holiday without your vitriol? quote: Where does your soul go BTW? What has Kroolu told you? What the heck is Kroolu? You really need to stop reading science fiction and fantasy books and mistaking them for reality. Where does the soul go? Eventually, back to its unity with the rest of the universe and God. Some of us just have a different perspective regarding the fairy tales you both love and hate. To me, they're all the same.", 
        "intTime": 20090410, 
        "postID": 37, 
        "quote": "Originally posted by soscorpio: He is your Lord, whether you recognize it or not.", 
        "reply": " Nope. Nice try, but no. quote: Show me where the flying monsters or trolls of your faith have a time-tested book from their supreme, or anything that matches the facts of the life of Jesus and the miracles He performed. Stop pretending you know anything about my beliefs, when it's clear that you don't. There are no \"flying monsters or trolls\" according to my beliefs. There's the sun, the moon, the seasons, the earth, and whimsical interpretations that are used to teach about spirituality. Stop reading Harry Potter under the delusion that you're reading about anyone's beliefs. quote: The romans knew they had killed the Messiah after His final breath. The earth shook and became dark at that moment. That's your myth, not mine. quote: So again, you heart is warmed because why? Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. quote: It's not because we celebrate Easter it's because you think the masses are being decieved into celbrating something they are not, and to a certain extent it's true about your vile paganistic ceremony, but deception shouldn't warm you, you should advocate change, so that those that follow your sick rituals know they are flirting with the fate of their souls. Vile paganistic ceremony? Sick rituals? What the heck are you talking about? Don't speak gibberish. What is this alleged ceremony you think you know about? Because I haven't heard about it. So how about qualifying that statement, because you're clearly fabricating some bizarre mental image about this which in no way resembles reality. For that matter... there's a lovely thread about Easter on this forum, if you wish to discuss Easter. I started this thread to wish people a happy Ostara, and welcome the return of spring with an acknowledgment of the old traditions and the origins of the holiday, not to listen to someone preach about another religion. Why not go talk about Easter on the Easter thread, and let those who wish to enjoy the season according to the old ways enjoy the wish of the happy holiday without your vitriol? quote: Where does your soul go BTW? What has Kroolu told you? What the heck is Kroolu? You really need to stop reading science fiction and fantasy books and mistaking them for reality. Where does the soul go? Eventually, back to its unity with the rest of the universe and God. Some of us just have a different perspective regarding the fairy tales you both love and hate. To me, they're all the same.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 09:39:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: What the heck is Kroolu? I think he was trying to invoke the Name of Our Dread Lord, Cthulu. Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "intTime": 20090410, 
        "postID": 38, 
        "quote": "What the heck is Kroolu?", 
        "reply": " I think he was trying to invoke the Name of Our Dread Lord, Cthulu. Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 10:32:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "BonoboJones"
    }, 
    {
        "content": "quote: What the heck is Kroolu? You really need to stop reading science fiction and fantasy books and mistaking them for reality. Me thinketh it's too late! soscorpio is no doubt observing this weekend something akin to the Jerusalem 'chain saw massacre' and the very popular horror story about dead coming back to life and returning to a far away planet from whenst it will return to vanquish the Earth and capture the faithful.... nearly sounds like Scientology or Planet of the Apes or .... and it's way too late for him to stop believing in sci-fi, horror stories and such, as one distinguished poster puts it, the Buy Bull.", 
        "intTime": 20090410, 
        "postID": 39, 
        "quote": "What the heck is Kroolu? You really need to stop reading science fiction and fantasy books and mistaking them for reality.", 
        "reply": " Me thinketh it's too late! soscorpio is no doubt observing this weekend something akin to the Jerusalem 'chain saw massacre' and the very popular horror story about dead coming back to life and returning to a far away planet from whenst it will return to vanquish the Earth and capture the faithful.... nearly sounds like Scientology or Planet of the Apes or .... and it's way too late for him to stop believing in sci-fi, horror stories and such, as one distinguished poster puts it, the Buy Bull.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 10:48:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me.", 
        "intTime": 20090410, 
        "postID": 40, 
        "quote": "Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression.", 
        "reply": " NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:11:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me. Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J.", 
        "intTime": 20090410, 
        "postID": 41, 
        "quote": "Originally posted by soscorpio: quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me.", 
        "reply": " Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:26:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Dung gods, wow that’s harsh.", 
        "intTime": 20090410, 
        "postID": 42, 
        "quote": "", 
        "reply": "Dung gods, wow that’s harsh.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:34:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. There he goes with the sci-fi and fantasy stories again. You really need to be careful about what you read, seeing as you have a hard time separating fact from fiction. Sorry, no black robes here. Also no animal sacrifice, no chicken blood, no voodoo dolls, and no virgin sacrifice. We don't do those sorts of things - we find them disgusting, violent, and distasteful. Actually... human sacrifice is what YOU are celebrating this weekend. Bloody, brutal murder. quote: Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Lovely insinuation. You just HAVE to hassle anyone who doesn't believe the same thing you do. Notice that I haven't pestered anyone on the Easter thread. Clearly, you're happy to sink to that level. Sure, it's Easter. It's also Ostara. Come May Day, we'll be celebrating Beltane. And Christmas has always been Yule... hence the Yule log, which was burned to keep the fire alive through the longest night of the year while everyone waits to welcome the rebirth of the sun. You celebrate your holidays your way, and I'll celebrate my holidays my way. I won't hassle you as long as you don't hassle me. Are you capable of not hassling others? Or do you need to attack anyone of a different faith than your own under the twisted notion that the mere EXISTENCE of other religions is an attack on your own?", 
        "intTime": 20090410, 
        "postID": 43, 
        "quote": "Originally posted by soscorpio: NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones.", 
        "reply": " There he goes with the sci-fi and fantasy stories again. You really need to be careful about what you read, seeing as you have a hard time separating fact from fiction. Sorry, no black robes here. Also no animal sacrifice, no chicken blood, no voodoo dolls, and no virgin sacrifice. We don't do those sorts of things - we find them disgusting, violent, and distasteful. Actually... human sacrifice is what YOU are celebrating this weekend. Bloody, brutal murder. quote: Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Lovely insinuation. You just HAVE to hassle anyone who doesn't believe the same thing you do. Notice that I haven't pestered anyone on the Easter thread. Clearly, you're happy to sink to that level. Sure, it's Easter. It's also Ostara. Come May Day, we'll be celebrating Beltane. And Christmas has always been Yule... hence the Yule log, which was burned to keep the fire alive through the longest night of the year while everyone waits to welcome the rebirth of the sun. You celebrate your holidays your way, and I'll celebrate my holidays my way. I won't hassle you as long as you don't hassle me. Are you capable of not hassling others? Or do you need to attack anyone of a different faith than your own under the twisted notion that the mere EXISTENCE of other religions is an attack on your own?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:37:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J. Yeah, WorldPee goes on & on about the evils of Christianity. If someone shoots someone and mentions god in their death rant, she gleefully says \"SEE!, it's EEEVIL! There is no greater love than the love of our only God. He loves her, but it won't last forever, only for the duration of her earthly life, then the just God must do the right thing. She can escape her punishments as we all have our sins, the blood of the Christ is the payment for our crimes, but can only be redeemed by repenting. Good work yourself, on that other lunatic thread about the 2nd Amendment. There are some real nutcases here. They think momma gov't is doing all she can to tuck us in each night, when she's really trying to suffocate us.", 
        "intTime": 20090410, 
        "postID": 44, 
        "quote": "Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J.", 
        "reply": " Yeah, WorldPee goes on & on about the evils of Christianity. If someone shoots someone and mentions god in their death rant, she gleefully says \"SEE!, it's EEEVIL! There is no greater love than the love of our only God. He loves her, but it won't last forever, only for the duration of her earthly life, then the just God must do the right thing. She can escape her punishments as we all have our sins, the blood of the Christ is the payment for our crimes, but can only be redeemed by repenting. Good work yourself, on that other lunatic thread about the 2nd Amendment. There are some real nutcases here. They think momma gov't is doing all she can to tuck us in each night, when she's really trying to suffocate us.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 11:42:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Please don't suspend me. I don't think today is the day Christians should be asking not to be 'suspended'! And, btw, the Ten Commands assumes there are other \"gods\".... you are the one who is not to have others, evidently. She can worship whatever and whoever she wants. You are the one ascribing to \"theory\" in the bible. It's written to you, not her. May the farce be with you!", 
        "intTime": 20090410, 
        "postID": 45, 
        "quote": "Please don't suspend me.", 
        "reply": " I don't think today is the day Christians should be asking not to be 'suspended'! And, btw, the Ten Commands assumes there are other \"gods\".... you are the one who is not to have others, evidently. She can worship whatever and whoever she wants. You are the one ascribing to \"theory\" in the bible. It's written to you, not her. May the farce be with you!", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 12:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "reducetension"
    }, 
    {
        "content": "Hey WP. Love the pie chart. Click Save Archived Oh, and my you & yours have a happy Ostara. Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "intTime": 20090410, 
        "postID": 46, 
        "quote": "", 
        "reply": "Hey WP. Love the pie chart. Click Save Archived Oh, and my you & yours have a happy Ostara. Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 13:01:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "BonoboJones"
    }, 
    {
        "content": "quote: Originally posted by BonoboJones: Hey WP. Love the pie chart. Click Save Archived Oh, and my you & yours have a happy Ostara. Ditto! Welcome back, AJ! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090410, 
        "postID": 47, 
        "quote": "Originally posted by BonoboJones: Hey WP. Love the pie chart. Click Save Archived Oh, and my you & yours have a happy Ostara.", 
        "reply": " Ditto! Welcome back, AJ! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 14:03:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "KJ1110"
    }, 
    {
        "content": "A.J.; The pie chart is wrong. There are approx. two point three billion Christians.....there are approx. one point five billion Muslims...as you can see the tiny splinter depicted for the people of Islam is WAaay off!! So is the one for Hindu there are over a billion of them!! Jews...about eighteen million Buddhist....about nine hundred million These are world wide figures, if you are talking those who identify themselves as Christians in the U.S....well then, about eighty six percent of Americans do, then the chart is not so far out. T", 
        "intTime": 20090410, 
        "postID": 48, 
        "quote": "", 
        "reply": "A.J.; The pie chart is wrong. There are approx. two point three billion Christians.....there are approx. one point five billion Muslims...as you can see the tiny splinter depicted for the people of Islam is WAaay off!! So is the one for Hindu there are over a billion of them!! Jews...about eighteen million Buddhist....about nine hundred million These are world wide figures, if you are talking those who identify themselves as Christians in the U.S....well then, about eighty six percent of Americans do, then the chart is not so far out. T", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 17:53:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "tawodi"
    }, 
    {
        "content": "The pie is colorful however, you, too, are mistaken, T. Here’s the more likely demographics as of 2008: Various Christian: 76% (down .6% from 2001) (Catholics remaining the largest at 25%) Jewish: 1.2% (down .1% from 2001) Muslim/Islam .6% (up .1% from 2001) Buddhist .5% remaining the same that past decade. New Religious/New Age 1.2% (an increase of .3% since 2001) No religion, atheist, etc has grown from 14.1% in 2001 to 15%... the fastest growing “religious” demographics. It is anticipated the “non-believers” demographics will continue to grow and the Christians/Jewish decline for the next decade or two. See>>>http://www.gc.cuny.edu/faculty/research_briefs/aris/key_findings.htm There is a nice pie on that link, too. Only 37% of the US population consider themselves seriously religious. Take a look. Have a nice Easter. I may even go across the street to the big fancy Lutheran Church because I anticipate a big 'cookies and coffee' feed! May the farce be with you! This message has been edited. Last edited by: reducetension, Fri 10 April 2009 06:55 PM", 
        "intTime": 20090410, 
        "postID": 49, 
        "quote": "", 
        "reply": "The pie is colorful however, you, too, are mistaken, T. Here’s the more likely demographics as of 2008: Various Christian: 76% (down .6% from 2001) (Catholics remaining the largest at 25%) Jewish: 1.2% (down .1% from 2001) Muslim/Islam .6% (up .1% from 2001) Buddhist .5% remaining the same that past decade. New Religious/New Age 1.2% (an increase of .3% since 2001) No religion, atheist, etc has grown from 14.1% in 2001 to 15%... the fastest growing “religious” demographics. It is anticipated the “non-believers” demographics will continue to grow and the Christians/Jewish decline for the next decade or two. See>>>http://www.gc.cuny.edu/faculty/research_briefs/aris/key_findings.htm There is a nice pie on that link, too. Only 37% of the US population consider themselves seriously religious. Take a look. Have a nice Easter. I may even go across the street to the big fancy Lutheran Church because I anticipate a big 'cookies and coffee' feed! May the farce be with you! This message has been edited. Last edited by: reducetension, Fri 10 April 2009 06:55 PM", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 18:21:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "reducetension"
    }, 
    {
        "content": "I didn't make that pie chart myself. Someone else made it based on the results of one of the religion census-type polls from a couple of years ago. But while the exact numbers might vary slightly, the overall message is still the same - the religious group that comprises the vast majority (numerically) in the United States loves to claim that they're being oppressed or persecuted if another religious group makes so much as a peep. *Disclaimer: Not every member of every group thinks or acts the same way as other members of their group, and I know this. Some groups have a LOT of variation within the group. But anyway, the point of this thread was to wish people a happy Ostara, or the traditional start of spring in conjunction with the old lunar calendar.", 
        "intTime": 20090410, 
        "postID": 50, 
        "quote": "", 
        "reply": "I didn't make that pie chart myself. Someone else made it based on the results of one of the religion census-type polls from a couple of years ago. But while the exact numbers might vary slightly, the overall message is still the same - the religious group that comprises the vast majority (numerically) in the United States loves to claim that they're being oppressed or persecuted if another religious group makes so much as a peep. *Disclaimer: Not every member of every group thinks or acts the same way as other members of their group, and I know this. Some groups have a LOT of variation within the group. But anyway, the point of this thread was to wish people a happy Ostara, or the traditional start of spring in conjunction with the old lunar calendar.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-10 22:43:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Well then.... Belle Oester!!", 
        "intTime": 20090411, 
        "postID": 51, 
        "quote": "", 
        "reply": "Well then.... Belle Oester!!", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-11 08:39:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Well then.... Belle Oester!! Thank you kindly! We just finished the egg hunt. Our niece found 63 out of 65 eggs that I hid... with a lot of help. And now, our ADHD niece is getting ready to experience the ultimate sugar high. I think I'll go hide now.", 
        "intTime": 20090411, 
        "postID": 52, 
        "quote": "Originally posted by tawodi: Well then.... Belle Oester!!", 
        "reply": " Thank you kindly! We just finished the egg hunt. Our niece found 63 out of 65 eggs that I hid... with a lot of help. And now, our ADHD niece is getting ready to experience the ultimate sugar high. I think I'll go hide now.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-11 15:25:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: quote: Originally posted by soscorpio: quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me. Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J. That is because soscorpio thinks ignorance is a virtue and insults are a Christian act as long as they are to people that don't believe what he has been \"told to believe\" about \"his\" translation of \"his\" religious book.", 
        "intTime": 20090414, 
        "postID": 53, 
        "quote": "Originally posted by donniejanuarysr: quote: Originally posted by soscorpio: quote: Because it's nice to see traditions that are thousands of years old being continued. It gives people roots to their pasts. The people of Northern Europe - the Celts and other related tribes - had their history trampled by invading Christian armies. It's nice to see that some things survived the bloodshed and vicious oppression. NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. It is a shame satan has perverted many who preach the Word causing many to foolishly contribute to abominations like paganism unknowingly. So, enjoy your \"warm heart\" as you watch so many stray from what they think they are doing. Satan is a deciever and those that decieve or cherish deception ........... (I'll stop there because I like communicating here) Sorry Nemesis1960, it IS Easter and is ridiculous to make a point that everyone with their eggs and such are pagans and that it is so wonderful to see the ancient customs continue. Please don't suspend me. Dang this one realy jumped out there, I thought some of my wifes aunts were bible tumping, ground stomping, hell proclaiming people, but dang soscorpio got em beat. D.J.", 
        "reply": " That is because soscorpio thinks ignorance is a virtue and insults are a Christian act as long as they are to people that don't believe what he has been \"told to believe\" about \"his\" translation of \"his\" religious book.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-14 10:10:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: That is because soscorpio thinks ignorance is a virtue and insults Are you feeling guilty there buddy? Where's my insults?", 
        "intTime": 20090414, 
        "postID": 54, 
        "quote": "That is because soscorpio thinks ignorance is a virtue and insults", 
        "reply": " Are you feeling guilty there buddy? Where's my insults?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-14 11:16:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: That is because soscorpio thinks ignorance is a virtue and insults Are you feeling guilty there buddy? Where's my insults? NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones.", 
        "intTime": 20090414, 
        "postID": 55, 
        "quote": "Originally posted by soscorpio: quote: That is because soscorpio thinks ignorance is a virtue and insults Are you feeling guilty there buddy? Where's my insults?", 
        "reply": " NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones.", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-14 11:28:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones. I don't care to know anything about paganism, but what is circulating around is the priestess wears black robes and worships deities that exist in all matter, right?", 
        "intTime": 20090414, 
        "postID": 56, 
        "quote": "NOBODY is celebrating your sun, moon, & dung gods, only you and the black robed ones.", 
        "reply": " I don't care to know anything about paganism, but what is circulating around is the priestess wears black robes and worships deities that exist in all matter, right?", 
        "threadID": "1270031990001_7810081022001", 
        "time": "2009-04-14 11:32:00", 
        "title": "Ostara: Holiday of spring, rebirth, new life, and fertility.", 
        "userID": "soscorpio"
    }
]