[
    {
        "content": "Yesterday, we buried one of our church's long-time stalwarts, J.T. He was a 90 year-old combat Veteran of WWII and a magnificent man of God. Though he had no children of his own, he was the unofficial church \"Dad\" to generations of kids and one of the few genuine intellects in our midst. Of course, he and his wife, Jackie, had their favorite seats on the second row, just in front of where I sit with my grandkids, and they'd used that pew for nearly 30 years. This morning, the sunlight streaming through the window briefly made the shape of a Cross right underneath J.T's seat. It didn't last long enough for more than a couple of ladies to see it and was gone before they could rush to find witnesses. Both of those ladies are of impecable character, so they didn't make it up. Significant? Indicative of anything? An analomy which has happened before and nobody noticed? I don't know. You tell me.", 
        "intTime": 20090322, 
        "postID": 1, 
        "quote": "", 
        "reply": "Yesterday, we buried one of our church's long-time stalwarts, J.T. He was a 90 year-old combat Veteran of WWII and a magnificent man of God. Though he had no children of his own, he was the unofficial church \"Dad\" to generations of kids and one of the few genuine intellects in our midst. Of course, he and his wife, Jackie, had their favorite seats on the second row, just in front of where I sit with my grandkids, and they'd used that pew for nearly 30 years. This morning, the sunlight streaming through the window briefly made the shape of a Cross right underneath J.T's seat. It didn't last long enough for more than a couple of ladies to see it and was gone before they could rush to find witnesses. Both of those ladies are of impecable character, so they didn't make it up. Significant? Indicative of anything? An analomy which has happened before and nobody noticed? I don't know. You tell me.", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-22 12:11:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Yesterday, we buried one of our church's long-time stalwarts, J.T. He was a 90 year-old combat Veteran of WWII and a magnificent man of God. Though he had no children of his own, he was the unofficial church \"Dad\" to generations of kids and one of the few genuine intellects in our midst. Of course, he and his wife, Jackie, had their favorite seats on the second row, just in front of where I sit with my grandkids, and they'd used that pew for nearly 30 years. This morning, the sunlight streaming through the window briefly made the shape of a Cross right underneath J.T's seat. It didn't last long enough for more than a couple of ladies to see it and was gone before they could rush to find witnesses. Both of those ladies are of impecable character, so they didn't make it up. Significant? Indicative of anything? An analomy which has happened before and nobody noticed? I don't know. You tell me. Darned right. It's significant of a window manufactured with refractory properties that allow it to produce a cross shape when light shines through it... which isn't all that uncommon. If it made the old girls happy and gave them something to jaw about, I guess it isn't all bad. 'http://www.falsemessiahs.com/maitreya.htm What made the guy such an \"intellectual,\" btw? (We usually call somebody smart if they agree with us.)", 
        "intTime": 20090322, 
        "postID": 2, 
        "quote": "Originally posted by stillkit: Yesterday, we buried one of our church's long-time stalwarts, J.T. He was a 90 year-old combat Veteran of WWII and a magnificent man of God. Though he had no children of his own, he was the unofficial church \"Dad\" to generations of kids and one of the few genuine intellects in our midst. Of course, he and his wife, Jackie, had their favorite seats on the second row, just in front of where I sit with my grandkids, and they'd used that pew for nearly 30 years. This morning, the sunlight streaming through the window briefly made the shape of a Cross right underneath J.T's seat. It didn't last long enough for more than a couple of ladies to see it and was gone before they could rush to find witnesses. Both of those ladies are of impecable character, so they didn't make it up. Significant? Indicative of anything? An analomy which has happened before and nobody noticed? I don't know. You tell me.", 
        "reply": " Darned right. It's significant of a window manufactured with refractory properties that allow it to produce a cross shape when light shines through it... which isn't all that uncommon. If it made the old girls happy and gave them something to jaw about, I guess it isn't all bad. 'http://www.falsemessiahs.com/maitreya.htm What made the guy such an \"intellectual,\" btw? (We usually call somebody smart if they agree with us.)", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-22 17:02:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: What made the guy such an \"intellectual,\" btw? (We usually call somebody smart if they agree with us.) I suppose he was an intellectual by my definition of the term. He didn't accept anything at face value, was something of a cynic and open to new ideas and concepts. There was nothing \"closed\" about his mind at all.", 
        "intTime": 20090322, 
        "postID": 3, 
        "quote": "Originally posted by billbright: What made the guy such an \"intellectual,\" btw? (We usually call somebody smart if they agree with us.)", 
        "reply": " I suppose he was an intellectual by my definition of the term. He didn't accept anything at face value, was something of a cynic and open to new ideas and concepts. There was nothing \"closed\" about his mind at all.", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-22 19:00:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by billbright: Darned right. It's significant of a window manufactured with refractory properties that allow it to produce a cross shape when light shines through it... which isn't all that uncommon. If it made the old girls happy and gave them something to jaw about, I guess it isn't all bad. I'm not one of those who look for signs and neither am I convinced there is any contact between the living and the dead. And, yes, I'm fully aware of the mechanics of refracted light. On the other hand, neither am I the sort who would categorically reject something just because I've already made up my mind it can't happen. Was it a sign of comfort to the church or his wife? I don't know. I do know that church building has been there for over 20 years. In fact, it's been there since J.T. and my Dad built it back in the 80's. J.T. sat in that exact spot every Sunday, and my Dad sat right behind him. Later, I took over that spot and have sat there for better than 10 years and I never saw it happen before. Neither has anyone else. You would think that with the passage of time and seasons, it would have occured before and someone would have noticed. Perhaps it did. Perhaps it didn't. Another thing I know is that I've heard many, many recently widowed people, including my own Mom, tell of something happening, some vision, some something regarding the recently deceased loved one, something which happened within a few days or weeks which brought them comfort and release. In Mom's case, she swears she was fully awake when Dad came into the bed room, laid down in his usual spot and said, \"I see you've got my pillow,\" and then disappeared. Fantasy? Self-generated from grief? Delusion? Maybe. But, maybe it's also a reassurance offered by a loving God. I frankly don't know, but I'm not about to be the one who says it isn't.", 
        "intTime": 20090322, 
        "postID": 4, 
        "quote": "Originally posted by billbright: Darned right. It's significant of a window manufactured with refractory properties that allow it to produce a cross shape when light shines through it... which isn't all that uncommon. If it made the old girls happy and gave them something to jaw about, I guess it isn't all bad.", 
        "reply": " I'm not one of those who look for signs and neither am I convinced there is any contact between the living and the dead. And, yes, I'm fully aware of the mechanics of refracted light. On the other hand, neither am I the sort who would categorically reject something just because I've already made up my mind it can't happen. Was it a sign of comfort to the church or his wife? I don't know. I do know that church building has been there for over 20 years. In fact, it's been there since J.T. and my Dad built it back in the 80's. J.T. sat in that exact spot every Sunday, and my Dad sat right behind him. Later, I took over that spot and have sat there for better than 10 years and I never saw it happen before. Neither has anyone else. You would think that with the passage of time and seasons, it would have occured before and someone would have noticed. Perhaps it did. Perhaps it didn't. Another thing I know is that I've heard many, many recently widowed people, including my own Mom, tell of something happening, some vision, some something regarding the recently deceased loved one, something which happened within a few days or weeks which brought them comfort and release. In Mom's case, she swears she was fully awake when Dad came into the bed room, laid down in his usual spot and said, \"I see you've got my pillow,\" and then disappeared. Fantasy? Self-generated from grief? Delusion? Maybe. But, maybe it's also a reassurance offered by a loving God. I frankly don't know, but I'm not about to be the one who says it isn't.", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-22 19:48:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "stillkit"
    }, 
    {
        "content": "confirmation bias you never noticed it before because it has never seemed significant before", 
        "intTime": 20090322, 
        "postID": 5, 
        "quote": "", 
        "reply": "confirmation bias you never noticed it before because it has never seemed significant before", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-22 20:31:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: confirmation bias you never noticed it before because it has never seemed significant before Maybe. Heck, probably. But, being as it would have appeared inside a Christian church, I can't imagine that I wouldn't have noticed it.", 
        "intTime": 20090322, 
        "postID": 6, 
        "quote": "Originally posted by liberal90: confirmation bias you never noticed it before because it has never seemed significant before", 
        "reply": " Maybe. Heck, probably. But, being as it would have appeared inside a Christian church, I can't imagine that I wouldn't have noticed it.", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-22 20:43:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "stillkit"
    }, 
    {
        "content": "My guess is that it may have happened every year on the same date in that spot. On earlier dates, it might happen in spots before that, and on later dates, in spots after that. Depending upon the latitude, layout, and design of the church and windows, it might even happen twice a year. It just so happened (1 or 2 chances in 365) that it hit that spot when he was missing from it, and it got noticed because someone was staring at the empty spot where an old friend used to sit. Furthermore, any intersection of two beams of light would most likely be interpreted as a cross when witnessed in a Christian church. Nevertheless, my condolences on your loss. It sounds as if he will be missed.", 
        "intTime": 20090322, 
        "postID": 7, 
        "quote": "", 
        "reply": "My guess is that it may have happened every year on the same date in that spot. On earlier dates, it might happen in spots before that, and on later dates, in spots after that. Depending upon the latitude, layout, and design of the church and windows, it might even happen twice a year. It just so happened (1 or 2 chances in 365) that it hit that spot when he was missing from it, and it got noticed because someone was staring at the empty spot where an old friend used to sit. Furthermore, any intersection of two beams of light would most likely be interpreted as a cross when witnessed in a Christian church. Nevertheless, my condolences on your loss. It sounds as if he will be missed.", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-22 20:50:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by billbright: What made the guy such an \"intellectual,\" btw? (We usually call somebody smart if they agree with us.) I suppose he was an intellectual by my definition of the term. He didn't accept anything at face value, was something of a cynic and open to new ideas and concepts. There was nothing \"closed\" about his mind at all. Well, there's that. And the limit of his disassociation with phony things does seem to have about the same quality as yours. No wonder you were friends. We all hate to see them go, but to make them linger might be an unkindness. Here's to old friends, now deceased.", 
        "intTime": 20090323, 
        "postID": 8, 
        "quote": "Originally posted by stillkit: quote: Originally posted by billbright: What made the guy such an \"intellectual,\" btw? (We usually call somebody smart if they agree with us.) I suppose he was an intellectual by my definition of the term. He didn't accept anything at face value, was something of a cynic and open to new ideas and concepts. There was nothing \"closed\" about his mind at all.", 
        "reply": " Well, there's that. And the limit of his disassociation with phony things does seem to have about the same quality as yours. No wonder you were friends. We all hate to see them go, but to make them linger might be an unkindness. Here's to old friends, now deceased.", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-23 16:16:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by stillkit: quote: Originally posted by billbright: What made the guy such an \"intellectual,\" btw? (We usually call somebody smart if they agree with us.) I suppose he was an intellectual by my definition of the term. He didn't accept anything at face value, was something of a cynic and open to new ideas and concepts. There was nothing \"closed\" about his mind at all. Well, there's that. And the limit of his disassociation with phony things does seem to have about the same quality as yours. No wonder you were friends. We all hate to see them go, but to make them linger might be an unkindness. Here's to old friends, now deceased.", 
        "intTime": 20090323, 
        "postID": 9, 
        "quote": "Originally posted by billbright: quote: Originally posted by stillkit: quote: Originally posted by billbright: What made the guy such an \"intellectual,\" btw? (We usually call somebody smart if they agree with us.) I suppose he was an intellectual by my definition of the term. He didn't accept anything at face value, was something of a cynic and open to new ideas and concepts. There was nothing \"closed\" about his mind at all. Well, there's that. And the limit of his disassociation with phony things does seem to have about the same quality as yours. No wonder you were friends. We all hate to see them go, but to make them linger might be an unkindness. Here's to old friends, now deceased.", 
        "reply": "", 
        "threadID": "1270031990001_8820085812001", 
        "time": "2009-03-23 16:32:00", 
        "title": "The strangest thing happened in church today!", 
        "userID": "donniejanuarysr"
    }
]