[
    {
        "content": "As president of the Military Association of Atheists & Freethinkers, I've got a few speaking engagements coming up* - Greater Worcester (Mass.) Humanists on 12 May NYC Atheists radio show (taped 13 May, uncertain air date) Ethical Humanist Society of Philadelphia, 24 May American Humanist Association Conference (Phoenix), 5 June Each organization has a website with more information. Jason * I'm not making money on any of this. I thought people might be interested. ** I like the new prohibition on links - Obama is great, but I say Google for president", 
        "intTime": 20090510, 
        "postID": 1, 
        "quote": "", 
        "reply": "As president of the Military Association of Atheists & Freethinkers, I've got a few speaking engagements coming up* - Greater Worcester (Mass.) Humanists on 12 May NYC Atheists radio show (taped 13 May, uncertain air date) Ethical Humanist Society of Philadelphia, 24 May American Humanist Association Conference (Phoenix), 5 June Each organization has a website with more information. Jason * I'm not making money on any of this. I thought people might be interested. ** I like the new prohibition on links - Obama is great, but I say Google for president", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 08:41:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "dday76"
    }, 
    {
        "content": "I though atheists didn't talk about religion, since the concept of gods doesn't merit it?", 
        "intTime": 20090510, 
        "postID": 2, 
        "quote": "", 
        "reply": "I though atheists didn't talk about religion, since the concept of gods doesn't merit it?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 08:57:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: I though atheists didn't talk about religion, since the concept of gods doesn't merit it? It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called.", 
        "intTime": 20090510, 
        "postID": 3, 
        "quote": "Originally posted by soscorpio: I though atheists didn't talk about religion, since the concept of gods doesn't merit it?", 
        "reply": " It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 10:22:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called. quote: It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called. So Atheist are overly paranoid people? Listen, I don't think of the wrath of the flying spaghetti monster because I have zero belief in its existence. You won't find me president of an association discussing spaghetti theory, as logic says that since I think the concept is ridiculous, I have no reason to even discuss it.", 
        "intTime": 20090510, 
        "postID": 4, 
        "quote": "It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called.", 
        "reply": "  So Atheist are overly paranoid people? Listen, I don't think of the wrath of the flying spaghetti monster because I have zero belief in its existence. You won't find me president of an association discussing spaghetti theory, as logic says that since I think the concept is ridiculous, I have no reason to even discuss it.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 10:59:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "But it isn't discussing mythical beings. It is discussing those who would propogate the public (read governmental) sphere with that nonsense.", 
        "intTime": 20090510, 
        "postID": 5, 
        "quote": "", 
        "reply": "But it isn't discussing mythical beings. It is discussing those who would propogate the public (read governmental) sphere with that nonsense.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:22:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: It is discussing those who would propogate the public (read governmental) sphere with that nonsense. Nonsense? You'll remeber that phrase when those in power soon put you in a position that is very difficult to understand. Only God cares for your everlasting liberty and justice not gov't buddy!", 
        "intTime": 20090510, 
        "postID": 6, 
        "quote": "It is discussing those who would propogate the public (read governmental) sphere with that nonsense.", 
        "reply": " Nonsense? You'll remeber that phrase when those in power soon put you in a position that is very difficult to understand. Only God cares for your everlasting liberty and justice not gov't buddy!", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:36:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: It is discussing those who would propogate the public (read governmental) sphere with that nonsense. Nonsense? You'll remeber that phrase when those in power soon put you in a position that is very difficult to understand. Only God cares for your everlasting liberty and justice not gov't buddy! Since your god does not exist, to me, it really doesn't matter what it thinks. And as for gov't, the last CIC is the one who really screwed things up.", 
        "intTime": 20090510, 
        "postID": 7, 
        "quote": "Originally posted by soscorpio: quote: It is discussing those who would propogate the public (read governmental) sphere with that nonsense. Nonsense? You'll remeber that phrase when those in power soon put you in a position that is very difficult to understand. Only God cares for your everlasting liberty and justice not gov't buddy!", 
        "reply": " Since your god does not exist, to me, it really doesn't matter what it thinks. And as for gov't, the last CIC is the one who really screwed things up.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:39:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: And as for gov't, the last CIC is the one who really screwed things up. well, you're going to find out our modern election process only produces those that do the will of the men in the shadows of power, men you don't know, unAmerican men, who have plans for you & I. You'll wish the God of Israel be real!", 
        "intTime": 20090510, 
        "postID": 8, 
        "quote": "And as for gov't, the last CIC is the one who really screwed things up.", 
        "reply": " well, you're going to find out our modern election process only produces those that do the will of the men in the shadows of power, men you don't know, unAmerican men, who have plans for you & I. You'll wish the God of Israel be real!", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:49:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I will admit that there are people, behind the scene, that contribute to the ruling process. Some do try to run it, and those are abominable - see Rove as a classic example. I will wish the god of Israel is real? Not really. I have read the bible, and found it to be a contemptible book and a very petty, jealous god. No thanks, I will stay as I am. I don't need that fictious being in my life.", 
        "intTime": 20090510, 
        "postID": 9, 
        "quote": "", 
        "reply": "I will admit that there are people, behind the scene, that contribute to the ruling process. Some do try to run it, and those are abominable - see Rove as a classic example. I will wish the god of Israel is real? Not really. I have read the bible, and found it to be a contemptible book and a very petty, jealous god. No thanks, I will stay as I am. I don't need that fictious being in my life.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:52:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: Originally posted by DragonRider01: I will admit that there are people, behind the scene, that contribute to the ruling process. Some do try to run it, and those are abominable - see Rove as a classic example. I will wish the god of Israel is real? Not really. I have read the bible, and found it to be a contemptible book and a very petty, jealous god. No thanks, I will stay as I am. I don't need that fictious being in my life. quote: Men rarely (if ever) manage to dream up a God superior to themselves. Most Gods have the manners and morals of a spoiled child. - Robert A. Heinlein It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090510, 
        "postID": 10, 
        "quote": "Originally posted by DragonRider01: I will admit that there are people, behind the scene, that contribute to the ruling process. Some do try to run it, and those are abominable - see Rove as a classic example. I will wish the god of Israel is real? Not really. I have read the bible, and found it to be a contemptible book and a very petty, jealous god. No thanks, I will stay as I am. I don't need that fictious being in my life.", 
        "reply": " quote: Men rarely (if ever) manage to dream up a God superior to themselves. Most Gods have the manners and morals of a spoiled child. - Robert A. Heinlein It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 15:28:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: I though atheists didn't talk about religion, since the concept of gods doesn't merit it? Not that this comment really warrants a response, but just to clarify, comparative religion is a fascinating subject and the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Those are subjects we talk about.", 
        "intTime": 20090510, 
        "postID": 11, 
        "quote": "Originally posted by soscorpio: I though atheists didn't talk about religion, since the concept of gods doesn't merit it?", 
        "reply": " Not that this comment really warrants a response, but just to clarify, comparative religion is a fascinating subject and the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Those are subjects we talk about.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 18:59:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: So Atheist are overly paranoid people? Listen, I don't think of the wrath of the flying spaghetti monster because I have zero belief in its existence. You won't find me president of an association discussing spaghetti theory, as logic says that since I think the concept is ridiculous, I have no reason to even discuss it. I hear similar arguments from drunk people who think they're okay to drive.", 
        "intTime": 20090510, 
        "postID": 12, 
        "quote": "So Atheist are overly paranoid people? Listen, I don't think of the wrath of the flying spaghetti monster because I have zero belief in its existence. You won't find me president of an association discussing spaghetti theory, as logic says that since I think the concept is ridiculous, I have no reason to even discuss it.", 
        "reply": " I hear similar arguments from drunk people who think they're okay to drive.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 20:07:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart.", 
        "intTime": 20090510, 
        "postID": 13, 
        "quote": "the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists).", 
        "reply": " Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 20:24:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: I hear similar arguments from drunk people who think they're okay to drive. Fascinating, so at times, your allowed to switch OFF the de-humanizing and logic processing apparatus?", 
        "intTime": 20090510, 
        "postID": 14, 
        "quote": "I hear similar arguments from drunk people who think they're okay to drive.", 
        "reply": " Fascinating, so at times, your allowed to switch OFF the de-humanizing and logic processing apparatus?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 20:30:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I hear similar arguments from drunk people who think they're okay to drive. Fascinating, so at times, your allowed to switch OFF the de-humanizing and logic processing apparatus? You don't see the connection: one group is deluded by religion, and the other group is deluded by drink? The arguments are so VERY similar. The FSM is intended to be a joke: a comment on the foolishness of religion. This equates well to allowing people to drive while \"under the influence.\" Religious people seem to think they have a special skill and right that allows them to dictate morals for everyone.... One of the morals they forget and leave at the door is tolerance of those who don't drink the Koolaid. pray", 
        "intTime": 20090511, 
        "postID": 15, 
        "quote": "Originally posted by soscorpio: quote: I hear similar arguments from drunk people who think they're okay to drive. Fascinating, so at times, your allowed to switch OFF the de-humanizing and logic processing apparatus?", 
        "reply": " You don't see the connection: one group is deluded by religion, and the other group is deluded by drink? The arguments are so VERY similar. The FSM is intended to be a joke: a comment on the foolishness of religion. This equates well to allowing people to drive while \"under the influence.\" Religious people seem to think they have a special skill and right that allows them to dictate morals for everyone.... One of the morals they forget and leave at the door is tolerance of those who don't drink the Koolaid. pray", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 07:47:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you?", 
        "intTime": 20090511, 
        "postID": 16, 
        "quote": "Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart.", 
        "reply": " I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 07:57:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? If you can't stand the heat BoBo, you know what you can do. Veteran? yes, US Army. Now stand down.", 
        "intTime": 20090511, 
        "postID": 17, 
        "quote": "I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you?", 
        "reply": " If you can't stand the heat BoBo, you know what you can do. Veteran? yes, US Army. Now stand down.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 08:52:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: One of the morals they forget and leave at the door is tolerance of those who don't drink the Koolaid. pray That's your own guilt bringing you to those conclusions buddy.", 
        "intTime": 20090511, 
        "postID": 18, 
        "quote": "One of the morals they forget and leave at the door is tolerance of those who don't drink the Koolaid. pray", 
        "reply": " That's your own guilt bringing you to those conclusions buddy.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 08:53:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J.", 
        "intTime": 20090511, 
        "postID": 19, 
        "quote": "Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you?", 
        "reply": " Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 09:14:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J. My bad. However, I still think our friend here may be a poser.", 
        "intTime": 20090511, 
        "postID": 20, 
        "quote": "Originally posted by donniejanuarysr: quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J.", 
        "reply": " My bad. However, I still think our friend here may be a poser.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 13:21:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: My bad. However, I still think our friend here may be a poser. Posing for what? My posts are consistent: The constitution is the law of the land. I try to answer most every political question in relation with that great and wise document. btw: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it?", 
        "intTime": 20090511, 
        "postID": 21, 
        "quote": "My bad. However, I still think our friend here may be a poser.", 
        "reply": " Posing for what? My posts are consistent: The constitution is the law of the land. I try to answer most every political question in relation with that great and wise document. btw: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 14:16:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by donniejanuarysr: quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J. My bad. However, I still think our friend here may be a poser. I agree. D.J.", 
        "intTime": 20090511, 
        "postID": 22, 
        "quote": "Originally posted by billbright: quote: Originally posted by donniejanuarysr: quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J. My bad. However, I still think our friend here may be a poser.", 
        "reply": " I agree. D.J.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 14:49:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: My bad. However, I still think our friend here may be a poser. Posing for what? My posts are consistent: The constitution is the law of the land. I try to answer most every political question in relation with that great and wise document. btw: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it? When have you ever taken the Oath to be a police officer? D.J", 
        "intTime": 20090511, 
        "postID": 23, 
        "quote": "Originally posted by soscorpio: quote: My bad. However, I still think our friend here may be a poser. Posing for what? My posts are consistent: The constitution is the law of the land. I try to answer most every political question in relation with that great and wise document. btw: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it?", 
        "reply": " When have you ever taken the Oath to be a police officer? D.J", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 14:55:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Poser? it is totally normal reaction that when confronted with new information that seems to logically explain everything that was previous know as truth, to buy some time while processing and attack the messenger. It is a painful journey to the truth and that part never ends. But to live in the light will always be better than to live in the dark, God just made us that way, we're the only creature who gives a damn about truth.", 
        "intTime": 20090512, 
        "postID": 24, 
        "quote": "", 
        "reply": "Poser? it is totally normal reaction that when confronted with new information that seems to logically explain everything that was previous know as truth, to buy some time while processing and attack the messenger. It is a painful journey to the truth and that part never ends. But to live in the light will always be better than to live in the dark, God just made us that way, we're the only creature who gives a damn about truth.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 06:37:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "The light? Oh, you mean like this one?", 
        "intTime": 20090512, 
        "postID": 25, 
        "quote": "", 
        "reply": "The light? Oh, you mean like this one?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 06:44:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them.", 
        "intTime": 20090512, 
        "postID": 26, 
        "quote": "", 
        "reply": "What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 10:40:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "ReconTeam"
    }, 
    {
        "content": "quote: Originally posted by ReconTeam: What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them. They use to be called 'free thinkers'. Know where that term came from and who applied it themselves? Go study our Founders. Many of them would be pleased to be Brights today.", 
        "intTime": 20090512, 
        "postID": 27, 
        "quote": "Originally posted by ReconTeam: What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them.", 
        "reply": " They use to be called 'free thinkers'. Know where that term came from and who applied it themselves? Go study our Founders. Many of them would be pleased to be Brights today.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 11:07:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it? BillBright, You don't want to answer the simple question? No wonder you haved called me a poser. You see, that is how our minds works, we fault others what we fear about ourselves. You are a poser. as a cop you have been trained to believe we are less than you. You will follow your orders obediently, justifiying them to restore order for the ones who actually caused the chaos. Yes, Bill you are a poser. An American would never follow the orders you will soon be tasked to follow. Remember Bill, God is watching you through your test. I sincerely wish you clear mind and good luck.", 
        "intTime": 20090512, 
        "postID": 28, 
        "quote": "as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it?", 
        "reply": " BillBright, You don't want to answer the simple question? No wonder you haved called me a poser. You see, that is how our minds works, we fault others what we fear about ourselves. You are a poser. as a cop you have been trained to believe we are less than you. You will follow your orders obediently, justifiying them to restore order for the ones who actually caused the chaos. Yes, Bill you are a poser. An American would never follow the orders you will soon be tasked to follow. Remember Bill, God is watching you through your test. I sincerely wish you clear mind and good luck.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 11:54:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by ReconTeam: What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them. This question from somebody who (according to your own profile) never served, but goes by the name \"ReconTeam?\" tsk, tsk! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090512, 
        "postID": 29, 
        "quote": "Originally posted by ReconTeam: What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them.", 
        "reply": " This question from somebody who (according to your own profile) never served, but goes by the name \"ReconTeam?\" tsk, tsk! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 12:41:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by reducetension: They use to be called 'free thinkers'. Know where that term came from and who applied it themselves? Go study our Founders. Many of them would be pleased to be Brights today. Wrong, the founding fathers were not atheists, nor would they be today. \"Freethinkers\" is a BS term atheists stole to imply they are somehow more free than the rest of us by having no faith. quote: This question from somebody who (according to your own profile) never served, but goes by the name \"ReconTeam?\" tsk, tsk! I have never falsely claimed to have served nor claimed to been a part of a USMC Force Recon unit, and I have the utmost respect for our military personnel. It is just a name I have used on the internet in the past.", 
        "intTime": 20090514, 
        "postID": 30, 
        "quote": "Originally posted by reducetension: They use to be called 'free thinkers'. Know where that term came from and who applied it themselves? Go study our Founders. Many of them would be pleased to be Brights today.", 
        "reply": " Wrong, the founding fathers were not atheists, nor would they be today. \"Freethinkers\" is a BS term atheists stole to imply they are somehow more free than the rest of us by having no faith. quote: This question from somebody who (according to your own profile) never served, but goes by the name \"ReconTeam?\" tsk, tsk! I have never falsely claimed to have served nor claimed to been a part of a USMC Force Recon unit, and I have the utmost respect for our military personnel. It is just a name I have used on the internet in the past.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-14 06:24:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "ReconTeam"
    }, 
    {
        "content": "As president of the Military Association of Atheists & Freethinkers, I've got a few speaking engagements coming up* - Greater Worcester (Mass.) Humanists on 12 May NYC Atheists radio show (taped 13 May, uncertain air date) Ethical Humanist Society of Philadelphia, 24 May American Humanist Association Conference (Phoenix), 5 June Each organization has a website with more information. Jason * I'm not making money on any of this. I thought people might be interested. ** I like the new prohibition on links - Obama is great, but I say Google for president", 
        "intTime": 20090510, 
        "postID": 31, 
        "quote": "", 
        "reply": "As president of the Military Association of Atheists & Freethinkers, I've got a few speaking engagements coming up* - Greater Worcester (Mass.) Humanists on 12 May NYC Atheists radio show (taped 13 May, uncertain air date) Ethical Humanist Society of Philadelphia, 24 May American Humanist Association Conference (Phoenix), 5 June Each organization has a website with more information. Jason * I'm not making money on any of this. I thought people might be interested. ** I like the new prohibition on links - Obama is great, but I say Google for president", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 08:41:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "dday76"
    }, 
    {
        "content": "I though atheists didn't talk about religion, since the concept of gods doesn't merit it?", 
        "intTime": 20090510, 
        "postID": 32, 
        "quote": "", 
        "reply": "I though atheists didn't talk about religion, since the concept of gods doesn't merit it?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 08:57:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: I though atheists didn't talk about religion, since the concept of gods doesn't merit it? It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called.", 
        "intTime": 20090510, 
        "postID": 33, 
        "quote": "Originally posted by soscorpio: I though atheists didn't talk about religion, since the concept of gods doesn't merit it?", 
        "reply": " It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 10:22:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called. quote: It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called. So Atheist are overly paranoid people? Listen, I don't think of the wrath of the flying spaghetti monster because I have zero belief in its existence. You won't find me president of an association discussing spaghetti theory, as logic says that since I think the concept is ridiculous, I have no reason to even discuss it.", 
        "intTime": 20090510, 
        "postID": 34, 
        "quote": "It's the blatant propagation of the myths of unseen beings pulling the strings of lives and history that has to be addressed, regardless of what it is called.", 
        "reply": "  So Atheist are overly paranoid people? Listen, I don't think of the wrath of the flying spaghetti monster because I have zero belief in its existence. You won't find me president of an association discussing spaghetti theory, as logic says that since I think the concept is ridiculous, I have no reason to even discuss it.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 10:59:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "But it isn't discussing mythical beings. It is discussing those who would propogate the public (read governmental) sphere with that nonsense.", 
        "intTime": 20090510, 
        "postID": 35, 
        "quote": "", 
        "reply": "But it isn't discussing mythical beings. It is discussing those who would propogate the public (read governmental) sphere with that nonsense.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:22:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: It is discussing those who would propogate the public (read governmental) sphere with that nonsense. Nonsense? You'll remeber that phrase when those in power soon put you in a position that is very difficult to understand. Only God cares for your everlasting liberty and justice not gov't buddy!", 
        "intTime": 20090510, 
        "postID": 36, 
        "quote": "It is discussing those who would propogate the public (read governmental) sphere with that nonsense.", 
        "reply": " Nonsense? You'll remeber that phrase when those in power soon put you in a position that is very difficult to understand. Only God cares for your everlasting liberty and justice not gov't buddy!", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:36:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: It is discussing those who would propogate the public (read governmental) sphere with that nonsense. Nonsense? You'll remeber that phrase when those in power soon put you in a position that is very difficult to understand. Only God cares for your everlasting liberty and justice not gov't buddy! Since your god does not exist, to me, it really doesn't matter what it thinks. And as for gov't, the last CIC is the one who really screwed things up.", 
        "intTime": 20090510, 
        "postID": 37, 
        "quote": "Originally posted by soscorpio: quote: It is discussing those who would propogate the public (read governmental) sphere with that nonsense. Nonsense? You'll remeber that phrase when those in power soon put you in a position that is very difficult to understand. Only God cares for your everlasting liberty and justice not gov't buddy!", 
        "reply": " Since your god does not exist, to me, it really doesn't matter what it thinks. And as for gov't, the last CIC is the one who really screwed things up.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:39:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: And as for gov't, the last CIC is the one who really screwed things up. well, you're going to find out our modern election process only produces those that do the will of the men in the shadows of power, men you don't know, unAmerican men, who have plans for you & I. You'll wish the God of Israel be real!", 
        "intTime": 20090510, 
        "postID": 38, 
        "quote": "And as for gov't, the last CIC is the one who really screwed things up.", 
        "reply": " well, you're going to find out our modern election process only produces those that do the will of the men in the shadows of power, men you don't know, unAmerican men, who have plans for you & I. You'll wish the God of Israel be real!", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:49:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I will admit that there are people, behind the scene, that contribute to the ruling process. Some do try to run it, and those are abominable - see Rove as a classic example. I will wish the god of Israel is real? Not really. I have read the bible, and found it to be a contemptible book and a very petty, jealous god. No thanks, I will stay as I am. I don't need that fictious being in my life.", 
        "intTime": 20090510, 
        "postID": 39, 
        "quote": "", 
        "reply": "I will admit that there are people, behind the scene, that contribute to the ruling process. Some do try to run it, and those are abominable - see Rove as a classic example. I will wish the god of Israel is real? Not really. I have read the bible, and found it to be a contemptible book and a very petty, jealous god. No thanks, I will stay as I am. I don't need that fictious being in my life.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 12:52:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: Originally posted by DragonRider01: I will admit that there are people, behind the scene, that contribute to the ruling process. Some do try to run it, and those are abominable - see Rove as a classic example. I will wish the god of Israel is real? Not really. I have read the bible, and found it to be a contemptible book and a very petty, jealous god. No thanks, I will stay as I am. I don't need that fictious being in my life. quote: Men rarely (if ever) manage to dream up a God superior to themselves. Most Gods have the manners and morals of a spoiled child. - Robert A. Heinlein It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090510, 
        "postID": 40, 
        "quote": "Originally posted by DragonRider01: I will admit that there are people, behind the scene, that contribute to the ruling process. Some do try to run it, and those are abominable - see Rove as a classic example. I will wish the god of Israel is real? Not really. I have read the bible, and found it to be a contemptible book and a very petty, jealous god. No thanks, I will stay as I am. I don't need that fictious being in my life.", 
        "reply": " quote: Men rarely (if ever) manage to dream up a God superior to themselves. Most Gods have the manners and morals of a spoiled child. - Robert A. Heinlein It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 15:28:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: I though atheists didn't talk about religion, since the concept of gods doesn't merit it? Not that this comment really warrants a response, but just to clarify, comparative religion is a fascinating subject and the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Those are subjects we talk about.", 
        "intTime": 20090510, 
        "postID": 41, 
        "quote": "Originally posted by soscorpio: I though atheists didn't talk about religion, since the concept of gods doesn't merit it?", 
        "reply": " Not that this comment really warrants a response, but just to clarify, comparative religion is a fascinating subject and the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Those are subjects we talk about.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 18:59:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: So Atheist are overly paranoid people? Listen, I don't think of the wrath of the flying spaghetti monster because I have zero belief in its existence. You won't find me president of an association discussing spaghetti theory, as logic says that since I think the concept is ridiculous, I have no reason to even discuss it. I hear similar arguments from drunk people who think they're okay to drive.", 
        "intTime": 20090510, 
        "postID": 42, 
        "quote": "So Atheist are overly paranoid people? Listen, I don't think of the wrath of the flying spaghetti monster because I have zero belief in its existence. You won't find me president of an association discussing spaghetti theory, as logic says that since I think the concept is ridiculous, I have no reason to even discuss it.", 
        "reply": " I hear similar arguments from drunk people who think they're okay to drive.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 20:07:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart.", 
        "intTime": 20090510, 
        "postID": 43, 
        "quote": "the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists).", 
        "reply": " Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 20:24:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: I hear similar arguments from drunk people who think they're okay to drive. Fascinating, so at times, your allowed to switch OFF the de-humanizing and logic processing apparatus?", 
        "intTime": 20090510, 
        "postID": 44, 
        "quote": "I hear similar arguments from drunk people who think they're okay to drive.", 
        "reply": " Fascinating, so at times, your allowed to switch OFF the de-humanizing and logic processing apparatus?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-10 20:30:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I hear similar arguments from drunk people who think they're okay to drive. Fascinating, so at times, your allowed to switch OFF the de-humanizing and logic processing apparatus? You don't see the connection: one group is deluded by religion, and the other group is deluded by drink? The arguments are so VERY similar. The FSM is intended to be a joke: a comment on the foolishness of religion. This equates well to allowing people to drive while \"under the influence.\" Religious people seem to think they have a special skill and right that allows them to dictate morals for everyone.... One of the morals they forget and leave at the door is tolerance of those who don't drink the Koolaid. pray", 
        "intTime": 20090511, 
        "postID": 45, 
        "quote": "Originally posted by soscorpio: quote: I hear similar arguments from drunk people who think they're okay to drive. Fascinating, so at times, your allowed to switch OFF the de-humanizing and logic processing apparatus?", 
        "reply": " You don't see the connection: one group is deluded by religion, and the other group is deluded by drink? The arguments are so VERY similar. The FSM is intended to be a joke: a comment on the foolishness of religion. This equates well to allowing people to drive while \"under the influence.\" Religious people seem to think they have a special skill and right that allows them to dictate morals for everyone.... One of the morals they forget and leave at the door is tolerance of those who don't drink the Koolaid. pray", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 07:47:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you?", 
        "intTime": 20090511, 
        "postID": 46, 
        "quote": "Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart.", 
        "reply": " I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 07:57:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? If you can't stand the heat BoBo, you know what you can do. Veteran? yes, US Army. Now stand down.", 
        "intTime": 20090511, 
        "postID": 47, 
        "quote": "I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you?", 
        "reply": " If you can't stand the heat BoBo, you know what you can do. Veteran? yes, US Army. Now stand down.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 08:52:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: One of the morals they forget and leave at the door is tolerance of those who don't drink the Koolaid. pray That's your own guilt bringing you to those conclusions buddy.", 
        "intTime": 20090511, 
        "postID": 48, 
        "quote": "One of the morals they forget and leave at the door is tolerance of those who don't drink the Koolaid. pray", 
        "reply": " That's your own guilt bringing you to those conclusions buddy.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 08:53:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J.", 
        "intTime": 20090511, 
        "postID": 49, 
        "quote": "Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you?", 
        "reply": " Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 09:14:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J. My bad. However, I still think our friend here may be a poser.", 
        "intTime": 20090511, 
        "postID": 50, 
        "quote": "Originally posted by donniejanuarysr: quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J.", 
        "reply": " My bad. However, I still think our friend here may be a poser.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 13:21:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: My bad. However, I still think our friend here may be a poser. Posing for what? My posts are consistent: The constitution is the law of the land. I try to answer most every political question in relation with that great and wise document. btw: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it?", 
        "intTime": 20090511, 
        "postID": 51, 
        "quote": "My bad. However, I still think our friend here may be a poser.", 
        "reply": " Posing for what? My posts are consistent: The constitution is the law of the land. I try to answer most every political question in relation with that great and wise document. btw: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 14:16:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by donniejanuarysr: quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J. My bad. However, I still think our friend here may be a poser. I agree. D.J.", 
        "intTime": 20090511, 
        "postID": 52, 
        "quote": "Originally posted by billbright: quote: Originally posted by donniejanuarysr: quote: Originally posted by billbright: quote: Originally posted by soscorpio: quote: the efforts of some religionists to hijack our government and military for their nefarious purposes is a subject of great concern among atheists (and many religionists). Well sir, it's interesting that this is your slant. Your gov't has been hijacked, just not by those that the propaganda blames. My comments were meant to open your eyes, because surely you can see, something is not right in this once great country. Leave your hatred behind, you will only be forced to serve a false reality. Good luck sir, and may the God who created all, re-enter your heart. I have my doubts about your authenticity as an American soldier. You left the service an E-2? And you refer to our government as \"your gov't?\" And you hadn't a clue about General Order #1? WTF? What country/planet/dimension are you from? You wouldn't be a bit of a troll, now would you? Bill, Please do not take this wrong, But I was in the army and was discharged as an E-2, granted I had a fractured neck and compressed spine but still I recieved my discharge as an E-2 I hope this does not make me less of a Veteran then others here. I can see how he got under the skin, I have no answers for the other parts of the post but please do not down play another Veteran because of his rank at discharge. D.J. My bad. However, I still think our friend here may be a poser.", 
        "reply": " I agree. D.J.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 14:49:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: My bad. However, I still think our friend here may be a poser. Posing for what? My posts are consistent: The constitution is the law of the land. I try to answer most every political question in relation with that great and wise document. btw: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it? When have you ever taken the Oath to be a police officer? D.J", 
        "intTime": 20090511, 
        "postID": 53, 
        "quote": "Originally posted by soscorpio: quote: My bad. However, I still think our friend here may be a poser. Posing for what? My posts are consistent: The constitution is the law of the land. I try to answer most every political question in relation with that great and wise document. btw: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it?", 
        "reply": " When have you ever taken the Oath to be a police officer? D.J", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-11 14:55:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Poser? it is totally normal reaction that when confronted with new information that seems to logically explain everything that was previous know as truth, to buy some time while processing and attack the messenger. It is a painful journey to the truth and that part never ends. But to live in the light will always be better than to live in the dark, God just made us that way, we're the only creature who gives a damn about truth.", 
        "intTime": 20090512, 
        "postID": 54, 
        "quote": "", 
        "reply": "Poser? it is totally normal reaction that when confronted with new information that seems to logically explain everything that was previous know as truth, to buy some time while processing and attack the messenger. It is a painful journey to the truth and that part never ends. But to live in the light will always be better than to live in the dark, God just made us that way, we're the only creature who gives a damn about truth.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 06:37:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "The light? Oh, you mean like this one?", 
        "intTime": 20090512, 
        "postID": 55, 
        "quote": "", 
        "reply": "The light? Oh, you mean like this one?", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 06:44:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "billbright"
    }, 
    {
        "content": "What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them.", 
        "intTime": 20090512, 
        "postID": 56, 
        "quote": "", 
        "reply": "What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 10:40:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "ReconTeam"
    }, 
    {
        "content": "quote: Originally posted by ReconTeam: What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them. They use to be called 'free thinkers'. Know where that term came from and who applied it themselves? Go study our Founders. Many of them would be pleased to be Brights today.", 
        "intTime": 20090512, 
        "postID": 57, 
        "quote": "Originally posted by ReconTeam: What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them.", 
        "reply": " They use to be called 'free thinkers'. Know where that term came from and who applied it themselves? Go study our Founders. Many of them would be pleased to be Brights today.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 11:07:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it? BillBright, You don't want to answer the simple question? No wonder you haved called me a poser. You see, that is how our minds works, we fault others what we fear about ourselves. You are a poser. as a cop you have been trained to believe we are less than you. You will follow your orders obediently, justifiying them to restore order for the ones who actually caused the chaos. Yes, Bill you are a poser. An American would never follow the orders you will soon be tasked to follow. Remember Bill, God is watching you through your test. I sincerely wish you clear mind and good luck.", 
        "intTime": 20090512, 
        "postID": 58, 
        "quote": "as a police officer, your constitutional role is to protect the community from a tyrannical federal and or state gov't. I've seldom met a cop who knows this most important stated role. Do you know it?", 
        "reply": " BillBright, You don't want to answer the simple question? No wonder you haved called me a poser. You see, that is how our minds works, we fault others what we fear about ourselves. You are a poser. as a cop you have been trained to believe we are less than you. You will follow your orders obediently, justifiying them to restore order for the ones who actually caused the chaos. Yes, Bill you are a poser. An American would never follow the orders you will soon be tasked to follow. Remember Bill, God is watching you through your test. I sincerely wish you clear mind and good luck.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 11:54:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by ReconTeam: What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them. This question from somebody who (according to your own profile) never served, but goes by the name \"ReconTeam?\" tsk, tsk! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090512, 
        "postID": 59, 
        "quote": "Originally posted by ReconTeam: What is with atheists and making up this idiotic names which showcase their undeserved sense of self-superiority? They can change the name but you can't change the fact that most people just don't like them.", 
        "reply": " This question from somebody who (according to your own profile) never served, but goes by the name \"ReconTeam?\" tsk, tsk! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-12 12:41:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by reducetension: They use to be called 'free thinkers'. Know where that term came from and who applied it themselves? Go study our Founders. Many of them would be pleased to be Brights today. Wrong, the founding fathers were not atheists, nor would they be today. \"Freethinkers\" is a BS term atheists stole to imply they are somehow more free than the rest of us by having no faith. quote: This question from somebody who (according to your own profile) never served, but goes by the name \"ReconTeam?\" tsk, tsk! I have never falsely claimed to have served nor claimed to been a part of a USMC Force Recon unit, and I have the utmost respect for our military personnel. It is just a name I have used on the internet in the past.", 
        "intTime": 20090514, 
        "postID": 60, 
        "quote": "Originally posted by reducetension: They use to be called 'free thinkers'. Know where that term came from and who applied it themselves? Go study our Founders. Many of them would be pleased to be Brights today.", 
        "reply": " Wrong, the founding fathers were not atheists, nor would they be today. \"Freethinkers\" is a BS term atheists stole to imply they are somehow more free than the rest of us by having no faith. quote: This question from somebody who (according to your own profile) never served, but goes by the name \"ReconTeam?\" tsk, tsk! I have never falsely claimed to have served nor claimed to been a part of a USMC Force Recon unit, and I have the utmost respect for our military personnel. It is just a name I have used on the internet in the past.", 
        "threadID": "1270031990001_3880059222001", 
        "time": "2009-05-14 06:24:00", 
        "title": "Upcoming religion in the military talks", 
        "userID": "ReconTeam"
    }
]