[
    {
        "content": "\"Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say.\"", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say.\"", 
        "threadID": "1270031990001_6450009612001", 
        "time": "2009-03-04 12:25:00", 
        "title": "Evolution Challenge from Thrust_0311", 
        "userID": "billbright"
    }, 
    {
        "content": "Interesting claim he made there, wasn't it? Especially since the judge in Kitzmiller, et al. v. Dover Area School District, who ruled against the teaching of \"Intelligent Design,\" was a conservative, Republican-appointed judge.", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "", 
        "reply": "Interesting claim he made there, wasn't it? Especially since the judge in Kitzmiller, et al. v. Dover Area School District, who ruled against the teaching of \"Intelligent Design,\" was a conservative, Republican-appointed judge.", 
        "threadID": "1270031990001_6450009612001", 
        "time": "2009-03-04 12:44:00", 
        "title": "Evolution Challenge from Thrust_0311", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Interestingly enough, this happened in my own State and quite recently: \"http://www.dallasnews.com/sharedcontent/dws/dn/education/stories/012309dntexevolution.1d0cd401.html\" In short, teachers aren't allowed to point out the many lies that are required to stop any critical thought in regard to the subject. You people have a lot to hide and the only way you can get away with it is by lying and censorship. YOU shirk from the challenge because you know that the only way you will ever be able to hold sway is to shame and ridicule anyone who thinks differently and by hiding all of the lies that your belief is based on. This message has been edited. Last edited by: Thrust_0311, Wed 04 March 2009 01:50 PM", 
        "intTime": 20090304, 
        "postID": 3, 
        "quote": "", 
        "reply": "Interestingly enough, this happened in my own State and quite recently: \"http://www.dallasnews.com/sharedcontent/dws/dn/education/stories/012309dntexevolution.1d0cd401.html\" In short, teachers aren't allowed to point out the many lies that are required to stop any critical thought in regard to the subject. You people have a lot to hide and the only way you can get away with it is by lying and censorship. YOU shirk from the challenge because you know that the only way you will ever be able to hold sway is to shame and ridicule anyone who thinks differently and by hiding all of the lies that your belief is based on. This message has been edited. Last edited by: Thrust_0311, Wed 04 March 2009 01:50 PM", 
        "threadID": "1270031990001_6450009612001", 
        "time": "2009-03-04 13:28:00", 
        "title": "Evolution Challenge from Thrust_0311", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: You people have a lot to hide and the only way you can get away with it is by lying and censorship. YOU shirk from the challenge because you know that the only way you will ever be able to hold sway is to shame and ridicule anyone who thinks differently and by hiding all of the lies that your belief is based on. Exactly opposite the facts. The Dover case was an excellent example of both sides doing their best to make their own case, without trying to prevent the other from doing so. And guess what? The conservative, Republican-appointed judge ruled that evolution had scientific merit, but ID was not. And as to the case you cited? That was the decision of a state (Texas) school board, deciding not to renew a rule that had required educators to teach \"weaknesses\" in the theory of evolution. No other theories, just evolution. Not the Germ Theory of disease, not the Theory of Gravitation, not the heliocentric theory of the solar system, etc. Just one. Hmm. I wonder why that might be? What did the school board decide instead? That students should \"analyze and evaluate scientific explanations using empirical evidence, logical reasoning and experimental and observational testing.\" Well, I can see why theists would be against that. If people start doing that, they might start thinking for themselves! Can't have that now, can we?", 
        "intTime": 20090304, 
        "postID": 4, 
        "quote": "Originally posted by Thrust_0311: You people have a lot to hide and the only way you can get away with it is by lying and censorship. YOU shirk from the challenge because you know that the only way you will ever be able to hold sway is to shame and ridicule anyone who thinks differently and by hiding all of the lies that your belief is based on.", 
        "reply": " Exactly opposite the facts. The Dover case was an excellent example of both sides doing their best to make their own case, without trying to prevent the other from doing so. And guess what? The conservative, Republican-appointed judge ruled that evolution had scientific merit, but ID was not. And as to the case you cited? That was the decision of a state (Texas) school board, deciding not to renew a rule that had required educators to teach \"weaknesses\" in the theory of evolution. No other theories, just evolution. Not the Germ Theory of disease, not the Theory of Gravitation, not the heliocentric theory of the solar system, etc. Just one. Hmm. I wonder why that might be? What did the school board decide instead? That students should \"analyze and evaluate scientific explanations using empirical evidence, logical reasoning and experimental and observational testing.\" Well, I can see why theists would be against that. If people start doing that, they might start thinking for themselves! Can't have that now, can we?", 
        "threadID": "1270031990001_6450009612001", 
        "time": "2009-03-04 16:38:00", 
        "title": "Evolution Challenge from Thrust_0311", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: And as to the case you cited? That was the decision of a state (Texas) school board, deciding not to renew a rule that had required educators to teach \"weaknesses\" in the theory of evolution. No other theories, just evolution. Not the Germ Theory of disease, not the Theory of Gravitation, not the heliocentric theory of the solar system, etc. Just one. Hmm. I wonder why that might be? What did the school board decide instead? That students should \"analyze and evaluate scientific explanations using empirical evidence, logical reasoning and experimental and observational testing.\" Well, I can see why theists would be against that. If people start doing that, they might start thinking for themselves! Can't have that now, can we? You can un-summarize what I said all you want but the point remains: A teacher can't point out facts that actually would lead to the students thinking for themselves and, perhaps, questioning the validity of evolution. This would be a probable outcome, considering its entire body of false evidence. You people have a lot to hide. We carry our banner openly and thus your only weapon is ridicule and groupthink, hence the 'shooting gallery' nature of billbright's thread here. A bunch of grown up *******s pointing and laughing at someone who thinks different is no more valid than a bunch of children doing the same, but you'll find it doesn't work on me. You see, I went to school under teachers who delighted in mocking America, Christianity, and everything that we hold dear. I learned to stand up to you people a long time ago but, more importantly, I learned how you operate: by suggestion. If that is the alternative, I'll take written Law. There would be no freedom of thought if not for White Christian Civilization. Shakespeare's works - all highly religious - will be remembered for all time. Dan Brown's will be forgotten in twenty years. Rousseau was a formulative influence on Marx and Engels. In contrast, the Bible was a formulative influence on our Founders and the basis for the Constitution that holds our state together. I disagree with your assessment of religion entirely. On the contrary, atheism cannot survive without stifling the opposition, and that is why all atheists become Robespierre when they take power.", 
        "intTime": 20090304, 
        "postID": 5, 
        "quote": "And as to the case you cited? That was the decision of a state (Texas) school board, deciding not to renew a rule that had required educators to teach \"weaknesses\" in the theory of evolution. No other theories, just evolution. Not the Germ Theory of disease, not the Theory of Gravitation, not the heliocentric theory of the solar system, etc. Just one. Hmm. I wonder why that might be? What did the school board decide instead? That students should \"analyze and evaluate scientific explanations using empirical evidence, logical reasoning and experimental and observational testing.\" Well, I can see why theists would be against that. If people start doing that, they might start thinking for themselves! Can't have that now, can we?", 
        "reply": " You can un-summarize what I said all you want but the point remains: A teacher can't point out facts that actually would lead to the students thinking for themselves and, perhaps, questioning the validity of evolution. This would be a probable outcome, considering its entire body of false evidence. You people have a lot to hide. We carry our banner openly and thus your only weapon is ridicule and groupthink, hence the 'shooting gallery' nature of billbright's thread here. A bunch of grown up *******s pointing and laughing at someone who thinks different is no more valid than a bunch of children doing the same, but you'll find it doesn't work on me. You see, I went to school under teachers who delighted in mocking America, Christianity, and everything that we hold dear. I learned to stand up to you people a long time ago but, more importantly, I learned how you operate: by suggestion. If that is the alternative, I'll take written Law. There would be no freedom of thought if not for White Christian Civilization. Shakespeare's works - all highly religious - will be remembered for all time. Dan Brown's will be forgotten in twenty years. Rousseau was a formulative influence on Marx and Engels. In contrast, the Bible was a formulative influence on our Founders and the basis for the Constitution that holds our state together. I disagree with your assessment of religion entirely. On the contrary, atheism cannot survive without stifling the opposition, and that is why all atheists become Robespierre when they take power.", 
        "threadID": "1270031990001_6450009612001", 
        "time": "2009-03-04 17:37:00", 
        "title": "Evolution Challenge from Thrust_0311", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: There would be no freedom of thought if not for White Christian Civilization. Ooooooo, is that revealing! quote: the Bible was a formulative influence on our Founders and the basis for the Constitution that holds our state together. I think we have been here before! #1... how about the Ten Commandments... let's look at the first one and the Constitution. Thou shalt have NO OTHER GODS before me. The Founders must have missed that one in the Bible because they chose to write as if their were other gods one could have and they would not give preeminence to any, not eve the bible guy. #2 The bible form of government is a Kingdom, not a democracy. So I guess the bible pattern fails the founders forming our means of governance? #3 Sabbath resting. So anti-Capitalistic. When, pray tell does that show up in any official government documents. Matter of fact I don't recall the Bible being quoted in any official founding documents. But we have whipped that pony a bunch on here but I guess we drag it out again. Besides, we are more religious as a nation than we ever were in 1776. Perhaps the Christians aren't praying hard enough ... or correctly? Or maybe the Christian should be the ones to blame for falling so far short of their 'Founding Fathers Christian Myth'? As the great white Bard wrote: \"My words fly up, but my thoughts remain below.\" quote: that is why all atheists become Robespierre when they take power. You mean like in Scandinavia where something like 70% of the population are atheists? Oh the tyranny! Those wicked people! Anyhow, I go off to teach philosophy at a military base for a couple of hours and come back and all hell is spilled out and I missed it!!!! Dammmmmmmn! (I see Stillkit shut that nose-to-nose thread down fast! I thought it was going rather well on its own accord but it does need its own heading... where ever it was heading??) I'm all filled with excitement now!! Can I watch? Oooooooooooooooooooooo.", 
        "intTime": 20090304, 
        "postID": 6, 
        "quote": "There would be no freedom of thought if not for White Christian Civilization.", 
        "reply": " Ooooooo, is that revealing! quote: the Bible was a formulative influence on our Founders and the basis for the Constitution that holds our state together. I think we have been here before! #1... how about the Ten Commandments... let's look at the first one and the Constitution. Thou shalt have NO OTHER GODS before me. The Founders must have missed that one in the Bible because they chose to write as if their were other gods one could have and they would not give preeminence to any, not eve the bible guy. #2 The bible form of government is a Kingdom, not a democracy. So I guess the bible pattern fails the founders forming our means of governance? #3 Sabbath resting. So anti-Capitalistic. When, pray tell does that show up in any official government documents. Matter of fact I don't recall the Bible being quoted in any official founding documents. But we have whipped that pony a bunch on here but I guess we drag it out again. Besides, we are more religious as a nation than we ever were in 1776. Perhaps the Christians aren't praying hard enough ... or correctly? Or maybe the Christian should be the ones to blame for falling so far short of their 'Founding Fathers Christian Myth'? As the great white Bard wrote: \"My words fly up, but my thoughts remain below.\" quote: that is why all atheists become Robespierre when they take power. You mean like in Scandinavia where something like 70% of the population are atheists? Oh the tyranny! Those wicked people! Anyhow, I go off to teach philosophy at a military base for a couple of hours and come back and all hell is spilled out and I missed it!!!! Dammmmmmmn! (I see Stillkit shut that nose-to-nose thread down fast! I thought it was going rather well on its own accord but it does need its own heading... where ever it was heading??) I'm all filled with excitement now!! Can I watch? Oooooooooooooooooooooo.", 
        "threadID": "1270031990001_6450009612001", 
        "time": "2009-03-04 20:40:00", 
        "title": "Evolution Challenge from Thrust_0311", 
        "userID": "reducetension"
    }
]