[
    {
        "content": "im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea", 
        "intTime": 20090301, 
        "postID": 1, 
        "quote": "", 
        "reply": "im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-01 18:09:00", 
        "title": "jewish", 
        "userID": "bornmarinereadyfight"
    }, 
    {
        "content": "quote: Originally posted by bornmarinereadyfight: im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea If it were time to pray and your mission needed you, what would be your priority?", 
        "intTime": 20090301, 
        "postID": 2, 
        "quote": "Originally posted by bornmarinereadyfight: im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea", 
        "reply": " If it were time to pray and your mission needed you, what would be your priority?", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-01 20:19:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "SUGGESTION; Send a letter of enquiry to the Israelli I.D.F. via the Israelli Procounsel in N.Y.C. they will give you the pro's and con's of your religious questions and then contact the Marines with your questions. Bills question is a good one by the way. T", 
        "intTime": 20090301, 
        "postID": 3, 
        "quote": "", 
        "reply": "SUGGESTION; Send a letter of enquiry to the Israelli I.D.F. via the Israelli Procounsel in N.Y.C. they will give you the pro's and con's of your religious questions and then contact the Marines with your questions. Bills question is a good one by the way. T", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-01 20:40:00", 
        "title": "jewish", 
        "userID": "tawodi"
    }, 
    {
        "content": "Are you Orthadox, Conservitave, or Ultra Orthadox? That would make a big difference, Most Ultra Orthadox do not even consider joining the military,( any branch) It has been a long time sence I was in the service and I know alot of things have changed, but when I was in the USARMY, the training stopped at 2100hrs on friday night , As for prayers there was time in the morning, when we stopped for lunch, then dinner most times after 2000 hrs was our time (with restrictions) . Bills question is a good one, I do believe there is time for the Sh'ma, It can be said durning any mission, and in Iraq, and Afganastan seems like the prayer I would be saying most often. BTW I am not speaking as a Jew, I am Ben No'ch. T's suggestion is also a good one. Also talk to your Rabbi, JMHO. D.J.", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "", 
        "reply": "Are you Orthadox, Conservitave, or Ultra Orthadox? That would make a big difference, Most Ultra Orthadox do not even consider joining the military,( any branch) It has been a long time sence I was in the service and I know alot of things have changed, but when I was in the USARMY, the training stopped at 2100hrs on friday night , As for prayers there was time in the morning, when we stopped for lunch, then dinner most times after 2000 hrs was our time (with restrictions) . Bills question is a good one, I do believe there is time for the Sh'ma, It can be said durning any mission, and in Iraq, and Afganastan seems like the prayer I would be saying most often. BTW I am not speaking as a Jew, I am Ben No'ch. T's suggestion is also a good one. Also talk to your Rabbi, JMHO. D.J.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-02 00:37:00", 
        "title": "jewish", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "well bill, my biggest concern isnt really praying, since the times to pray and place doesnt need to be in a specific place, it would be better but there isnt a 100% diff., and the time can be pushed around as long as its within several hours, i mean the night prayer can be daid from night till like 3 am. but and praying can just be on the drive. but yet the real concern which basicly decides if i join the marines or the idf is shabbos (sabbath) so the answer to your que is the mission. and thanks a lot for every one elses answer, they all really help.", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "", 
        "reply": "well bill, my biggest concern isnt really praying, since the times to pray and place doesnt need to be in a specific place, it would be better but there isnt a 100% diff., and the time can be pushed around as long as its within several hours, i mean the night prayer can be daid from night till like 3 am. but and praying can just be on the drive. but yet the real concern which basicly decides if i join the marines or the idf is shabbos (sabbath) so the answer to your que is the mission. and thanks a lot for every one elses answer, they all really help.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 16:25:00", 
        "title": "jewish", 
        "userID": "bornmarinereadyfight"
    }, 
    {
        "content": "I'm sure we'd much rather have you in the Corps than going to another country. Here's my take on the demographics of the Marine Corps. Remember that this is all anecdotal and is just what I've seen, but I've talked to a lot of Marines in my family and in life and they more or less agree: 20% of the Corps is your generic nonbeliever/agnostic. They don't have time for God and don't really get worked up about it one way or another. Outright atheists and fruitcake \"wiccans\" are far and few between. Normally they are computer geeks or something but not grunts, so you don't hear much from them on the green side. 60% is Christian in the same way that Lord Wellington's Army was \"Christian.\" They get really religious in boot camp and in a hard fight, but the rest of the time they whore and drink like Marines are famous for. They don't rebel against their religion but they don't really embrace it until they're older and wiser. The last 20% are of the more religious type. They keep what traditions they may but it doesn't interfere with their duties. This includes all of the major religions and Judaism, which is a smaller one but not a disrespected one. The trick is knowing when to play it smart. \"Trust God but keep your powder dry,\" as Cromwell said. Or a better analogy might be Gideon: he chose for his 300 the most aloof and stalwart among believers, not the most Traditional. Don't expect to alter your uniform for cultural preferences but don't take anything you shouldn't have to off of an atheist or a malcontent. Also I would add that this was the demographic of the men who fought in the Revolution and our Civil War. Religion makes a better soldier when death stares you in the face constantly.", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "", 
        "reply": "I'm sure we'd much rather have you in the Corps than going to another country. Here's my take on the demographics of the Marine Corps. Remember that this is all anecdotal and is just what I've seen, but I've talked to a lot of Marines in my family and in life and they more or less agree: 20% of the Corps is your generic nonbeliever/agnostic. They don't have time for God and don't really get worked up about it one way or another. Outright atheists and fruitcake \"wiccans\" are far and few between. Normally they are computer geeks or something but not grunts, so you don't hear much from them on the green side. 60% is Christian in the same way that Lord Wellington's Army was \"Christian.\" They get really religious in boot camp and in a hard fight, but the rest of the time they whore and drink like Marines are famous for. They don't rebel against their religion but they don't really embrace it until they're older and wiser. The last 20% are of the more religious type. They keep what traditions they may but it doesn't interfere with their duties. This includes all of the major religions and Judaism, which is a smaller one but not a disrespected one. The trick is knowing when to play it smart. \"Trust God but keep your powder dry,\" as Cromwell said. Or a better analogy might be Gideon: he chose for his 300 the most aloof and stalwart among believers, not the most Traditional. Don't expect to alter your uniform for cultural preferences but don't take anything you shouldn't have to off of an atheist or a malcontent. Also I would add that this was the demographic of the men who fought in the Revolution and our Civil War. Religion makes a better soldier when death stares you in the face constantly.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 16:36:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: ............................ Religion makes a better soldier when death stares you in the face constantly. As any fundamentalist fanatic terrorist will tell you! ....or kamikaze ....or Masada 'defender' .... or Constantine at Milvian Bridge.... the gods are unimportant... it's the idea that counts.", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "Originally posted by Thrust_0311: ............................ Religion makes a better soldier when death stares you in the face constantly.", 
        "reply": " As any fundamentalist fanatic terrorist will tell you! ....or kamikaze ....or Masada 'defender' .... or Constantine at Milvian Bridge.... the gods are unimportant... it's the idea that counts.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 17:08:00", 
        "title": "jewish", 
        "userID": "reducetension"
    }, 
    {
        "content": "The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you.", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "", 
        "reply": "The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 18:14:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by bornmarinereadyfight: im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea bornmarinereadyfight, My husband is an observant Jew and has managed to survive keeping Shabbat and prayers (as well as kosher, and yom tovim) in the army. If you want, you can e-mail me and I will put you in contact with him. I also know an Orthodox Rabbi (US Army) that could give you some help. He just came back from Iraq and I am sure will be more than happy to give you his opinion. Shalom Raquel", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "Originally posted by bornmarinereadyfight: im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea", 
        "reply": " bornmarinereadyfight, My husband is an observant Jew and has managed to survive keeping Shabbat and prayers (as well as kosher, and yom tovim) in the army. If you want, you can e-mail me and I will put you in contact with him. I also know an Orthodox Rabbi (US Army) that could give you some help. He just came back from Iraq and I am sure will be more than happy to give you his opinion. Shalom Raquel", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 19:20:00", 
        "title": "jewish", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you. So then, the Marines I had to deal with in \"treatment\" in my occupation in the military, those who beat their wives and kids, are representative of all Marines? I didn't say a believe in God was a bad idea. I noted such believe can work in both ways. The subject of the thread will do fine, regardless of which god he worships. The military can be very accommodating. This is America, after all. (Hi, Raquel! Long time no see read !)", 
        "intTime": 20090303, 
        "postID": 10, 
        "quote": "Originally posted by Thrust_0311: The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you.", 
        "reply": " So then, the Marines I had to deal with in \"treatment\" in my occupation in the military, those who beat their wives and kids, are representative of all Marines? I didn't say a believe in God was a bad idea. I noted such believe can work in both ways. The subject of the thread will do fine, regardless of which god he worships. The military can be very accommodating. This is America, after all. (Hi, Raquel! Long time no see read !)", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 19:32:00", 
        "title": "jewish", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: So then, the Marines I had to deal with in \"treatment\" in my occupation in the military, those who beat their wives and kids, are representative of all Marines? I didn't say a believe in God was a bad idea. I noted such believe can work in both ways. The subject of the thread will do fine, regards of which god he worships. The military can be very accommodating. This is America, after all. (Hi, Raquel! Long time no see read !) You are so condescending......but I agree that he has his right to worship as he pleases in America.", 
        "intTime": 20090303, 
        "postID": 11, 
        "quote": "Originally posted by reducetension: So then, the Marines I had to deal with in \"treatment\" in my occupation in the military, those who beat their wives and kids, are representative of all Marines? I didn't say a believe in God was a bad idea. I noted such believe can work in both ways. The subject of the thread will do fine, regards of which god he worships. The military can be very accommodating. This is America, after all. (Hi, Raquel! Long time no see read !)", 
        "reply": " You are so condescending......but I agree that he has his right to worship as he pleases in America.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 19:37:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by reducetension: (Hi, Raquel! Long time no see read !) Hi reducetension, I know, it has been for ever!!! How are you? I have been a bit busy taken some classes, but I hope to have some time to write more often. See ya! Raquel", 
        "intTime": 20090303, 
        "postID": 12, 
        "quote": "Originally posted by reducetension: (Hi, Raquel! Long time no see read !)", 
        "reply": " Hi reducetension, I know, it has been for ever!!! How are you? I have been a bit busy taken some classes, but I hope to have some time to write more often. See ya! Raquel", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 20:19:00", 
        "title": "jewish", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "quote: Originally posted by bornmarinereadyfight: well bill, my biggest concern isnt really praying, since the times to pray and place doesnt need to be in a specific place, it would be better but there isnt a 100% diff., and the time can be pushed around as long as its within several hours, i mean the night prayer can be daid from night till like 3 am. but and praying can just be on the drive. but yet the real concern which basicly decides if i join the marines or the idf is shabbos (sabbath) so the answer to your que is the mission. and thanks a lot for every one elses answer, they all really help. I think I read on another thread that Uncle is trying to accommodate food requirements of Jews and Muslims. If you don't mind the occasional generic chaplain, you'll probably survive.", 
        "intTime": 20090303, 
        "postID": 13, 
        "quote": "Originally posted by bornmarinereadyfight: well bill, my biggest concern isnt really praying, since the times to pray and place doesnt need to be in a specific place, it would be better but there isnt a 100% diff., and the time can be pushed around as long as its within several hours, i mean the night prayer can be daid from night till like 3 am. but and praying can just be on the drive. but yet the real concern which basicly decides if i join the marines or the idf is shabbos (sabbath) so the answer to your que is the mission. and thanks a lot for every one elses answer, they all really help.", 
        "reply": " I think I read on another thread that Uncle is trying to accommodate food requirements of Jews and Muslims. If you don't mind the occasional generic chaplain, you'll probably survive.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 22:00:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "Hello ixcatzin, Hadnt seen you in awhile and hoped you woud find his post, Shalom D.J.", 
        "intTime": 20090303, 
        "postID": 14, 
        "quote": "", 
        "reply": "Hello ixcatzin, Hadnt seen you in awhile and hoped you woud find his post, Shalom D.J.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 22:06:00", 
        "title": "jewish", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you. Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. Thing two: Who the hell are you to decide what the nature of inquiry is in a thread that doesn't remotely belong to you?", 
        "intTime": 20090303, 
        "postID": 15, 
        "quote": "Originally posted by Thrust_0311: The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you.", 
        "reply": " Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. Thing two: Who the hell are you to decide what the nature of inquiry is in a thread that doesn't remotely belong to you?", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 22:07:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: Hello ixcatzin, Hadnt seen you in awhile and hoped you woud find his post, Shalom D.J. Hi Donnie, I have been quite busy, but I have some free time now and hope to participate more often. How are you? Shalom, Raquel", 
        "intTime": 20090304, 
        "postID": 16, 
        "quote": "Originally posted by donniejanuarysr: Hello ixcatzin, Hadnt seen you in awhile and hoped you woud find his post, Shalom D.J.", 
        "reply": " Hi Donnie, I have been quite busy, but I have some free time now and hope to participate more often. How are you? Shalom, Raquel", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 07:30:00", 
        "title": "jewish", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "quote: Originally posted by billbright: Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. What do you want me to say? Those are fighting words that aren't said in person. I'll have you know, those cowards were dealt with and the problem was resolved. It only reinforced what was already obvious to us and to all soldiers. Also their weakness is all the more reason we should stand up to them when they try to subvert our civilization.", 
        "intTime": 20090304, 
        "postID": 17, 
        "quote": "Originally posted by billbright: Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like.", 
        "reply": " What do you want me to say? Those are fighting words that aren't said in person. I'll have you know, those cowards were dealt with and the problem was resolved. It only reinforced what was already obvious to us and to all soldiers. Also their weakness is all the more reason we should stand up to them when they try to subvert our civilization.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 10:17:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: quote: Originally posted by billbright: Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. What do you want me to say? Those are fighting words that aren't said in person. I'll have you know, those cowards were dealt with and the problem was resolved. It only reinforced what was already obvious to us and to all soldiers. Also their weakness is all the more reason we should stand up to them when they try to subvert our civilization. And hence, all atheists are a s s holes, I suppose. Move closer. I'll say it in person. You're acting like a jerk, and it's not making civilization any stronger by your actions. You asked what I want you to say? I want you to say you're sorry. I don't want you to kiss my a s s. I just want you to be a stand-up guy and admit that there are decent atheists in the world and that your statements were inappropriate. You come charging in with that Marine all-go no-stop attitude without thinking for an instant that you may not be right in the minutest degree, then you don't expect to be challenged? WTF?", 
        "intTime": 20090304, 
        "postID": 18, 
        "quote": "Originally posted by Thrust_0311: quote: Originally posted by billbright: Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. What do you want me to say? Those are fighting words that aren't said in person. I'll have you know, those cowards were dealt with and the problem was resolved. It only reinforced what was already obvious to us and to all soldiers. Also their weakness is all the more reason we should stand up to them when they try to subvert our civilization.", 
        "reply": " And hence, all atheists are a s s holes, I suppose. Move closer. I'll say it in person. You're acting like a jerk, and it's not making civilization any stronger by your actions. You asked what I want you to say? I want you to say you're sorry. I don't want you to kiss my a s s. I just want you to be a stand-up guy and admit that there are decent atheists in the world and that your statements were inappropriate. You come charging in with that Marine all-go no-stop attitude without thinking for an instant that you may not be right in the minutest degree, then you don't expect to be challenged? WTF?", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 11:17:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth.", 
        "intTime": 20090304, 
        "postID": 19, 
        "quote": "", 
        "reply": "I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 12:00:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "real er in Thrust aparently you may have know a few people of non belief (no offence intended) But I have also known alot more that I would have standing beside me in anyfight, their beliefs are not like mine just like yours are not like mine but I would not be afraid to go into any battle with them standing beside me. You seem to have a very large chip on your sholder probably caused by someone or somthing that isnt even in this forum, These people have all been in sometype of military or military connected service, to call a person a coward because of maybe one or even two people you think you knew is Wrong. Calling a person a coward and not doing it to their face IMO would make the person making the statement a coward. I have known alot of xtians that refused to fight in conflicts, dosnt make them cowards just go's against their beliefs, JMHO D.J.", 
        "intTime": 20090304, 
        "postID": 20, 
        "quote": "", 
        "reply": "real er in Thrust aparently you may have know a few people of non belief (no offence intended) But I have also known alot more that I would have standing beside me in anyfight, their beliefs are not like mine just like yours are not like mine but I would not be afraid to go into any battle with them standing beside me. You seem to have a very large chip on your sholder probably caused by someone or somthing that isnt even in this forum, These people have all been in sometype of military or military connected service, to call a person a coward because of maybe one or even two people you think you knew is Wrong. Calling a person a coward and not doing it to their face IMO would make the person making the statement a coward. I have known alot of xtians that refused to fight in conflicts, dosnt make them cowards just go's against their beliefs, JMHO D.J.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 12:28:00", 
        "title": "jewish", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth. Here's the danger of painting everyone with the same brush: You belong(ed) to the same organization as the three animals who gang-raped and murdered a defenseless girl in Okinawa back in the 90's. Are you ready to describe yourself in the same terms as those three? Either say yes, or retract your blanket statements about atheists, you lunkhead. By the way, responding to words with hints of violence? Always a sign of someone who knows they're in the wrong. If you can't argue your way out, don't think you can win by fighting your way out. THAT is what a COWARD would do.", 
        "intTime": 20090304, 
        "postID": 21, 
        "quote": "Originally posted by Thrust_0311: I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth.", 
        "reply": " Here's the danger of painting everyone with the same brush: You belong(ed) to the same organization as the three animals who gang-raped and murdered a defenseless girl in Okinawa back in the 90's. Are you ready to describe yourself in the same terms as those three? Either say yes, or retract your blanket statements about atheists, you lunkhead. By the way, responding to words with hints of violence? Always a sign of someone who knows they're in the wrong. If you can't argue your way out, don't think you can win by fighting your way out. THAT is what a COWARD would do.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 12:33:00", 
        "title": "jewish", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth. Calm down before you blow a gasket. I scanned your arguments about the ACLU and evolutionists over to other threads where they can be more appropriately addressed. I could as easily say that your attacks of atheists smack of conspiracy among the majority religionists as you do of hinting that there's a minority atheist conspiracy to bring down religion. I resent that you compare me to the dictatorial elements in North Korea. I don't know who you think you are, but I dislike that regime as much as you do. If you can't keep your ideologies straight, at least give those who can a fekkin' break. Communist dictator does not equal atheist, in ideology. Neither does ACLU. I don't need the ACLU to tell me that religious nuts are trying to take over everything... it isn't as if all atheists belong to SPONGE (Society for Prevention of Nut-balls Getting Everything), but it might not be a bad idea, come to think of it. The trouble with atheists is that they cannot possibly conspire. They're so skeptical, they're skeptical of one another. And the \"media?\" Get over yourself! I turn on my TV, and I get religion on three of the first twelve channels. My radio is alive with the s h i t. Then there's the infamous FOX and MSNBC and ABC. And, what kind of screwy background does Rush Limbaugh have to come from to be as fekked up as he is? Every newspaper has a religious section; show me the 'atheist' section, please. Yeah, the mighty atheist is really whuppin' up on the Christian... It's plain as pink unicorns.", 
        "intTime": 20090304, 
        "postID": 22, 
        "quote": "Originally posted by Thrust_0311: I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth.", 
        "reply": " Calm down before you blow a gasket. I scanned your arguments about the ACLU and evolutionists over to other threads where they can be more appropriately addressed. I could as easily say that your attacks of atheists smack of conspiracy among the majority religionists as you do of hinting that there's a minority atheist conspiracy to bring down religion. I resent that you compare me to the dictatorial elements in North Korea. I don't know who you think you are, but I dislike that regime as much as you do. If you can't keep your ideologies straight, at least give those who can a fekkin' break. Communist dictator does not equal atheist, in ideology. Neither does ACLU. I don't need the ACLU to tell me that religious nuts are trying to take over everything... it isn't as if all atheists belong to SPONGE (Society for Prevention of Nut-balls Getting Everything), but it might not be a bad idea, come to think of it. The trouble with atheists is that they cannot possibly conspire. They're so skeptical, they're skeptical of one another. And the \"media?\" Get over yourself! I turn on my TV, and I get religion on three of the first twelve channels. My radio is alive with the s h i t. Then there's the infamous FOX and MSNBC and ABC. And, what kind of screwy background does Rush Limbaugh have to come from to be as fekked up as he is? Every newspaper has a religious section; show me the 'atheist' section, please. Yeah, the mighty atheist is really whuppin' up on the Christian... It's plain as pink unicorns.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 12:47:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Every newspaper has a religious section; show me the 'atheist' section, please. If you can't distinguish what the newspaper's opinion is and what actual religion is then you are simply a fool. quote: Here's the danger of painting everyone with the same brush: You belong(ed) to the same organization as the three animals who gang-raped and murdered a defenseless girl in Okinawa back in the 90's. Are you ready to describe yourself in the same terms as those three? Either say yes, or retract your blanket statements about atheists, you lunkhead. They are serving a life sentence in Japanese prison - complete with tiny cells and a diet of fish-heads forever. No one gave them pro-bono counsel. You are also taking up for the ACLU by comparing Marines to the lowest common denominator and that is a failure in logic because: It is not our official policy to do as those three did. It IS the ACLU's official policy to destroy religion (among other things) in the pursuit of a certain social agenda. They are dangerous and should be stopped by any means necessary because there are real casualties that result from their action. It is past time we fight back by any means. quote: You seem to have a very large chip on your sholder probably caused by someone or somthing that isnt even in this forum, These people have all been in sometype of military or military connected service, to call a person a coward because of maybe one or even two people you think you knew is Wrong. Calling a person a coward and not doing it to their face IMO would make the person making the statement a coward. I have known alot of xtians that refused to fight in conflicts, dosnt make them cowards just go's against their beliefs, Respectfully donnie, the problem I have is that I am one of many people who feels as though my country is being taken by people who don't understand its values and had nothing to do with its creation. I think that if they prefer secularism and don't like the way we were set up, then they should simply allow us to seperate ourselves from them and govern ourselves accordingly and in peace so that they may do the same according to their beliefs.", 
        "intTime": 20090304, 
        "postID": 23, 
        "quote": "Every newspaper has a religious section; show me the 'atheist' section, please.", 
        "reply": " If you can't distinguish what the newspaper's opinion is and what actual religion is then you are simply a fool. quote: Here's the danger of painting everyone with the same brush: You belong(ed) to the same organization as the three animals who gang-raped and murdered a defenseless girl in Okinawa back in the 90's. Are you ready to describe yourself in the same terms as those three? Either say yes, or retract your blanket statements about atheists, you lunkhead. They are serving a life sentence in Japanese prison - complete with tiny cells and a diet of fish-heads forever. No one gave them pro-bono counsel. You are also taking up for the ACLU by comparing Marines to the lowest common denominator and that is a failure in logic because: It is not our official policy to do as those three did. It IS the ACLU's official policy to destroy religion (among other things) in the pursuit of a certain social agenda. They are dangerous and should be stopped by any means necessary because there are real casualties that result from their action. It is past time we fight back by any means. quote: You seem to have a very large chip on your sholder probably caused by someone or somthing that isnt even in this forum, These people have all been in sometype of military or military connected service, to call a person a coward because of maybe one or even two people you think you knew is Wrong. Calling a person a coward and not doing it to their face IMO would make the person making the statement a coward. I have known alot of xtians that refused to fight in conflicts, dosnt make them cowards just go's against their beliefs, Respectfully donnie, the problem I have is that I am one of many people who feels as though my country is being taken by people who don't understand its values and had nothing to do with its creation. I think that if they prefer secularism and don't like the way we were set up, then they should simply allow us to seperate ourselves from them and govern ourselves accordingly and in peace so that they may do the same according to their beliefs.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 13:39:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: It IS the ACLU's official policy to destroy religion (among other things) in the pursuit of a certain social agenda. If it's their \"official\" policy, then you should be able to supply the address of a web site that declares that policy. Go ahead, we'll wait...", 
        "intTime": 20090304, 
        "postID": 24, 
        "quote": "Originally posted by Thrust_0311: It IS the ACLU's official policy to destroy religion (among other things) in the pursuit of a certain social agenda.", 
        "reply": " If it's their \"official\" policy, then you should be able to supply the address of a web site that declares that policy. Go ahead, we'll wait...", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 16:44:00", 
        "title": "jewish", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Respectfully donnie, the problem I have is that I am one of many people who feels as though my country is being taken by people who don't understand its values and had nothing to do with its creation. I think that if they prefer secularism and don't like the way we were set up, then they should simply allow us to seperate ourselves from them and govern ourselves accordingly and in peace so that they may do the same according to their beliefs.[/quote] THRUST0311; I can identify with that statement in many ways. The problem, as it exists at this minute, is you are picking a fight with guys who have paid their dues, in the military, some for entire careers and here on these fora. I have gone ten rounds with each and every one of them, but I'd back them up in a bar brawl, or with a weapon if they were in poor enough shape to need my sorry old azz!! The way you are condemning fellow brothers in arms is just wrong, there's no other thing to say about it. There has been an atheist here in the last week or so and these guys have tried to tone him down a bit, as he, like you, is very abrasive in his blanket condemnation of ALL religious people no matter what they believe. He's an equal oportunity hater I guess. You really, as a Christian, do NOT want to emulate him!! Begin a conversation, see who it is you are dealing with, then gut them like a fish!! That way you are being fair!! But do not threaten, even vaguely, it is unseemly. Now cool off, then come back and have at it!! With individuals, not entire herds of people, each of whom is different. Reverend Bruce.........Tawodi", 
        "intTime": 20090304, 
        "postID": 25, 
        "quote": "", 
        "reply": "Respectfully donnie, the problem I have is that I am one of many people who feels as though my country is being taken by people who don't understand its values and had nothing to do with its creation. I think that if they prefer secularism and don't like the way we were set up, then they should simply allow us to seperate ourselves from them and govern ourselves accordingly and in peace so that they may do the same according to their beliefs.[/quote] THRUST0311; I can identify with that statement in many ways. The problem, as it exists at this minute, is you are picking a fight with guys who have paid their dues, in the military, some for entire careers and here on these fora. I have gone ten rounds with each and every one of them, but I'd back them up in a bar brawl, or with a weapon if they were in poor enough shape to need my sorry old azz!! The way you are condemning fellow brothers in arms is just wrong, there's no other thing to say about it. There has been an atheist here in the last week or so and these guys have tried to tone him down a bit, as he, like you, is very abrasive in his blanket condemnation of ALL religious people no matter what they believe. He's an equal oportunity hater I guess. You really, as a Christian, do NOT want to emulate him!! Begin a conversation, see who it is you are dealing with, then gut them like a fish!! That way you are being fair!! But do not threaten, even vaguely, it is unseemly. Now cool off, then come back and have at it!! With individuals, not entire herds of people, each of whom is different. Reverend Bruce.........Tawodi", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 17:02:00", 
        "title": "jewish", 
        "userID": "tawodi"
    }, 
    {
        "content": "Get off the fence and look at what has happened: A prospective recruit came asking a question and I answered it to the best of my ability. A typical psychologist picked up on one part of what I said to try and make some point (as an objective and all wise observer, of course) about all religion being the same, with no purpose other than to cover his own self-doubt in the face of an opposing opinion or perhaps to antagonize. Atheist lifers follow suit and get in on what they see as a shooting match. Who is the antagonist here? These people will not stop until our Rights are eliminated entirely. We shouldn't patronize them in any way - they are dangerous fools with no Understanding.", 
        "intTime": 20090304, 
        "postID": 26, 
        "quote": "", 
        "reply": "Get off the fence and look at what has happened: A prospective recruit came asking a question and I answered it to the best of my ability. A typical psychologist picked up on one part of what I said to try and make some point (as an objective and all wise observer, of course) about all religion being the same, with no purpose other than to cover his own self-doubt in the face of an opposing opinion or perhaps to antagonize. Atheist lifers follow suit and get in on what they see as a shooting match. Who is the antagonist here? These people will not stop until our Rights are eliminated entirely. We shouldn't patronize them in any way - they are dangerous fools with no Understanding.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 17:27:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: These people will not stop until our Rights are eliminated entirely. We shouldn't patronize them in any way - they are dangerous fools with no Understanding. Pot. Kettle. Black.", 
        "intTime": 20090304, 
        "postID": 27, 
        "quote": "Originally posted by Thrust_0311: These people will not stop until our Rights are eliminated entirely. We shouldn't patronize them in any way - they are dangerous fools with no Understanding.", 
        "reply": " Pot. Kettle. Black.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 17:30:00", 
        "title": "jewish", 
        "userID": "AKinNC"
    }, 
    {
        "content": "Bruce: Right back atcha, buddy! Adam: Any topic, any time. I'll debate you with half my brain tied behind my back, and still mop the floor with you (forensically speaking, that is). And I'll do it while thinking for myself, not parroting what I heard at a church, on Fox News or on Rush Limbaugh's program. And in the meantime, I'll continue to do anything I can to guarantee your (and therefore MY) freedoms, as protected by the Constitution. But remember, \"Your right to swing your fist ends at the tip of my nose.\"", 
        "intTime": 20090304, 
        "postID": 28, 
        "quote": "", 
        "reply": "Bruce: Right back atcha, buddy! Adam: Any topic, any time. I'll debate you with half my brain tied behind my back, and still mop the floor with you (forensically speaking, that is). And I'll do it while thinking for myself, not parroting what I heard at a church, on Fox News or on Rush Limbaugh's program. And in the meantime, I'll continue to do anything I can to guarantee your (and therefore MY) freedoms, as protected by the Constitution. But remember, \"Your right to swing your fist ends at the tip of my nose.\"", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 17:46:00", 
        "title": "jewish", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Yeah go run your suck about Fox news and all the cliches you want to someone else because you don't know anything about me, my beliefs, or what I read....but I would dare say that you are not very well read. You are an ignorant ******* in life and you'll die that way. quote: Originally posted by AKinNC: Pot. Kettle. Black. Great cliche mr shot from the dark. I'm glad to see my words proved right by your inability to communicate.", 
        "intTime": 20090304, 
        "postID": 29, 
        "quote": "Originally posted by AKinNC: Pot. Kettle. Black.", 
        "reply": "Yeah go run your suck about Fox news and all the cliches you want to someone else because you don't know anything about me, my beliefs, or what I read....but I would dare say that you are not very well read. You are an ignorant ******* in life and you'll die that way.  Great cliche mr shot from the dark. I'm glad to see my words proved right by your inability to communicate.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 18:02:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "Still waiting for your proof on the ACLU's \"official\" policy...", 
        "intTime": 20090304, 
        "postID": 30, 
        "quote": "", 
        "reply": "Still waiting for your proof on the ACLU's \"official\" policy...", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 18:10:00", 
        "title": "jewish", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea", 
        "intTime": 20090301, 
        "postID": 31, 
        "quote": "", 
        "reply": "im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-01 18:09:00", 
        "title": "jewish", 
        "userID": "bornmarinereadyfight"
    }, 
    {
        "content": "quote: Originally posted by bornmarinereadyfight: im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea If it were time to pray and your mission needed you, what would be your priority?", 
        "intTime": 20090301, 
        "postID": 32, 
        "quote": "Originally posted by bornmarinereadyfight: im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea", 
        "reply": " If it were time to pray and your mission needed you, what would be your priority?", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-01 20:19:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "SUGGESTION; Send a letter of enquiry to the Israelli I.D.F. via the Israelli Procounsel in N.Y.C. they will give you the pro's and con's of your religious questions and then contact the Marines with your questions. Bills question is a good one by the way. T", 
        "intTime": 20090301, 
        "postID": 33, 
        "quote": "", 
        "reply": "SUGGESTION; Send a letter of enquiry to the Israelli I.D.F. via the Israelli Procounsel in N.Y.C. they will give you the pro's and con's of your religious questions and then contact the Marines with your questions. Bills question is a good one by the way. T", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-01 20:40:00", 
        "title": "jewish", 
        "userID": "tawodi"
    }, 
    {
        "content": "Are you Orthadox, Conservitave, or Ultra Orthadox? That would make a big difference, Most Ultra Orthadox do not even consider joining the military,( any branch) It has been a long time sence I was in the service and I know alot of things have changed, but when I was in the USARMY, the training stopped at 2100hrs on friday night , As for prayers there was time in the morning, when we stopped for lunch, then dinner most times after 2000 hrs was our time (with restrictions) . Bills question is a good one, I do believe there is time for the Sh'ma, It can be said durning any mission, and in Iraq, and Afganastan seems like the prayer I would be saying most often. BTW I am not speaking as a Jew, I am Ben No'ch. T's suggestion is also a good one. Also talk to your Rabbi, JMHO. D.J.", 
        "intTime": 20090302, 
        "postID": 34, 
        "quote": "", 
        "reply": "Are you Orthadox, Conservitave, or Ultra Orthadox? That would make a big difference, Most Ultra Orthadox do not even consider joining the military,( any branch) It has been a long time sence I was in the service and I know alot of things have changed, but when I was in the USARMY, the training stopped at 2100hrs on friday night , As for prayers there was time in the morning, when we stopped for lunch, then dinner most times after 2000 hrs was our time (with restrictions) . Bills question is a good one, I do believe there is time for the Sh'ma, It can be said durning any mission, and in Iraq, and Afganastan seems like the prayer I would be saying most often. BTW I am not speaking as a Jew, I am Ben No'ch. T's suggestion is also a good one. Also talk to your Rabbi, JMHO. D.J.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-02 00:37:00", 
        "title": "jewish", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "well bill, my biggest concern isnt really praying, since the times to pray and place doesnt need to be in a specific place, it would be better but there isnt a 100% diff., and the time can be pushed around as long as its within several hours, i mean the night prayer can be daid from night till like 3 am. but and praying can just be on the drive. but yet the real concern which basicly decides if i join the marines or the idf is shabbos (sabbath) so the answer to your que is the mission. and thanks a lot for every one elses answer, they all really help.", 
        "intTime": 20090303, 
        "postID": 35, 
        "quote": "", 
        "reply": "well bill, my biggest concern isnt really praying, since the times to pray and place doesnt need to be in a specific place, it would be better but there isnt a 100% diff., and the time can be pushed around as long as its within several hours, i mean the night prayer can be daid from night till like 3 am. but and praying can just be on the drive. but yet the real concern which basicly decides if i join the marines or the idf is shabbos (sabbath) so the answer to your que is the mission. and thanks a lot for every one elses answer, they all really help.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 16:25:00", 
        "title": "jewish", 
        "userID": "bornmarinereadyfight"
    }, 
    {
        "content": "I'm sure we'd much rather have you in the Corps than going to another country. Here's my take on the demographics of the Marine Corps. Remember that this is all anecdotal and is just what I've seen, but I've talked to a lot of Marines in my family and in life and they more or less agree: 20% of the Corps is your generic nonbeliever/agnostic. They don't have time for God and don't really get worked up about it one way or another. Outright atheists and fruitcake \"wiccans\" are far and few between. Normally they are computer geeks or something but not grunts, so you don't hear much from them on the green side. 60% is Christian in the same way that Lord Wellington's Army was \"Christian.\" They get really religious in boot camp and in a hard fight, but the rest of the time they whore and drink like Marines are famous for. They don't rebel against their religion but they don't really embrace it until they're older and wiser. The last 20% are of the more religious type. They keep what traditions they may but it doesn't interfere with their duties. This includes all of the major religions and Judaism, which is a smaller one but not a disrespected one. The trick is knowing when to play it smart. \"Trust God but keep your powder dry,\" as Cromwell said. Or a better analogy might be Gideon: he chose for his 300 the most aloof and stalwart among believers, not the most Traditional. Don't expect to alter your uniform for cultural preferences but don't take anything you shouldn't have to off of an atheist or a malcontent. Also I would add that this was the demographic of the men who fought in the Revolution and our Civil War. Religion makes a better soldier when death stares you in the face constantly.", 
        "intTime": 20090303, 
        "postID": 36, 
        "quote": "", 
        "reply": "I'm sure we'd much rather have you in the Corps than going to another country. Here's my take on the demographics of the Marine Corps. Remember that this is all anecdotal and is just what I've seen, but I've talked to a lot of Marines in my family and in life and they more or less agree: 20% of the Corps is your generic nonbeliever/agnostic. They don't have time for God and don't really get worked up about it one way or another. Outright atheists and fruitcake \"wiccans\" are far and few between. Normally they are computer geeks or something but not grunts, so you don't hear much from them on the green side. 60% is Christian in the same way that Lord Wellington's Army was \"Christian.\" They get really religious in boot camp and in a hard fight, but the rest of the time they whore and drink like Marines are famous for. They don't rebel against their religion but they don't really embrace it until they're older and wiser. The last 20% are of the more religious type. They keep what traditions they may but it doesn't interfere with their duties. This includes all of the major religions and Judaism, which is a smaller one but not a disrespected one. The trick is knowing when to play it smart. \"Trust God but keep your powder dry,\" as Cromwell said. Or a better analogy might be Gideon: he chose for his 300 the most aloof and stalwart among believers, not the most Traditional. Don't expect to alter your uniform for cultural preferences but don't take anything you shouldn't have to off of an atheist or a malcontent. Also I would add that this was the demographic of the men who fought in the Revolution and our Civil War. Religion makes a better soldier when death stares you in the face constantly.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 16:36:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: ............................ Religion makes a better soldier when death stares you in the face constantly. As any fundamentalist fanatic terrorist will tell you! ....or kamikaze ....or Masada 'defender' .... or Constantine at Milvian Bridge.... the gods are unimportant... it's the idea that counts.", 
        "intTime": 20090303, 
        "postID": 37, 
        "quote": "Originally posted by Thrust_0311: ............................ Religion makes a better soldier when death stares you in the face constantly.", 
        "reply": " As any fundamentalist fanatic terrorist will tell you! ....or kamikaze ....or Masada 'defender' .... or Constantine at Milvian Bridge.... the gods are unimportant... it's the idea that counts.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 17:08:00", 
        "title": "jewish", 
        "userID": "reducetension"
    }, 
    {
        "content": "The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you.", 
        "intTime": 20090303, 
        "postID": 38, 
        "quote": "", 
        "reply": "The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 18:14:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by bornmarinereadyfight: im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea bornmarinereadyfight, My husband is an observant Jew and has managed to survive keeping Shabbat and prayers (as well as kosher, and yom tovim) in the army. If you want, you can e-mail me and I will put you in contact with him. I also know an Orthodox Rabbi (US Army) that could give you some help. He just came back from Iraq and I am sure will be more than happy to give you his opinion. Shalom Raquel", 
        "intTime": 20090303, 
        "postID": 39, 
        "quote": "Originally posted by bornmarinereadyfight: im a jew who is very close to my religion. no like really close, like kosher, black hats and kipus on sabath (srry if thats spelled rong, we really call it shabbos) i really want to join the marines but out of what i saw, sunday is the only day for religion? i know the army gives kosher mre's, but what about the corps? and last i would like to learn torah avery once in a while, and pray 3 times a day ( mornings the long one, afternoon is like 10 min. and evening is like 20) i doubt it, but is this all possible for an active duty infantryman or recon marine? and maybe even during bootcamp, thanks a lot, you have no idea", 
        "reply": " bornmarinereadyfight, My husband is an observant Jew and has managed to survive keeping Shabbat and prayers (as well as kosher, and yom tovim) in the army. If you want, you can e-mail me and I will put you in contact with him. I also know an Orthodox Rabbi (US Army) that could give you some help. He just came back from Iraq and I am sure will be more than happy to give you his opinion. Shalom Raquel", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 19:20:00", 
        "title": "jewish", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you. So then, the Marines I had to deal with in \"treatment\" in my occupation in the military, those who beat their wives and kids, are representative of all Marines? I didn't say a believe in God was a bad idea. I noted such believe can work in both ways. The subject of the thread will do fine, regardless of which god he worships. The military can be very accommodating. This is America, after all. (Hi, Raquel! Long time no see read !)", 
        "intTime": 20090303, 
        "postID": 40, 
        "quote": "Originally posted by Thrust_0311: The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you.", 
        "reply": " So then, the Marines I had to deal with in \"treatment\" in my occupation in the military, those who beat their wives and kids, are representative of all Marines? I didn't say a believe in God was a bad idea. I noted such believe can work in both ways. The subject of the thread will do fine, regardless of which god he worships. The military can be very accommodating. This is America, after all. (Hi, Raquel! Long time no see read !)", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 19:32:00", 
        "title": "jewish", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: So then, the Marines I had to deal with in \"treatment\" in my occupation in the military, those who beat their wives and kids, are representative of all Marines? I didn't say a believe in God was a bad idea. I noted such believe can work in both ways. The subject of the thread will do fine, regards of which god he worships. The military can be very accommodating. This is America, after all. (Hi, Raquel! Long time no see read !) You are so condescending......but I agree that he has his right to worship as he pleases in America.", 
        "intTime": 20090303, 
        "postID": 41, 
        "quote": "Originally posted by reducetension: So then, the Marines I had to deal with in \"treatment\" in my occupation in the military, those who beat their wives and kids, are representative of all Marines? I didn't say a believe in God was a bad idea. I noted such believe can work in both ways. The subject of the thread will do fine, regards of which god he worships. The military can be very accommodating. This is America, after all. (Hi, Raquel! Long time no see read !)", 
        "reply": " You are so condescending......but I agree that he has his right to worship as he pleases in America.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 19:37:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by reducetension: (Hi, Raquel! Long time no see read !) Hi reducetension, I know, it has been for ever!!! How are you? I have been a bit busy taken some classes, but I hope to have some time to write more often. See ya! Raquel", 
        "intTime": 20090303, 
        "postID": 42, 
        "quote": "Originally posted by reducetension: (Hi, Raquel! Long time no see read !)", 
        "reply": " Hi reducetension, I know, it has been for ever!!! How are you? I have been a bit busy taken some classes, but I hope to have some time to write more often. See ya! Raquel", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 20:19:00", 
        "title": "jewish", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "quote: Originally posted by bornmarinereadyfight: well bill, my biggest concern isnt really praying, since the times to pray and place doesnt need to be in a specific place, it would be better but there isnt a 100% diff., and the time can be pushed around as long as its within several hours, i mean the night prayer can be daid from night till like 3 am. but and praying can just be on the drive. but yet the real concern which basicly decides if i join the marines or the idf is shabbos (sabbath) so the answer to your que is the mission. and thanks a lot for every one elses answer, they all really help. I think I read on another thread that Uncle is trying to accommodate food requirements of Jews and Muslims. If you don't mind the occasional generic chaplain, you'll probably survive.", 
        "intTime": 20090303, 
        "postID": 43, 
        "quote": "Originally posted by bornmarinereadyfight: well bill, my biggest concern isnt really praying, since the times to pray and place doesnt need to be in a specific place, it would be better but there isnt a 100% diff., and the time can be pushed around as long as its within several hours, i mean the night prayer can be daid from night till like 3 am. but and praying can just be on the drive. but yet the real concern which basicly decides if i join the marines or the idf is shabbos (sabbath) so the answer to your que is the mission. and thanks a lot for every one elses answer, they all really help.", 
        "reply": " I think I read on another thread that Uncle is trying to accommodate food requirements of Jews and Muslims. If you don't mind the occasional generic chaplain, you'll probably survive.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 22:00:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "Hello ixcatzin, Hadnt seen you in awhile and hoped you woud find his post, Shalom D.J.", 
        "intTime": 20090303, 
        "postID": 44, 
        "quote": "", 
        "reply": "Hello ixcatzin, Hadnt seen you in awhile and hoped you woud find his post, Shalom D.J.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 22:06:00", 
        "title": "jewish", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you. Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. Thing two: Who the hell are you to decide what the nature of inquiry is in a thread that doesn't remotely belong to you?", 
        "intTime": 20090303, 
        "postID": 45, 
        "quote": "Originally posted by Thrust_0311: The atheists who were with us discraced themselves in combat. All two of them. I don't think any more of your worth as soldiers than I do of your opinion in an inquiry thread that was not made for you.", 
        "reply": " Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. Thing two: Who the hell are you to decide what the nature of inquiry is in a thread that doesn't remotely belong to you?", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-03 22:07:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: Hello ixcatzin, Hadnt seen you in awhile and hoped you woud find his post, Shalom D.J. Hi Donnie, I have been quite busy, but I have some free time now and hope to participate more often. How are you? Shalom, Raquel", 
        "intTime": 20090304, 
        "postID": 46, 
        "quote": "Originally posted by donniejanuarysr: Hello ixcatzin, Hadnt seen you in awhile and hoped you woud find his post, Shalom D.J.", 
        "reply": " Hi Donnie, I have been quite busy, but I have some free time now and hope to participate more often. How are you? Shalom, Raquel", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 07:30:00", 
        "title": "jewish", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "quote: Originally posted by billbright: Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. What do you want me to say? Those are fighting words that aren't said in person. I'll have you know, those cowards were dealt with and the problem was resolved. It only reinforced what was already obvious to us and to all soldiers. Also their weakness is all the more reason we should stand up to them when they try to subvert our civilization.", 
        "intTime": 20090304, 
        "postID": 47, 
        "quote": "Originally posted by billbright: Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like.", 
        "reply": " What do you want me to say? Those are fighting words that aren't said in person. I'll have you know, those cowards were dealt with and the problem was resolved. It only reinforced what was already obvious to us and to all soldiers. Also their weakness is all the more reason we should stand up to them when they try to subvert our civilization.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 10:17:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: quote: Originally posted by billbright: Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. What do you want me to say? Those are fighting words that aren't said in person. I'll have you know, those cowards were dealt with and the problem was resolved. It only reinforced what was already obvious to us and to all soldiers. Also their weakness is all the more reason we should stand up to them when they try to subvert our civilization. And hence, all atheists are a s s holes, I suppose. Move closer. I'll say it in person. You're acting like a jerk, and it's not making civilization any stronger by your actions. You asked what I want you to say? I want you to say you're sorry. I don't want you to kiss my a s s. I just want you to be a stand-up guy and admit that there are decent atheists in the world and that your statements were inappropriate. You come charging in with that Marine all-go no-stop attitude without thinking for an instant that you may not be right in the minutest degree, then you don't expect to be challenged? WTF?", 
        "intTime": 20090304, 
        "postID": 48, 
        "quote": "Originally posted by Thrust_0311: quote: Originally posted by billbright: Thing one: I'm inclined to think you're a lying sack of .... regarding atheists in combat. You probably made it up. (I notice that atheists have less trouble spelling, too.) It's possible that there are disgraceful atheists in combat situations, but I don't imagine you'd be any kind of judge as to what disgraceful behavior actually looks like. What do you want me to say? Those are fighting words that aren't said in person. I'll have you know, those cowards were dealt with and the problem was resolved. It only reinforced what was already obvious to us and to all soldiers. Also their weakness is all the more reason we should stand up to them when they try to subvert our civilization.", 
        "reply": " And hence, all atheists are a s s holes, I suppose. Move closer. I'll say it in person. You're acting like a jerk, and it's not making civilization any stronger by your actions. You asked what I want you to say? I want you to say you're sorry. I don't want you to kiss my a s s. I just want you to be a stand-up guy and admit that there are decent atheists in the world and that your statements were inappropriate. You come charging in with that Marine all-go no-stop attitude without thinking for an instant that you may not be right in the minutest degree, then you don't expect to be challenged? WTF?", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 11:17:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth.", 
        "intTime": 20090304, 
        "postID": 49, 
        "quote": "", 
        "reply": "I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 12:00:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "real er in Thrust aparently you may have know a few people of non belief (no offence intended) But I have also known alot more that I would have standing beside me in anyfight, their beliefs are not like mine just like yours are not like mine but I would not be afraid to go into any battle with them standing beside me. You seem to have a very large chip on your sholder probably caused by someone or somthing that isnt even in this forum, These people have all been in sometype of military or military connected service, to call a person a coward because of maybe one or even two people you think you knew is Wrong. Calling a person a coward and not doing it to their face IMO would make the person making the statement a coward. I have known alot of xtians that refused to fight in conflicts, dosnt make them cowards just go's against their beliefs, JMHO D.J.", 
        "intTime": 20090304, 
        "postID": 50, 
        "quote": "", 
        "reply": "real er in Thrust aparently you may have know a few people of non belief (no offence intended) But I have also known alot more that I would have standing beside me in anyfight, their beliefs are not like mine just like yours are not like mine but I would not be afraid to go into any battle with them standing beside me. You seem to have a very large chip on your sholder probably caused by someone or somthing that isnt even in this forum, These people have all been in sometype of military or military connected service, to call a person a coward because of maybe one or even two people you think you knew is Wrong. Calling a person a coward and not doing it to their face IMO would make the person making the statement a coward. I have known alot of xtians that refused to fight in conflicts, dosnt make them cowards just go's against their beliefs, JMHO D.J.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 12:28:00", 
        "title": "jewish", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth. Here's the danger of painting everyone with the same brush: You belong(ed) to the same organization as the three animals who gang-raped and murdered a defenseless girl in Okinawa back in the 90's. Are you ready to describe yourself in the same terms as those three? Either say yes, or retract your blanket statements about atheists, you lunkhead. By the way, responding to words with hints of violence? Always a sign of someone who knows they're in the wrong. If you can't argue your way out, don't think you can win by fighting your way out. THAT is what a COWARD would do.", 
        "intTime": 20090304, 
        "postID": 51, 
        "quote": "Originally posted by Thrust_0311: I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth.", 
        "reply": " Here's the danger of painting everyone with the same brush: You belong(ed) to the same organization as the three animals who gang-raped and murdered a defenseless girl in Okinawa back in the 90's. Are you ready to describe yourself in the same terms as those three? Either say yes, or retract your blanket statements about atheists, you lunkhead. By the way, responding to words with hints of violence? Always a sign of someone who knows they're in the wrong. If you can't argue your way out, don't think you can win by fighting your way out. THAT is what a COWARD would do.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 12:33:00", 
        "title": "jewish", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth. Calm down before you blow a gasket. I scanned your arguments about the ACLU and evolutionists over to other threads where they can be more appropriately addressed. I could as easily say that your attacks of atheists smack of conspiracy among the majority religionists as you do of hinting that there's a minority atheist conspiracy to bring down religion. I resent that you compare me to the dictatorial elements in North Korea. I don't know who you think you are, but I dislike that regime as much as you do. If you can't keep your ideologies straight, at least give those who can a fekkin' break. Communist dictator does not equal atheist, in ideology. Neither does ACLU. I don't need the ACLU to tell me that religious nuts are trying to take over everything... it isn't as if all atheists belong to SPONGE (Society for Prevention of Nut-balls Getting Everything), but it might not be a bad idea, come to think of it. The trouble with atheists is that they cannot possibly conspire. They're so skeptical, they're skeptical of one another. And the \"media?\" Get over yourself! I turn on my TV, and I get religion on three of the first twelve channels. My radio is alive with the s h i t. Then there's the infamous FOX and MSNBC and ABC. And, what kind of screwy background does Rush Limbaugh have to come from to be as fekked up as he is? Every newspaper has a religious section; show me the 'atheist' section, please. Yeah, the mighty atheist is really whuppin' up on the Christian... It's plain as pink unicorns.", 
        "intTime": 20090304, 
        "postID": 52, 
        "quote": "Originally posted by Thrust_0311: I don't mind being challenge and I support your right to say what you want, but I've had it with giving in to atheists. The ACLU gives free counsel to child rapist/murderers for the same reason that it tries to tear down every Cross in America. Evolutionists pass laws to censor anyone who points out the lies that they rely on for the same reason that they want to control what preachers can actually say. We are under attack and it is time to fight back. Ridicule us all you want, but it's time to stop their slimy subversion so that they will have no choice but to fight us openly, which I KNOW they don't have the stomach for. If they did, they would have done it already. It's all about doing harm and creating chaos to them. I think that to say it is about worldy power is to give them too much credit. There is a difference in someone minding their own business as a non-believer and the kinds of atheists that constitute the North Korean security, the ACLU, the media, and so forth.", 
        "reply": " Calm down before you blow a gasket. I scanned your arguments about the ACLU and evolutionists over to other threads where they can be more appropriately addressed. I could as easily say that your attacks of atheists smack of conspiracy among the majority religionists as you do of hinting that there's a minority atheist conspiracy to bring down religion. I resent that you compare me to the dictatorial elements in North Korea. I don't know who you think you are, but I dislike that regime as much as you do. If you can't keep your ideologies straight, at least give those who can a fekkin' break. Communist dictator does not equal atheist, in ideology. Neither does ACLU. I don't need the ACLU to tell me that religious nuts are trying to take over everything... it isn't as if all atheists belong to SPONGE (Society for Prevention of Nut-balls Getting Everything), but it might not be a bad idea, come to think of it. The trouble with atheists is that they cannot possibly conspire. They're so skeptical, they're skeptical of one another. And the \"media?\" Get over yourself! I turn on my TV, and I get religion on three of the first twelve channels. My radio is alive with the s h i t. Then there's the infamous FOX and MSNBC and ABC. And, what kind of screwy background does Rush Limbaugh have to come from to be as fekked up as he is? Every newspaper has a religious section; show me the 'atheist' section, please. Yeah, the mighty atheist is really whuppin' up on the Christian... It's plain as pink unicorns.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 12:47:00", 
        "title": "jewish", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Every newspaper has a religious section; show me the 'atheist' section, please. If you can't distinguish what the newspaper's opinion is and what actual religion is then you are simply a fool. quote: Here's the danger of painting everyone with the same brush: You belong(ed) to the same organization as the three animals who gang-raped and murdered a defenseless girl in Okinawa back in the 90's. Are you ready to describe yourself in the same terms as those three? Either say yes, or retract your blanket statements about atheists, you lunkhead. They are serving a life sentence in Japanese prison - complete with tiny cells and a diet of fish-heads forever. No one gave them pro-bono counsel. You are also taking up for the ACLU by comparing Marines to the lowest common denominator and that is a failure in logic because: It is not our official policy to do as those three did. It IS the ACLU's official policy to destroy religion (among other things) in the pursuit of a certain social agenda. They are dangerous and should be stopped by any means necessary because there are real casualties that result from their action. It is past time we fight back by any means. quote: You seem to have a very large chip on your sholder probably caused by someone or somthing that isnt even in this forum, These people have all been in sometype of military or military connected service, to call a person a coward because of maybe one or even two people you think you knew is Wrong. Calling a person a coward and not doing it to their face IMO would make the person making the statement a coward. I have known alot of xtians that refused to fight in conflicts, dosnt make them cowards just go's against their beliefs, Respectfully donnie, the problem I have is that I am one of many people who feels as though my country is being taken by people who don't understand its values and had nothing to do with its creation. I think that if they prefer secularism and don't like the way we were set up, then they should simply allow us to seperate ourselves from them and govern ourselves accordingly and in peace so that they may do the same according to their beliefs.", 
        "intTime": 20090304, 
        "postID": 53, 
        "quote": "Every newspaper has a religious section; show me the 'atheist' section, please.", 
        "reply": " If you can't distinguish what the newspaper's opinion is and what actual religion is then you are simply a fool. quote: Here's the danger of painting everyone with the same brush: You belong(ed) to the same organization as the three animals who gang-raped and murdered a defenseless girl in Okinawa back in the 90's. Are you ready to describe yourself in the same terms as those three? Either say yes, or retract your blanket statements about atheists, you lunkhead. They are serving a life sentence in Japanese prison - complete with tiny cells and a diet of fish-heads forever. No one gave them pro-bono counsel. You are also taking up for the ACLU by comparing Marines to the lowest common denominator and that is a failure in logic because: It is not our official policy to do as those three did. It IS the ACLU's official policy to destroy religion (among other things) in the pursuit of a certain social agenda. They are dangerous and should be stopped by any means necessary because there are real casualties that result from their action. It is past time we fight back by any means. quote: You seem to have a very large chip on your sholder probably caused by someone or somthing that isnt even in this forum, These people have all been in sometype of military or military connected service, to call a person a coward because of maybe one or even two people you think you knew is Wrong. Calling a person a coward and not doing it to their face IMO would make the person making the statement a coward. I have known alot of xtians that refused to fight in conflicts, dosnt make them cowards just go's against their beliefs, Respectfully donnie, the problem I have is that I am one of many people who feels as though my country is being taken by people who don't understand its values and had nothing to do with its creation. I think that if they prefer secularism and don't like the way we were set up, then they should simply allow us to seperate ourselves from them and govern ourselves accordingly and in peace so that they may do the same according to their beliefs.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 13:39:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: It IS the ACLU's official policy to destroy religion (among other things) in the pursuit of a certain social agenda. If it's their \"official\" policy, then you should be able to supply the address of a web site that declares that policy. Go ahead, we'll wait...", 
        "intTime": 20090304, 
        "postID": 54, 
        "quote": "Originally posted by Thrust_0311: It IS the ACLU's official policy to destroy religion (among other things) in the pursuit of a certain social agenda.", 
        "reply": " If it's their \"official\" policy, then you should be able to supply the address of a web site that declares that policy. Go ahead, we'll wait...", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 16:44:00", 
        "title": "jewish", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Respectfully donnie, the problem I have is that I am one of many people who feels as though my country is being taken by people who don't understand its values and had nothing to do with its creation. I think that if they prefer secularism and don't like the way we were set up, then they should simply allow us to seperate ourselves from them and govern ourselves accordingly and in peace so that they may do the same according to their beliefs.[/quote] THRUST0311; I can identify with that statement in many ways. The problem, as it exists at this minute, is you are picking a fight with guys who have paid their dues, in the military, some for entire careers and here on these fora. I have gone ten rounds with each and every one of them, but I'd back them up in a bar brawl, or with a weapon if they were in poor enough shape to need my sorry old azz!! The way you are condemning fellow brothers in arms is just wrong, there's no other thing to say about it. There has been an atheist here in the last week or so and these guys have tried to tone him down a bit, as he, like you, is very abrasive in his blanket condemnation of ALL religious people no matter what they believe. He's an equal oportunity hater I guess. You really, as a Christian, do NOT want to emulate him!! Begin a conversation, see who it is you are dealing with, then gut them like a fish!! That way you are being fair!! But do not threaten, even vaguely, it is unseemly. Now cool off, then come back and have at it!! With individuals, not entire herds of people, each of whom is different. Reverend Bruce.........Tawodi", 
        "intTime": 20090304, 
        "postID": 55, 
        "quote": "", 
        "reply": "Respectfully donnie, the problem I have is that I am one of many people who feels as though my country is being taken by people who don't understand its values and had nothing to do with its creation. I think that if they prefer secularism and don't like the way we were set up, then they should simply allow us to seperate ourselves from them and govern ourselves accordingly and in peace so that they may do the same according to their beliefs.[/quote] THRUST0311; I can identify with that statement in many ways. The problem, as it exists at this minute, is you are picking a fight with guys who have paid their dues, in the military, some for entire careers and here on these fora. I have gone ten rounds with each and every one of them, but I'd back them up in a bar brawl, or with a weapon if they were in poor enough shape to need my sorry old azz!! The way you are condemning fellow brothers in arms is just wrong, there's no other thing to say about it. There has been an atheist here in the last week or so and these guys have tried to tone him down a bit, as he, like you, is very abrasive in his blanket condemnation of ALL religious people no matter what they believe. He's an equal oportunity hater I guess. You really, as a Christian, do NOT want to emulate him!! Begin a conversation, see who it is you are dealing with, then gut them like a fish!! That way you are being fair!! But do not threaten, even vaguely, it is unseemly. Now cool off, then come back and have at it!! With individuals, not entire herds of people, each of whom is different. Reverend Bruce.........Tawodi", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 17:02:00", 
        "title": "jewish", 
        "userID": "tawodi"
    }, 
    {
        "content": "Get off the fence and look at what has happened: A prospective recruit came asking a question and I answered it to the best of my ability. A typical psychologist picked up on one part of what I said to try and make some point (as an objective and all wise observer, of course) about all religion being the same, with no purpose other than to cover his own self-doubt in the face of an opposing opinion or perhaps to antagonize. Atheist lifers follow suit and get in on what they see as a shooting match. Who is the antagonist here? These people will not stop until our Rights are eliminated entirely. We shouldn't patronize them in any way - they are dangerous fools with no Understanding.", 
        "intTime": 20090304, 
        "postID": 56, 
        "quote": "", 
        "reply": "Get off the fence and look at what has happened: A prospective recruit came asking a question and I answered it to the best of my ability. A typical psychologist picked up on one part of what I said to try and make some point (as an objective and all wise observer, of course) about all religion being the same, with no purpose other than to cover his own self-doubt in the face of an opposing opinion or perhaps to antagonize. Atheist lifers follow suit and get in on what they see as a shooting match. Who is the antagonist here? These people will not stop until our Rights are eliminated entirely. We shouldn't patronize them in any way - they are dangerous fools with no Understanding.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 17:27:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: These people will not stop until our Rights are eliminated entirely. We shouldn't patronize them in any way - they are dangerous fools with no Understanding. Pot. Kettle. Black.", 
        "intTime": 20090304, 
        "postID": 57, 
        "quote": "Originally posted by Thrust_0311: These people will not stop until our Rights are eliminated entirely. We shouldn't patronize them in any way - they are dangerous fools with no Understanding.", 
        "reply": " Pot. Kettle. Black.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 17:30:00", 
        "title": "jewish", 
        "userID": "AKinNC"
    }, 
    {
        "content": "Bruce: Right back atcha, buddy! Adam: Any topic, any time. I'll debate you with half my brain tied behind my back, and still mop the floor with you (forensically speaking, that is). And I'll do it while thinking for myself, not parroting what I heard at a church, on Fox News or on Rush Limbaugh's program. And in the meantime, I'll continue to do anything I can to guarantee your (and therefore MY) freedoms, as protected by the Constitution. But remember, \"Your right to swing your fist ends at the tip of my nose.\"", 
        "intTime": 20090304, 
        "postID": 58, 
        "quote": "", 
        "reply": "Bruce: Right back atcha, buddy! Adam: Any topic, any time. I'll debate you with half my brain tied behind my back, and still mop the floor with you (forensically speaking, that is). And I'll do it while thinking for myself, not parroting what I heard at a church, on Fox News or on Rush Limbaugh's program. And in the meantime, I'll continue to do anything I can to guarantee your (and therefore MY) freedoms, as protected by the Constitution. But remember, \"Your right to swing your fist ends at the tip of my nose.\"", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 17:46:00", 
        "title": "jewish", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Yeah go run your suck about Fox news and all the cliches you want to someone else because you don't know anything about me, my beliefs, or what I read....but I would dare say that you are not very well read. You are an ignorant ******* in life and you'll die that way. quote: Originally posted by AKinNC: Pot. Kettle. Black. Great cliche mr shot from the dark. I'm glad to see my words proved right by your inability to communicate.", 
        "intTime": 20090304, 
        "postID": 59, 
        "quote": "Originally posted by AKinNC: Pot. Kettle. Black.", 
        "reply": "Yeah go run your suck about Fox news and all the cliches you want to someone else because you don't know anything about me, my beliefs, or what I read....but I would dare say that you are not very well read. You are an ignorant ******* in life and you'll die that way.  Great cliche mr shot from the dark. I'm glad to see my words proved right by your inability to communicate.", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 18:02:00", 
        "title": "jewish", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "Still waiting for your proof on the ACLU's \"official\" policy...", 
        "intTime": 20090304, 
        "postID": 60, 
        "quote": "", 
        "reply": "Still waiting for your proof on the ACLU's \"official\" policy...", 
        "threadID": "1270031990001_6540026612001", 
        "time": "2009-03-04 18:10:00", 
        "title": "jewish", 
        "userID": "SteveDeHaven"
    }
]