[
    {
        "content": "I've recently received emails from two disparate sources with the same \"video\" attached. I put video in quotes because the bulk of the work was in video format, but nothing moved... a PowerPoint type program was presented telling me that, essentially, the Muslims are going to take over because they are willing to screw more than I am. It ranted about the birth rate in different places in the world and the effect it has had on the increase in Muslims in those places. The upshot of it was that if we don't start reproducing like bunnies, the Muslims will dominate. I guess it struck a nerve with the GOP mentality, because the two people who sent it to me are raving righty's. My reply? How do you explain India and China not being very powerful in the world until they began limiting population growth? Religious competition! Don't you just love it?", 
        "intTime": 20090505, 
        "postID": 1, 
        "quote": "", 
        "reply": "I've recently received emails from two disparate sources with the same \"video\" attached. I put video in quotes because the bulk of the work was in video format, but nothing moved... a PowerPoint type program was presented telling me that, essentially, the Muslims are going to take over because they are willing to screw more than I am. It ranted about the birth rate in different places in the world and the effect it has had on the increase in Muslims in those places. The upshot of it was that if we don't start reproducing like bunnies, the Muslims will dominate. I guess it struck a nerve with the GOP mentality, because the two people who sent it to me are raving righty's. My reply? How do you explain India and China not being very powerful in the world until they began limiting population growth? Religious competition! Don't you just love it?", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-05 16:20:00", 
        "title": "Population", 
        "userID": "billbright"
    }, 
    {
        "content": "The Pope has been wringing his hands over this for a couple of years now. And it is the conservatives who sweat the most over it. Muslims will dominate via reproduction in democratic countries and vote themselves in to power and Islamic laws. Screwing really isn't the issue, however, it's birth control and abortion. They don't use it and and godless liberals do. So, I guess the godless liberals will eventually become extinct and the conservative Christians and Muslims will duke it out over who speaks for god? What a nice future for the planet. Overpopulated by religious nuts.", 
        "intTime": 20090505, 
        "postID": 2, 
        "quote": "", 
        "reply": "The Pope has been wringing his hands over this for a couple of years now. And it is the conservatives who sweat the most over it. Muslims will dominate via reproduction in democratic countries and vote themselves in to power and Islamic laws. Screwing really isn't the issue, however, it's birth control and abortion. They don't use it and and godless liberals do. So, I guess the godless liberals will eventually become extinct and the conservative Christians and Muslims will duke it out over who speaks for god? What a nice future for the planet. Overpopulated by religious nuts.", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-05 16:30:00", 
        "title": "Population", 
        "userID": "reducetension"
    }, 
    {
        "content": "The more things change, the more they stay the same. I guess much like your government, you get the world you deserve.", 
        "intTime": 20090505, 
        "postID": 3, 
        "quote": "", 
        "reply": "The more things change, the more they stay the same. I guess much like your government, you get the world you deserve.", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-05 17:37:00", 
        "title": "Population", 
        "userID": "AKinNC"
    }, 
    {
        "content": "It's not just Muslim's, it's the whole third world. But, fear not; there are three possible solutions: 1. Kill off the undesirables, a solution evidently in favor among the \"elites\" of the world who don't want to see their position threatened. 2. Make love, not war. The more we do that, the more kids we'll have. 3. Transfer enormous amounts of wealth to the undesirables. It's a statistical fact that wealthier nations produce fewer children. Why? Because entertainment is expensive and the only entertainment poor people have is sex. It's virtually free.", 
        "intTime": 20090505, 
        "postID": 4, 
        "quote": "", 
        "reply": "It's not just Muslim's, it's the whole third world. But, fear not; there are three possible solutions: 1. Kill off the undesirables, a solution evidently in favor among the \"elites\" of the world who don't want to see their position threatened. 2. Make love, not war. The more we do that, the more kids we'll have. 3. Transfer enormous amounts of wealth to the undesirables. It's a statistical fact that wealthier nations produce fewer children. Why? Because entertainment is expensive and the only entertainment poor people have is sex. It's virtually free.", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-05 17:45:00", 
        "title": "Population", 
        "userID": "stillkit"
    }, 
    {
        "content": "I had a friend send me this clip from you tube that you all are talkin' about. I started me seriously worrying about his propensity toward cabin fever up there in Maine........is it time to start worryin' about all of you now????", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "", 
        "reply": "I had a friend send me this clip from you tube that you all are talkin' about. I started me seriously worrying about his propensity toward cabin fever up there in Maine........is it time to start worryin' about all of you now????", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-06 12:29:00", 
        "title": "Population", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by reducetension: The Pope has been wringing his hands over this for a couple of years now. And it is the conservatives who sweat the most over it. Muslims will dominate via reproduction in democratic countries and vote themselves in to power and Islamic laws. Screwing really isn't the issue, however, it's birth control and abortion. They don't use it and and godless liberals do. So, I guess the godless liberals will eventually become extinct and the conservative Christians and Muslims will duke it out over who speaks for god? What a nice future for the planet. Overpopulated by religious nuts. Godlessness has a way of breeding without intercourse when people become knowledgeable, and people are learning at an astounding rate, due to the internet. People will eventually get tired of the suspicions, hatred, and bloodshed, I think. There's new troubles on the horizon, c/o the melting icecap. Once-frozen waters opening up will change trade and warship routes, melting glaciers will cause millions of refugees from the mountainous hinterlands, desertification will continue to increase in other parts of the globe, and oil and water will be the new items over which we will combat one another. Russia has over half the newly available drillable space, north of the Arctic circle. Religion will be the last thing on people's minds in a couple of years. This country will be attempting to play catch-up in the energy race and starting to pull its head out... but too late. Someone else in the world will lead in oil, nuclear, alternate fuels and manufacturing resources, and we'll be educating our kids to learn new cultures and languages to survive in other countries... thanks to powerful morons who can't get a clue in this country. My youngest is learning Spanish as fast as she can; bi-lingual never hurt anyone. Adapt and survive... we're already in the end game of adjusting to global warming.", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "Originally posted by reducetension: The Pope has been wringing his hands over this for a couple of years now. And it is the conservatives who sweat the most over it. Muslims will dominate via reproduction in democratic countries and vote themselves in to power and Islamic laws. Screwing really isn't the issue, however, it's birth control and abortion. They don't use it and and godless liberals do. So, I guess the godless liberals will eventually become extinct and the conservative Christians and Muslims will duke it out over who speaks for god? What a nice future for the planet. Overpopulated by religious nuts.", 
        "reply": " Godlessness has a way of breeding without intercourse when people become knowledgeable, and people are learning at an astounding rate, due to the internet. People will eventually get tired of the suspicions, hatred, and bloodshed, I think. There's new troubles on the horizon, c/o the melting icecap. Once-frozen waters opening up will change trade and warship routes, melting glaciers will cause millions of refugees from the mountainous hinterlands, desertification will continue to increase in other parts of the globe, and oil and water will be the new items over which we will combat one another. Russia has over half the newly available drillable space, north of the Arctic circle. Religion will be the last thing on people's minds in a couple of years. This country will be attempting to play catch-up in the energy race and starting to pull its head out... but too late. Someone else in the world will lead in oil, nuclear, alternate fuels and manufacturing resources, and we'll be educating our kids to learn new cultures and languages to survive in other countries... thanks to powerful morons who can't get a clue in this country. My youngest is learning Spanish as fast as she can; bi-lingual never hurt anyone. Adapt and survive... we're already in the end game of adjusting to global warming.", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-06 17:24:00", 
        "title": "Population", 
        "userID": "billbright"
    }, 
    {
        "content": "With or without religion, it is all so sad. My 15 year old grandson understands it well as I suppose most young people do and my oldest daughter is angry over it, too, and in environmental studies.... I won't be here, I suppose, but its so sad.", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "", 
        "reply": "With or without religion, it is all so sad. My 15 year old grandson understands it well as I suppose most young people do and my oldest daughter is angry over it, too, and in environmental studies.... I won't be here, I suppose, but its so sad.", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-06 19:29:00", 
        "title": "Population", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: With or without religion, it is all so sad. My 15 year old grandson understands it well as I suppose most young people do and my oldest daughter is angry over it, too, and in environmental studies.... I won't be here, I suppose, but its so sad. Why? Where are you going? We're talking about less than twenty years, m'man. You'll still be here.", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by reducetension: With or without religion, it is all so sad. My 15 year old grandson understands it well as I suppose most young people do and my oldest daughter is angry over it, too, and in environmental studies.... I won't be here, I suppose, but its so sad.", 
        "reply": " Why? Where are you going? We're talking about less than twenty years, m'man. You'll still be here.", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-06 21:31:00", 
        "title": "Population", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by reducetension: With or without religion, it is all so sad. My 15 year old grandson understands it well as I suppose most young people do and my oldest daughter is angry over it, too, and in environmental studies.... I won't be here, I suppose, but its so sad. Why? Where are you going? We're talking about less than twenty years, m'man. You'll still be here. No, probably not and not all that interested to be... make room for the next generation or two, my ultimate contribution to saving the planet. I'll be 85 then.... live long and suffer? Hopefully what's left of me will be ashes on top of the Continental Divide in the Rockies of Montana and a fine layer of mud on the bottom of the Puget Sound!", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "Originally posted by billbright: quote: Originally posted by reducetension: With or without religion, it is all so sad. My 15 year old grandson understands it well as I suppose most young people do and my oldest daughter is angry over it, too, and in environmental studies.... I won't be here, I suppose, but its so sad. Why? Where are you going? We're talking about less than twenty years, m'man. You'll still be here.", 
        "reply": " No, probably not and not all that interested to be... make room for the next generation or two, my ultimate contribution to saving the planet. I'll be 85 then.... live long and suffer? Hopefully what's left of me will be ashes on top of the Continental Divide in the Rockies of Montana and a fine layer of mud on the bottom of the Puget Sound!", 
        "threadID": "1270031990001_4690065222001", 
        "time": "2009-05-06 22:14:00", 
        "title": "Population", 
        "userID": "reducetension"
    }
]