[
    {
        "content": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 06:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:32:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "TAH407"
    }, 
    {
        "content": "Which values?", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "", 
        "reply": "Which values?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:57:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do. I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do.", 
        "reply": " I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "reply": " So... how much did you get for your possessions?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "", 
        "reply": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "", 
        "reply": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:44:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "", 
        "reply": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:47:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "slavation", 
        "reply": " Freudian slip?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Just a simple typing error. quote: Originally posted by billbright: quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "Originally posted by billbright: quote: slavation Freudian slip?", 
        "reply": "Just a simple typing error. ", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:59:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 19:08:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 20:55:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "", 
        "reply": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 03:25:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "intTime": 20090417, 
        "postID": 16, 
        "quote": "Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "reply": " And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 05:41:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "", 
        "reply": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:42:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "intTime": 20090417, 
        "postID": 18, 
        "quote": "Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor.", 
        "reply": " *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:49:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "", 
        "reply": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 08:03:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "intTime": 20090417, 
        "postID": 20, 
        "quote": "", 
        "reply": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 21:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Blacksheep-23"
    }, 
    {
        "content": "quote: Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12). \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "intTime": 20090418, 
        "postID": 21, 
        "quote": "Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "reply": " \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-18 21:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "intTime": 20090419, 
        "postID": 22, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "reply": " Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 19:14:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon - \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "intTime": 20090419, 
        "postID": 23, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "reply": " \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 20:10:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "intTime": 20090502, 
        "postID": 24, 
        "quote": "Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "reply": " Amen, Amen, Amen", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-02 23:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "all4truth"
    }, 
    {
        "content": "quote: Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "intTime": 20090503, 
        "postID": 25, 
        "quote": "Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "reply": " To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-03 11:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "intTime": 20090509, 
        "postID": 26, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:51:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "intTime": 20090509, 
        "postID": 27, 
        "quote": "", 
        "reply": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:52:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "intTime": 20090513, 
        "postID": 28, 
        "quote": "", 
        "reply": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:16:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "witko1"
    }, 
    {
        "content": "quote: Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life. Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "intTime": 20090513, 
        "postID": 29, 
        "quote": "Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "reply": " Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:28:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "intTime": 20090513, 
        "postID": 30, 
        "quote": "", 
        "reply": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 19:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "intTime": 20090416, 
        "postID": 31, 
        "quote": "", 
        "reply": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 06:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "intTime": 20090416, 
        "postID": 32, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:32:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "TAH407"
    }, 
    {
        "content": "Which values?", 
        "intTime": 20090416, 
        "postID": 33, 
        "quote": "", 
        "reply": "Which values?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:57:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do. I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "intTime": 20090416, 
        "postID": 34, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do.", 
        "reply": " I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "intTime": 20090416, 
        "postID": 35, 
        "quote": "Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "reply": " So... how much did you get for your possessions?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "intTime": 20090416, 
        "postID": 36, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "intTime": 20090416, 
        "postID": 37, 
        "quote": "", 
        "reply": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "intTime": 20090416, 
        "postID": 38, 
        "quote": "", 
        "reply": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "intTime": 20090416, 
        "postID": 39, 
        "quote": "", 
        "reply": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:44:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "intTime": 20090416, 
        "postID": 40, 
        "quote": "", 
        "reply": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:47:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 41, 
        "quote": "slavation", 
        "reply": " Freudian slip?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Just a simple typing error. quote: Originally posted by billbright: quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 42, 
        "quote": "Originally posted by billbright: quote: slavation Freudian slip?", 
        "reply": "Just a simple typing error. ", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:59:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "intTime": 20090416, 
        "postID": 43, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 19:08:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "intTime": 20090416, 
        "postID": 44, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 20:55:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "intTime": 20090417, 
        "postID": 45, 
        "quote": "", 
        "reply": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 03:25:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "intTime": 20090417, 
        "postID": 46, 
        "quote": "Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "reply": " And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 05:41:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "intTime": 20090417, 
        "postID": 47, 
        "quote": "", 
        "reply": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:42:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "intTime": 20090417, 
        "postID": 48, 
        "quote": "Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor.", 
        "reply": " *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:49:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "intTime": 20090417, 
        "postID": 49, 
        "quote": "", 
        "reply": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 08:03:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "intTime": 20090417, 
        "postID": 50, 
        "quote": "", 
        "reply": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 21:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Blacksheep-23"
    }, 
    {
        "content": "quote: Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12). \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "intTime": 20090418, 
        "postID": 51, 
        "quote": "Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "reply": " \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-18 21:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "intTime": 20090419, 
        "postID": 52, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "reply": " Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 19:14:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon - \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "intTime": 20090419, 
        "postID": 53, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "reply": " \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 20:10:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "intTime": 20090502, 
        "postID": 54, 
        "quote": "Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "reply": " Amen, Amen, Amen", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-02 23:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "all4truth"
    }, 
    {
        "content": "quote: Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "intTime": 20090503, 
        "postID": 55, 
        "quote": "Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "reply": " To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-03 11:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "intTime": 20090509, 
        "postID": 56, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:51:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "intTime": 20090509, 
        "postID": 57, 
        "quote": "", 
        "reply": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:52:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "intTime": 20090513, 
        "postID": 58, 
        "quote": "", 
        "reply": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:16:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "witko1"
    }, 
    {
        "content": "quote: Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life. Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "intTime": 20090513, 
        "postID": 59, 
        "quote": "Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "reply": " Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:28:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "intTime": 20090513, 
        "postID": 60, 
        "quote": "", 
        "reply": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 19:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "intTime": 20090416, 
        "postID": 61, 
        "quote": "", 
        "reply": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 06:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "intTime": 20090416, 
        "postID": 62, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:32:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "TAH407"
    }, 
    {
        "content": "Which values?", 
        "intTime": 20090416, 
        "postID": 63, 
        "quote": "", 
        "reply": "Which values?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:57:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do. I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "intTime": 20090416, 
        "postID": 64, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do.", 
        "reply": " I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "intTime": 20090416, 
        "postID": 65, 
        "quote": "Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "reply": " So... how much did you get for your possessions?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "intTime": 20090416, 
        "postID": 66, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "intTime": 20090416, 
        "postID": 67, 
        "quote": "", 
        "reply": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "intTime": 20090416, 
        "postID": 68, 
        "quote": "", 
        "reply": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "intTime": 20090416, 
        "postID": 69, 
        "quote": "", 
        "reply": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:44:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "intTime": 20090416, 
        "postID": 70, 
        "quote": "", 
        "reply": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:47:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 71, 
        "quote": "slavation", 
        "reply": " Freudian slip?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Just a simple typing error. quote: Originally posted by billbright: quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 72, 
        "quote": "Originally posted by billbright: quote: slavation Freudian slip?", 
        "reply": "Just a simple typing error. ", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:59:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "intTime": 20090416, 
        "postID": 73, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 19:08:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "intTime": 20090416, 
        "postID": 74, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 20:55:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "intTime": 20090417, 
        "postID": 75, 
        "quote": "", 
        "reply": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 03:25:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "intTime": 20090417, 
        "postID": 76, 
        "quote": "Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "reply": " And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 05:41:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "intTime": 20090417, 
        "postID": 77, 
        "quote": "", 
        "reply": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:42:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "intTime": 20090417, 
        "postID": 78, 
        "quote": "Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor.", 
        "reply": " *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:49:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "intTime": 20090417, 
        "postID": 79, 
        "quote": "", 
        "reply": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 08:03:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "intTime": 20090417, 
        "postID": 80, 
        "quote": "", 
        "reply": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 21:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Blacksheep-23"
    }, 
    {
        "content": "quote: Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12). \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "intTime": 20090418, 
        "postID": 81, 
        "quote": "Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "reply": " \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-18 21:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "intTime": 20090419, 
        "postID": 82, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "reply": " Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 19:14:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon - \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "intTime": 20090419, 
        "postID": 83, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "reply": " \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 20:10:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "intTime": 20090502, 
        "postID": 84, 
        "quote": "Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "reply": " Amen, Amen, Amen", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-02 23:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "all4truth"
    }, 
    {
        "content": "quote: Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "intTime": 20090503, 
        "postID": 85, 
        "quote": "Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "reply": " To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-03 11:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "intTime": 20090509, 
        "postID": 86, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:51:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "intTime": 20090509, 
        "postID": 87, 
        "quote": "", 
        "reply": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:52:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "intTime": 20090513, 
        "postID": 88, 
        "quote": "", 
        "reply": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:16:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "witko1"
    }, 
    {
        "content": "quote: Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life. Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "intTime": 20090513, 
        "postID": 89, 
        "quote": "Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "reply": " Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:28:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "intTime": 20090513, 
        "postID": 90, 
        "quote": "", 
        "reply": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 19:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "intTime": 20090416, 
        "postID": 91, 
        "quote": "", 
        "reply": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 06:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "intTime": 20090416, 
        "postID": 92, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:32:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "TAH407"
    }, 
    {
        "content": "Which values?", 
        "intTime": 20090416, 
        "postID": 93, 
        "quote": "", 
        "reply": "Which values?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:57:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do. I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "intTime": 20090416, 
        "postID": 94, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do.", 
        "reply": " I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "intTime": 20090416, 
        "postID": 95, 
        "quote": "Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "reply": " So... how much did you get for your possessions?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "intTime": 20090416, 
        "postID": 96, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "intTime": 20090416, 
        "postID": 97, 
        "quote": "", 
        "reply": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "intTime": 20090416, 
        "postID": 98, 
        "quote": "", 
        "reply": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "intTime": 20090416, 
        "postID": 99, 
        "quote": "", 
        "reply": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:44:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "intTime": 20090416, 
        "postID": 100, 
        "quote": "", 
        "reply": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:47:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 101, 
        "quote": "slavation", 
        "reply": " Freudian slip?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Just a simple typing error. quote: Originally posted by billbright: quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 102, 
        "quote": "Originally posted by billbright: quote: slavation Freudian slip?", 
        "reply": "Just a simple typing error. ", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:59:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "intTime": 20090416, 
        "postID": 103, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 19:08:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "intTime": 20090416, 
        "postID": 104, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 20:55:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "intTime": 20090417, 
        "postID": 105, 
        "quote": "", 
        "reply": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 03:25:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "intTime": 20090417, 
        "postID": 106, 
        "quote": "Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "reply": " And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 05:41:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "intTime": 20090417, 
        "postID": 107, 
        "quote": "", 
        "reply": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:42:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "intTime": 20090417, 
        "postID": 108, 
        "quote": "Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor.", 
        "reply": " *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:49:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "intTime": 20090417, 
        "postID": 109, 
        "quote": "", 
        "reply": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 08:03:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "intTime": 20090417, 
        "postID": 110, 
        "quote": "", 
        "reply": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 21:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Blacksheep-23"
    }, 
    {
        "content": "quote: Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12). \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "intTime": 20090418, 
        "postID": 111, 
        "quote": "Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "reply": " \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-18 21:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "intTime": 20090419, 
        "postID": 112, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "reply": " Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 19:14:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon - \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "intTime": 20090419, 
        "postID": 113, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "reply": " \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 20:10:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "intTime": 20090502, 
        "postID": 114, 
        "quote": "Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "reply": " Amen, Amen, Amen", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-02 23:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "all4truth"
    }, 
    {
        "content": "quote: Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "intTime": 20090503, 
        "postID": 115, 
        "quote": "Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "reply": " To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-03 11:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "intTime": 20090509, 
        "postID": 116, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:51:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "intTime": 20090509, 
        "postID": 117, 
        "quote": "", 
        "reply": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:52:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "intTime": 20090513, 
        "postID": 118, 
        "quote": "", 
        "reply": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:16:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "witko1"
    }, 
    {
        "content": "quote: Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life. Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "intTime": 20090513, 
        "postID": 119, 
        "quote": "Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "reply": " Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:28:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "intTime": 20090513, 
        "postID": 120, 
        "quote": "", 
        "reply": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 19:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "intTime": 20090416, 
        "postID": 121, 
        "quote": "", 
        "reply": "I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 06:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "intTime": 20090416, 
        "postID": 122, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " Character and the memory of who you represent. You have the ability in everything you do in action and word to show His love. I use a very strong Pastor group I meet with twice a week to stay re-charged in what I do. We have 3-70+ year old retired Rev's, 3-40+ year old active Ministers, and 4-30 & 40+ yr old active Chaplains, DOD-Fire & Police-VA-Hospice, as regular attendee's. We share our problems and counsel among ourselves. I find this helps me beyond words. I, like you, find myself in difficult situations during the week among people who honestly do not care about anything, except maybe immediate gratification. I remember who I am, and try to help when they'll listen. I finally have reached the age that I don't need to fit in. I am not willing to jeapordize my standing, beliefs, and character. I do the best I can to be Spirit led in all I do, and help others regardless of their beliefs, life styles or stature. At times I too, find this extremely difficult. Nobody ever said it would be easy, but it does show that it cost those before us, everything! The reward as promised, is later... Hope that helps some... CJ PS... If you believe in Christ you are a Saint. Saint means believer in Christ.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:32:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "TAH407"
    }, 
    {
        "content": "Which values?", 
        "intTime": 20090416, 
        "postID": 123, 
        "quote": "", 
        "reply": "Which values?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 07:57:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do. I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "intTime": 20090416, 
        "postID": 124, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are around people that don't care what they do.", 
        "reply": " I try, as best as it is humanly possible, to follow the teachings of Jesus Christ as recorded in Matthew, Mark, Luke and John. Those teachings are the only \"Christian values\" you need to follow, in my opinion as a Christian. The hardest time I have following Christian values are when I am around people whose \"Christian values\" include large amounts of dogma and doctrine not based on the teachings of Jesus Christ (i.e. You must always vote for the Republican candidate; you must discriminate against gays, women or non-Caucasians; you must never question any statements made by Popes, televangelists (Pat Robertson), dentists masquarading as historians (David Barton) or child psychologists (James Dobson); you must believe that the United States is, was and always will be an evangelical, fundamentalist, Protestant \"Christian nation\" and you must work to codify that belief into civil and criminal law, you must hate all Muslims, etc.). It isn't easy to practice Christian values - especially when around \"Christians\" Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "intTime": 20090416, 
        "postID": 125, 
        "quote": "Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.”", 
        "reply": " So... how much did you get for your possessions?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 08:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "intTime": 20090416, 
        "postID": 126, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I didn't keep a record. I keep enough to keep me healthy, warm, dry, fed, happy - and I find good use for the rest.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "intTime": 20090416, 
        "postID": 127, 
        "quote": "", 
        "reply": "Maine dog; What is hard, is not keeping your Christian morals. It is keeping your perspective about those morals. At first we see others doing things that we know are wrong or perhaps even self destructive, but also know that to voice our opinion would be futile or destructive, to all concerned. After a while we begin to feel \"what's the point? Everybody else is doing it why shouldn't I?\" That IS the POINT!! We know better!! It ain't easy, but then again, nobody ever said it was!! It's hard to perhaps remember a youth when we tried things that felt great, but hurt us in some small way, or even a great deal....or hurt someone we cared about a great deal. And not want to feel \"good\"again. But, was it really \"good\" that we felt?? Maybe destroyed a relationship. Or in the case of all the friends I had as I has growing up, killed them one after another. By the time I was 41 they were ALL dead. My wife's sister died at 48 in Jan 2007 from meth addiction and you and so many others can look back and see many of the same examples. So when we are trying to keep to the straight and narrow it's hard enough to stick it out, don't feel bad you sometimes wonder why you do. We all get a little shaky now and then, but then we just soldier on as best we can, one step at a time. When we fall on our faces, or azzes, well, we pick our selves up, dust ourselves off or if we're REALLY lucky, somebody who loves us dusts us off and shoves our sorry selves out the door to try again......we gotta keep tryin' big guy. Just remember, when it's all done, it's a WIN if you got up one more time than you fell down!!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }, 
    {
        "content": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "intTime": 20090416, 
        "postID": 128, 
        "quote": "", 
        "reply": "THE CONSTANT BATTLE Repay to Ceasar what is Ceasars'. Give to God what is Gods'. This constant battle in following the Laws Of God and the laws of man. Love The Lord your God with all your heart,mind and soul. Love your neighbor as yourself. Put on the Armour of God. Gain strength from The Family Of God. Walk amongst all people. Survive the battle!!! Resist temptation when you can. Fight it when you must. Pray , pray, pray, along the way. Yet still we all fall short. Pick up again your cross. Pray, pray, pray. Confess your sins, ask for forgiveness and strength. Pick up again your cross. Keep on walking in Spirit with the Love Of God as your guide. We are weak, some weaker. We are strong, some stronger. Pray, pray, pray. Pick up your cross and carry on. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:29:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "intTime": 20090416, 
        "postID": 129, 
        "quote": "", 
        "reply": "I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:44:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "intTime": 20090416, 
        "postID": 130, 
        "quote": "", 
        "reply": "This is a good thread...nice to be chatting with you guys again. Bless you all - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:47:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 131, 
        "quote": "slavation", 
        "reply": " Freudian slip?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Just a simple typing error. quote: Originally posted by billbright: quote: slavation Freudian slip?", 
        "intTime": 20090416, 
        "postID": 132, 
        "quote": "Originally posted by billbright: quote: slavation Freudian slip?", 
        "reply": "Just a simple typing error. ", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 09:59:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mlowrey"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "intTime": 20090416, 
        "postID": 133, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 19:08:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions? I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "intTime": 20090416, 
        "postID": 134, 
        "quote": "Originally posted by billbright: quote: Originally posted by Fightdirector: Just concentrate on his teachings, such as these from Matthew: Chapter 19 Verses 17-19 quote: \"But if you want to enter into life, keep the commandments.\" He said to Him, “Which ones?” Jesus said, “You shall not murder, You shall not commit adultery, You shall not steal, You shall not bear false witness, Honor your father and your mother, and, you shall love your neighbor as yourself.” So... how much did you get for your possessions?", 
        "reply": " I have to admit bill, you could test a saint. I'm not one, just one that was called to god to do his work.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-16 20:55:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "intTime": 20090417, 
        "postID": 135, 
        "quote": "", 
        "reply": "religious, atheist, rich, poor, whatever you are, Your values(or how well you practice them) should not be dependent on those around you. If they can't respect what you believe or don't respect what you feel like you should/shouldn't do, then its time to stay away from those people.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 03:25:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "intTime": 20090417, 
        "postID": 136, 
        "quote": "Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ!", 
        "reply": " And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 05:41:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "intTime": 20090417, 
        "postID": 137, 
        "quote": "", 
        "reply": "As a retired Catholic, I do what I please, knowing that when the time comes, I can just confess all on my deathbed, receive absolution and make it to heaven while all the pious-living hypocrites struggle through purgatory. When God gives you lemons, you find a new God. Sullivan013 P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. Else, why the chimpanze?", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:42:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor. *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "intTime": 20090417, 
        "postID": 138, 
        "quote": "Originally posted by sullivan013: When God gives you lemons, you find a new God. P.S. Ya'll have GOT to stop taking yourselves and your religion as serious as you do. The big guy has a sense of humor.", 
        "reply": " *grins* Couldn't have said it better myself! Of course God has a sense of humor. I've seen a naked man - now THAT'S funny. Personally, I prefer deities that like a good party, a few rounds of strong mead, a bonfire, some drumming, and the raucous singing and shouting of those who are enjoying life the way it should be enjoyed. Take the Celtic God, Angus. We celebrated his birthday for Yule last year, and he was in quite a mood. The birthday cake had sprinkles, and he pleasantly requested juggling of oranges and other acts of silliness. Fun was had by all. And sprinkles. Lots of sprinkles.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 07:49:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "intTime": 20090417, 
        "postID": 139, 
        "quote": "", 
        "reply": "Patty O'Sullivan. Such a fine Irish name. Me dad used to say we were the O'Brights until the O was dropped. I checked. He was misinformed. But then, I suppose you and I could be an O even so, inasmuch as it probably means \"out of\" or something like that... sort of like calling Leonardo da Vinci by his real name, which would have been Leonardo di ser Piero da Vinci. His father's name was Piero. Vinci is only the place he of his birth. Good to see you on this board.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 08:03:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "intTime": 20090417, 
        "postID": 140, 
        "quote": "", 
        "reply": "Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-17 21:13:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "Blacksheep-23"
    }, 
    {
        "content": "quote: Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12). \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "intTime": 20090418, 
        "postID": 141, 
        "quote": "Originally posted by Blacksheep-23: Stated, \"...Ya'll have GOT to stop taking yourselves and your religion as serious as you do...\" To make a long story short, I use to log in as Mario72. Those that knew me as Mario72 know of my staunch stand as an Evangelical Fundamentalist that believes in the infallibility of God's holy Scriptures. Yet with that in mind, I believe in, though not scriptural, \"live and let live\" The statement that I quoted at the beginning of this reply reminded me of something that I had read a few years back in ARMOR Magazine and would like to share with \"Ya'll\" \"The test of a good religion is whether you can joke about it.\" - G.K. Chesterton Of the above quote by Chesterton, ARMOR Magazine went on to state, \"Chesterton supplies an excellent touchstone, a telling one. An institution, organization, or person that cannot tolerate humor, or lacks a sense of humor, is often revealed as insecure or unsure.\" As for me, \"...I know whom I have believed...\" (II Tim. 1:12).", 
        "reply": " \"The test of a good religion is.... Oh, yeah... there isn't any such thing.\" - Bill Bright (The real, living Bill Bright)", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-18 21:23:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "intTime": 20090419, 
        "postID": 142, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation.", 
        "reply": " Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 19:14:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon - \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "intTime": 20090419, 
        "postID": 143, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by Whirled_Peas: quote: Originally posted by mlowrey: I'm a poor miserable sinner. I sin against God in thought word and deed everyday. My best works are as filthy rags to Him. If any part of my salvation is depended on anything I might do, then I am hopelessly and helplessly lost. All I can do is bleed and die. I rely soley on Christ's compassion and forgiveness....., for only through Him do I have life...., My hope and my slavation comes from no other than Christ! And this is supposed to somehow be good? Dang, I would NOT want to live a life with such negative fixations. \"I'm a poor miserable sinner\"? How cheerful. Lovely affirmation. Yes, I was referring to all the Christian concern and shared expressions along with this one as \"good\". But, I can also see how many of those who misunderstand Christianity would fail to recognize the wisdom in practicing humility. That is what this quote was about after all. Accepting mans role as secondary and submissive to God and recognizing that even the greatest of ours can be the least among His in comparison is a blessing. You know...just as there are those who misunderstand your religion you could benefit from practicing humility in trying to understand Christianity...I believe it will benefit you in many other avenues of lifes journeys. - LegionSon -", 
        "reply": " \"...those who misunderstandfinally came to understand Christianity...\" Fixed it for ya... Man's role on earth is secondary to no one's, least of all a four thousand year old myth's. When you finally realize the lie you've been living, you can begin to concentrate on humanity.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-04-19 20:10:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "intTime": 20090502, 
        "postID": 144, 
        "quote": "Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are....someone worthy of God's love and, hence, my love too.", 
        "reply": " Amen, Amen, Amen", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-02 23:38:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "all4truth"
    }, 
    {
        "content": "quote: Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "intTime": 20090503, 
        "postID": 145, 
        "quote": "Originally posted by all4truth: quote: Originally posted by stillkit: quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I do it by focusing not on what they do, but on who they are ....someone worthy of God's love and, hence, my love too. Amen, Amen, Amen", 
        "reply": " To borrow that segment of the above but on who they are is very Kantian ethics. And as Kant would have emphasized, they are rational and can therefore develop their own moral laws. Values established without a god dictate are even more valuable than the god dictate! Long live the secular humanist revolution!", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-03 11:01:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do. I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "intTime": 20090509, 
        "postID": 146, 
        "quote": "Originally posted by mainedawg: I'm a Godly man, but I'm no saint. I try hard to follow the bible in a way that is fitting for our times, but I'm still falling short of the values I know I should follow. Can any of you tell me how you keep your Christian values when you are a round people that don't care what they do.", 
        "reply": " I heard this a few years ago and it has helped ‘along the way’ Jesus’ best buds were Christians!! Yea, he would hang-out with non-Christians, but the guys closest to Him (Peter, James & John) were believers. choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:51:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "intTime": 20090509, 
        "postID": 147, 
        "quote": "", 
        "reply": "Here’s another: Romans 12:2 And do not be conformed of this world, but BE TRANSFORMED by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God. + + + In other words: Garbage in ~ garbage out! choose joy each day", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-09 04:52:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "MissU2"
    }, 
    {
        "content": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "intTime": 20090513, 
        "postID": 148, 
        "quote": "", 
        "reply": "Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:16:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "witko1"
    }, 
    {
        "content": "quote: Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life. Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "intTime": 20090513, 
        "postID": 149, 
        "quote": "Originally posted by witko1: Being an Atheist, I try to focus on what is good for society and my fellow man. If I run to catch stray grocery cart before it can smash into someone's car, I don't do so because some \"god\" would expect me to. I do so because it's the right thing to do, and I would like anyone else to do the same for me. The thing is, according to the posts in this forum, most Americans are religious, and claim to be christians. So that means that cart I stopped before it could damage a stranger's car was probably left by someone who professes to be a christian. Someone who had absolutely no regard for, or who was at least indifferent to his fellow man. If, as claimed in these forums, most of my fellow Americans are religious, that means the guy who cuts me off in traffic, the woman who throws her trash on the ground, the people who speak foul language without regard to who is around to hear them, the ones who cheat on their taxes, or drive while drunk, who abuse their children, or cheat on their spouses...most of these are religious people and quite possibly christians. If they consider that behavior appropriate for followers of a religious faith, I'd like them all to give it up! (It is interesting, though, to be cut off in traffic by a car bearing the JESUS in a fish emblem.) So, instead of worrying about whether you are living your life in accordance with your beliefs, live your life as a responsible member of society...because it is the right thing to do. When you think about it, the \"ten commandments\" are the kind of rules that any society would have to follow in order to survive and thrive. The golden rule, \"do unto others as you would have them do unto you\", is an excellent philosophy for anyone to live by, regardless of whether or not you believe in a supreme being. It would mean that at work, everyone would give the kind of service they would like to have for themselves. It would mean your neighbor would grab your trash can before it rolled into the street simply because he'd like you to do the same for him. It would mean the kid across the street would run over to help your wife carry in the groceries, simply because she could use a hand. And wouldn't it be a better world if everyone focused on what was necessary for a good community, rather than on what things might win them a place in heaven after they died? I don't worry much about what happens when I die. But I really hope that people I interacted with remember me with fondness, and to perhaps feel that in some small way, I made a difference in their life.", 
        "reply": " Good post witkol, I agree with your percentages. And you sound like a great person. You sound a lot like Jesus witko1 I will do as you say and remember you with fondness. And I pray that you have made perhaps that small \"difference in their life\" as you have made in mine. - LegionSon -", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 11:28:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "LegionSon"
    }, 
    {
        "content": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "intTime": 20090513, 
        "postID": 150, 
        "quote": "", 
        "reply": "You might want to watch out Witko....you're starting to sound like a nice person!! T", 
        "threadID": "1270031990001_7710009022001", 
        "time": "2009-05-13 19:54:00", 
        "title": "What kind of a Christian are you?", 
        "userID": "tawodi"
    }
]