[
    {
        "content": "Obama's new budget terminates the two major federal funding streams for abstinence-only-until-marriage programs. Ineffective sex-ed programs that promote a specific religious ideology instead of accurate medical information will no longer be funded.", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "Obama's new budget terminates the two major federal funding streams for abstinence-only-until-marriage programs. Ineffective sex-ed programs that promote a specific religious ideology instead of accurate medical information will no longer be funded.", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 08:27:00", 
        "title": "Abstinance Only", 
        "userID": "billbright"
    }, 
    {
        "content": "You know, I wish there was a way to go back and correct headlines spelling mistakes....", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "", 
        "reply": "You know, I wish there was a way to go back and correct headlines spelling mistakes....", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 08:28:00", 
        "title": "Abstinance Only", 
        "userID": "billbright"
    }, 
    {
        "content": "Tha's O.K. Bill we know what cha meant!! Abstinence make the heart grow fonder!! Right??", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "", 
        "reply": "Tha's O.K. Bill we know what cha meant!! Abstinence make the heart grow fonder!! Right??", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 09:08:00", 
        "title": "Abstinance Only", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Tha's O.K. Bill we know what cha meant!! Abstinence make the heart grow fonder!! Right?? Very funny, T! Now you will burn for that one!", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "Originally posted by tawodi: Tha's O.K. Bill we know what cha meant!! Abstinence make the heart grow fonder!! Right??", 
        "reply": " Very funny, T! Now you will burn for that one!", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 10:41:00", 
        "title": "Abstinance Only", 
        "userID": "reducetension"
    }, 
    {
        "content": "I'm fine if parents, churches, or other groups want to promote \"abstinence-only\" sex-ed. It's a lovely IDEAL. But as we know, it's not an effective sex-ed principle, because PEOPLE HAVE SEX. Abstinence-only sex-ed is simple a WASTE OF MONEY, and I'm glad to know that they'll stop WASTING MY TAX DOLLARS on ineffective programs. \"Don't have sex.\" Why do you need money to say that? It just doesn't need funding! Our government wastes enough money; we don't need to waste it on an ineffective lesson plan.", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm fine if parents, churches, or other groups want to promote \"abstinence-only\" sex-ed. It's a lovely IDEAL. But as we know, it's not an effective sex-ed principle, because PEOPLE HAVE SEX. Abstinence-only sex-ed is simple a WASTE OF MONEY, and I'm glad to know that they'll stop WASTING MY TAX DOLLARS on ineffective programs. \"Don't have sex.\" Why do you need money to say that? It just doesn't need funding! Our government wastes enough money; we don't need to waste it on an ineffective lesson plan.", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 11:08:00", 
        "title": "Abstinance Only", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Tha's O.K. Bill we know what cha meant!! Abstinence make the heart grow fonder!! Right?? Or, as Oscar Wilde said, \"Absinthe makes the tart grow fonder.\"", 
        "intTime": 20090511, 
        "postID": 6, 
        "quote": "Originally posted by tawodi: Tha's O.K. Bill we know what cha meant!! Abstinence make the heart grow fonder!! Right??", 
        "reply": " Or, as Oscar Wilde said, \"Absinthe makes the tart grow fonder.\"", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 12:06:00", 
        "title": "Abstinance Only", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: I'm fine if parents, churches, or other groups want to promote \"abstinence-only\" sex-ed. It's a lovely IDEAL. But as we know, it's not an effective sex-ed principle, because PEOPLE HAVE SEX. Abstinence-only sex-ed is simple a WASTE OF MONEY, and I'm glad to know that they'll stop WASTING MY TAX DOLLARS on ineffective programs. \"Don't have sex.\" Why do you need money to say that? It just doesn't need funding! Our government wastes enough money; we don't need to waste it on an ineffective lesson plan. They can push this all they want in their churches and in public venues, on their own dime if they have that kind of money to waste. Just don't waste my tax dollars on ineffective and unrealistic programs like this. Studies are showing that kids who have taken that silly chastity pledge are getting STDs at a higher rate than kids who haven't taken it!", 
        "intTime": 20090511, 
        "postID": 7, 
        "quote": "Originally posted by Whirled_Peas: I'm fine if parents, churches, or other groups want to promote \"abstinence-only\" sex-ed. It's a lovely IDEAL. But as we know, it's not an effective sex-ed principle, because PEOPLE HAVE SEX. Abstinence-only sex-ed is simple a WASTE OF MONEY, and I'm glad to know that they'll stop WASTING MY TAX DOLLARS on ineffective programs. \"Don't have sex.\" Why do you need money to say that? It just doesn't need funding! Our government wastes enough money; we don't need to waste it on an ineffective lesson plan.", 
        "reply": " They can push this all they want in their churches and in public venues, on their own dime if they have that kind of money to waste. Just don't waste my tax dollars on ineffective and unrealistic programs like this. Studies are showing that kids who have taken that silly chastity pledge are getting STDs at a higher rate than kids who haven't taken it!", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 12:17:00", 
        "title": "Abstinance Only", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "THe old joke: What do you call a woman that practices abstinence only birth control? MOM", 
        "intTime": 20090511, 
        "postID": 8, 
        "quote": "", 
        "reply": "THe old joke: What do you call a woman that practices abstinence only birth control? MOM", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 13:15:00", 
        "title": "Abstinance Only", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Tha's O.K. Bill we know what cha meant!! Abstinence make the heart grow fonder!! Right?? Old joke: A man cuts one, and it sounds like \"Honda!\" WTF? says a nearby observer. \"I've been drinking an old Czechoslavakian drink that contains absinthe,\" says the man. \"Absinthe makes the fart go Honda.\" [Old Czech absinthe recipe: Pour a shot of Absinthe in a small tumbler. Take a teaspoon of sugar. Dip the teaspoon into the absinthe so that the sugar absorbs the liquor. Then, holding the spoon above the absinthe, set fire to the sugar. Let it burn for a minute or so. The sugar will bubble and begin to caramelize. Once the flame is beginning to die down, stir the shot of absinthe with the sugared spoon (smothering the glass if it catches afire). Now add an equal measure of water and some ice.]", 
        "intTime": 20090511, 
        "postID": 9, 
        "quote": "Originally posted by tawodi: Tha's O.K. Bill we know what cha meant!! Abstinence make the heart grow fonder!! Right??", 
        "reply": " Old joke: A man cuts one, and it sounds like \"Honda!\" WTF? says a nearby observer. \"I've been drinking an old Czechoslavakian drink that contains absinthe,\" says the man. \"Absinthe makes the fart go Honda.\" [Old Czech absinthe recipe: Pour a shot of Absinthe in a small tumbler. Take a teaspoon of sugar. Dip the teaspoon into the absinthe so that the sugar absorbs the liquor. Then, holding the spoon above the absinthe, set fire to the sugar. Let it burn for a minute or so. The sugar will bubble and begin to caramelize. Once the flame is beginning to die down, stir the shot of absinthe with the sugared spoon (smothering the glass if it catches afire). Now add an equal measure of water and some ice.]", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-11 13:17:00", 
        "title": "Abstinance Only", 
        "userID": "billbright"
    }, 
    {
        "content": "I've done the same with rum and a dash of lemon to make Rum toddies!! I love absinth I'm gonna try this, of course with a \"little nip\" not a whole bottle!! Must maintain the decorum....at all costs!!", 
        "intTime": 20090512, 
        "postID": 10, 
        "quote": "", 
        "reply": "I've done the same with rum and a dash of lemon to make Rum toddies!! I love absinth I'm gonna try this, of course with a \"little nip\" not a whole bottle!! Must maintain the decorum....at all costs!!", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-12 10:26:00", 
        "title": "Abstinance Only", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: I've done the same with rum and a dash of lemon to make Rum toddies!! I love absinth I'm gonna try this, of course with a \"little nip\" not a whole bottle!! Must maintain the decorum....at all costs!! Moderation is alright if you get enough of it, T.", 
        "intTime": 20090512, 
        "postID": 11, 
        "quote": "Originally posted by tawodi: I've done the same with rum and a dash of lemon to make Rum toddies!! I love absinth I'm gonna try this, of course with a \"little nip\" not a whole bottle!! Must maintain the decorum....at all costs!!", 
        "reply": " Moderation is alright if you get enough of it, T.", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-12 11:18:00", 
        "title": "Abstinance Only", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by tawodi: I've done the same with rum and a dash of lemon to make Rum toddies!! I love absinth I'm gonna try this, of course with a \"little nip\" not a whole bottle!! Must maintain the decorum....at all costs!! Moderation is alright if you get enough of it, T. All things in moderation, especially moderation!", 
        "intTime": 20090513, 
        "postID": 12, 
        "quote": "Originally posted by reducetension: quote: Originally posted by tawodi: I've done the same with rum and a dash of lemon to make Rum toddies!! I love absinth I'm gonna try this, of course with a \"little nip\" not a whole bottle!! Must maintain the decorum....at all costs!! Moderation is alright if you get enough of it, T.", 
        "reply": " All things in moderation, especially moderation!", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-13 15:38:00", 
        "title": "Abstinance Only", 
        "userID": "thorin001"
    }, 
    {
        "content": "I didn't have any Absinth but my wife DID have a couple of Sambuca \"nips\" soooo I tried it with one ounce of Buca....OH WOW!!!! That is GOOOOOOD!!!!! Bad Me...........", 
        "intTime": 20090513, 
        "postID": 13, 
        "quote": "", 
        "reply": "I didn't have any Absinth but my wife DID have a couple of Sambuca \"nips\" soooo I tried it with one ounce of Buca....OH WOW!!!! That is GOOOOOOD!!!!! Bad Me...........", 
        "threadID": "1270031990001_5500040322001", 
        "time": "2009-05-13 19:42:00", 
        "title": "Abstinance Only", 
        "userID": "tawodi"
    }
]