[
    {
        "content": "++http://edition.cnn.com/2009/LIVING/05/15/bible.critic/index.html++ I can understand the ability to debunk the NT guess this fella might have done it. D.J.", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "", 
        "reply": "++http://edition.cnn.com/2009/LIVING/05/15/bible.critic/index.html++ I can understand the ability to debunk the NT guess this fella might have done it. D.J.", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-15 16:27:00", 
        "title": "bible debunked???", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: ++http://edition.cnn.com/2009/LIVING/05/15/bible.critic/index.html++ I can understand the ability to debunk the NT guess this fella might have done it. D.J. Sounds like this fella is about to become Ben Noach, We studied for 10 years and finily got out of xtiananity. D.J.", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "Originally posted by donniejanuarysr: ++http://edition.cnn.com/2009/LIVING/05/15/bible.critic/index.html++ I can understand the ability to debunk the NT guess this fella might have done it. D.J.", 
        "reply": " Sounds like this fella is about to become Ben Noach, We studied for 10 years and finily got out of xtiananity. D.J.", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-15 17:15:00", 
        "title": "bible debunked???", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: quote: Originally posted by donniejanuarysr: ++http://edition.cnn.com/2009/LIVING/05/15/bible.critic/index.html++ I can understand the ability to debunk the NT guess this fella might have done it. D.J. Sounds like this fella is about to become Ben Noach, We studied for 10 years and finily got out of xtiananity. D.J. Mazel Tov, I am getting ready for Shabbat, but will read the article after that. Shalom Ixcatl", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "Originally posted by donniejanuarysr: quote: Originally posted by donniejanuarysr: ++http://edition.cnn.com/2009/LIVING/05/15/bible.critic/index.html++ I can understand the ability to debunk the NT guess this fella might have done it. D.J. Sounds like this fella is about to become Ben Noach, We studied for 10 years and finily got out of xtiananity. D.J.", 
        "reply": " Mazel Tov, I am getting ready for Shabbat, but will read the article after that. Shalom Ixcatl", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-15 18:06:00", 
        "title": "bible debunked???", 
        "userID": "ixcatzin"
    }, 
    {
        "content": "Some more interesting reading. think I will order the book. +++http://y-jesus.com/jesuscomplex_1.php?gclid=CJyxke-jwpoCFQgNDQodvRbdsw+++++ D.J.", 
        "intTime": 20090516, 
        "postID": 4, 
        "quote": "", 
        "reply": "Some more interesting reading. think I will order the book. +++http://y-jesus.com/jesuscomplex_1.php?gclid=CJyxke-jwpoCFQgNDQodvRbdsw+++++ D.J.", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-16 19:18:00", 
        "title": "bible debunked???", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "I read this guy's first book, it seems like eons ago now but still think now what I did then. The best way to put it is like this; \"Snoring is linked to sleep, study says!\" Well, not always!! I can make snoring noises right now and I'm wide awake!! After reading things like this and not quite fifty years of study let's put it this way. Everything has been written about religion, for everyone out there and each can prove beyond a shadow of a doubt....... they're RIGHT!! O.K. works for me!! T This message has been edited. Last edited by: tawodi, Sun 17 May 2009 11:10 AM", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "", 
        "reply": "I read this guy's first book, it seems like eons ago now but still think now what I did then. The best way to put it is like this; \"Snoring is linked to sleep, study says!\" Well, not always!! I can make snoring noises right now and I'm wide awake!! After reading things like this and not quite fifty years of study let's put it this way. Everything has been written about religion, for everyone out there and each can prove beyond a shadow of a doubt....... they're RIGHT!! O.K. works for me!! T This message has been edited. Last edited by: tawodi, Sun 17 May 2009 11:10 AM", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-16 20:01:00", 
        "title": "bible debunked???", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: I read this guy's first book, it seems like eons ago now but still think now what I did then. The best way to put it is like this; \"Snoring is linked to sleep, study says!\" I understand I have this same problem reading some posts on here that attempt to be wayyyyy one sided. Well, not always!! I can make snoring noises right now and I'm wide awake!! After reading things like this and not quite fifty years of atudy let's put it this way. Everything has been written about religion, for everyone out there and each can prove beyond a shadow of a doubt....... they're RIGHT!! O.K. works for me!! T T. I agree there have been alot of books writen on religen and all from different points of view, People are still looking for truths, and other opinions instead of the stories they were told growing up by their preachers, or other religous leaders. I understand this goes against your beliefs but alot of it does fall into what i believe about the subject. D.J.", 
        "intTime": 20090517, 
        "postID": 6, 
        "quote": "Originally posted by tawodi: I read this guy's first book, it seems like eons ago now but still think now what I did then. The best way to put it is like this; \"Snoring is linked to sleep, study says!\" I understand I have this same problem reading some posts on here that attempt to be wayyyyy one sided. Well, not always!! I can make snoring noises right now and I'm wide awake!! After reading things like this and not quite fifty years of atudy let's put it this way. Everything has been written about religion, for everyone out there and each can prove beyond a shadow of a doubt....... they're RIGHT!! O.K. works for me!! T", 
        "reply": " T. I agree there have been alot of books writen on religen and all from different points of view, People are still looking for truths, and other opinions instead of the stories they were told growing up by their preachers, or other religous leaders. I understand this goes against your beliefs but alot of it does fall into what i believe about the subject. D.J.", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-17 09:51:00", 
        "title": "bible debunked???", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "I'm happy for you pal but let me ask you this. Does it make a bit of difference to the atheists on these boards as long as your attacking Christians? ANSWER; Only until you defend your beliefs against them! This is why I will NOT attack you or anyone else's beliefs. And one thing you can depend on. If I chose to, I could tear your or just about anyone else's apart based on their writings and interpretations of just about ANY piece of scripture. One of the things I was trained to do, was just that, defend and then gut like a fish anything written by men, concerning God or scripture. It is one of the very first things taught in seminary, or by your mentors. It is to make sure one understands ALL sides of the issue. It is this type of training that leads one to a firm understanding of the area in which you will function. There is much debate for instance on \"allegory\" isn't there? Well for one like me, or C.J. and others, it is easy to tell the difference. We were trained to recognise which is which!! Got six months, maybe a year?? I can teach you to do it!! My biggest argument with anybody here, is that persons of one religion attack another and some of them are being USED to attack Christians and totally lose it when this is pointed out to them or they themselves are attacked for a point of belief. Whoa man!! You're not supposed to attack me, you're a Christian!! That's out of line!! Where is that \"yellow triangle\" for me to press!?? Who does this clown think he is anyway attacking me for my beliefs!! Are you beggining to understand some of the things I have posted regarding this issue?? Now to post this and then ask for debate on one or more points of the article is fine!! But to use it as a blanket condemnation of an entire faith is wrong. You, by your own admission, do not understand Christianity, or many of it's tennets. So why post what you have added to the text, except to condemn us? Or is it to gain the approval, of some, that you feel you need? Be well........Tawodi", 
        "intTime": 20090517, 
        "postID": 7, 
        "quote": "", 
        "reply": "I'm happy for you pal but let me ask you this. Does it make a bit of difference to the atheists on these boards as long as your attacking Christians? ANSWER; Only until you defend your beliefs against them! This is why I will NOT attack you or anyone else's beliefs. And one thing you can depend on. If I chose to, I could tear your or just about anyone else's apart based on their writings and interpretations of just about ANY piece of scripture. One of the things I was trained to do, was just that, defend and then gut like a fish anything written by men, concerning God or scripture. It is one of the very first things taught in seminary, or by your mentors. It is to make sure one understands ALL sides of the issue. It is this type of training that leads one to a firm understanding of the area in which you will function. There is much debate for instance on \"allegory\" isn't there? Well for one like me, or C.J. and others, it is easy to tell the difference. We were trained to recognise which is which!! Got six months, maybe a year?? I can teach you to do it!! My biggest argument with anybody here, is that persons of one religion attack another and some of them are being USED to attack Christians and totally lose it when this is pointed out to them or they themselves are attacked for a point of belief. Whoa man!! You're not supposed to attack me, you're a Christian!! That's out of line!! Where is that \"yellow triangle\" for me to press!?? Who does this clown think he is anyway attacking me for my beliefs!! Are you beggining to understand some of the things I have posted regarding this issue?? Now to post this and then ask for debate on one or more points of the article is fine!! But to use it as a blanket condemnation of an entire faith is wrong. You, by your own admission, do not understand Christianity, or many of it's tennets. So why post what you have added to the text, except to condemn us? Or is it to gain the approval, of some, that you feel you need? Be well........Tawodi", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-17 11:06:00", 
        "title": "bible debunked???", 
        "userID": "tawodi"
    }, 
    {
        "content": "n emn quote: Originally posted by tawodi: I'm happy for you pal but let me ask you this. Does it make a bit of difference to the atheists on these boards as long as your attacking Christians? I was unaware i was attacking anybody, maybe I miss read this disscussion thread. ANSWER; Only until you defend your beliefs against them! This is why I will NOT attack you or anyone else's beliefs. And one thing you can depend on. If I chose to, I could tear your or just about anyone else's apart based on their writings and interpretations of just about ANY piece of scripture. IMO and no disrespect intended, that would only seem like that to yourself or to somone with like beliefs, I am aware you have spent your life studding your religen and your interpetions and I do respect that. But religous disscussions/debates are never won or torn apart except in the minds of the people debating (and then (both side) have decided they won). because both sides have torn asunder the others thinking (in their own minds)D.J. One of the things I was trained to do, was just that, defend and then gut like a fish anything written by men, concerning God or scripture. It is one of the very first things taught in seminary, or by your mentors. It is to make sure one understands ALL sides of the issue. It is this type of training that leads one to a firm understanding of the area in which you will function. There is much debate for instance on \"allegory\" isn't there? Well for one like me, or C.J. and others, it is easy to tell the difference. We were trained to recognise which is which!! Got six months, maybe a year?? I can teach you to do it!! My biggest argument with anybody here, is that persons of one religion attack another and some of them are being USED to attack Christians and totally lose it when this is pointed out to them or they themselves are attacked for a point of belief. Whoa man!! You're not supposed to attack me, you're a Christian!! That's out of line!! Where is that \"yellow triangle\" for me to press!?? Who does this clown think he is anyway attacking me for my beliefs!! Are you beggining to understand some of the things I have posted regarding this issue?? Now to post this and then ask for debate on one or more points of the article is fine!! But to use it as a blanket condemnation of an entire faith is wrong. You, by your own admission, do not understand Christianity, or many of it's tennets. So why post what you have added to the text, except to condemn us? It is not my position to condemn anybody, I do not know if you have noticed or not but there are alot of one sided posts on religen here, so my posting another side for people to read is considered condemning, If so i am sorry maybe there should be a different disscussion for ALL religens and beliefs in the military. As stated befor I am aware of your education (maybe not all ) but please just because I do not have the papers hanging on the walls dont think I am a totle idiot, My spelling isnt the best and my eye sight isnt the best but I can still decide and I do still learn. No offence intended to you . Or is it to gain the approval, of some, that you feel you need? I need nobodys approval for anything I do anymore then your need for approval. D.J. Be well........Tawodi you too and have a wonderful week D.J.", 
        "intTime": 20090517, 
        "postID": 8, 
        "quote": "Originally posted by tawodi: I'm happy for you pal but let me ask you this. Does it make a bit of difference to the atheists on these boards as long as your attacking Christians? I was unaware i was attacking anybody, maybe I miss read this disscussion thread. ANSWER; Only until you defend your beliefs against them! This is why I will NOT attack you or anyone else's beliefs. And one thing you can depend on. If I chose to, I could tear your or just about anyone else's apart based on their writings and interpretations of just about ANY piece of scripture. IMO and no disrespect intended, that would only seem like that to yourself or to somone with like beliefs, I am aware you have spent your life studding your religen and your interpetions and I do respect that. But religous disscussions/debates are never won or torn apart except in the minds of the people debating (and then (both side) have decided they won). because both sides have torn asunder the others thinking (in their own minds)D.J. One of the things I was trained to do, was just that, defend and then gut like a fish anything written by men, concerning God or scripture. It is one of the very first things taught in seminary, or by your mentors. It is to make sure one understands ALL sides of the issue. It is this type of training that leads one to a firm understanding of the area in which you will function. There is much debate for instance on \"allegory\" isn't there? Well for one like me, or C.J. and others, it is easy to tell the difference. We were trained to recognise which is which!! Got six months, maybe a year?? I can teach you to do it!! My biggest argument with anybody here, is that persons of one religion attack another and some of them are being USED to attack Christians and totally lose it when this is pointed out to them or they themselves are attacked for a point of belief. Whoa man!! You're not supposed to attack me, you're a Christian!! That's out of line!! Where is that \"yellow triangle\" for me to press!?? Who does this clown think he is anyway attacking me for my beliefs!! Are you beggining to understand some of the things I have posted regarding this issue?? Now to post this and then ask for debate on one or more points of the article is fine!! But to use it as a blanket condemnation of an entire faith is wrong. You, by your own admission, do not understand Christianity, or many of it's tennets. So why post what you have added to the text, except to condemn us? It is not my position to condemn anybody, I do not know if you have noticed or not but there are alot of one sided posts on religen here, so my posting another side for people to read is considered condemning, If so i am sorry maybe there should be a different disscussion for ALL religens and beliefs in the military. As stated befor I am aware of your education (maybe not all ) but please just because I do not have the papers hanging on the walls dont think I am a totle idiot, My spelling isnt the best and my eye sight isnt the best but I can still decide and I do still learn. No offence intended to you . Or is it to gain the approval, of some, that you feel you need? I need nobodys approval for anything I do anymore then your need for approval. D.J. Be well........Tawodi", 
        "reply": "n emn  you too and have a wonderful week D.J.", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-17 12:46:00", 
        "title": "bible debunked???", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Hey Bruce... I love you, man... I could feel the passion bridled under control, well done... Persecution, condemnation, etc... all signs to dance in the streets and rejoice... I'm dancing for you, and myself... On another bright note... My Ordination is approved and will be finalized with a non-denominational (my choice) ceremony Sunday after next @ Camp Wesley, Methodist encampment... Because of my work, it appears Clergy from at least 7 different denominations will take part in this as I become an Ordained Reverend. I can't figure out my title though... Rev. Chaplain or Chaplain Rev. My paperwork shows on the Certificate of Ordination as Reverend CJ Lic #... I also received another certificate as Rev. CJ as a fully Certified Chaplain different Lic #... So what's my correct title along traditions... CJ This message has been edited. Last edited by: TAH407, Sun 17 May 2009 01:42 PM", 
        "intTime": 20090517, 
        "postID": 9, 
        "quote": "", 
        "reply": "Hey Bruce... I love you, man... I could feel the passion bridled under control, well done... Persecution, condemnation, etc... all signs to dance in the streets and rejoice... I'm dancing for you, and myself... On another bright note... My Ordination is approved and will be finalized with a non-denominational (my choice) ceremony Sunday after next @ Camp Wesley, Methodist encampment... Because of my work, it appears Clergy from at least 7 different denominations will take part in this as I become an Ordained Reverend. I can't figure out my title though... Rev. Chaplain or Chaplain Rev. My paperwork shows on the Certificate of Ordination as Reverend CJ Lic #... I also received another certificate as Rev. CJ as a fully Certified Chaplain different Lic #... So what's my correct title along traditions... CJ This message has been edited. Last edited by: TAH407, Sun 17 May 2009 01:42 PM", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-17 13:05:00", 
        "title": "bible debunked???", 
        "userID": "TAH407"
    }, 
    {
        "content": "C.J.; You have been blessed my brother!! Would that I could be there to see this!! but it is with mixed emotions that I MUST fail to appear. Carly is being confirmed on the 31rst (Pentacost Sunday) Which if I have my understanding correct is when you will be ordained. Obviously I'm good, but not THAT good, I still can't be in two places at once!! Tell ya what!! I'll send you pictures if you send me some of your special day! I'll consider it an honor if you do. Until then, blessings and more be on you and your family, and especially that wonderful wife of yours, who cares so much for your gifts and that they be given to the world as only you can. And she can understand and see that the world needs. Oh, and title? A true hearted, struggling man of God, just like me! OR!! The Right Reverend C.J. Tillinghast!! TA DA!! Be well dear friend...Bruce", 
        "intTime": 20090517, 
        "postID": 10, 
        "quote": "", 
        "reply": "C.J.; You have been blessed my brother!! Would that I could be there to see this!! but it is with mixed emotions that I MUST fail to appear. Carly is being confirmed on the 31rst (Pentacost Sunday) Which if I have my understanding correct is when you will be ordained. Obviously I'm good, but not THAT good, I still can't be in two places at once!! Tell ya what!! I'll send you pictures if you send me some of your special day! I'll consider it an honor if you do. Until then, blessings and more be on you and your family, and especially that wonderful wife of yours, who cares so much for your gifts and that they be given to the world as only you can. And she can understand and see that the world needs. Oh, and title? A true hearted, struggling man of God, just like me! OR!! The Right Reverend C.J. Tillinghast!! TA DA!! Be well dear friend...Bruce", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-17 20:53:00", 
        "title": "bible debunked???", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: I can understand the ability to debunk the NT guess this fella might have done it. D.J. Donnie I told you I don't have a problem with taking out items and debating them seriatum to get at the meaning to ascertain their validity or not. I also told you what my reservations with your post were, a blanket condemnation of an entire faith system, which your line does. As you can see, I enclosed the quote here for you to see. If I posted a series of articles or even just one stating \"the followers of the Ben Noach line of faith debunked\" and then followed it with the line you did, would you be writing to me to pull my briefs up into the biggest wedgie you could.....or not!!?? Just askin' !! T", 
        "intTime": 20090517, 
        "postID": 11, 
        "quote": "I can understand the ability to debunk the NT guess this fella might have done it. D.J.", 
        "reply": " Donnie I told you I don't have a problem with taking out items and debating them seriatum to get at the meaning to ascertain their validity or not. I also told you what my reservations with your post were, a blanket condemnation of an entire faith system, which your line does. As you can see, I enclosed the quote here for you to see. If I posted a series of articles or even just one stating \"the followers of the Ben Noach line of faith debunked\" and then followed it with the line you did, would you be writing to me to pull my briefs up into the biggest wedgie you could.....or not!!?? Just askin' !! T", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-17 21:00:00", 
        "title": "bible debunked???", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: quote: I can understand the ability to debunk the NT guess this fella might have done it. D.J. Donnie I told you I don't have a problem with taking out items and debating them seriatum to get at the meaning to ascertain their validity or not. I also told you what my reservations with your post were, a blanket condemnation of an entire faith system, which your line does. As you can see, I enclosed the quote here for you to see. If I posted a series of articles or even just one stating \"the followers of the Ben Noach line of faith debunked\" and then followed it with the line you did, would you be writing to me to pull my briefs up into the biggest wedgie you could.....or not!!?? Just askin' !! T after reading and thinking about your question, I can tell you with all honesty, No I dont think i would. I try to listen to people to HEAR what they are saying I try not to precieve. (I'm not perfect but I try to listen)granted there are some stories so far out there that it amazes me. I try to be open minded untill it hits the part that it is impossible to accept. Hope you have a wonderful week D.J.", 
        "intTime": 20090517, 
        "postID": 12, 
        "quote": "Originally posted by tawodi: quote: I can understand the ability to debunk the NT guess this fella might have done it. D.J. Donnie I told you I don't have a problem with taking out items and debating them seriatum to get at the meaning to ascertain their validity or not. I also told you what my reservations with your post were, a blanket condemnation of an entire faith system, which your line does. As you can see, I enclosed the quote here for you to see. If I posted a series of articles or even just one stating \"the followers of the Ben Noach line of faith debunked\" and then followed it with the line you did, would you be writing to me to pull my briefs up into the biggest wedgie you could.....or not!!?? Just askin' !! T", 
        "reply": " after reading and thinking about your question, I can tell you with all honesty, No I dont think i would. I try to listen to people to HEAR what they are saying I try not to precieve. (I'm not perfect but I try to listen)granted there are some stories so far out there that it amazes me. I try to be open minded untill it hits the part that it is impossible to accept. Hope you have a wonderful week D.J.", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-17 21:46:00", 
        "title": "bible debunked???", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Donnie; One final note, and then we can agree to disagree over this issue. I didn't just spend a lifetime studying MY religion. I have spent a life time studying THEM ALL, to one degree or another. This to clarify my own thinking about how OTHERS think and feel. I first came to these boards for instance on Nov. 29 2006, If we could go back, you would see I didn't even know how to start a new paragraph on a computer, because they are slightly different than a typewriter's keyboard. People here taught me how to do that and many other things. I asked many just exactly what their understandings were, based on what I thought they were already, from my delving into them. In almost every case, I found that I was wrong in what I thought!! I also found many things about Christianity that other people have dug up and that I never knew myself. In short, the very first thing I learned is this,. Even with many conversations with Jewish Rabbi's over so many years, they had told me what they thought I could understand, Not what they thought!! People here answered the questions as they saw them. WAKE UP CALL!!!! BACK TO THE BOOKS!!! Every time I would receive an unexpected answer I would study up on it. You can imagine what happened when I touched on Islam!! I didn't know squat!! I thought I did, but I hadn't a frigging CLUE!! And so it goes....Now if I had been combative, how much would I have learned? If I had chosen sides and slandered people's beliefs, how long would I have lasted?? If I had given ONLY my interpretations of what I thought THEY believed and then told them how wrong they were to believe as they did, how far would I have gotten?? Those are the kinds of exchanges that were the norm then and to a degree now, distasteful in the extreme. Remember when you first came here and asked questions? I answered some of them based on what my understanding of the Christian position was and NEVER once told you what to believe, did I? In fact each and every time told you clearly, this was the stance of Christian belief in general and you needn't listen to a word I say didn't I. Do you also remember how much crap I caught for that?? I hope so..... Tawodi", 
        "intTime": 20090518, 
        "postID": 13, 
        "quote": "", 
        "reply": "Donnie; One final note, and then we can agree to disagree over this issue. I didn't just spend a lifetime studying MY religion. I have spent a life time studying THEM ALL, to one degree or another. This to clarify my own thinking about how OTHERS think and feel. I first came to these boards for instance on Nov. 29 2006, If we could go back, you would see I didn't even know how to start a new paragraph on a computer, because they are slightly different than a typewriter's keyboard. People here taught me how to do that and many other things. I asked many just exactly what their understandings were, based on what I thought they were already, from my delving into them. In almost every case, I found that I was wrong in what I thought!! I also found many things about Christianity that other people have dug up and that I never knew myself. In short, the very first thing I learned is this,. Even with many conversations with Jewish Rabbi's over so many years, they had told me what they thought I could understand, Not what they thought!! People here answered the questions as they saw them. WAKE UP CALL!!!! BACK TO THE BOOKS!!! Every time I would receive an unexpected answer I would study up on it. You can imagine what happened when I touched on Islam!! I didn't know squat!! I thought I did, but I hadn't a frigging CLUE!! And so it goes....Now if I had been combative, how much would I have learned? If I had chosen sides and slandered people's beliefs, how long would I have lasted?? If I had given ONLY my interpretations of what I thought THEY believed and then told them how wrong they were to believe as they did, how far would I have gotten?? Those are the kinds of exchanges that were the norm then and to a degree now, distasteful in the extreme. Remember when you first came here and asked questions? I answered some of them based on what my understanding of the Christian position was and NEVER once told you what to believe, did I? In fact each and every time told you clearly, this was the stance of Christian belief in general and you needn't listen to a word I say didn't I. Do you also remember how much crap I caught for that?? I hope so..... Tawodi", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-18 03:21:00", 
        "title": "bible debunked???", 
        "userID": "tawodi"
    }, 
    {
        "content": "Thanks Bruce... Congratulations on Carly, it will be a big weekend indeed! Yes, I'll send pic's, so you can see this pure hearted abnormal collection of mis-fits and non-compliant traditionalist welcome me to this position among them. Knowing this group, it's liable to be more a roast than an Ordination... I could'nt imagine being in better company, you would definitely fit in !!! The story they continue to tell: During an extremely rough call, I was consoling an elderly couple on the loss of their home. As I was reaching into my bunker jacket pocket trying to find the cards I keep with Salvation Army & Red Cross numbers for quick access a young firefighter came beside me reaching in his jacket for a card to help me. (I make sure all have some in their gear incase I become incapacitated during a call). As he withdrew his hand a thin like towel came out. As he tried to act normal infront of the couple, he slowly unfolded this thing to discover an extremely large pair of white womens underwear, like size 300! As he was holding them dumbfounded, with this look of scared amazement on his face, a melted unwrapped chocolate candy-bar resembling you know what, slowly slid off onto the ground. I could'nt control myself and burst into laughter that brought tears to my eyes and sent me to my knees. The couple stunned, thank God, began to laugh as they realized the situation. They did ask what church I was part of, I think to make sure they steered clear!!! Our Chief on the other hand was fit to be tied, Go figure... Your crap catching comment to Donnie made me think... Maybe we could market those as crap catchers !!! I know, I know, I worry about me, too !!! What a life we get to experience here with others... I truly love it @ times... Thanks for being part of mine... Blessings to you, yours, and especially Carly. I can feel your pride from here, well done... CJ", 
        "intTime": 20090518, 
        "postID": 14, 
        "quote": "", 
        "reply": "Thanks Bruce... Congratulations on Carly, it will be a big weekend indeed! Yes, I'll send pic's, so you can see this pure hearted abnormal collection of mis-fits and non-compliant traditionalist welcome me to this position among them. Knowing this group, it's liable to be more a roast than an Ordination... I could'nt imagine being in better company, you would definitely fit in !!! The story they continue to tell: During an extremely rough call, I was consoling an elderly couple on the loss of their home. As I was reaching into my bunker jacket pocket trying to find the cards I keep with Salvation Army & Red Cross numbers for quick access a young firefighter came beside me reaching in his jacket for a card to help me. (I make sure all have some in their gear incase I become incapacitated during a call). As he withdrew his hand a thin like towel came out. As he tried to act normal infront of the couple, he slowly unfolded this thing to discover an extremely large pair of white womens underwear, like size 300! As he was holding them dumbfounded, with this look of scared amazement on his face, a melted unwrapped chocolate candy-bar resembling you know what, slowly slid off onto the ground. I could'nt control myself and burst into laughter that brought tears to my eyes and sent me to my knees. The couple stunned, thank God, began to laugh as they realized the situation. They did ask what church I was part of, I think to make sure they steered clear!!! Our Chief on the other hand was fit to be tied, Go figure... Your crap catching comment to Donnie made me think... Maybe we could market those as crap catchers !!! I know, I know, I worry about me, too !!! What a life we get to experience here with others... I truly love it @ times... Thanks for being part of mine... Blessings to you, yours, and especially Carly. I can feel your pride from here, well done... CJ", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-18 07:20:00", 
        "title": "bible debunked???", 
        "userID": "TAH407"
    }, 
    {
        "content": "I will refrain from comment at this time!!", 
        "intTime": 20090518, 
        "postID": 15, 
        "quote": "", 
        "reply": "I will refrain from comment at this time!!", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-18 11:00:00", 
        "title": "bible debunked???", 
        "userID": "tawodi"
    }, 
    {
        "content": "www.truthchat.net < Good site supported by Southern Evangelical Seminary they love a good debate. Matter of fact they encourage it as these men and women are trying to be come future pastors. Give it a look they like to rebunk the debunked.", 
        "intTime": 20090528, 
        "postID": 16, 
        "quote": "", 
        "reply": "www.truthchat.net < Good site supported by Southern Evangelical Seminary they love a good debate. Matter of fact they encourage it as these men and women are trying to be come future pastors. Give it a look they like to rebunk the debunked.", 
        "threadID": "1270031990001_2410014322001", 
        "time": "2009-05-28 17:36:00", 
        "title": "bible debunked???", 
        "userID": "Lonny333"
    }
]