[
    {
        "content": "I don't think atheism is a bad word for the record, but I do believe those who against theism, are very similar in motive as the theists in which they are critical of. The fact is that the atheist does have a belief system, their belief is the the belief in no belief and they defend it as fervently as the very theists who defend their theism. Both are opposite sides of the same coin. Understanding this a mutual respect should be followed by both parties as it is no more wrong or right to be for theism or against it. According to both sides doctrines this is the ultimate truth. If your a theist then in the end your deity will make their truths manifest. If your against theism then in the end the reality of nothingness will make itself manifest. So both parties constantly vying against one another in zealotry will solve nothing. The only way to enhance our discussions on these topics would be to attempt to understand one another in the context of where we are common from in shared human experience. If one doesn't want to do that, than why play the hypocrite? If you believe your ultimately right, then why feel the need to constantly attempt to prove that which none of us can prove until the result of our faith becomes manifest? And yes both parties have faith. The theist has faith in a higher deity. The atheist has faith that there is no higher deity. Neither can conclusively prove their faith, so let's just discuss our truths and how we came to our conclusions and where we are at variance and why.", 
        "intTime": 20090306, 
        "postID": 1, 
        "quote": "", 
        "reply": "I don't think atheism is a bad word for the record, but I do believe those who against theism, are very similar in motive as the theists in which they are critical of. The fact is that the atheist does have a belief system, their belief is the the belief in no belief and they defend it as fervently as the very theists who defend their theism. Both are opposite sides of the same coin. Understanding this a mutual respect should be followed by both parties as it is no more wrong or right to be for theism or against it. According to both sides doctrines this is the ultimate truth. If your a theist then in the end your deity will make their truths manifest. If your against theism then in the end the reality of nothingness will make itself manifest. So both parties constantly vying against one another in zealotry will solve nothing. The only way to enhance our discussions on these topics would be to attempt to understand one another in the context of where we are common from in shared human experience. If one doesn't want to do that, than why play the hypocrite? If you believe your ultimately right, then why feel the need to constantly attempt to prove that which none of us can prove until the result of our faith becomes manifest? And yes both parties have faith. The theist has faith in a higher deity. The atheist has faith that there is no higher deity. Neither can conclusively prove their faith, so let's just discuss our truths and how we came to our conclusions and where we are at variance and why.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 07:09:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "intTime": 20090306, 
        "postID": 2, 
        "quote": "", 
        "reply": "I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 07:54:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "intTime": 20090306, 
        "postID": 3, 
        "quote": "Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "reply": " Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:10:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "intTime": 20090306, 
        "postID": 4, 
        "quote": "", 
        "reply": "Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:32:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion. I agree with you wholeheartedly, I was merely referring to the discussion on these threads. It's aweful and tragic when one's beliefs are used against them by others especially when it comes to one's livelihood. I find atheists and their beliefs \"interesting\" and enjoy the debate as I love to hear others points of view, but as a matter of personal philosophy, I don't believe anyone is anymore or less, just because they don't agree with me. I respect their opinion and would afford them the same hospitality as I would anyone else. That was the intention of this post in general. Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.", 
        "intTime": 20090306, 
        "postID": 5, 
        "quote": "Originally posted by billbright: Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "reply": " I agree with you wholeheartedly, I was merely referring to the discussion on these threads. It's aweful and tragic when one's beliefs are used against them by others especially when it comes to one's livelihood. I find atheists and their beliefs \"interesting\" and enjoy the debate as I love to hear others points of view, but as a matter of personal philosophy, I don't believe anyone is anymore or less, just because they don't agree with me. I respect their opinion and would afford them the same hospitality as I would anyone else. That was the intention of this post in general. Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:52:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "\"Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.\" Yes, that's what I meant, pretty much. I don't think I \"typed wrong\" but I may have typed in a way that seemed impolite. I was still smarting from the action I had to take after spending so much time and energy to make a place that a disparate group of atheists could work together. Spending time on that group after having spent so much time on a mixed group where there was a large contingent of Christians, it was amazing to see the humanistic beauty of the work that developed in the contributors. Religious dogma creates such blinders to the human spirit: look at the busting out of the dark ages during the Renaissance, especially (milli)Quattrocentro and (milli)Cinquecentro--the late fifteenth and early sixteenth century--when humanism was allowed to flourish. Inventiveness, perspective, chiaroscuro, significant metallurgy, an understanding of the human form (in art and medicine), prescient-motion poses, corporeality, new integrated systems for architecture, programs and discoveries in shipping, and a thousand other leaps ahead in improving the human condition occurred until again and again dogmatic Christians created periods of dark ages. Now, once again, dogmatism have slowed human progress, if only on a minor scale among my friends in that group. I can't tell you how angry I am about it. So, before you belittle atheism with your self-righteous rhetoric and set it aside as just another world view, consider what it is that you portend with your small, selfish, dogmatic ways. Atheism is not the opposite side of your coin. Other dogma is the opposite side of your coin. Atheism stands alone, and if I may borrow a phrase from the afflicted, it stands in the light--of reason, that is.", 
        "intTime": 20090306, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.\" Yes, that's what I meant, pretty much. I don't think I \"typed wrong\" but I may have typed in a way that seemed impolite. I was still smarting from the action I had to take after spending so much time and energy to make a place that a disparate group of atheists could work together. Spending time on that group after having spent so much time on a mixed group where there was a large contingent of Christians, it was amazing to see the humanistic beauty of the work that developed in the contributors. Religious dogma creates such blinders to the human spirit: look at the busting out of the dark ages during the Renaissance, especially (milli)Quattrocentro and (milli)Cinquecentro--the late fifteenth and early sixteenth century--when humanism was allowed to flourish. Inventiveness, perspective, chiaroscuro, significant metallurgy, an understanding of the human form (in art and medicine), prescient-motion poses, corporeality, new integrated systems for architecture, programs and discoveries in shipping, and a thousand other leaps ahead in improving the human condition occurred until again and again dogmatic Christians created periods of dark ages. Now, once again, dogmatism have slowed human progress, if only on a minor scale among my friends in that group. I can't tell you how angry I am about it. So, before you belittle atheism with your self-righteous rhetoric and set it aside as just another world view, consider what it is that you portend with your small, selfish, dogmatic ways. Atheism is not the opposite side of your coin. Other dogma is the opposite side of your coin. Atheism stands alone, and if I may borrow a phrase from the afflicted, it stands in the light--of reason, that is.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 13:10:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts! Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)", 
        "intTime": 20090307, 
        "postID": 7, 
        "quote": "Originally posted by SgtSalaamv2: quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "reply": " Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 07:22:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by billbright: So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... Exactly. I was recently wondering why the two categories I usually frequent at Military-dot-com are \"Religion in the Military\" and \"Gay/Lesbian Issues in the Military.\" I concluded that the reason was that I truly believe that gays and atheists are the two largest remaining groups in America against whom discrimination is still tolerated. Members of both groups frequently find themselves in situations where acknowledging such \"membership\" is socially unaccepted or awkward. Those in the majority still deliver jokes about gays, and rabid-anti-communist-style rants against atheists, with relative impunity. No other ethnic, racial, social or religious groups are so easily targeted for social scorn. Gays are making much more progress than atheists at the moment, but they still are not treated as completely equal citizens. There is, however, at least one openly gay member of Congress; I'm not aware of any openly non-believing person there. Many people seem to think \"freedom of religion\" means freedom to choose from among the available religions, as long as one IS chosen. They fail to comprehend that it also means we are free to choose NO religion for ourselves. The very fact that we are labeled as ATHEISTS illustrates that our lack-of-belief is so far outside the mainstream, we must be described in terms of what we DON'T believe. By comparison, when was the last time you heard of a Shintoist being described as an A-Yahweh-ist, or a Muslim described as an A-Shiva-ist? For that matter, why aren't ALL people described as A-Unicorn-ists, since we are all presumably united in a lack of belief in those creatures? The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "intTime": 20090307, 
        "postID": 8, 
        "quote": "Originally posted by billbright: So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people...", 
        "reply": " Exactly. I was recently wondering why the two categories I usually frequent at Military-dot-com are \"Religion in the Military\" and \"Gay/Lesbian Issues in the Military.\" I concluded that the reason was that I truly believe that gays and atheists are the two largest remaining groups in America against whom discrimination is still tolerated. Members of both groups frequently find themselves in situations where acknowledging such \"membership\" is socially unaccepted or awkward. Those in the majority still deliver jokes about gays, and rabid-anti-communist-style rants against atheists, with relative impunity. No other ethnic, racial, social or religious groups are so easily targeted for social scorn. Gays are making much more progress than atheists at the moment, but they still are not treated as completely equal citizens. There is, however, at least one openly gay member of Congress; I'm not aware of any openly non-believing person there. Many people seem to think \"freedom of religion\" means freedom to choose from among the available religions, as long as one IS chosen. They fail to comprehend that it also means we are free to choose NO religion for ourselves. The very fact that we are labeled as ATHEISTS illustrates that our lack-of-belief is so far outside the mainstream, we must be described in terms of what we DON'T believe. By comparison, when was the last time you heard of a Shintoist being described as an A-Yahweh-ist, or a Muslim described as an A-Shiva-ist? For that matter, why aren't ALL people described as A-Unicorn-ists, since we are all presumably united in a lack of belief in those creatures? The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 08:28:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads and co-incidentally co-founder of The People of Abraham, Christians, Muslims and Jews along with me. He had trouble re-activating his screen name so had to start again, that's why he seems to be a newby. Ergo, the V2 I am sure he, like myself, was not aware of your sensitivities, vis a vis nomenclature and was not attempting to make a heretofore unknown, earth shattering revelation, but simply attempting to extend an olive branch......oh well. T", 
        "intTime": 20090307, 
        "postID": 9, 
        "quote": "", 
        "reply": "HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads and co-incidentally co-founder of The People of Abraham, Christians, Muslims and Jews along with me. He had trouble re-activating his screen name so had to start again, that's why he seems to be a newby. Ergo, the V2 I am sure he, like myself, was not aware of your sensitivities, vis a vis nomenclature and was not attempting to make a heretofore unknown, earth shattering revelation, but simply attempting to extend an olive branch......oh well. T", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 13:28:00", 
        "title": "Atheism.....", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "intTime": 20090307, 
        "postID": 10, 
        "quote": "Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads...", 
        "reply": " So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 14:47:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Steve, Pete Stark is the only openly atheistic congressman. He didn't out himself until it no longer mattered to him, however. Smart man, as it turns out. \"http://www.secular.org/news/pete_stark_070312.html\"", 
        "intTime": 20090307, 
        "postID": 11, 
        "quote": "", 
        "reply": "Steve, Pete Stark is the only openly atheistic congressman. He didn't out himself until it no longer mattered to him, however. Smart man, as it turns out. \"http://www.secular.org/news/pete_stark_070312.html\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 17:47:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem? The faithful do that because they don't really understand faith. It doesn't make any sense to them that there can actually be people who don't base their Weltanschauung on not knowing.", 
        "intTime": 20090307, 
        "postID": 12, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "reply": " The faithful do that because they don't really understand faith. It doesn't make any sense to them that there can actually be people who don't base their Weltanschauung on not knowing.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 17:51:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: ......{snip}......When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" Sounds like a excerpt out of Douglas Adams' Hitchhiker's Guide to the Galaxy - So Long, and Thanks for All the Fish wherein he talks about \"Wonko the Sane!\" For reference: \"\"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for the use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.\"\" Sadly, he probably had the right of it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090307, 
        "postID": 13, 
        "quote": "Originally posted by SteveDeHaven: ......{snip}......When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "reply": " Sounds like a excerpt out of Douglas Adams' Hitchhiker's Guide to the Galaxy - So Long, and Thanks for All the Fish wherein he talks about \"Wonko the Sane!\" For reference: \"\"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for the use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.\"\" Sadly, he probably had the right of it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:09:00", 
        "title": "Atheism.....", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Imagine meeting your maker and finding out it's Frito-Lay. quote: God's final message to his creation: \"We apoligize for the inconvenience\" It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090307, 
        "postID": 14, 
        "quote": "Imagine meeting your maker and finding out it's Frito-Lay.", 
        "reply": " quote: God's final message to his creation: \"We apoligize for the inconvenience\" It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:35:00", 
        "title": "Atheism.....", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: The theist has faith in a higher deity. The atheist has faith that there is no higher deity. As an atheist, I did in fact notice that you were extending an olive branch. Your intentions were good. Nevertheless, what you did was totally miss the boat on atheist and nontheist philosophies. It really indicates that you haven't taken the time to really understand us. At its basic level, theists and nontheists differ fundamentally on the issue of faith. A theist values faith over truth. Belief in things not seen and the mystery of god are paradigms valued in theism. A nontheist (including atheists) value reason, logic, and the scientific method as ways to better understand the world. Very frequently, we gather and assess evidence and determine that we simply don't know (the connection between electromagnetism and gravity for example). That's fine. Sometimes we posit tentative theories (multidimensions and string theory) that we recognize are not entirely proven. And sometimes we have an overwhelming body of evidence which allows us to make an informed conclusion about the world - gravity, nuclear fission, internal combustion engines, the Casimir effect, evolution, and god doesn't exist. We consider belief in things not seen or belief contrary to evidence to be a bad thing, not a good thing. We do not value faith. I think we have an opportunity to come together on points of ethics, politics, and actions in daily life. I think it will be much more difficult for us (theists and nontheists) to come together on the issue of the source of truth in the world. Jason", 
        "intTime": 20090307, 
        "postID": 15, 
        "quote": "The theist has faith in a higher deity. The atheist has faith that there is no higher deity.", 
        "reply": " As an atheist, I did in fact notice that you were extending an olive branch. Your intentions were good. Nevertheless, what you did was totally miss the boat on atheist and nontheist philosophies. It really indicates that you haven't taken the time to really understand us. At its basic level, theists and nontheists differ fundamentally on the issue of faith. A theist values faith over truth. Belief in things not seen and the mystery of god are paradigms valued in theism. A nontheist (including atheists) value reason, logic, and the scientific method as ways to better understand the world. Very frequently, we gather and assess evidence and determine that we simply don't know (the connection between electromagnetism and gravity for example). That's fine. Sometimes we posit tentative theories (multidimensions and string theory) that we recognize are not entirely proven. And sometimes we have an overwhelming body of evidence which allows us to make an informed conclusion about the world - gravity, nuclear fission, internal combustion engines, the Casimir effect, evolution, and god doesn't exist. We consider belief in things not seen or belief contrary to evidence to be a bad thing, not a good thing. We do not value faith. I think we have an opportunity to come together on points of ethics, politics, and actions in daily life. I think it will be much more difficult for us (theists and nontheists) to come together on the issue of the source of truth in the world. Jason", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:47:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Your comical, Ive been a member of this board since 2004, with 2727 posts![/QUOTE] Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)[/QUOTE] Steve, bad grammar is a symptom of a bad argument. Point out bad grammar is a symptom of a bad counter-argument. The proper response in this situation would be - \"oh, it's sgt salam. I should have recognized you...\" or not to have made the ad hominem argument in the first place.", 
        "intTime": 20090307, 
        "postID": 16, 
        "quote": "Originally posted by SteveDeHaven:", 
        "reply": " Your comical, Ive been a member of this board since 2004, with 2727 posts![/QUOTE] Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)[/QUOTE] Steve, bad grammar is a symptom of a bad argument. Point out bad grammar is a symptom of a bad counter-argument. The proper response in this situation would be - \"oh, it's sgt salam. I should have recognized you...\" or not to have made the ad hominem argument in the first place.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:50:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: EVENING FOLKS EVERYONE DOING GOOD TONIGHT? Ne-Me! Doin' fine. How's by you?", 
        "intTime": 20090307, 
        "postID": 17, 
        "quote": "Originally posted by NEMESIS1960: EVENING FOLKS EVERYONE DOING GOOD TONIGHT?", 
        "reply": " Ne-Me! Doin' fine. How's by you?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 19:44:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by dday76: Steve, bad grammar is a symptom of a bad argument. Pointing out bad grammar is a symptom of a bad counter-argument. What can I say? I'm a teacher by nature. Jus' tryin' ta help!", 
        "intTime": 20090308, 
        "postID": 18, 
        "quote": "Originally posted by dday76: Steve, bad grammar is a symptom of a bad argument. Pointing out bad grammar is a symptom of a bad counter-argument.", 
        "reply": " What can I say? I'm a teacher by nature. Jus' tryin' ta help!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 03:51:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "SteveDeHaven, quote: ... The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence. In that sense, I'd say agnostics are the rationalists - they seem to say they cannot know because no one can see all the possible evidence. quote: So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" You're on a forum about religion, talking about how you do not believe in any deity. I'd say the term is fitting.", 
        "intTime": 20090308, 
        "postID": 19, 
        "quote": "... The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists.", 
        "reply": "SteveDeHaven,  Yet you do assume it does not exist, because you haven't seen evidence. In that sense, I'd say agnostics are the rationalists - they seem to say they cannot know because no one can see all the possible evidence. quote: So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" You're on a forum about religion, talking about how you do not believe in any deity. I'd say the term is fitting.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 05:25:00", 
        "title": "Atheism.....", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "I want the original Greek preface ”a” to be read in the same way in “atheist” as it is customarily read in such other Greco-English words as “amoral,” “atypical,” and “asymmetrical.” In this interpretation an atheist becomes: not someone who positively asserts the non-existence off God; but someone who is simply not a theist. We non-believers need to make up our own word describing ourselves. Agnostic; one who goes against the Gnostics, a long vanished religious sect remarkable for their narrow loss to Christianity in the great Cosmic game of Slap-Jack is not acceptable. I’m open to suggestion here... Infidel, just doesn’t sit right with me.", 
        "intTime": 20090308, 
        "postID": 20, 
        "quote": "", 
        "reply": "I want the original Greek preface ”a” to be read in the same way in “atheist” as it is customarily read in such other Greco-English words as “amoral,” “atypical,” and “asymmetrical.” In this interpretation an atheist becomes: not someone who positively asserts the non-existence off God; but someone who is simply not a theist. We non-believers need to make up our own word describing ourselves. Agnostic; one who goes against the Gnostics, a long vanished religious sect remarkable for their narrow loss to Christianity in the great Cosmic game of Slap-Jack is not acceptable. I’m open to suggestion here... Infidel, just doesn’t sit right with me.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:19:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Originally posted by SteveDeHaven: Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence. You can't just twist my words, then try to make a point based upon that twist. There's a difference between \"we don't assume X\" and \"we assume NOT X.\"", 
        "intTime": 20090308, 
        "postID": 21, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Originally posted by SteveDeHaven: Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence.", 
        "reply": " You can't just twist my words, then try to make a point based upon that twist. There's a difference between \"we don't assume X\" and \"we assume NOT X.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:20:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "As to the term \"atheist,\" I don't deny that it's accurate. But it's accurate in the same way that \"A-unicorn-ist\" is accurate, or that \"not insane\" is accurate. My point was, why define ourselves in terms of what we're NOT? I like the term \"Rationalist.\" It's a POSITIVE statement of what we are, rather than a statement of what we're not. I also like \"scientist\" in the sense that we are knowledge-oriented, but \"scientist\" has too many memetic connotations to be useful to the layman.", 
        "intTime": 20090308, 
        "postID": 22, 
        "quote": "", 
        "reply": "As to the term \"atheist,\" I don't deny that it's accurate. But it's accurate in the same way that \"A-unicorn-ist\" is accurate, or that \"not insane\" is accurate. My point was, why define ourselves in terms of what we're NOT? I like the term \"Rationalist.\" It's a POSITIVE statement of what we are, rather than a statement of what we're not. I also like \"scientist\" in the sense that we are knowledge-oriented, but \"scientist\" has too many memetic connotations to be useful to the layman.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:39:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If Ron L. Hubbard and Brigham Young can start a new religion so can we. We can start the “Church of the Chrysalis.” We are all out there hanging on a limb and with luck some day we will all break out of our belief cocoons and fly away. We could have missionaries and send them out into the world to “rebribe” those poor misguided believers who were denied food, medicine and clothing until they became Christians. Offer them food, medicine and clothing up front and tell them to go back to their old ways and if they were cannibals to please wait until we have left. Those of you who wish to help in the forming of the “Church of the Chrysalis” please feel free to join us.", 
        "intTime": 20090308, 
        "postID": 23, 
        "quote": "", 
        "reply": "If Ron L. Hubbard and Brigham Young can start a new religion so can we. We can start the “Church of the Chrysalis.” We are all out there hanging on a limb and with luck some day we will all break out of our belief cocoons and fly away. We could have missionaries and send them out into the world to “rebribe” those poor misguided believers who were denied food, medicine and clothing until they became Christians. Offer them food, medicine and clothing up front and tell them to go back to their old ways and if they were cannibals to please wait until we have left. Those of you who wish to help in the forming of the “Church of the Chrysalis” please feel free to join us.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:52:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "intTime": 20090308, 
        "postID": 24, 
        "quote": "", 
        "reply": "At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 08:13:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "intTime": 20090308, 
        "postID": 25, 
        "quote": "Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "reply": " Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 08:43:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash! Huh?", 
        "intTime": 20090308, 
        "postID": 26, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "reply": " Huh?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 10:06:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "intTime": 20090308, 
        "postID": 27, 
        "quote": "", 
        "reply": "How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 10:43:00", 
        "title": "Atheism.....", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: We non-believers need to make up our own word describing ourselves. The only way to work this out is to choose a word that best describes you. Humanist, Secular Humanist, Naturalist (not Naturist), and Bright are all options you might like. Try to pick a label that works for you. Remember the good thing is no insecure, vain divine power is worried about what you label yourself. The only thing that really matters is that you successfully communicate to others the message you're trying to get across. Like I always frontload \"atheist\" if someone asks me my religion. They generally assume I am theistic in my beliefs, and I want to clear that up first. Then we can be more specific about what I do belief. ps. we did start one: Church of the Flying Spaghetti Monster (PBUNA) This message has been edited. Last edited by: stillkit, Mon 09 March 2009 04:22 AM", 
        "intTime": 20090308, 
        "postID": 28, 
        "quote": "Originally posted by Another4Truth: We non-believers need to make up our own word describing ourselves.", 
        "reply": " The only way to work this out is to choose a word that best describes you. Humanist, Secular Humanist, Naturalist (not Naturist), and Bright are all options you might like. Try to pick a label that works for you. Remember the good thing is no insecure, vain divine power is worried about what you label yourself. The only thing that really matters is that you successfully communicate to others the message you're trying to get across. Like I always frontload \"atheist\" if someone asks me my religion. They generally assume I am theistic in my beliefs, and I want to clear that up first. Then we can be more specific about what I do belief. ps. we did start one: Church of the Flying Spaghetti Monster (PBUNA) This message has been edited. Last edited by: stillkit, Mon 09 March 2009 04:22 AM", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 15:45:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by tawodi: How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T You guys.... Don't go around making up definitions for those things that are already defined. Memetic refers to meme. Main Entry from Merriam Webster: meme Pronunciation: \\ˈmēm\\ Function: noun Etymology: alteration of mimeme, from mim- (as in mimesis) + -eme Date: 1976 : an idea, behavior, style, or usage that spreads from person to person within a culture", 
        "intTime": 20090308, 
        "postID": 29, 
        "quote": "Originally posted by tawodi: How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "reply": " You guys.... Don't go around making up definitions for those things that are already defined. Memetic refers to meme. Main Entry from Merriam Webster: meme Pronunciation: \\ˈmēm\\ Function: noun Etymology: alteration of mimeme, from mim- (as in mimesis) + -eme Date: 1976 : an idea, behavior, style, or usage that spreads from person to person within a culture", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 15:52:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "I don't think atheism is a bad word for the record, but I do believe those who against theism, are very similar in motive as the theists in which they are critical of. The fact is that the atheist does have a belief system, their belief is the the belief in no belief and they defend it as fervently as the very theists who defend their theism. Both are opposite sides of the same coin. Understanding this a mutual respect should be followed by both parties as it is no more wrong or right to be for theism or against it. According to both sides doctrines this is the ultimate truth. If your a theist then in the end your deity will make their truths manifest. If your against theism then in the end the reality of nothingness will make itself manifest. So both parties constantly vying against one another in zealotry will solve nothing. The only way to enhance our discussions on these topics would be to attempt to understand one another in the context of where we are common from in shared human experience. If one doesn't want to do that, than why play the hypocrite? If you believe your ultimately right, then why feel the need to constantly attempt to prove that which none of us can prove until the result of our faith becomes manifest? And yes both parties have faith. The theist has faith in a higher deity. The atheist has faith that there is no higher deity. Neither can conclusively prove their faith, so let's just discuss our truths and how we came to our conclusions and where we are at variance and why.", 
        "intTime": 20090306, 
        "postID": 30, 
        "quote": "", 
        "reply": "I don't think atheism is a bad word for the record, but I do believe those who against theism, are very similar in motive as the theists in which they are critical of. The fact is that the atheist does have a belief system, their belief is the the belief in no belief and they defend it as fervently as the very theists who defend their theism. Both are opposite sides of the same coin. Understanding this a mutual respect should be followed by both parties as it is no more wrong or right to be for theism or against it. According to both sides doctrines this is the ultimate truth. If your a theist then in the end your deity will make their truths manifest. If your against theism then in the end the reality of nothingness will make itself manifest. So both parties constantly vying against one another in zealotry will solve nothing. The only way to enhance our discussions on these topics would be to attempt to understand one another in the context of where we are common from in shared human experience. If one doesn't want to do that, than why play the hypocrite? If you believe your ultimately right, then why feel the need to constantly attempt to prove that which none of us can prove until the result of our faith becomes manifest? And yes both parties have faith. The theist has faith in a higher deity. The atheist has faith that there is no higher deity. Neither can conclusively prove their faith, so let's just discuss our truths and how we came to our conclusions and where we are at variance and why.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 07:09:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "intTime": 20090306, 
        "postID": 31, 
        "quote": "", 
        "reply": "I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 07:54:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "intTime": 20090306, 
        "postID": 32, 
        "quote": "Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "reply": " Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:10:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "intTime": 20090306, 
        "postID": 33, 
        "quote": "", 
        "reply": "Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:32:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion. I agree with you wholeheartedly, I was merely referring to the discussion on these threads. It's aweful and tragic when one's beliefs are used against them by others especially when it comes to one's livelihood. I find atheists and their beliefs \"interesting\" and enjoy the debate as I love to hear others points of view, but as a matter of personal philosophy, I don't believe anyone is anymore or less, just because they don't agree with me. I respect their opinion and would afford them the same hospitality as I would anyone else. That was the intention of this post in general. Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.", 
        "intTime": 20090306, 
        "postID": 34, 
        "quote": "Originally posted by billbright: Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "reply": " I agree with you wholeheartedly, I was merely referring to the discussion on these threads. It's aweful and tragic when one's beliefs are used against them by others especially when it comes to one's livelihood. I find atheists and their beliefs \"interesting\" and enjoy the debate as I love to hear others points of view, but as a matter of personal philosophy, I don't believe anyone is anymore or less, just because they don't agree with me. I respect their opinion and would afford them the same hospitality as I would anyone else. That was the intention of this post in general. Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:52:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "\"Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.\" Yes, that's what I meant, pretty much. I don't think I \"typed wrong\" but I may have typed in a way that seemed impolite. I was still smarting from the action I had to take after spending so much time and energy to make a place that a disparate group of atheists could work together. Spending time on that group after having spent so much time on a mixed group where there was a large contingent of Christians, it was amazing to see the humanistic beauty of the work that developed in the contributors. Religious dogma creates such blinders to the human spirit: look at the busting out of the dark ages during the Renaissance, especially (milli)Quattrocentro and (milli)Cinquecentro--the late fifteenth and early sixteenth century--when humanism was allowed to flourish. Inventiveness, perspective, chiaroscuro, significant metallurgy, an understanding of the human form (in art and medicine), prescient-motion poses, corporeality, new integrated systems for architecture, programs and discoveries in shipping, and a thousand other leaps ahead in improving the human condition occurred until again and again dogmatic Christians created periods of dark ages. Now, once again, dogmatism have slowed human progress, if only on a minor scale among my friends in that group. I can't tell you how angry I am about it. So, before you belittle atheism with your self-righteous rhetoric and set it aside as just another world view, consider what it is that you portend with your small, selfish, dogmatic ways. Atheism is not the opposite side of your coin. Other dogma is the opposite side of your coin. Atheism stands alone, and if I may borrow a phrase from the afflicted, it stands in the light--of reason, that is.", 
        "intTime": 20090306, 
        "postID": 35, 
        "quote": "", 
        "reply": "\"Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.\" Yes, that's what I meant, pretty much. I don't think I \"typed wrong\" but I may have typed in a way that seemed impolite. I was still smarting from the action I had to take after spending so much time and energy to make a place that a disparate group of atheists could work together. Spending time on that group after having spent so much time on a mixed group where there was a large contingent of Christians, it was amazing to see the humanistic beauty of the work that developed in the contributors. Religious dogma creates such blinders to the human spirit: look at the busting out of the dark ages during the Renaissance, especially (milli)Quattrocentro and (milli)Cinquecentro--the late fifteenth and early sixteenth century--when humanism was allowed to flourish. Inventiveness, perspective, chiaroscuro, significant metallurgy, an understanding of the human form (in art and medicine), prescient-motion poses, corporeality, new integrated systems for architecture, programs and discoveries in shipping, and a thousand other leaps ahead in improving the human condition occurred until again and again dogmatic Christians created periods of dark ages. Now, once again, dogmatism have slowed human progress, if only on a minor scale among my friends in that group. I can't tell you how angry I am about it. So, before you belittle atheism with your self-righteous rhetoric and set it aside as just another world view, consider what it is that you portend with your small, selfish, dogmatic ways. Atheism is not the opposite side of your coin. Other dogma is the opposite side of your coin. Atheism stands alone, and if I may borrow a phrase from the afflicted, it stands in the light--of reason, that is.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 13:10:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts! Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)", 
        "intTime": 20090307, 
        "postID": 36, 
        "quote": "Originally posted by SgtSalaamv2: quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "reply": " Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 07:22:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by billbright: So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... Exactly. I was recently wondering why the two categories I usually frequent at Military-dot-com are \"Religion in the Military\" and \"Gay/Lesbian Issues in the Military.\" I concluded that the reason was that I truly believe that gays and atheists are the two largest remaining groups in America against whom discrimination is still tolerated. Members of both groups frequently find themselves in situations where acknowledging such \"membership\" is socially unaccepted or awkward. Those in the majority still deliver jokes about gays, and rabid-anti-communist-style rants against atheists, with relative impunity. No other ethnic, racial, social or religious groups are so easily targeted for social scorn. Gays are making much more progress than atheists at the moment, but they still are not treated as completely equal citizens. There is, however, at least one openly gay member of Congress; I'm not aware of any openly non-believing person there. Many people seem to think \"freedom of religion\" means freedom to choose from among the available religions, as long as one IS chosen. They fail to comprehend that it also means we are free to choose NO religion for ourselves. The very fact that we are labeled as ATHEISTS illustrates that our lack-of-belief is so far outside the mainstream, we must be described in terms of what we DON'T believe. By comparison, when was the last time you heard of a Shintoist being described as an A-Yahweh-ist, or a Muslim described as an A-Shiva-ist? For that matter, why aren't ALL people described as A-Unicorn-ists, since we are all presumably united in a lack of belief in those creatures? The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "intTime": 20090307, 
        "postID": 37, 
        "quote": "Originally posted by billbright: So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people...", 
        "reply": " Exactly. I was recently wondering why the two categories I usually frequent at Military-dot-com are \"Religion in the Military\" and \"Gay/Lesbian Issues in the Military.\" I concluded that the reason was that I truly believe that gays and atheists are the two largest remaining groups in America against whom discrimination is still tolerated. Members of both groups frequently find themselves in situations where acknowledging such \"membership\" is socially unaccepted or awkward. Those in the majority still deliver jokes about gays, and rabid-anti-communist-style rants against atheists, with relative impunity. No other ethnic, racial, social or religious groups are so easily targeted for social scorn. Gays are making much more progress than atheists at the moment, but they still are not treated as completely equal citizens. There is, however, at least one openly gay member of Congress; I'm not aware of any openly non-believing person there. Many people seem to think \"freedom of religion\" means freedom to choose from among the available religions, as long as one IS chosen. They fail to comprehend that it also means we are free to choose NO religion for ourselves. The very fact that we are labeled as ATHEISTS illustrates that our lack-of-belief is so far outside the mainstream, we must be described in terms of what we DON'T believe. By comparison, when was the last time you heard of a Shintoist being described as an A-Yahweh-ist, or a Muslim described as an A-Shiva-ist? For that matter, why aren't ALL people described as A-Unicorn-ists, since we are all presumably united in a lack of belief in those creatures? The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 08:28:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads and co-incidentally co-founder of The People of Abraham, Christians, Muslims and Jews along with me. He had trouble re-activating his screen name so had to start again, that's why he seems to be a newby. Ergo, the V2 I am sure he, like myself, was not aware of your sensitivities, vis a vis nomenclature and was not attempting to make a heretofore unknown, earth shattering revelation, but simply attempting to extend an olive branch......oh well. T", 
        "intTime": 20090307, 
        "postID": 38, 
        "quote": "", 
        "reply": "HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads and co-incidentally co-founder of The People of Abraham, Christians, Muslims and Jews along with me. He had trouble re-activating his screen name so had to start again, that's why he seems to be a newby. Ergo, the V2 I am sure he, like myself, was not aware of your sensitivities, vis a vis nomenclature and was not attempting to make a heretofore unknown, earth shattering revelation, but simply attempting to extend an olive branch......oh well. T", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 13:28:00", 
        "title": "Atheism.....", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "intTime": 20090307, 
        "postID": 39, 
        "quote": "Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads...", 
        "reply": " So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 14:47:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Steve, Pete Stark is the only openly atheistic congressman. He didn't out himself until it no longer mattered to him, however. Smart man, as it turns out. \"http://www.secular.org/news/pete_stark_070312.html\"", 
        "intTime": 20090307, 
        "postID": 40, 
        "quote": "", 
        "reply": "Steve, Pete Stark is the only openly atheistic congressman. He didn't out himself until it no longer mattered to him, however. Smart man, as it turns out. \"http://www.secular.org/news/pete_stark_070312.html\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 17:47:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem? The faithful do that because they don't really understand faith. It doesn't make any sense to them that there can actually be people who don't base their Weltanschauung on not knowing.", 
        "intTime": 20090307, 
        "postID": 41, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "reply": " The faithful do that because they don't really understand faith. It doesn't make any sense to them that there can actually be people who don't base their Weltanschauung on not knowing.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 17:51:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: ......{snip}......When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" Sounds like a excerpt out of Douglas Adams' Hitchhiker's Guide to the Galaxy - So Long, and Thanks for All the Fish wherein he talks about \"Wonko the Sane!\" For reference: \"\"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for the use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.\"\" Sadly, he probably had the right of it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090307, 
        "postID": 42, 
        "quote": "Originally posted by SteveDeHaven: ......{snip}......When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "reply": " Sounds like a excerpt out of Douglas Adams' Hitchhiker's Guide to the Galaxy - So Long, and Thanks for All the Fish wherein he talks about \"Wonko the Sane!\" For reference: \"\"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for the use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.\"\" Sadly, he probably had the right of it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:09:00", 
        "title": "Atheism.....", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Imagine meeting your maker and finding out it's Frito-Lay. quote: God's final message to his creation: \"We apoligize for the inconvenience\" It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090307, 
        "postID": 43, 
        "quote": "Imagine meeting your maker and finding out it's Frito-Lay.", 
        "reply": " quote: God's final message to his creation: \"We apoligize for the inconvenience\" It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:35:00", 
        "title": "Atheism.....", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: The theist has faith in a higher deity. The atheist has faith that there is no higher deity. As an atheist, I did in fact notice that you were extending an olive branch. Your intentions were good. Nevertheless, what you did was totally miss the boat on atheist and nontheist philosophies. It really indicates that you haven't taken the time to really understand us. At its basic level, theists and nontheists differ fundamentally on the issue of faith. A theist values faith over truth. Belief in things not seen and the mystery of god are paradigms valued in theism. A nontheist (including atheists) value reason, logic, and the scientific method as ways to better understand the world. Very frequently, we gather and assess evidence and determine that we simply don't know (the connection between electromagnetism and gravity for example). That's fine. Sometimes we posit tentative theories (multidimensions and string theory) that we recognize are not entirely proven. And sometimes we have an overwhelming body of evidence which allows us to make an informed conclusion about the world - gravity, nuclear fission, internal combustion engines, the Casimir effect, evolution, and god doesn't exist. We consider belief in things not seen or belief contrary to evidence to be a bad thing, not a good thing. We do not value faith. I think we have an opportunity to come together on points of ethics, politics, and actions in daily life. I think it will be much more difficult for us (theists and nontheists) to come together on the issue of the source of truth in the world. Jason", 
        "intTime": 20090307, 
        "postID": 44, 
        "quote": "The theist has faith in a higher deity. The atheist has faith that there is no higher deity.", 
        "reply": " As an atheist, I did in fact notice that you were extending an olive branch. Your intentions were good. Nevertheless, what you did was totally miss the boat on atheist and nontheist philosophies. It really indicates that you haven't taken the time to really understand us. At its basic level, theists and nontheists differ fundamentally on the issue of faith. A theist values faith over truth. Belief in things not seen and the mystery of god are paradigms valued in theism. A nontheist (including atheists) value reason, logic, and the scientific method as ways to better understand the world. Very frequently, we gather and assess evidence and determine that we simply don't know (the connection between electromagnetism and gravity for example). That's fine. Sometimes we posit tentative theories (multidimensions and string theory) that we recognize are not entirely proven. And sometimes we have an overwhelming body of evidence which allows us to make an informed conclusion about the world - gravity, nuclear fission, internal combustion engines, the Casimir effect, evolution, and god doesn't exist. We consider belief in things not seen or belief contrary to evidence to be a bad thing, not a good thing. We do not value faith. I think we have an opportunity to come together on points of ethics, politics, and actions in daily life. I think it will be much more difficult for us (theists and nontheists) to come together on the issue of the source of truth in the world. Jason", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:47:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Your comical, Ive been a member of this board since 2004, with 2727 posts![/QUOTE] Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)[/QUOTE] Steve, bad grammar is a symptom of a bad argument. Point out bad grammar is a symptom of a bad counter-argument. The proper response in this situation would be - \"oh, it's sgt salam. I should have recognized you...\" or not to have made the ad hominem argument in the first place.", 
        "intTime": 20090307, 
        "postID": 45, 
        "quote": "Originally posted by SteveDeHaven:", 
        "reply": " Your comical, Ive been a member of this board since 2004, with 2727 posts![/QUOTE] Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)[/QUOTE] Steve, bad grammar is a symptom of a bad argument. Point out bad grammar is a symptom of a bad counter-argument. The proper response in this situation would be - \"oh, it's sgt salam. I should have recognized you...\" or not to have made the ad hominem argument in the first place.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:50:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: EVENING FOLKS EVERYONE DOING GOOD TONIGHT? Ne-Me! Doin' fine. How's by you?", 
        "intTime": 20090307, 
        "postID": 46, 
        "quote": "Originally posted by NEMESIS1960: EVENING FOLKS EVERYONE DOING GOOD TONIGHT?", 
        "reply": " Ne-Me! Doin' fine. How's by you?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 19:44:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by dday76: Steve, bad grammar is a symptom of a bad argument. Pointing out bad grammar is a symptom of a bad counter-argument. What can I say? I'm a teacher by nature. Jus' tryin' ta help!", 
        "intTime": 20090308, 
        "postID": 47, 
        "quote": "Originally posted by dday76: Steve, bad grammar is a symptom of a bad argument. Pointing out bad grammar is a symptom of a bad counter-argument.", 
        "reply": " What can I say? I'm a teacher by nature. Jus' tryin' ta help!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 03:51:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "SteveDeHaven, quote: ... The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence. In that sense, I'd say agnostics are the rationalists - they seem to say they cannot know because no one can see all the possible evidence. quote: So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" You're on a forum about religion, talking about how you do not believe in any deity. I'd say the term is fitting.", 
        "intTime": 20090308, 
        "postID": 48, 
        "quote": "... The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists.", 
        "reply": "SteveDeHaven,  Yet you do assume it does not exist, because you haven't seen evidence. In that sense, I'd say agnostics are the rationalists - they seem to say they cannot know because no one can see all the possible evidence. quote: So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" You're on a forum about religion, talking about how you do not believe in any deity. I'd say the term is fitting.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 05:25:00", 
        "title": "Atheism.....", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "I want the original Greek preface ”a” to be read in the same way in “atheist” as it is customarily read in such other Greco-English words as “amoral,” “atypical,” and “asymmetrical.” In this interpretation an atheist becomes: not someone who positively asserts the non-existence off God; but someone who is simply not a theist. We non-believers need to make up our own word describing ourselves. Agnostic; one who goes against the Gnostics, a long vanished religious sect remarkable for their narrow loss to Christianity in the great Cosmic game of Slap-Jack is not acceptable. I’m open to suggestion here... Infidel, just doesn’t sit right with me.", 
        "intTime": 20090308, 
        "postID": 49, 
        "quote": "", 
        "reply": "I want the original Greek preface ”a” to be read in the same way in “atheist” as it is customarily read in such other Greco-English words as “amoral,” “atypical,” and “asymmetrical.” In this interpretation an atheist becomes: not someone who positively asserts the non-existence off God; but someone who is simply not a theist. We non-believers need to make up our own word describing ourselves. Agnostic; one who goes against the Gnostics, a long vanished religious sect remarkable for their narrow loss to Christianity in the great Cosmic game of Slap-Jack is not acceptable. I’m open to suggestion here... Infidel, just doesn’t sit right with me.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:19:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Originally posted by SteveDeHaven: Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence. You can't just twist my words, then try to make a point based upon that twist. There's a difference between \"we don't assume X\" and \"we assume NOT X.\"", 
        "intTime": 20090308, 
        "postID": 50, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Originally posted by SteveDeHaven: Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence.", 
        "reply": " You can't just twist my words, then try to make a point based upon that twist. There's a difference between \"we don't assume X\" and \"we assume NOT X.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:20:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "As to the term \"atheist,\" I don't deny that it's accurate. But it's accurate in the same way that \"A-unicorn-ist\" is accurate, or that \"not insane\" is accurate. My point was, why define ourselves in terms of what we're NOT? I like the term \"Rationalist.\" It's a POSITIVE statement of what we are, rather than a statement of what we're not. I also like \"scientist\" in the sense that we are knowledge-oriented, but \"scientist\" has too many memetic connotations to be useful to the layman.", 
        "intTime": 20090308, 
        "postID": 51, 
        "quote": "", 
        "reply": "As to the term \"atheist,\" I don't deny that it's accurate. But it's accurate in the same way that \"A-unicorn-ist\" is accurate, or that \"not insane\" is accurate. My point was, why define ourselves in terms of what we're NOT? I like the term \"Rationalist.\" It's a POSITIVE statement of what we are, rather than a statement of what we're not. I also like \"scientist\" in the sense that we are knowledge-oriented, but \"scientist\" has too many memetic connotations to be useful to the layman.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:39:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If Ron L. Hubbard and Brigham Young can start a new religion so can we. We can start the “Church of the Chrysalis.” We are all out there hanging on a limb and with luck some day we will all break out of our belief cocoons and fly away. We could have missionaries and send them out into the world to “rebribe” those poor misguided believers who were denied food, medicine and clothing until they became Christians. Offer them food, medicine and clothing up front and tell them to go back to their old ways and if they were cannibals to please wait until we have left. Those of you who wish to help in the forming of the “Church of the Chrysalis” please feel free to join us.", 
        "intTime": 20090308, 
        "postID": 52, 
        "quote": "", 
        "reply": "If Ron L. Hubbard and Brigham Young can start a new religion so can we. We can start the “Church of the Chrysalis.” We are all out there hanging on a limb and with luck some day we will all break out of our belief cocoons and fly away. We could have missionaries and send them out into the world to “rebribe” those poor misguided believers who were denied food, medicine and clothing until they became Christians. Offer them food, medicine and clothing up front and tell them to go back to their old ways and if they were cannibals to please wait until we have left. Those of you who wish to help in the forming of the “Church of the Chrysalis” please feel free to join us.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:52:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "intTime": 20090308, 
        "postID": 53, 
        "quote": "", 
        "reply": "At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 08:13:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "intTime": 20090308, 
        "postID": 54, 
        "quote": "Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "reply": " Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 08:43:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash! Huh?", 
        "intTime": 20090308, 
        "postID": 55, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "reply": " Huh?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 10:06:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "intTime": 20090308, 
        "postID": 56, 
        "quote": "", 
        "reply": "How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 10:43:00", 
        "title": "Atheism.....", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: We non-believers need to make up our own word describing ourselves. The only way to work this out is to choose a word that best describes you. Humanist, Secular Humanist, Naturalist (not Naturist), and Bright are all options you might like. Try to pick a label that works for you. Remember the good thing is no insecure, vain divine power is worried about what you label yourself. The only thing that really matters is that you successfully communicate to others the message you're trying to get across. Like I always frontload \"atheist\" if someone asks me my religion. They generally assume I am theistic in my beliefs, and I want to clear that up first. Then we can be more specific about what I do belief. ps. we did start one: Church of the Flying Spaghetti Monster (PBUNA) This message has been edited. Last edited by: stillkit, Mon 09 March 2009 04:22 AM", 
        "intTime": 20090308, 
        "postID": 57, 
        "quote": "Originally posted by Another4Truth: We non-believers need to make up our own word describing ourselves.", 
        "reply": " The only way to work this out is to choose a word that best describes you. Humanist, Secular Humanist, Naturalist (not Naturist), and Bright are all options you might like. Try to pick a label that works for you. Remember the good thing is no insecure, vain divine power is worried about what you label yourself. The only thing that really matters is that you successfully communicate to others the message you're trying to get across. Like I always frontload \"atheist\" if someone asks me my religion. They generally assume I am theistic in my beliefs, and I want to clear that up first. Then we can be more specific about what I do belief. ps. we did start one: Church of the Flying Spaghetti Monster (PBUNA) This message has been edited. Last edited by: stillkit, Mon 09 March 2009 04:22 AM", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 15:45:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by tawodi: How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T You guys.... Don't go around making up definitions for those things that are already defined. Memetic refers to meme. Main Entry from Merriam Webster: meme Pronunciation: \\ˈmēm\\ Function: noun Etymology: alteration of mimeme, from mim- (as in mimesis) + -eme Date: 1976 : an idea, behavior, style, or usage that spreads from person to person within a culture", 
        "intTime": 20090308, 
        "postID": 58, 
        "quote": "Originally posted by tawodi: How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "reply": " You guys.... Don't go around making up definitions for those things that are already defined. Memetic refers to meme. Main Entry from Merriam Webster: meme Pronunciation: \\ˈmēm\\ Function: noun Etymology: alteration of mimeme, from mim- (as in mimesis) + -eme Date: 1976 : an idea, behavior, style, or usage that spreads from person to person within a culture", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 15:52:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "I don't think atheism is a bad word for the record, but I do believe those who against theism, are very similar in motive as the theists in which they are critical of. The fact is that the atheist does have a belief system, their belief is the the belief in no belief and they defend it as fervently as the very theists who defend their theism. Both are opposite sides of the same coin. Understanding this a mutual respect should be followed by both parties as it is no more wrong or right to be for theism or against it. According to both sides doctrines this is the ultimate truth. If your a theist then in the end your deity will make their truths manifest. If your against theism then in the end the reality of nothingness will make itself manifest. So both parties constantly vying against one another in zealotry will solve nothing. The only way to enhance our discussions on these topics would be to attempt to understand one another in the context of where we are common from in shared human experience. If one doesn't want to do that, than why play the hypocrite? If you believe your ultimately right, then why feel the need to constantly attempt to prove that which none of us can prove until the result of our faith becomes manifest? And yes both parties have faith. The theist has faith in a higher deity. The atheist has faith that there is no higher deity. Neither can conclusively prove their faith, so let's just discuss our truths and how we came to our conclusions and where we are at variance and why.", 
        "intTime": 20090306, 
        "postID": 59, 
        "quote": "", 
        "reply": "I don't think atheism is a bad word for the record, but I do believe those who against theism, are very similar in motive as the theists in which they are critical of. The fact is that the atheist does have a belief system, their belief is the the belief in no belief and they defend it as fervently as the very theists who defend their theism. Both are opposite sides of the same coin. Understanding this a mutual respect should be followed by both parties as it is no more wrong or right to be for theism or against it. According to both sides doctrines this is the ultimate truth. If your a theist then in the end your deity will make their truths manifest. If your against theism then in the end the reality of nothingness will make itself manifest. So both parties constantly vying against one another in zealotry will solve nothing. The only way to enhance our discussions on these topics would be to attempt to understand one another in the context of where we are common from in shared human experience. If one doesn't want to do that, than why play the hypocrite? If you believe your ultimately right, then why feel the need to constantly attempt to prove that which none of us can prove until the result of our faith becomes manifest? And yes both parties have faith. The theist has faith in a higher deity. The atheist has faith that there is no higher deity. Neither can conclusively prove their faith, so let's just discuss our truths and how we came to our conclusions and where we are at variance and why.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 07:09:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "intTime": 20090306, 
        "postID": 60, 
        "quote": "", 
        "reply": "I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 07:54:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "intTime": 20090306, 
        "postID": 61, 
        "quote": "Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "reply": " Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:10:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "intTime": 20090306, 
        "postID": 62, 
        "quote": "", 
        "reply": "Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:32:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion. I agree with you wholeheartedly, I was merely referring to the discussion on these threads. It's aweful and tragic when one's beliefs are used against them by others especially when it comes to one's livelihood. I find atheists and their beliefs \"interesting\" and enjoy the debate as I love to hear others points of view, but as a matter of personal philosophy, I don't believe anyone is anymore or less, just because they don't agree with me. I respect their opinion and would afford them the same hospitality as I would anyone else. That was the intention of this post in general. Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.", 
        "intTime": 20090306, 
        "postID": 63, 
        "quote": "Originally posted by billbright: Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "reply": " I agree with you wholeheartedly, I was merely referring to the discussion on these threads. It's aweful and tragic when one's beliefs are used against them by others especially when it comes to one's livelihood. I find atheists and their beliefs \"interesting\" and enjoy the debate as I love to hear others points of view, but as a matter of personal philosophy, I don't believe anyone is anymore or less, just because they don't agree with me. I respect their opinion and would afford them the same hospitality as I would anyone else. That was the intention of this post in general. Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:52:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "\"Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.\" Yes, that's what I meant, pretty much. I don't think I \"typed wrong\" but I may have typed in a way that seemed impolite. I was still smarting from the action I had to take after spending so much time and energy to make a place that a disparate group of atheists could work together. Spending time on that group after having spent so much time on a mixed group where there was a large contingent of Christians, it was amazing to see the humanistic beauty of the work that developed in the contributors. Religious dogma creates such blinders to the human spirit: look at the busting out of the dark ages during the Renaissance, especially (milli)Quattrocentro and (milli)Cinquecentro--the late fifteenth and early sixteenth century--when humanism was allowed to flourish. Inventiveness, perspective, chiaroscuro, significant metallurgy, an understanding of the human form (in art and medicine), prescient-motion poses, corporeality, new integrated systems for architecture, programs and discoveries in shipping, and a thousand other leaps ahead in improving the human condition occurred until again and again dogmatic Christians created periods of dark ages. Now, once again, dogmatism have slowed human progress, if only on a minor scale among my friends in that group. I can't tell you how angry I am about it. So, before you belittle atheism with your self-righteous rhetoric and set it aside as just another world view, consider what it is that you portend with your small, selfish, dogmatic ways. Atheism is not the opposite side of your coin. Other dogma is the opposite side of your coin. Atheism stands alone, and if I may borrow a phrase from the afflicted, it stands in the light--of reason, that is.", 
        "intTime": 20090306, 
        "postID": 64, 
        "quote": "", 
        "reply": "\"Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.\" Yes, that's what I meant, pretty much. I don't think I \"typed wrong\" but I may have typed in a way that seemed impolite. I was still smarting from the action I had to take after spending so much time and energy to make a place that a disparate group of atheists could work together. Spending time on that group after having spent so much time on a mixed group where there was a large contingent of Christians, it was amazing to see the humanistic beauty of the work that developed in the contributors. Religious dogma creates such blinders to the human spirit: look at the busting out of the dark ages during the Renaissance, especially (milli)Quattrocentro and (milli)Cinquecentro--the late fifteenth and early sixteenth century--when humanism was allowed to flourish. Inventiveness, perspective, chiaroscuro, significant metallurgy, an understanding of the human form (in art and medicine), prescient-motion poses, corporeality, new integrated systems for architecture, programs and discoveries in shipping, and a thousand other leaps ahead in improving the human condition occurred until again and again dogmatic Christians created periods of dark ages. Now, once again, dogmatism have slowed human progress, if only on a minor scale among my friends in that group. I can't tell you how angry I am about it. So, before you belittle atheism with your self-righteous rhetoric and set it aside as just another world view, consider what it is that you portend with your small, selfish, dogmatic ways. Atheism is not the opposite side of your coin. Other dogma is the opposite side of your coin. Atheism stands alone, and if I may borrow a phrase from the afflicted, it stands in the light--of reason, that is.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 13:10:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts! Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)", 
        "intTime": 20090307, 
        "postID": 65, 
        "quote": "Originally posted by SgtSalaamv2: quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "reply": " Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 07:22:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by billbright: So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... Exactly. I was recently wondering why the two categories I usually frequent at Military-dot-com are \"Religion in the Military\" and \"Gay/Lesbian Issues in the Military.\" I concluded that the reason was that I truly believe that gays and atheists are the two largest remaining groups in America against whom discrimination is still tolerated. Members of both groups frequently find themselves in situations where acknowledging such \"membership\" is socially unaccepted or awkward. Those in the majority still deliver jokes about gays, and rabid-anti-communist-style rants against atheists, with relative impunity. No other ethnic, racial, social or religious groups are so easily targeted for social scorn. Gays are making much more progress than atheists at the moment, but they still are not treated as completely equal citizens. There is, however, at least one openly gay member of Congress; I'm not aware of any openly non-believing person there. Many people seem to think \"freedom of religion\" means freedom to choose from among the available religions, as long as one IS chosen. They fail to comprehend that it also means we are free to choose NO religion for ourselves. The very fact that we are labeled as ATHEISTS illustrates that our lack-of-belief is so far outside the mainstream, we must be described in terms of what we DON'T believe. By comparison, when was the last time you heard of a Shintoist being described as an A-Yahweh-ist, or a Muslim described as an A-Shiva-ist? For that matter, why aren't ALL people described as A-Unicorn-ists, since we are all presumably united in a lack of belief in those creatures? The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "intTime": 20090307, 
        "postID": 66, 
        "quote": "Originally posted by billbright: So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people...", 
        "reply": " Exactly. I was recently wondering why the two categories I usually frequent at Military-dot-com are \"Religion in the Military\" and \"Gay/Lesbian Issues in the Military.\" I concluded that the reason was that I truly believe that gays and atheists are the two largest remaining groups in America against whom discrimination is still tolerated. Members of both groups frequently find themselves in situations where acknowledging such \"membership\" is socially unaccepted or awkward. Those in the majority still deliver jokes about gays, and rabid-anti-communist-style rants against atheists, with relative impunity. No other ethnic, racial, social or religious groups are so easily targeted for social scorn. Gays are making much more progress than atheists at the moment, but they still are not treated as completely equal citizens. There is, however, at least one openly gay member of Congress; I'm not aware of any openly non-believing person there. Many people seem to think \"freedom of religion\" means freedom to choose from among the available religions, as long as one IS chosen. They fail to comprehend that it also means we are free to choose NO religion for ourselves. The very fact that we are labeled as ATHEISTS illustrates that our lack-of-belief is so far outside the mainstream, we must be described in terms of what we DON'T believe. By comparison, when was the last time you heard of a Shintoist being described as an A-Yahweh-ist, or a Muslim described as an A-Shiva-ist? For that matter, why aren't ALL people described as A-Unicorn-ists, since we are all presumably united in a lack of belief in those creatures? The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 08:28:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads and co-incidentally co-founder of The People of Abraham, Christians, Muslims and Jews along with me. He had trouble re-activating his screen name so had to start again, that's why he seems to be a newby. Ergo, the V2 I am sure he, like myself, was not aware of your sensitivities, vis a vis nomenclature and was not attempting to make a heretofore unknown, earth shattering revelation, but simply attempting to extend an olive branch......oh well. T", 
        "intTime": 20090307, 
        "postID": 67, 
        "quote": "", 
        "reply": "HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads and co-incidentally co-founder of The People of Abraham, Christians, Muslims and Jews along with me. He had trouble re-activating his screen name so had to start again, that's why he seems to be a newby. Ergo, the V2 I am sure he, like myself, was not aware of your sensitivities, vis a vis nomenclature and was not attempting to make a heretofore unknown, earth shattering revelation, but simply attempting to extend an olive branch......oh well. T", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 13:28:00", 
        "title": "Atheism.....", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "intTime": 20090307, 
        "postID": 68, 
        "quote": "Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads...", 
        "reply": " So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 14:47:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Steve, Pete Stark is the only openly atheistic congressman. He didn't out himself until it no longer mattered to him, however. Smart man, as it turns out. \"http://www.secular.org/news/pete_stark_070312.html\"", 
        "intTime": 20090307, 
        "postID": 69, 
        "quote": "", 
        "reply": "Steve, Pete Stark is the only openly atheistic congressman. He didn't out himself until it no longer mattered to him, however. Smart man, as it turns out. \"http://www.secular.org/news/pete_stark_070312.html\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 17:47:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem? The faithful do that because they don't really understand faith. It doesn't make any sense to them that there can actually be people who don't base their Weltanschauung on not knowing.", 
        "intTime": 20090307, 
        "postID": 70, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "reply": " The faithful do that because they don't really understand faith. It doesn't make any sense to them that there can actually be people who don't base their Weltanschauung on not knowing.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 17:51:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: ......{snip}......When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" Sounds like a excerpt out of Douglas Adams' Hitchhiker's Guide to the Galaxy - So Long, and Thanks for All the Fish wherein he talks about \"Wonko the Sane!\" For reference: \"\"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for the use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.\"\" Sadly, he probably had the right of it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090307, 
        "postID": 71, 
        "quote": "Originally posted by SteveDeHaven: ......{snip}......When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "reply": " Sounds like a excerpt out of Douglas Adams' Hitchhiker's Guide to the Galaxy - So Long, and Thanks for All the Fish wherein he talks about \"Wonko the Sane!\" For reference: \"\"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for the use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.\"\" Sadly, he probably had the right of it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:09:00", 
        "title": "Atheism.....", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Imagine meeting your maker and finding out it's Frito-Lay. quote: God's final message to his creation: \"We apoligize for the inconvenience\" It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090307, 
        "postID": 72, 
        "quote": "Imagine meeting your maker and finding out it's Frito-Lay.", 
        "reply": " quote: God's final message to his creation: \"We apoligize for the inconvenience\" It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:35:00", 
        "title": "Atheism.....", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: The theist has faith in a higher deity. The atheist has faith that there is no higher deity. As an atheist, I did in fact notice that you were extending an olive branch. Your intentions were good. Nevertheless, what you did was totally miss the boat on atheist and nontheist philosophies. It really indicates that you haven't taken the time to really understand us. At its basic level, theists and nontheists differ fundamentally on the issue of faith. A theist values faith over truth. Belief in things not seen and the mystery of god are paradigms valued in theism. A nontheist (including atheists) value reason, logic, and the scientific method as ways to better understand the world. Very frequently, we gather and assess evidence and determine that we simply don't know (the connection between electromagnetism and gravity for example). That's fine. Sometimes we posit tentative theories (multidimensions and string theory) that we recognize are not entirely proven. And sometimes we have an overwhelming body of evidence which allows us to make an informed conclusion about the world - gravity, nuclear fission, internal combustion engines, the Casimir effect, evolution, and god doesn't exist. We consider belief in things not seen or belief contrary to evidence to be a bad thing, not a good thing. We do not value faith. I think we have an opportunity to come together on points of ethics, politics, and actions in daily life. I think it will be much more difficult for us (theists and nontheists) to come together on the issue of the source of truth in the world. Jason", 
        "intTime": 20090307, 
        "postID": 73, 
        "quote": "The theist has faith in a higher deity. The atheist has faith that there is no higher deity.", 
        "reply": " As an atheist, I did in fact notice that you were extending an olive branch. Your intentions were good. Nevertheless, what you did was totally miss the boat on atheist and nontheist philosophies. It really indicates that you haven't taken the time to really understand us. At its basic level, theists and nontheists differ fundamentally on the issue of faith. A theist values faith over truth. Belief in things not seen and the mystery of god are paradigms valued in theism. A nontheist (including atheists) value reason, logic, and the scientific method as ways to better understand the world. Very frequently, we gather and assess evidence and determine that we simply don't know (the connection between electromagnetism and gravity for example). That's fine. Sometimes we posit tentative theories (multidimensions and string theory) that we recognize are not entirely proven. And sometimes we have an overwhelming body of evidence which allows us to make an informed conclusion about the world - gravity, nuclear fission, internal combustion engines, the Casimir effect, evolution, and god doesn't exist. We consider belief in things not seen or belief contrary to evidence to be a bad thing, not a good thing. We do not value faith. I think we have an opportunity to come together on points of ethics, politics, and actions in daily life. I think it will be much more difficult for us (theists and nontheists) to come together on the issue of the source of truth in the world. Jason", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:47:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Your comical, Ive been a member of this board since 2004, with 2727 posts![/QUOTE] Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)[/QUOTE] Steve, bad grammar is a symptom of a bad argument. Point out bad grammar is a symptom of a bad counter-argument. The proper response in this situation would be - \"oh, it's sgt salam. I should have recognized you...\" or not to have made the ad hominem argument in the first place.", 
        "intTime": 20090307, 
        "postID": 74, 
        "quote": "Originally posted by SteveDeHaven:", 
        "reply": " Your comical, Ive been a member of this board since 2004, with 2727 posts![/QUOTE] Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)[/QUOTE] Steve, bad grammar is a symptom of a bad argument. Point out bad grammar is a symptom of a bad counter-argument. The proper response in this situation would be - \"oh, it's sgt salam. I should have recognized you...\" or not to have made the ad hominem argument in the first place.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:50:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: EVENING FOLKS EVERYONE DOING GOOD TONIGHT? Ne-Me! Doin' fine. How's by you?", 
        "intTime": 20090307, 
        "postID": 75, 
        "quote": "Originally posted by NEMESIS1960: EVENING FOLKS EVERYONE DOING GOOD TONIGHT?", 
        "reply": " Ne-Me! Doin' fine. How's by you?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 19:44:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by dday76: Steve, bad grammar is a symptom of a bad argument. Pointing out bad grammar is a symptom of a bad counter-argument. What can I say? I'm a teacher by nature. Jus' tryin' ta help!", 
        "intTime": 20090308, 
        "postID": 76, 
        "quote": "Originally posted by dday76: Steve, bad grammar is a symptom of a bad argument. Pointing out bad grammar is a symptom of a bad counter-argument.", 
        "reply": " What can I say? I'm a teacher by nature. Jus' tryin' ta help!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 03:51:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "SteveDeHaven, quote: ... The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence. In that sense, I'd say agnostics are the rationalists - they seem to say they cannot know because no one can see all the possible evidence. quote: So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" You're on a forum about religion, talking about how you do not believe in any deity. I'd say the term is fitting.", 
        "intTime": 20090308, 
        "postID": 77, 
        "quote": "... The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists.", 
        "reply": "SteveDeHaven,  Yet you do assume it does not exist, because you haven't seen evidence. In that sense, I'd say agnostics are the rationalists - they seem to say they cannot know because no one can see all the possible evidence. quote: So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" You're on a forum about religion, talking about how you do not believe in any deity. I'd say the term is fitting.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 05:25:00", 
        "title": "Atheism.....", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "I want the original Greek preface ”a” to be read in the same way in “atheist” as it is customarily read in such other Greco-English words as “amoral,” “atypical,” and “asymmetrical.” In this interpretation an atheist becomes: not someone who positively asserts the non-existence off God; but someone who is simply not a theist. We non-believers need to make up our own word describing ourselves. Agnostic; one who goes against the Gnostics, a long vanished religious sect remarkable for their narrow loss to Christianity in the great Cosmic game of Slap-Jack is not acceptable. I’m open to suggestion here... Infidel, just doesn’t sit right with me.", 
        "intTime": 20090308, 
        "postID": 78, 
        "quote": "", 
        "reply": "I want the original Greek preface ”a” to be read in the same way in “atheist” as it is customarily read in such other Greco-English words as “amoral,” “atypical,” and “asymmetrical.” In this interpretation an atheist becomes: not someone who positively asserts the non-existence off God; but someone who is simply not a theist. We non-believers need to make up our own word describing ourselves. Agnostic; one who goes against the Gnostics, a long vanished religious sect remarkable for their narrow loss to Christianity in the great Cosmic game of Slap-Jack is not acceptable. I’m open to suggestion here... Infidel, just doesn’t sit right with me.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:19:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Originally posted by SteveDeHaven: Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence. You can't just twist my words, then try to make a point based upon that twist. There's a difference between \"we don't assume X\" and \"we assume NOT X.\"", 
        "intTime": 20090308, 
        "postID": 79, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Originally posted by SteveDeHaven: Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence.", 
        "reply": " You can't just twist my words, then try to make a point based upon that twist. There's a difference between \"we don't assume X\" and \"we assume NOT X.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:20:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "As to the term \"atheist,\" I don't deny that it's accurate. But it's accurate in the same way that \"A-unicorn-ist\" is accurate, or that \"not insane\" is accurate. My point was, why define ourselves in terms of what we're NOT? I like the term \"Rationalist.\" It's a POSITIVE statement of what we are, rather than a statement of what we're not. I also like \"scientist\" in the sense that we are knowledge-oriented, but \"scientist\" has too many memetic connotations to be useful to the layman.", 
        "intTime": 20090308, 
        "postID": 80, 
        "quote": "", 
        "reply": "As to the term \"atheist,\" I don't deny that it's accurate. But it's accurate in the same way that \"A-unicorn-ist\" is accurate, or that \"not insane\" is accurate. My point was, why define ourselves in terms of what we're NOT? I like the term \"Rationalist.\" It's a POSITIVE statement of what we are, rather than a statement of what we're not. I also like \"scientist\" in the sense that we are knowledge-oriented, but \"scientist\" has too many memetic connotations to be useful to the layman.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:39:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If Ron L. Hubbard and Brigham Young can start a new religion so can we. We can start the “Church of the Chrysalis.” We are all out there hanging on a limb and with luck some day we will all break out of our belief cocoons and fly away. We could have missionaries and send them out into the world to “rebribe” those poor misguided believers who were denied food, medicine and clothing until they became Christians. Offer them food, medicine and clothing up front and tell them to go back to their old ways and if they were cannibals to please wait until we have left. Those of you who wish to help in the forming of the “Church of the Chrysalis” please feel free to join us.", 
        "intTime": 20090308, 
        "postID": 81, 
        "quote": "", 
        "reply": "If Ron L. Hubbard and Brigham Young can start a new religion so can we. We can start the “Church of the Chrysalis.” We are all out there hanging on a limb and with luck some day we will all break out of our belief cocoons and fly away. We could have missionaries and send them out into the world to “rebribe” those poor misguided believers who were denied food, medicine and clothing until they became Christians. Offer them food, medicine and clothing up front and tell them to go back to their old ways and if they were cannibals to please wait until we have left. Those of you who wish to help in the forming of the “Church of the Chrysalis” please feel free to join us.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:52:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "intTime": 20090308, 
        "postID": 82, 
        "quote": "", 
        "reply": "At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 08:13:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "intTime": 20090308, 
        "postID": 83, 
        "quote": "Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "reply": " Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 08:43:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash! Huh?", 
        "intTime": 20090308, 
        "postID": 84, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "reply": " Huh?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 10:06:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "intTime": 20090308, 
        "postID": 85, 
        "quote": "", 
        "reply": "How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 10:43:00", 
        "title": "Atheism.....", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: We non-believers need to make up our own word describing ourselves. The only way to work this out is to choose a word that best describes you. Humanist, Secular Humanist, Naturalist (not Naturist), and Bright are all options you might like. Try to pick a label that works for you. Remember the good thing is no insecure, vain divine power is worried about what you label yourself. The only thing that really matters is that you successfully communicate to others the message you're trying to get across. Like I always frontload \"atheist\" if someone asks me my religion. They generally assume I am theistic in my beliefs, and I want to clear that up first. Then we can be more specific about what I do belief. ps. we did start one: Church of the Flying Spaghetti Monster (PBUNA) This message has been edited. Last edited by: stillkit, Mon 09 March 2009 04:22 AM", 
        "intTime": 20090308, 
        "postID": 86, 
        "quote": "Originally posted by Another4Truth: We non-believers need to make up our own word describing ourselves.", 
        "reply": " The only way to work this out is to choose a word that best describes you. Humanist, Secular Humanist, Naturalist (not Naturist), and Bright are all options you might like. Try to pick a label that works for you. Remember the good thing is no insecure, vain divine power is worried about what you label yourself. The only thing that really matters is that you successfully communicate to others the message you're trying to get across. Like I always frontload \"atheist\" if someone asks me my religion. They generally assume I am theistic in my beliefs, and I want to clear that up first. Then we can be more specific about what I do belief. ps. we did start one: Church of the Flying Spaghetti Monster (PBUNA) This message has been edited. Last edited by: stillkit, Mon 09 March 2009 04:22 AM", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 15:45:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by tawodi: How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T You guys.... Don't go around making up definitions for those things that are already defined. Memetic refers to meme. Main Entry from Merriam Webster: meme Pronunciation: \\ˈmēm\\ Function: noun Etymology: alteration of mimeme, from mim- (as in mimesis) + -eme Date: 1976 : an idea, behavior, style, or usage that spreads from person to person within a culture", 
        "intTime": 20090308, 
        "postID": 87, 
        "quote": "Originally posted by tawodi: How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "reply": " You guys.... Don't go around making up definitions for those things that are already defined. Memetic refers to meme. Main Entry from Merriam Webster: meme Pronunciation: \\ˈmēm\\ Function: noun Etymology: alteration of mimeme, from mim- (as in mimesis) + -eme Date: 1976 : an idea, behavior, style, or usage that spreads from person to person within a culture", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 15:52:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "I don't think atheism is a bad word for the record, but I do believe those who against theism, are very similar in motive as the theists in which they are critical of. The fact is that the atheist does have a belief system, their belief is the the belief in no belief and they defend it as fervently as the very theists who defend their theism. Both are opposite sides of the same coin. Understanding this a mutual respect should be followed by both parties as it is no more wrong or right to be for theism or against it. According to both sides doctrines this is the ultimate truth. If your a theist then in the end your deity will make their truths manifest. If your against theism then in the end the reality of nothingness will make itself manifest. So both parties constantly vying against one another in zealotry will solve nothing. The only way to enhance our discussions on these topics would be to attempt to understand one another in the context of where we are common from in shared human experience. If one doesn't want to do that, than why play the hypocrite? If you believe your ultimately right, then why feel the need to constantly attempt to prove that which none of us can prove until the result of our faith becomes manifest? And yes both parties have faith. The theist has faith in a higher deity. The atheist has faith that there is no higher deity. Neither can conclusively prove their faith, so let's just discuss our truths and how we came to our conclusions and where we are at variance and why.", 
        "intTime": 20090306, 
        "postID": 88, 
        "quote": "", 
        "reply": "I don't think atheism is a bad word for the record, but I do believe those who against theism, are very similar in motive as the theists in which they are critical of. The fact is that the atheist does have a belief system, their belief is the the belief in no belief and they defend it as fervently as the very theists who defend their theism. Both are opposite sides of the same coin. Understanding this a mutual respect should be followed by both parties as it is no more wrong or right to be for theism or against it. According to both sides doctrines this is the ultimate truth. If your a theist then in the end your deity will make their truths manifest. If your against theism then in the end the reality of nothingness will make itself manifest. So both parties constantly vying against one another in zealotry will solve nothing. The only way to enhance our discussions on these topics would be to attempt to understand one another in the context of where we are common from in shared human experience. If one doesn't want to do that, than why play the hypocrite? If you believe your ultimately right, then why feel the need to constantly attempt to prove that which none of us can prove until the result of our faith becomes manifest? And yes both parties have faith. The theist has faith in a higher deity. The atheist has faith that there is no higher deity. Neither can conclusively prove their faith, so let's just discuss our truths and how we came to our conclusions and where we are at variance and why.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 07:09:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "intTime": 20090306, 
        "postID": 89, 
        "quote": "", 
        "reply": "I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 07:54:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "intTime": 20090306, 
        "postID": 90, 
        "quote": "Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\"", 
        "reply": " Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:10:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "intTime": 20090306, 
        "postID": 91, 
        "quote": "", 
        "reply": "Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:32:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion. I agree with you wholeheartedly, I was merely referring to the discussion on these threads. It's aweful and tragic when one's beliefs are used against them by others especially when it comes to one's livelihood. I find atheists and their beliefs \"interesting\" and enjoy the debate as I love to hear others points of view, but as a matter of personal philosophy, I don't believe anyone is anymore or less, just because they don't agree with me. I respect their opinion and would afford them the same hospitality as I would anyone else. That was the intention of this post in general. Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.", 
        "intTime": 20090306, 
        "postID": 92, 
        "quote": "Originally posted by billbright: Let me tell you how bad the atheist - religionist divide is, SS. You may be in a tight situation, economically, and may not be worried about discrimination because of your belief, but not everyone is. I ran a discussion group I had started and monitored for about eight months. It was a site for creative atheists, a place that writers and artists could drop manuscripts and works for critique. Well, one of the members has an uber-Christian employer who is trying to find out about this member through extraordinary web searches. I felt I had to delete the group in order to erase any trace that might lead them to think she was an atheist. Oh, sure... I know that discreet groups are supposed to be protected, but I, myself, have found supposedly private comments on the same provider. This is the same provider where I held my own group. I couldn't take the chance, so I deleted it and we set up an email ring to do our critiques. So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... people who have families to feed and raise, and often people who are astute and have taken the time to search for real answers to reality. They should never have to fear for their livelihood. ...Not in the America I spent twenty years trying to defend against just such agents of dominion.", 
        "reply": " I agree with you wholeheartedly, I was merely referring to the discussion on these threads. It's aweful and tragic when one's beliefs are used against them by others especially when it comes to one's livelihood. I find atheists and their beliefs \"interesting\" and enjoy the debate as I love to hear others points of view, but as a matter of personal philosophy, I don't believe anyone is anymore or less, just because they don't agree with me. I respect their opinion and would afford them the same hospitality as I would anyone else. That was the intention of this post in general. Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 08:52:00", 
        "title": "Atheism.....", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "\"Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.\" Yes, that's what I meant, pretty much. I don't think I \"typed wrong\" but I may have typed in a way that seemed impolite. I was still smarting from the action I had to take after spending so much time and energy to make a place that a disparate group of atheists could work together. Spending time on that group after having spent so much time on a mixed group where there was a large contingent of Christians, it was amazing to see the humanistic beauty of the work that developed in the contributors. Religious dogma creates such blinders to the human spirit: look at the busting out of the dark ages during the Renaissance, especially (milli)Quattrocentro and (milli)Cinquecentro--the late fifteenth and early sixteenth century--when humanism was allowed to flourish. Inventiveness, perspective, chiaroscuro, significant metallurgy, an understanding of the human form (in art and medicine), prescient-motion poses, corporeality, new integrated systems for architecture, programs and discoveries in shipping, and a thousand other leaps ahead in improving the human condition occurred until again and again dogmatic Christians created periods of dark ages. Now, once again, dogmatism have slowed human progress, if only on a minor scale among my friends in that group. I can't tell you how angry I am about it. So, before you belittle atheism with your self-righteous rhetoric and set it aside as just another world view, consider what it is that you portend with your small, selfish, dogmatic ways. Atheism is not the opposite side of your coin. Other dogma is the opposite side of your coin. Atheism stands alone, and if I may borrow a phrase from the afflicted, it stands in the light--of reason, that is.", 
        "intTime": 20090306, 
        "postID": 93, 
        "quote": "", 
        "reply": "\"Now as to my situation, I don't understand how that is relevant, unless you typed wrong and meant to state that I may be well off enough to do and say what I want, which isn't completely true, but I would say I'm doing OK compared to many in my age/ethnic/etc. group and I kinda get where your going I think.\" Yes, that's what I meant, pretty much. I don't think I \"typed wrong\" but I may have typed in a way that seemed impolite. I was still smarting from the action I had to take after spending so much time and energy to make a place that a disparate group of atheists could work together. Spending time on that group after having spent so much time on a mixed group where there was a large contingent of Christians, it was amazing to see the humanistic beauty of the work that developed in the contributors. Religious dogma creates such blinders to the human spirit: look at the busting out of the dark ages during the Renaissance, especially (milli)Quattrocentro and (milli)Cinquecentro--the late fifteenth and early sixteenth century--when humanism was allowed to flourish. Inventiveness, perspective, chiaroscuro, significant metallurgy, an understanding of the human form (in art and medicine), prescient-motion poses, corporeality, new integrated systems for architecture, programs and discoveries in shipping, and a thousand other leaps ahead in improving the human condition occurred until again and again dogmatic Christians created periods of dark ages. Now, once again, dogmatism have slowed human progress, if only on a minor scale among my friends in that group. I can't tell you how angry I am about it. So, before you belittle atheism with your self-righteous rhetoric and set it aside as just another world view, consider what it is that you portend with your small, selfish, dogmatic ways. Atheism is not the opposite side of your coin. Other dogma is the opposite side of your coin. Atheism stands alone, and if I may borrow a phrase from the afflicted, it stands in the light--of reason, that is.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-06 13:10:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SgtSalaamv2: quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts! Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)", 
        "intTime": 20090307, 
        "postID": 94, 
        "quote": "Originally posted by SgtSalaamv2: quote: Originally posted by SteveDeHaven: I'm sure you think you've discovered some elegant point of logic that will leave us dumbfounded. However, I see by your number of posts (14 at this writing) that you haven't been on this forum very long. That's okay, but take a little time to read some of the older threads, and you'll find lots of examples of people trying to use this same hoary argument. The argument makes as much sense as saying, \"X doesn't equal Y, therefore Y equals everything except X.\" Your comical, Ive been a member of this board since 2004, with 2727 posts!", 
        "reply": " Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 07:22:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by billbright: So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people... Exactly. I was recently wondering why the two categories I usually frequent at Military-dot-com are \"Religion in the Military\" and \"Gay/Lesbian Issues in the Military.\" I concluded that the reason was that I truly believe that gays and atheists are the two largest remaining groups in America against whom discrimination is still tolerated. Members of both groups frequently find themselves in situations where acknowledging such \"membership\" is socially unaccepted or awkward. Those in the majority still deliver jokes about gays, and rabid-anti-communist-style rants against atheists, with relative impunity. No other ethnic, racial, social or religious groups are so easily targeted for social scorn. Gays are making much more progress than atheists at the moment, but they still are not treated as completely equal citizens. There is, however, at least one openly gay member of Congress; I'm not aware of any openly non-believing person there. Many people seem to think \"freedom of religion\" means freedom to choose from among the available religions, as long as one IS chosen. They fail to comprehend that it also means we are free to choose NO religion for ourselves. The very fact that we are labeled as ATHEISTS illustrates that our lack-of-belief is so far outside the mainstream, we must be described in terms of what we DON'T believe. By comparison, when was the last time you heard of a Shintoist being described as an A-Yahweh-ist, or a Muslim described as an A-Shiva-ist? For that matter, why aren't ALL people described as A-Unicorn-ists, since we are all presumably united in a lack of belief in those creatures? The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "intTime": 20090307, 
        "postID": 95, 
        "quote": "Originally posted by billbright: So, while you may feel that you can plaster your name and face all over the universe proclaiming your faith and your acceptance, it's not the same for everyone. Atheists are just people...", 
        "reply": " Exactly. I was recently wondering why the two categories I usually frequent at Military-dot-com are \"Religion in the Military\" and \"Gay/Lesbian Issues in the Military.\" I concluded that the reason was that I truly believe that gays and atheists are the two largest remaining groups in America against whom discrimination is still tolerated. Members of both groups frequently find themselves in situations where acknowledging such \"membership\" is socially unaccepted or awkward. Those in the majority still deliver jokes about gays, and rabid-anti-communist-style rants against atheists, with relative impunity. No other ethnic, racial, social or religious groups are so easily targeted for social scorn. Gays are making much more progress than atheists at the moment, but they still are not treated as completely equal citizens. There is, however, at least one openly gay member of Congress; I'm not aware of any openly non-believing person there. Many people seem to think \"freedom of religion\" means freedom to choose from among the available religions, as long as one IS chosen. They fail to comprehend that it also means we are free to choose NO religion for ourselves. The very fact that we are labeled as ATHEISTS illustrates that our lack-of-belief is so far outside the mainstream, we must be described in terms of what we DON'T believe. By comparison, when was the last time you heard of a Shintoist being described as an A-Yahweh-ist, or a Muslim described as an A-Shiva-ist? For that matter, why aren't ALL people described as A-Unicorn-ists, since we are all presumably united in a lack of belief in those creatures? The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 08:28:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads and co-incidentally co-founder of The People of Abraham, Christians, Muslims and Jews along with me. He had trouble re-activating his screen name so had to start again, that's why he seems to be a newby. Ergo, the V2 I am sure he, like myself, was not aware of your sensitivities, vis a vis nomenclature and was not attempting to make a heretofore unknown, earth shattering revelation, but simply attempting to extend an olive branch......oh well. T", 
        "intTime": 20090307, 
        "postID": 96, 
        "quote": "", 
        "reply": "HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads and co-incidentally co-founder of The People of Abraham, Christians, Muslims and Jews along with me. He had trouble re-activating his screen name so had to start again, that's why he seems to be a newby. Ergo, the V2 I am sure he, like myself, was not aware of your sensitivities, vis a vis nomenclature and was not attempting to make a heretofore unknown, earth shattering revelation, but simply attempting to extend an olive branch......oh well. T", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 13:28:00", 
        "title": "Atheism.....", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "intTime": 20090307, 
        "postID": 97, 
        "quote": "Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads...", 
        "reply": " So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 14:47:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Steve, Pete Stark is the only openly atheistic congressman. He didn't out himself until it no longer mattered to him, however. Smart man, as it turns out. \"http://www.secular.org/news/pete_stark_070312.html\"", 
        "intTime": 20090307, 
        "postID": 98, 
        "quote": "", 
        "reply": "Steve, Pete Stark is the only openly atheistic congressman. He didn't out himself until it no longer mattered to him, however. Smart man, as it turns out. \"http://www.secular.org/news/pete_stark_070312.html\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 17:47:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem? The faithful do that because they don't really understand faith. It doesn't make any sense to them that there can actually be people who don't base their Weltanschauung on not knowing.", 
        "intTime": 20090307, 
        "postID": 99, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by tawodi: HI STEVE; I saw your exchange with SgtSalaamv2 and thought you might like a little info. He is Robert Salaam, a former marine Sgt. Long time member of the threads... So what's his excuse for trotting out the old \"atheists have faith\" argument? Some kind of reading-retention problem?", 
        "reply": " The faithful do that because they don't really understand faith. It doesn't make any sense to them that there can actually be people who don't base their Weltanschauung on not knowing.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 17:51:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: ......{snip}......When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" Sounds like a excerpt out of Douglas Adams' Hitchhiker's Guide to the Galaxy - So Long, and Thanks for All the Fish wherein he talks about \"Wonko the Sane!\" For reference: \"\"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for the use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.\"\" Sadly, he probably had the right of it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090307, 
        "postID": 100, 
        "quote": "Originally posted by SteveDeHaven: ......{snip}......When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\"", 
        "reply": " Sounds like a excerpt out of Douglas Adams' Hitchhiker's Guide to the Galaxy - So Long, and Thanks for All the Fish wherein he talks about \"Wonko the Sane!\" For reference: \"\"It seemed to me,\" said Wonko the Sane, \"that any civilization that had so far lost its head as to need to include a set of detailed instructions for the use in a package of toothpicks, was no longer a civilization in which I could live and stay sane.\"\" Sadly, he probably had the right of it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:09:00", 
        "title": "Atheism.....", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Imagine meeting your maker and finding out it's Frito-Lay. quote: God's final message to his creation: \"We apoligize for the inconvenience\" It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090307, 
        "postID": 101, 
        "quote": "Imagine meeting your maker and finding out it's Frito-Lay.", 
        "reply": " quote: God's final message to his creation: \"We apoligize for the inconvenience\" It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:35:00", 
        "title": "Atheism.....", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: The theist has faith in a higher deity. The atheist has faith that there is no higher deity. As an atheist, I did in fact notice that you were extending an olive branch. Your intentions were good. Nevertheless, what you did was totally miss the boat on atheist and nontheist philosophies. It really indicates that you haven't taken the time to really understand us. At its basic level, theists and nontheists differ fundamentally on the issue of faith. A theist values faith over truth. Belief in things not seen and the mystery of god are paradigms valued in theism. A nontheist (including atheists) value reason, logic, and the scientific method as ways to better understand the world. Very frequently, we gather and assess evidence and determine that we simply don't know (the connection between electromagnetism and gravity for example). That's fine. Sometimes we posit tentative theories (multidimensions and string theory) that we recognize are not entirely proven. And sometimes we have an overwhelming body of evidence which allows us to make an informed conclusion about the world - gravity, nuclear fission, internal combustion engines, the Casimir effect, evolution, and god doesn't exist. We consider belief in things not seen or belief contrary to evidence to be a bad thing, not a good thing. We do not value faith. I think we have an opportunity to come together on points of ethics, politics, and actions in daily life. I think it will be much more difficult for us (theists and nontheists) to come together on the issue of the source of truth in the world. Jason", 
        "intTime": 20090307, 
        "postID": 102, 
        "quote": "The theist has faith in a higher deity. The atheist has faith that there is no higher deity.", 
        "reply": " As an atheist, I did in fact notice that you were extending an olive branch. Your intentions were good. Nevertheless, what you did was totally miss the boat on atheist and nontheist philosophies. It really indicates that you haven't taken the time to really understand us. At its basic level, theists and nontheists differ fundamentally on the issue of faith. A theist values faith over truth. Belief in things not seen and the mystery of god are paradigms valued in theism. A nontheist (including atheists) value reason, logic, and the scientific method as ways to better understand the world. Very frequently, we gather and assess evidence and determine that we simply don't know (the connection between electromagnetism and gravity for example). That's fine. Sometimes we posit tentative theories (multidimensions and string theory) that we recognize are not entirely proven. And sometimes we have an overwhelming body of evidence which allows us to make an informed conclusion about the world - gravity, nuclear fission, internal combustion engines, the Casimir effect, evolution, and god doesn't exist. We consider belief in things not seen or belief contrary to evidence to be a bad thing, not a good thing. We do not value faith. I think we have an opportunity to come together on points of ethics, politics, and actions in daily life. I think it will be much more difficult for us (theists and nontheists) to come together on the issue of the source of truth in the world. Jason", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:47:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Your comical, Ive been a member of this board since 2004, with 2727 posts![/QUOTE] Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)[/QUOTE] Steve, bad grammar is a symptom of a bad argument. Point out bad grammar is a symptom of a bad counter-argument. The proper response in this situation would be - \"oh, it's sgt salam. I should have recognized you...\" or not to have made the ad hominem argument in the first place.", 
        "intTime": 20090307, 
        "postID": 103, 
        "quote": "Originally posted by SteveDeHaven:", 
        "reply": " Your comical, Ive been a member of this board since 2004, with 2727 posts![/QUOTE] Fine, you're an old hand. Your argument still doesn't hold water. (See how those words are different?)[/QUOTE] Steve, bad grammar is a symptom of a bad argument. Point out bad grammar is a symptom of a bad counter-argument. The proper response in this situation would be - \"oh, it's sgt salam. I should have recognized you...\" or not to have made the ad hominem argument in the first place.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 18:50:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: EVENING FOLKS EVERYONE DOING GOOD TONIGHT? Ne-Me! Doin' fine. How's by you?", 
        "intTime": 20090307, 
        "postID": 104, 
        "quote": "Originally posted by NEMESIS1960: EVENING FOLKS EVERYONE DOING GOOD TONIGHT?", 
        "reply": " Ne-Me! Doin' fine. How's by you?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-07 19:44:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by dday76: Steve, bad grammar is a symptom of a bad argument. Pointing out bad grammar is a symptom of a bad counter-argument. What can I say? I'm a teacher by nature. Jus' tryin' ta help!", 
        "intTime": 20090308, 
        "postID": 105, 
        "quote": "Originally posted by dday76: Steve, bad grammar is a symptom of a bad argument. Pointing out bad grammar is a symptom of a bad counter-argument.", 
        "reply": " What can I say? I'm a teacher by nature. Jus' tryin' ta help!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 03:51:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "SteveDeHaven, quote: ... The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence. In that sense, I'd say agnostics are the rationalists - they seem to say they cannot know because no one can see all the possible evidence. quote: So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" You're on a forum about religion, talking about how you do not believe in any deity. I'd say the term is fitting.", 
        "intTime": 20090308, 
        "postID": 106, 
        "quote": "... The thing that's most amazing to me is the fact that available evidence (or lack thereof) supports OUR view. There is no evidence of any deity's existence, at least none that meets accepted criteria for \"evidence.\" Anything that \"Theist A\" claims as evidence of Deity A's existence can just as easily be claimed as evidence for the existence of Deity B through Z, and thousands more. If something can be claimed as evidence for that many opposing theories, then it is useless as evidence. This leaves us with the observable universe and the laws we can deduce about it, which is what the rationalist attempts to do. Since we see no evidence of something, we don't assume it exists.", 
        "reply": "SteveDeHaven,  Yet you do assume it does not exist, because you haven't seen evidence. In that sense, I'd say agnostics are the rationalists - they seem to say they cannot know because no one can see all the possible evidence. quote: So why is it that the people who are taking the most rational, objective viewpoint of the universe are described in terms of NOT doing the opposite? When I hear the term \"atheist\" applied to myself or others (even though I myself have done so for the sake of expediency), I get the same feeling that I would if we were routinely but constantly described as \"not insane.\" You're on a forum about religion, talking about how you do not believe in any deity. I'd say the term is fitting.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 05:25:00", 
        "title": "Atheism.....", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "I want the original Greek preface ”a” to be read in the same way in “atheist” as it is customarily read in such other Greco-English words as “amoral,” “atypical,” and “asymmetrical.” In this interpretation an atheist becomes: not someone who positively asserts the non-existence off God; but someone who is simply not a theist. We non-believers need to make up our own word describing ourselves. Agnostic; one who goes against the Gnostics, a long vanished religious sect remarkable for their narrow loss to Christianity in the great Cosmic game of Slap-Jack is not acceptable. I’m open to suggestion here... Infidel, just doesn’t sit right with me.", 
        "intTime": 20090308, 
        "postID": 107, 
        "quote": "", 
        "reply": "I want the original Greek preface ”a” to be read in the same way in “atheist” as it is customarily read in such other Greco-English words as “amoral,” “atypical,” and “asymmetrical.” In this interpretation an atheist becomes: not someone who positively asserts the non-existence off God; but someone who is simply not a theist. We non-believers need to make up our own word describing ourselves. Agnostic; one who goes against the Gnostics, a long vanished religious sect remarkable for their narrow loss to Christianity in the great Cosmic game of Slap-Jack is not acceptable. I’m open to suggestion here... Infidel, just doesn’t sit right with me.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:19:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Originally posted by SteveDeHaven: Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence. You can't just twist my words, then try to make a point based upon that twist. There's a difference between \"we don't assume X\" and \"we assume NOT X.\"", 
        "intTime": 20090308, 
        "postID": 108, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Originally posted by SteveDeHaven: Since we see no evidence of something, we don't assume it exists. Yet you do assume it does not exist, because you haven't seen evidence.", 
        "reply": " You can't just twist my words, then try to make a point based upon that twist. There's a difference between \"we don't assume X\" and \"we assume NOT X.\"", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:20:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "As to the term \"atheist,\" I don't deny that it's accurate. But it's accurate in the same way that \"A-unicorn-ist\" is accurate, or that \"not insane\" is accurate. My point was, why define ourselves in terms of what we're NOT? I like the term \"Rationalist.\" It's a POSITIVE statement of what we are, rather than a statement of what we're not. I also like \"scientist\" in the sense that we are knowledge-oriented, but \"scientist\" has too many memetic connotations to be useful to the layman.", 
        "intTime": 20090308, 
        "postID": 109, 
        "quote": "", 
        "reply": "As to the term \"atheist,\" I don't deny that it's accurate. But it's accurate in the same way that \"A-unicorn-ist\" is accurate, or that \"not insane\" is accurate. My point was, why define ourselves in terms of what we're NOT? I like the term \"Rationalist.\" It's a POSITIVE statement of what we are, rather than a statement of what we're not. I also like \"scientist\" in the sense that we are knowledge-oriented, but \"scientist\" has too many memetic connotations to be useful to the layman.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:39:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "If Ron L. Hubbard and Brigham Young can start a new religion so can we. We can start the “Church of the Chrysalis.” We are all out there hanging on a limb and with luck some day we will all break out of our belief cocoons and fly away. We could have missionaries and send them out into the world to “rebribe” those poor misguided believers who were denied food, medicine and clothing until they became Christians. Offer them food, medicine and clothing up front and tell them to go back to their old ways and if they were cannibals to please wait until we have left. Those of you who wish to help in the forming of the “Church of the Chrysalis” please feel free to join us.", 
        "intTime": 20090308, 
        "postID": 110, 
        "quote": "", 
        "reply": "If Ron L. Hubbard and Brigham Young can start a new religion so can we. We can start the “Church of the Chrysalis.” We are all out there hanging on a limb and with luck some day we will all break out of our belief cocoons and fly away. We could have missionaries and send them out into the world to “rebribe” those poor misguided believers who were denied food, medicine and clothing until they became Christians. Offer them food, medicine and clothing up front and tell them to go back to their old ways and if they were cannibals to please wait until we have left. Those of you who wish to help in the forming of the “Church of the Chrysalis” please feel free to join us.", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 07:52:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "intTime": 20090308, 
        "postID": 111, 
        "quote": "", 
        "reply": "At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 08:13:00", 
        "title": "Atheism.....", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "intTime": 20090308, 
        "postID": 112, 
        "quote": "Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS).", 
        "reply": " Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 08:43:00", 
        "title": "Atheism.....", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash! Huh?", 
        "intTime": 20090308, 
        "postID": 113, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by SteveDeHaven: At the risk of being picky, it's \"L. Ron Hubbard\" who started Scientology, and Joseph Smith who started Mormonism (LDS). Oh! Well, thanks. It’s Sunday and I haven't had my Irish Cream in my coffee yet. It was you who sent me off to find the definition of “Memetic.” Boy!!! Was that a can of worms? I finally after much reading and thinking decided that “Memetic” was just another attempt by the religionist to create a science to prove beliefs were part of the human genetics. Balderdash!", 
        "reply": " Huh?", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 10:06:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }, 
    {
        "content": "How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "intTime": 20090308, 
        "postID": 114, 
        "quote": "", 
        "reply": "How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 10:43:00", 
        "title": "Atheism.....", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: We non-believers need to make up our own word describing ourselves. The only way to work this out is to choose a word that best describes you. Humanist, Secular Humanist, Naturalist (not Naturist), and Bright are all options you might like. Try to pick a label that works for you. Remember the good thing is no insecure, vain divine power is worried about what you label yourself. The only thing that really matters is that you successfully communicate to others the message you're trying to get across. Like I always frontload \"atheist\" if someone asks me my religion. They generally assume I am theistic in my beliefs, and I want to clear that up first. Then we can be more specific about what I do belief. ps. we did start one: Church of the Flying Spaghetti Monster (PBUNA) This message has been edited. Last edited by: stillkit, Mon 09 March 2009 04:22 AM", 
        "intTime": 20090308, 
        "postID": 115, 
        "quote": "Originally posted by Another4Truth: We non-believers need to make up our own word describing ourselves.", 
        "reply": " The only way to work this out is to choose a word that best describes you. Humanist, Secular Humanist, Naturalist (not Naturist), and Bright are all options you might like. Try to pick a label that works for you. Remember the good thing is no insecure, vain divine power is worried about what you label yourself. The only thing that really matters is that you successfully communicate to others the message you're trying to get across. Like I always frontload \"atheist\" if someone asks me my religion. They generally assume I am theistic in my beliefs, and I want to clear that up first. Then we can be more specific about what I do belief. ps. we did start one: Church of the Flying Spaghetti Monster (PBUNA) This message has been edited. Last edited by: stillkit, Mon 09 March 2009 04:22 AM", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 15:45:00", 
        "title": "Atheism.....", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by tawodi: How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T You guys.... Don't go around making up definitions for those things that are already defined. Memetic refers to meme. Main Entry from Merriam Webster: meme Pronunciation: \\ˈmēm\\ Function: noun Etymology: alteration of mimeme, from mim- (as in mimesis) + -eme Date: 1976 : an idea, behavior, style, or usage that spreads from person to person within a culture", 
        "intTime": 20090308, 
        "postID": 116, 
        "quote": "Originally posted by tawodi: How long ago was it that I gave a very simple definition of the word \"memetic\" Two months...three?? Oh well, here it is again. MEMETIC; Aphorism, derived from adding the letter \"M\" to EMETIC.....with the same results. NOT to be found in Webster's, Oxford's, Mirriam's or anybody else's dictionary, but MINE!! T", 
        "reply": " You guys.... Don't go around making up definitions for those things that are already defined. Memetic refers to meme. Main Entry from Merriam Webster: meme Pronunciation: \\ˈmēm\\ Function: noun Etymology: alteration of mimeme, from mim- (as in mimesis) + -eme Date: 1976 : an idea, behavior, style, or usage that spreads from person to person within a culture", 
        "threadID": "1270031990001_1480070712001", 
        "time": "2009-03-08 15:52:00", 
        "title": "Atheism.....", 
        "userID": "billbright"
    }
]