[
    {
        "content": "Last September, the Secular Coalition for America and our supporters lobbied the Department of Health and Human Services (HHS) to protect their rights to medical services from religious objectors by withdrawing the so-called \"conscience clause\" rule proposal. But, even though more than 200,000 Americans emailed HHS Secretary Michael Leavitt in opposition to this rule, the Bush Administration adopted the conscience clause as one of its last actions in office. Now, President Obama has directed his current HHS Secretary to rescind the conscience clause rule, but we need to make sure that the Obama Administration understands that there is no room for middle ground on this issue. Tell Obama's Acting Director of Health and Human Services that it is unethical for our government to encourage health care workers to deny important medical information and services to patients based on the perceived needs of a worker's religious beliefs. Moreover, it would be irresponsible for the government to permit religiously motivated workers receiving federal funds to compromise federal programs by refusing to carryout their responsibilities. TAKE ACTION NOW. Go to secular . org The conscience clause rule inappropriately places the religious beliefs of health care workers above the medical needs of their patients. Health care workers (whether they are doctors, pharmacists, technicians, or emergency medical technicians) are employed in the field of medicine, not spirituality. They have the right to consider their own religious beliefs in determining what medical decisions they make for their own care, but their personal religion should never infringe on the right of a patient to seek products or procedures that they have a legal right to obtain. Moreover, health care workers who have responsibilities for federally funded research or other programs should never be permitted to undermine a program for which they work because they have religious objections to the program.", 
        "intTime": 20090318, 
        "postID": 12, 
        "quote": "", 
        "reply": "Last September, the Secular Coalition for America and our supporters lobbied the Department of Health and Human Services (HHS) to protect their rights to medical services from religious objectors by withdrawing the so-called \"conscience clause\" rule proposal. But, even though more than 200,000 Americans emailed HHS Secretary Michael Leavitt in opposition to this rule, the Bush Administration adopted the conscience clause as one of its last actions in office. Now, President Obama has directed his current HHS Secretary to rescind the conscience clause rule, but we need to make sure that the Obama Administration understands that there is no room for middle ground on this issue. Tell Obama's Acting Director of Health and Human Services that it is unethical for our government to encourage health care workers to deny important medical information and services to patients based on the perceived needs of a worker's religious beliefs. Moreover, it would be irresponsible for the government to permit religiously motivated workers receiving federal funds to compromise federal programs by refusing to carryout their responsibilities. TAKE ACTION NOW. Go to secular . org The conscience clause rule inappropriately places the religious beliefs of health care workers above the medical needs of their patients. Health care workers (whether they are doctors, pharmacists, technicians, or emergency medical technicians) are employed in the field of medicine, not spirituality. They have the right to consider their own religious beliefs in determining what medical decisions they make for their own care, but their personal religion should never infringe on the right of a patient to seek products or procedures that they have a legal right to obtain. Moreover, health care workers who have responsibilities for federally funded research or other programs should never be permitted to undermine a program for which they work because they have religious objections to the program.", 
        "threadID": "1270031990001_3930034412001", 
        "time": "2009-03-18 12:52:00", 
        "title": "Sedition-Based Initiatives", 
        "userID": "billbright"
    }, 
    {
        "content": "I got this email today from the Secular Coalition: April 27, 2009 Dear Bill, I am writing to tell you about my meeting last week, along with other representatives of CARD (Coalition Against Religious Discrimination), with Joshua DuBois, the director of the White House Office of Faith-Based and Neighborhood Partnerships. I entered the meeting with very mixed emotions. Although I was glad that the Secular Coalition for America has the political connections to meet face-to-face with the person who runs President Obama's new faith-based office, I was saddened that this meeting was even taking place -- saddened that our new president has decided to continue the failed faith-based policies of his predecessor. The meeting was an open and often lively discussion of our concerns -- and each of us clearly expressed our disappointment that the Obama administration had decided to continue Bush's faith-based program without first dealing with the critical constitutional and civil rights problems it presents: direct funding of houses of worship, religious discrimination in hiring, and entangling secular and sectarian program content. I left the meeting with the same kind of mixed feelings I had going in. One the one hand, Mr. DuBois seemed sympathetic to our constitutional and civil rights concerns; on the other, it's clear we will have a long wait to see if and how these concerns are going to be addressed. Nearly three months after he was appointed to run it, DuBois told us the new faith-based office is still getting organized and they are just beginning their information collection and policy review. Unfortunately, until this process is complete, faith-based programs will continue to operate under the Bush administration rules. We face a very difficult challenge in getting this administration to address all our concerns, so we will continue to put pressure on the White House -- but this meeting did reinforce that we do now have a place at the table. As the cover story in the National Journal recently reported, In the past, politicians in Washington and elsewhere could largely ignore the Godless. But those days are over. With their numbers growing, nonbelievers are intent on pushing a political and legislative agenda governed more by cool reason than by faith. Thank you for your support and efforts that have helped to make this and many other meetings possible. Sincerely, Ron Millar, Acting Director Secular Coalition for America P.S. The Secular Coalition for America represents the interests of atheists, humanists, agnostics, freethinkers and other nontheists in our nation's capital. According to the latest ARIS study, our community is larger than Methodists, Lutherans, Presbyterians, Episcopalians, Mormons and Jews - combined.", 
        "intTime": 20090427, 
        "postID": 13, 
        "quote": "", 
        "reply": "I got this email today from the Secular Coalition: April 27, 2009 Dear Bill, I am writing to tell you about my meeting last week, along with other representatives of CARD (Coalition Against Religious Discrimination), with Joshua DuBois, the director of the White House Office of Faith-Based and Neighborhood Partnerships. I entered the meeting with very mixed emotions. Although I was glad that the Secular Coalition for America has the political connections to meet face-to-face with the person who runs President Obama's new faith-based office, I was saddened that this meeting was even taking place -- saddened that our new president has decided to continue the failed faith-based policies of his predecessor. The meeting was an open and often lively discussion of our concerns -- and each of us clearly expressed our disappointment that the Obama administration had decided to continue Bush's faith-based program without first dealing with the critical constitutional and civil rights problems it presents: direct funding of houses of worship, religious discrimination in hiring, and entangling secular and sectarian program content. I left the meeting with the same kind of mixed feelings I had going in. One the one hand, Mr. DuBois seemed sympathetic to our constitutional and civil rights concerns; on the other, it's clear we will have a long wait to see if and how these concerns are going to be addressed. Nearly three months after he was appointed to run it, DuBois told us the new faith-based office is still getting organized and they are just beginning their information collection and policy review. Unfortunately, until this process is complete, faith-based programs will continue to operate under the Bush administration rules. We face a very difficult challenge in getting this administration to address all our concerns, so we will continue to put pressure on the White House -- but this meeting did reinforce that we do now have a place at the table. As the cover story in the National Journal recently reported, In the past, politicians in Washington and elsewhere could largely ignore the Godless. But those days are over. With their numbers growing, nonbelievers are intent on pushing a political and legislative agenda governed more by cool reason than by faith. Thank you for your support and efforts that have helped to make this and many other meetings possible. Sincerely, Ron Millar, Acting Director Secular Coalition for America P.S. The Secular Coalition for America represents the interests of atheists, humanists, agnostics, freethinkers and other nontheists in our nation's capital. According to the latest ARIS study, our community is larger than Methodists, Lutherans, Presbyterians, Episcopalians, Mormons and Jews - combined.", 
        "threadID": "1270031990001_3930034412001", 
        "time": "2009-04-27 16:51:00", 
        "title": "Sedition-Based Initiatives", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Last September, the Secular Coalition for America and our supporters lobbied the Department of Health and Human Services (HHS) to protect their rights to medical services from religious objectors by withdrawing the so-called \"conscience clause\" rule proposal. But, even though more than 200,000 Americans emailed HHS Secretary Michael Leavitt in opposition to this rule, the Bush Administration adopted the conscience clause as one of its last actions in office. Now, President Obama has directed his current HHS Secretary to rescind the conscience clause rule, but we need to make sure that the Obama Administration understands that there is no room for middle ground on this issue. Tell Obama's Acting Director of Health and Human Services that it is unethical for our government to encourage health care workers to deny important medical information and services to patients based on the perceived needs of a worker's religious beliefs. Moreover, it would be irresponsible for the government to permit religiously motivated workers receiving federal funds to compromise federal programs by refusing to carryout their responsibilities. TAKE ACTION NOW. Go to secular . org The conscience clause rule inappropriately places the religious beliefs of health care workers above the medical needs of their patients. Health care workers (whether they are doctors, pharmacists, technicians, or emergency medical technicians) are employed in the field of medicine, not spirituality. They have the right to consider their own religious beliefs in determining what medical decisions they make for their own care, but their personal religion should never infringe on the right of a patient to seek products or procedures that they have a legal right to obtain. Moreover, health care workers who have responsibilities for federally funded research or other programs should never be permitted to undermine a program for which they work because they have religious objections to the program. So, what this says is that the far left radical element of secular thinkers want to force those with a moral conscience to kill babies or loose their jobs valuable to contributing to society...not to mention a total disreguard to ensuring the right to Life, Liberty and the pursuit of Happiness. - LegionSon -", 
        "intTime": 20090427, 
        "postID": 14, 
        "quote": "Originally posted by billbright: Last September, the Secular Coalition for America and our supporters lobbied the Department of Health and Human Services (HHS) to protect their rights to medical services from religious objectors by withdrawing the so-called \"conscience clause\" rule proposal. But, even though more than 200,000 Americans emailed HHS Secretary Michael Leavitt in opposition to this rule, the Bush Administration adopted the conscience clause as one of its last actions in office. Now, President Obama has directed his current HHS Secretary to rescind the conscience clause rule, but we need to make sure that the Obama Administration understands that there is no room for middle ground on this issue. Tell Obama's Acting Director of Health and Human Services that it is unethical for our government to encourage health care workers to deny important medical information and services to patients based on the perceived needs of a worker's religious beliefs. Moreover, it would be irresponsible for the government to permit religiously motivated workers receiving federal funds to compromise federal programs by refusing to carryout their responsibilities. TAKE ACTION NOW. Go to secular . org The conscience clause rule inappropriately places the religious beliefs of health care workers above the medical needs of their patients. Health care workers (whether they are doctors, pharmacists, technicians, or emergency medical technicians) are employed in the field of medicine, not spirituality. They have the right to consider their own religious beliefs in determining what medical decisions they make for their own care, but their personal religion should never infringe on the right of a patient to seek products or procedures that they have a legal right to obtain. Moreover, health care workers who have responsibilities for federally funded research or other programs should never be permitted to undermine a program for which they work because they have religious objections to the program.", 
        "reply": " So, what this says is that the far left radical element of secular thinkers want to force those with a moral conscience to kill babies or loose their jobs valuable to contributing to society...not to mention a total disreguard to ensuring the right to Life, Liberty and the pursuit of Happiness. - LegionSon -", 
        "threadID": "1270031990001_3930034412001", 
        "time": "2009-04-27 21:06:00", 
        "title": "Sedition-Based Initiatives", 
        "userID": "LegionSon"
    }, 
    {
        "content": "quote: So, what this says is that the far left radical element of secular thinkers want to force those with a moral conscience to kill babies or loose their jobs valuable to contributing to society...not to mention a total disreguard to ensuring the right to Life, Liberty and the pursuit of Happiness. - LegionSon - The left isn't trying to get the right to kill their babies. The left is saying it shouldn't be the rights choice to stop them from selecting a more expedient means of dealing with an unwanted pregnancy. If you think about it, LS, the more women on the left that have abortions, the fewer liberals there might be. Likewise, if you encourage the discontinuance of birth control among righties, then maybe the more conservatives there would be in the future. Who knows, maybe the conservative might breed their way back into power someday.... while the left aborts itself into extinction. You know, survival of the fittest. The right can certainly have their 'pursuits', the left just doesn't want them forcing others to do it 'their way' - the 'right' way. What valuable jobs would the 'radical left' want the 'right wingers' to lose? Abortion bombing? Gay torture? What? You are a Christian, give me some honest evidence.", 
        "intTime": 20090427, 
        "postID": 15, 
        "quote": "So, what this says is that the far left radical element of secular thinkers want to force those with a moral conscience to kill babies or loose their jobs valuable to contributing to society...not to mention a total disreguard to ensuring the right to Life, Liberty and the pursuit of Happiness. - LegionSon -", 
        "reply": " The left isn't trying to get the right to kill their babies. The left is saying it shouldn't be the rights choice to stop them from selecting a more expedient means of dealing with an unwanted pregnancy. If you think about it, LS, the more women on the left that have abortions, the fewer liberals there might be. Likewise, if you encourage the discontinuance of birth control among righties, then maybe the more conservatives there would be in the future. Who knows, maybe the conservative might breed their way back into power someday.... while the left aborts itself into extinction. You know, survival of the fittest. The right can certainly have their 'pursuits', the left just doesn't want them forcing others to do it 'their way' - the 'right' way. What valuable jobs would the 'radical left' want the 'right wingers' to lose? Abortion bombing? Gay torture? What? You are a Christian, give me some honest evidence.", 
        "threadID": "1270031990001_3930034412001", 
        "time": "2009-04-27 21:47:00", 
        "title": "Sedition-Based Initiatives", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: quote: Originally posted by billbright: Last September, the Secular Coalition for America and our supporters lobbied the Department of Health and Human Services (HHS) to protect their rights to medical services from religious objectors by withdrawing the so-called \"conscience clause\" rule proposal. But, even though more than 200,000 Americans emailed HHS Secretary Michael Leavitt in opposition to this rule, the Bush Administration adopted the conscience clause as one of its last actions in office. Now, President Obama has directed his current HHS Secretary to rescind the conscience clause rule, but we need to make sure that the Obama Administration understands that there is no room for middle ground on this issue. Tell Obama's Acting Director of Health and Human Services that it is unethical for our government to encourage health care workers to deny important medical information and services to patients based on the perceived needs of a worker's religious beliefs. Moreover, it would be irresponsible for the government to permit religiously motivated workers receiving federal funds to compromise federal programs by refusing to carryout their responsibilities. TAKE ACTION NOW. Go to secular . org The conscience clause rule inappropriately places the religious beliefs of health care workers above the medical needs of their patients. Health care workers (whether they are doctors, pharmacists, technicians, or emergency medical technicians) are employed in the field of medicine, not spirituality. They have the right to consider their own religious beliefs in determining what medical decisions they make for their own care, but their personal religion should never infringe on the right of a patient to seek products or procedures that they have a legal right to obtain. Moreover, health care workers who have responsibilities for federally funded research or other programs should never be permitted to undermine a program for which they work because they have religious objections to the program. So, what this says is that the far left radical element of secular thinkers want to force those with a moral conscience to kill babies or loose their jobs valuable to contributing to society...not to mention a total disreguard to ensuring the right to Life, Liberty and the pursuit of Happiness. - LegionSon - I hardly think you can refer to the author of that letter as a \"far left radical.\" Mr. Millar is a righteous man who is trying to hold the line against a religious onslaught on the rights, everybody's rights, protected by the Constitution and Bill of Rights. President Bush gave away much of the separation of secular belief and government law by disobeying the Constitution and creating the offices of Faith-Based Initiatives. His successor has chosen to overlook this lapse, this presidential excess, and to continue the programs, thereby weakening our country and opening us up to Dominionism. It's a mistake that will weaken democracy.", 
        "intTime": 20090428, 
        "postID": 16, 
        "quote": "Originally posted by LegionSon: quote: Originally posted by billbright: Last September, the Secular Coalition for America and our supporters lobbied the Department of Health and Human Services (HHS) to protect their rights to medical services from religious objectors by withdrawing the so-called \"conscience clause\" rule proposal. But, even though more than 200,000 Americans emailed HHS Secretary Michael Leavitt in opposition to this rule, the Bush Administration adopted the conscience clause as one of its last actions in office. Now, President Obama has directed his current HHS Secretary to rescind the conscience clause rule, but we need to make sure that the Obama Administration understands that there is no room for middle ground on this issue. Tell Obama's Acting Director of Health and Human Services that it is unethical for our government to encourage health care workers to deny important medical information and services to patients based on the perceived needs of a worker's religious beliefs. Moreover, it would be irresponsible for the government to permit religiously motivated workers receiving federal funds to compromise federal programs by refusing to carryout their responsibilities. TAKE ACTION NOW. Go to secular . org The conscience clause rule inappropriately places the religious beliefs of health care workers above the medical needs of their patients. Health care workers (whether they are doctors, pharmacists, technicians, or emergency medical technicians) are employed in the field of medicine, not spirituality. They have the right to consider their own religious beliefs in determining what medical decisions they make for their own care, but their personal religion should never infringe on the right of a patient to seek products or procedures that they have a legal right to obtain. Moreover, health care workers who have responsibilities for federally funded research or other programs should never be permitted to undermine a program for which they work because they have religious objections to the program. So, what this says is that the far left radical element of secular thinkers want to force those with a moral conscience to kill babies or loose their jobs valuable to contributing to society...not to mention a total disreguard to ensuring the right to Life, Liberty and the pursuit of Happiness. - LegionSon -", 
        "reply": " I hardly think you can refer to the author of that letter as a \"far left radical.\" Mr. Millar is a righteous man who is trying to hold the line against a religious onslaught on the rights, everybody's rights, protected by the Constitution and Bill of Rights. President Bush gave away much of the separation of secular belief and government law by disobeying the Constitution and creating the offices of Faith-Based Initiatives. His successor has chosen to overlook this lapse, this presidential excess, and to continue the programs, thereby weakening our country and opening us up to Dominionism. It's a mistake that will weaken democracy.", 
        "threadID": "1270031990001_3930034412001", 
        "time": "2009-04-28 15:57:00", 
        "title": "Sedition-Based Initiatives", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by LegionSon: -snip- So, what this says is that the far left radical element of secular thinkers want to force those with a moral conscience to kill babies or loose their jobs valuable to contributing to society...not to mention a total disreguard to ensuring the right to Life, Liberty and the pursuit of Happiness. - LegionSon - No what they are saying is if you take a job and take the money to do the job then you should DO IT. If you consider the job as being against your moral beliefs then stand up for your beliefs and DON'T TAKE THE JOB AND THE MONEY. This message has been edited. Last edited by: rayld2, Fri 01 May 2009 10:37 PM", 
        "intTime": 20090501, 
        "postID": 17, 
        "quote": "Originally posted by LegionSon: -snip- So, what this says is that the far left radical element of secular thinkers want to force those with a moral conscience to kill babies or loose their jobs valuable to contributing to society...not to mention a total disreguard to ensuring the right to Life, Liberty and the pursuit of Happiness. - LegionSon -", 
        "reply": " No what they are saying is if you take a job and take the money to do the job then you should DO IT. If you consider the job as being against your moral beliefs then stand up for your beliefs and DON'T TAKE THE JOB AND THE MONEY. This message has been edited. Last edited by: rayld2, Fri 01 May 2009 10:37 PM", 
        "threadID": "1270031990001_3930034412001", 
        "time": "2009-05-01 12:36:00", 
        "title": "Sedition-Based Initiatives", 
        "userID": "rayld2"
    }
]