[
    {
        "content": "quote: In the days surrounding the U.S. invasion of Iraq, cover sheets-like the ones in this exclusive GQ.com slideshow-began adorning top-secret intelligence briefings produced by Donald Rumsfeld's Pentagon. The sheets juxtaposed war images with inspirational Bible quotes and were delivered by Rumsfeld himself to the White House... men.style.com/gq/features/topsecret Nauseating, but typical.", 
        "intTime": 20090517, 
        "postID": 1, 
        "quote": "In the days surrounding the U.S. invasion of Iraq, cover sheets-like the ones in this exclusive GQ.com slideshow-began adorning top-secret intelligence briefings produced by Donald Rumsfeld's Pentagon. The sheets juxtaposed war images with inspirational Bible quotes and were delivered by Rumsfeld himself to the White House...", 
        "reply": " men.style.com/gq/features/topsecret Nauseating, but typical.", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-17 10:09:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "benjdm"
    }, 
    {
        "content": "Itwould be interesting indeed to see how these, if real, got out into the public domain. And what would happen if anything to the one or one's who leaked them to the press. Probably nothing, as nothing ever has, except to Skeeter who never leaked anything anyway!! But he was a miserable piece of republican S### anyway so who cares!! Right???? Right!!!", 
        "intTime": 20090517, 
        "postID": 2, 
        "quote": "", 
        "reply": "Itwould be interesting indeed to see how these, if real, got out into the public domain. And what would happen if anything to the one or one's who leaked them to the press. Probably nothing, as nothing ever has, except to Skeeter who never leaked anything anyway!! But he was a miserable piece of republican S### anyway so who cares!! Right???? Right!!!", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-17 10:51:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Itwould be interesting indeed to see how these, if real, got out into the public domain. And what would happen if anything to the one or one's who leaked them to the press. Probably nothing, as nothing ever has, except to Skeeter who never leaked anything anyway!! But he was a miserable piece of republican S### anyway so who cares!! Right???? Right!!! They don't actually contain any information, so they should not be in any way classified. What is sad is that creating these cover sheets was probably the primary function of some bicycle-seat sniffing staff officer. I'm glad we're paying people to produce these things when a simple Top Secret coversheet will do.", 
        "intTime": 20090517, 
        "postID": 3, 
        "quote": "Originally posted by tawodi: Itwould be interesting indeed to see how these, if real, got out into the public domain. And what would happen if anything to the one or one's who leaked them to the press. Probably nothing, as nothing ever has, except to Skeeter who never leaked anything anyway!! But he was a miserable piece of republican S### anyway so who cares!! Right???? Right!!!", 
        "reply": " They don't actually contain any information, so they should not be in any way classified. What is sad is that creating these cover sheets was probably the primary function of some bicycle-seat sniffing staff officer. I'm glad we're paying people to produce these things when a simple Top Secret coversheet will do.", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-17 11:01:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "AKinNC"
    }, 
    {
        "content": "A.K.; Don't misunderstand me I think they are rediculous as you probably do!! But why were they leaked, except to make some body feel superior?? Whoever that person is, or that organisation is, has serious problems with life in general, I would think!! T", 
        "intTime": 20090517, 
        "postID": 4, 
        "quote": "", 
        "reply": "A.K.; Don't misunderstand me I think they are rediculous as you probably do!! But why were they leaked, except to make some body feel superior?? Whoever that person is, or that organisation is, has serious problems with life in general, I would think!! T", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-17 11:19:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Itwould be interesting indeed to see how these, if real, got out into the public domain. men.style.com/gq/features/full?id=content_9217 quote: ...But one government official was disturbed enough by these biblically seasoned sheets to hold on to copies, which I obtained recently while debriefing the past eight years with those who lived them inside the West Wing and the Pentagon... Nothing has or should happen to the people who leaked them.", 
        "intTime": 20090517, 
        "postID": 5, 
        "quote": "Originally posted by tawodi: Itwould be interesting indeed to see how these, if real, got out into the public domain.", 
        "reply": " men.style.com/gq/features/full?id=content_9217 quote: ...But one government official was disturbed enough by these biblically seasoned sheets to hold on to copies, which I obtained recently while debriefing the past eight years with those who lived them inside the West Wing and the Pentagon... Nothing has or should happen to the people who leaked them.", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-17 14:45:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "benjdm"
    }, 
    {
        "content": "T, If the person had leaked classified info, I'd be upset. In this case, they merely released what I'm guessing would otherwise be FOIA type stuff. What were there motives? I'm guessing they wanted to show the world what kind of sillyness is being presented to senior leadership. When I read this, I can't help but think of the response the Bush White House gave after it was revealed that their office had leaked the name of a CIA operative in spite. Their response was \"Who told you about this...that's classified! We're going to crucify the person who essentially told the truth that we broke the law and set this family up for failure by revealing their nature...!\" The real issue here is not that someone exposed what should be a public document, but that there is a festering crusader type mentality within the highest ranks of our government. Why would there be a need to include such a cover sheet in the first place? I don't know what the motives where of the person who released this, other than to reinforce what we already knew...that the previous administration had more than a nodding relationship with fundamentalists who put their own agenda in front of what was best for America.", 
        "intTime": 20090517, 
        "postID": 6, 
        "quote": "", 
        "reply": "T, If the person had leaked classified info, I'd be upset. In this case, they merely released what I'm guessing would otherwise be FOIA type stuff. What were there motives? I'm guessing they wanted to show the world what kind of sillyness is being presented to senior leadership. When I read this, I can't help but think of the response the Bush White House gave after it was revealed that their office had leaked the name of a CIA operative in spite. Their response was \"Who told you about this...that's classified! We're going to crucify the person who essentially told the truth that we broke the law and set this family up for failure by revealing their nature...!\" The real issue here is not that someone exposed what should be a public document, but that there is a festering crusader type mentality within the highest ranks of our government. Why would there be a need to include such a cover sheet in the first place? I don't know what the motives where of the person who released this, other than to reinforce what we already knew...that the previous administration had more than a nodding relationship with fundamentalists who put their own agenda in front of what was best for America.", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-17 16:32:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "AKinNC"
    }, 
    {
        "content": "If you are talking about Valery Plame go back and check the facts! It was a reporter who \"leaked\" her name and TOLD THE SPECIAL PROSECUTER HE HAD DONE SO!!! After all the investigation when Scooter Libby was finally charged with \"lying to investigators\" and found guilty, it came out he had NOTHING to lie about, as there was never a crime!! This is why Bush cancelled his jail time. Once again, a mis-step by Bush. Libby should have gotten a complete pardon it was a \"monkey trial\"!! Just one more example of what the Bush White house had to deal with from Jumpin' Jim Jeffords, and all the rest of the way through their administration. All of us have been in \"circle the wagon\" positions, revisit the Clinton white house years and observe the absolute foolishness displayed by them and lapped up by the press!! This is what is principally wrong with the country now. Most have lost the ability to think rationally and simply fall back on partisan hack, stock phrases in substitution for critical thinking. This is why I can, in part, agree that these covers are foolish but harmless, while those with an agenda can not! T", 
        "intTime": 20090517, 
        "postID": 7, 
        "quote": "", 
        "reply": "If you are talking about Valery Plame go back and check the facts! It was a reporter who \"leaked\" her name and TOLD THE SPECIAL PROSECUTER HE HAD DONE SO!!! After all the investigation when Scooter Libby was finally charged with \"lying to investigators\" and found guilty, it came out he had NOTHING to lie about, as there was never a crime!! This is why Bush cancelled his jail time. Once again, a mis-step by Bush. Libby should have gotten a complete pardon it was a \"monkey trial\"!! Just one more example of what the Bush White house had to deal with from Jumpin' Jim Jeffords, and all the rest of the way through their administration. All of us have been in \"circle the wagon\" positions, revisit the Clinton white house years and observe the absolute foolishness displayed by them and lapped up by the press!! This is what is principally wrong with the country now. Most have lost the ability to think rationally and simply fall back on partisan hack, stock phrases in substitution for critical thinking. This is why I can, in part, agree that these covers are foolish but harmless, while those with an agenda can not! T", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-17 20:42:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: This is why I can, in part, agree that these covers are foolish but harmless, while those with an agenda can not! They absolutely are not harmless. When God sanctions killing, people listen. \"www.psychologicalscience.org/media/releases/2007/bushman.cfm\" quote: ...After reporting their religious affiliation and beliefs, the participants read a parable adapted from a relatively obscure passage in the King James Bible describing the brutal torture and murder of a woman, and her husband's subsequent revenge on her attackers. Half of the participants were told that the passage came from the Book of Judges in the Old Testament while the other half were told it was an ancient scroll discovered in an archaeological expedition... The winner of the task would be able to \"blast\" his or her partner with noise up to 105 decibels, about the same volume as a fire alarm. The test measures aggression. As expected, the Brigham Young students were more aggressive (i.e. louder) with their blasts if they had been told that the passage they had previously read was from the bible rather than a scroll. Likewise, participants were more aggressive if they had read the additional verse that depicts God sanctioning violence. At the more secular Vrije Universiteit, the results were surprisingly similar. Although Vrije students were less likely to be influenced by the source of the material, they blasted more aggressively when the passage that they read included the sanctioning of the violence by God. This finding held true even for non-believers, though to a lesser extent. The whole reason for those quotes was to impair the judgment of those who held the Bible as authoritative.", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": "Originally posted by tawodi: This is why I can, in part, agree that these covers are foolish but harmless, while those with an agenda can not!", 
        "reply": " They absolutely are not harmless. When God sanctions killing, people listen. \"www.psychologicalscience.org/media/releases/2007/bushman.cfm\" quote: ...After reporting their religious affiliation and beliefs, the participants read a parable adapted from a relatively obscure passage in the King James Bible describing the brutal torture and murder of a woman, and her husband's subsequent revenge on her attackers. Half of the participants were told that the passage came from the Book of Judges in the Old Testament while the other half were told it was an ancient scroll discovered in an archaeological expedition... The winner of the task would be able to \"blast\" his or her partner with noise up to 105 decibels, about the same volume as a fire alarm. The test measures aggression. As expected, the Brigham Young students were more aggressive (i.e. louder) with their blasts if they had been told that the passage they had previously read was from the bible rather than a scroll. Likewise, participants were more aggressive if they had read the additional verse that depicts God sanctioning violence. At the more secular Vrije Universiteit, the results were surprisingly similar. Although Vrije students were less likely to be influenced by the source of the material, they blasted more aggressively when the passage that they read included the sanctioning of the violence by God. This finding held true even for non-believers, though to a lesser extent. The whole reason for those quotes was to impair the judgment of those who held the Bible as authoritative.", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-18 07:27:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "benjdm"
    }, 
    {
        "content": "quote: Originally posted by tawodi: If you are talking about Valery Plame go back and check the facts! It was a reporter who \"leaked\" her name and TOLD THE SPECIAL PROSECUTER HE HAD DONE SO!!! After all the investigation when Scooter Libby was finally charged with \"lying to investigators\" and found guilty, it came out he had NOTHING to lie about, as there was never a crime!! This is why Bush cancelled his jail time. Once again, a mis-step by Bush. Libby should have gotten a complete pardon it was a \"monkey trial\"!! Just one more example of what the Bush White house had to deal with from Jumpin' Jim Jeffords, and all the rest of the way through their administration. All of us have been in \"circle the wagon\" positions, revisit the Clinton white house years and observe the absolute foolishness displayed by them and lapped up by the press!! This is what is principally wrong with the country now. Most have lost the ability to think rationally and simply fall back on partisan hack, stock phrases in substitution for critical thinking. This is why I can, in part, agree that these covers are foolish but harmless, while those with an agenda can not! T And it was the Bush WH that leaked her name to the press... However, I don't think we will ever get the truth, since honesty is a trait that is about as foreign to politicians as dry air in DC in the summertime. That's all politicians, mind you, including Willy and Co. I also disagree that they are harmless. They do nothing but support the crusader mentality. I'm sure if the POTUS saw them, he would not have taken offense at all, since he claimed that God told him to kill OBL and Saddam. I'm curious why God would go through the trouble of telling the POTUS to kill someone when he could just do it old school and wipe them out with a bolt of lightning. If I claim I hear voices, I'm crazy. If the president hears voices from God, he is...pious and faithful???", 
        "intTime": 20090518, 
        "postID": 9, 
        "quote": "Originally posted by tawodi: If you are talking about Valery Plame go back and check the facts! It was a reporter who \"leaked\" her name and TOLD THE SPECIAL PROSECUTER HE HAD DONE SO!!! After all the investigation when Scooter Libby was finally charged with \"lying to investigators\" and found guilty, it came out he had NOTHING to lie about, as there was never a crime!! This is why Bush cancelled his jail time. Once again, a mis-step by Bush. Libby should have gotten a complete pardon it was a \"monkey trial\"!! Just one more example of what the Bush White house had to deal with from Jumpin' Jim Jeffords, and all the rest of the way through their administration. All of us have been in \"circle the wagon\" positions, revisit the Clinton white house years and observe the absolute foolishness displayed by them and lapped up by the press!! This is what is principally wrong with the country now. Most have lost the ability to think rationally and simply fall back on partisan hack, stock phrases in substitution for critical thinking. This is why I can, in part, agree that these covers are foolish but harmless, while those with an agenda can not! T", 
        "reply": " And it was the Bush WH that leaked her name to the press... However, I don't think we will ever get the truth, since honesty is a trait that is about as foreign to politicians as dry air in DC in the summertime. That's all politicians, mind you, including Willy and Co. I also disagree that they are harmless. They do nothing but support the crusader mentality. I'm sure if the POTUS saw them, he would not have taken offense at all, since he claimed that God told him to kill OBL and Saddam. I'm curious why God would go through the trouble of telling the POTUS to kill someone when he could just do it old school and wipe them out with a bolt of lightning. If I claim I hear voices, I'm crazy. If the president hears voices from God, he is...pious and faithful???", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-18 09:16:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "AKinNC"
    }, 
    {
        "content": "Can you post the publication that quoted him so I can research the attributions please? I have never been able to find these and I have looked several times. I have seen many posts alledging this but have not been able to find the publication they appeared in. T", 
        "intTime": 20090518, 
        "postID": 10, 
        "quote": "", 
        "reply": "Can you post the publication that quoted him so I can research the attributions please? I have never been able to find these and I have looked several times. I have seen many posts alledging this but have not been able to find the publication they appeared in. T", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-18 11:04:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Can you post the publication that quoted him so I can research the attributions please? I have never been able to find these and I have looked several times. I have seen many posts alledging this but have not been able to find the publication they appeared in. T Kind of scant pickings, but I'll give you what I can find... 'http://baltimorechronicle.com/2005/092905Hussain.shtml' 'http://www.washingtonpost.com/wp-dyn/content/article/2005/10/13/AR2005101301688.html' 'http://www.washingtonpost.com/wp-dyn/content/article/2005/10/08/AR2005100801094.html' The original conversation took place between Bush and Abbas during a meeting. There is considerable controversy (as you can imagine) with the WH staff denying that he said that.", 
        "intTime": 20090518, 
        "postID": 11, 
        "quote": "Originally posted by tawodi: Can you post the publication that quoted him so I can research the attributions please? I have never been able to find these and I have looked several times. I have seen many posts alledging this but have not been able to find the publication they appeared in. T", 
        "reply": " Kind of scant pickings, but I'll give you what I can find... 'http://baltimorechronicle.com/2005/092905Hussain.shtml' 'http://www.washingtonpost.com/wp-dyn/content/article/2005/10/13/AR2005101301688.html' 'http://www.washingtonpost.com/wp-dyn/content/article/2005/10/08/AR2005100801094.html' The original conversation took place between Bush and Abbas during a meeting. There is considerable controversy (as you can imagine) with the WH staff denying that he said that.", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-18 16:14:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "AKinNC"
    }, 
    {
        "content": "Thanks!!", 
        "intTime": 20090518, 
        "postID": 12, 
        "quote": "", 
        "reply": "Thanks!!", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-18 21:08:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Thanks!! It was difficult to find sources outside of the really loopy sites! But I respect you too much to try to pass something off on you from obvious wingnuts! The first site is a little 'opinionated', but not as much as some.", 
        "intTime": 20090519, 
        "postID": 13, 
        "quote": "Originally posted by tawodi: Thanks!!", 
        "reply": " It was difficult to find sources outside of the really loopy sites! But I respect you too much to try to pass something off on you from obvious wingnuts! The first site is a little 'opinionated', but not as much as some.", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-19 03:48:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "AKinNC"
    }, 
    {
        "content": "I can sort through opinions aslong as the content of the sound \"bite\" is intact. For this kind of comment it isn't even necessary for the context to be provided as it is clear even with out context. The statements were made and even if the man felt called in some way, they never should have been uttered. T", 
        "intTime": 20090519, 
        "postID": 14, 
        "quote": "", 
        "reply": "I can sort through opinions aslong as the content of the sound \"bite\" is intact. For this kind of comment it isn't even necessary for the context to be provided as it is clear even with out context. The statements were made and even if the man felt called in some way, they never should have been uttered. T", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-19 07:30:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "\"Hmm Mr. President, we need something to distract people with and blame Bush for.\" \"What about these Bible quotes on these old briefing covers.\" \"Great thinking, whiny liberals will eat this stuff up. Clearly it is a plot by the evil religious right to take over the world! How dare they be politically incorrect and mention God or the Bible?\" \"Could you print off another five billion while your at it?\"", 
        "intTime": 20090519, 
        "postID": 15, 
        "quote": "", 
        "reply": "\"Hmm Mr. President, we need something to distract people with and blame Bush for.\" \"What about these Bible quotes on these old briefing covers.\" \"Great thinking, whiny liberals will eat this stuff up. Clearly it is a plot by the evil religious right to take over the world! How dare they be politically incorrect and mention God or the Bible?\" \"Could you print off another five billion while your at it?\"", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-19 11:48:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "ReconTeam"
    }, 
    {
        "content": "RECONTEAM; You and I are in agreement on this, but it is what it is, if you don't want to be shot at, don't give the opposition ammunition. T", 
        "intTime": 20090519, 
        "postID": 16, 
        "quote": "", 
        "reply": "RECONTEAM; You and I are in agreement on this, but it is what it is, if you don't want to be shot at, don't give the opposition ammunition. T", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-19 12:19:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "You know there were many times when I would watch Bush earnestly trying to answer questions about his faith and I would cringe because he never really did get it. They only wanted to create other reasons for their buddies and hangers on to laugh at him. When he first voiced and then insisted on \"a new tone in Washington\" I knew he would never get past a certain point. As the republicans proved after Newt Gingrich they simply cannot stand not being invited to all the insider parties and soir'es in Dizzy City and you WON'T be, unless you are part of the elite, and the elite eventually goes along with the liberal left and their buddies, in and of the press, and lamesteream media. As Kronkite loved to say \"And that's the way it is!\" and ain't THAT just too friggin' true!! that's the way it is, SUCK ON IT FOOL!!!! God the next few years are gonna suck!!!", 
        "intTime": 20090522, 
        "postID": 17, 
        "quote": "", 
        "reply": "You know there were many times when I would watch Bush earnestly trying to answer questions about his faith and I would cringe because he never really did get it. They only wanted to create other reasons for their buddies and hangers on to laugh at him. When he first voiced and then insisted on \"a new tone in Washington\" I knew he would never get past a certain point. As the republicans proved after Newt Gingrich they simply cannot stand not being invited to all the insider parties and soir'es in Dizzy City and you WON'T be, unless you are part of the elite, and the elite eventually goes along with the liberal left and their buddies, in and of the press, and lamesteream media. As Kronkite loved to say \"And that's the way it is!\" and ain't THAT just too friggin' true!! that's the way it is, SUCK ON IT FOOL!!!! God the next few years are gonna suck!!!", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-22 06:36:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "I thought it was great when Bush, at the end of his term and the beginning of our salvation, said he believed the Bible and evolution were compatible. The final nail in the fundamentalist evangelical support. He used Christians as political tools. That's how I know it's the end times. \"Many shall be deceived.\"", 
        "intTime": 20090522, 
        "postID": 18, 
        "quote": "", 
        "reply": "I thought it was great when Bush, at the end of his term and the beginning of our salvation, said he believed the Bible and evolution were compatible. The final nail in the fundamentalist evangelical support. He used Christians as political tools. That's how I know it's the end times. \"Many shall be deceived.\"", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-22 11:10:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "reducetension"
    }, 
    {
        "content": "Ya know, if you were riding by me on a horse, I would bet nobody could tell which direction you were going.", 
        "intTime": 20090522, 
        "postID": 19, 
        "quote": "", 
        "reply": "Ya know, if you were riding by me on a horse, I would bet nobody could tell which direction you were going.", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-22 16:24:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "tawodi"
    }, 
    {
        "content": "hnn.us/roundup/entries/87247.html quote: ...In 2003 while lobbying leaders to put together the Coalition of the Willing, President Bush spoke to France's President Jacques Chirac. Bush wove a story about how the Biblical creatures Gog and Magog were at work in the Middle East and how they must be defeated. Bush believed the time had now come for that battle, telling Chirac: \"This confrontation is willed by God, who wants to use this conflict to erase his people's enemies before a New Age begins\". The story of the conversation emerged only because the Elyse Palace, baffled by Bush's words, sought advice from Thomas Romer, a professor of theology at the University of Lausanne. Four years later, Romer gave an account in the September 2007 issue of the university's review, Allez savoir. The article apparently went unnoticed, although it was referred to in a French newspaper. The story has now been confirmed by Chirac himself in a new book...", 
        "intTime": 20090529, 
        "postID": 20, 
        "quote": "...In 2003 while lobbying leaders to put together the Coalition of the Willing, President Bush spoke to France's President Jacques Chirac. Bush wove a story about how the Biblical creatures Gog and Magog were at work in the Middle East and how they must be defeated. Bush believed the time had now come for that battle, telling Chirac: \"This confrontation is willed by God, who wants to use this conflict to erase his people's enemies before a New Age begins\". The story of the conversation emerged only because the Elyse Palace, baffled by Bush's words, sought advice from Thomas Romer, a professor of theology at the University of Lausanne. Four years later, Romer gave an account in the September 2007 issue of the university's review, Allez savoir. The article apparently went unnoticed, although it was referred to in a French newspaper. The story has now been confirmed by Chirac himself in a new book...", 
        "reply": "hnn.us/roundup/entries/87247.html ", 
        "threadID": "1270031990001_5800015322001", 
        "time": "2009-05-29 06:57:00", 
        "title": "Disturbing Briefing Covers", 
        "userID": "benjdm"
    }
]