[
    {
        "content": "I AM SO GLAD I LIVE IN A COUNTRY THAT ALLOWS AND SUPPORTS FREEDOM OF RELIGION !!!", 
        "intTime": 20090418, 
        "postID": 7, 
        "quote": "", 
        "reply": "I AM SO GLAD I LIVE IN A COUNTRY THAT ALLOWS AND SUPPORTS FREEDOM OF RELIGION !!!", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-18 15:30:00", 
        "title": "Bewitching World", 
        "userID": "DoD_Sim"
    }, 
    {
        "content": "So am I, but I still can't see what any of this has to do with religion in the military.", 
        "intTime": 20090419, 
        "postID": 8, 
        "quote": "", 
        "reply": "So am I, but I still can't see what any of this has to do with religion in the military.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-19 07:27:00", 
        "title": "Bewitching World", 
        "userID": "tawodi"
    }, 
    {
        "content": "Well, it probably has a lot to do with the study of external cultural behaviors in ones own quest to be more tolerant of similar behaviors inside ones own cultural structure. . Or, we are interested in the human condition and are studying lower behavior in the sense that we might see a way to eliminate unnecessary burden and injustice. Personally, I live with clear intention to improve the human condition. All human behavior is very interesting to me, especially matters of oppression and intolerance.", 
        "intTime": 20090419, 
        "postID": 9, 
        "quote": "", 
        "reply": "Well, it probably has a lot to do with the study of external cultural behaviors in ones own quest to be more tolerant of similar behaviors inside ones own cultural structure. . Or, we are interested in the human condition and are studying lower behavior in the sense that we might see a way to eliminate unnecessary burden and injustice. Personally, I live with clear intention to improve the human condition. All human behavior is very interesting to me, especially matters of oppression and intolerance.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-19 12:18:00", 
        "title": "Bewitching World", 
        "userID": "DoD_Sim"
    }, 
    {
        "content": "quote: Originally posted by tawodi: So am I, but I still can't see what any of this has to do with religion in the military. Bruce, most of the threads in this forum have nothing to do specifically with religion in the military. I've seen plenty of discussions from people of several different religions, none of which specifically address the practice of religion in the military. Really, this is (or has become) pretty much a forum for military personnel, veterans, and military family members to discuss religion in general. If we had to remove any thread that didn't specifically have to do with religion in the military, we'd have to delete easily over 90% of this forum. Here's a twist for this discussion to bring it back to the military... I've seen lots of Christian bookstores and resource centers near military bases. That's all fine and good, of course. However, I've never seen a pagan supply center within easy access of a military base. I'm curious... if someone were to open such a store not far outside the gates of a military base, how much would they have to endure harassment and protests from the ignorant masses who think they're practicing Satanism and want to run them out of town? I've noticed a lot of open hostility towards earth-based religions on military bases.", 
        "intTime": 20090419, 
        "postID": 10, 
        "quote": "Originally posted by tawodi: So am I, but I still can't see what any of this has to do with religion in the military.", 
        "reply": " Bruce, most of the threads in this forum have nothing to do specifically with religion in the military. I've seen plenty of discussions from people of several different religions, none of which specifically address the practice of religion in the military. Really, this is (or has become) pretty much a forum for military personnel, veterans, and military family members to discuss religion in general. If we had to remove any thread that didn't specifically have to do with religion in the military, we'd have to delete easily over 90% of this forum. Here's a twist for this discussion to bring it back to the military... I've seen lots of Christian bookstores and resource centers near military bases. That's all fine and good, of course. However, I've never seen a pagan supply center within easy access of a military base. I'm curious... if someone were to open such a store not far outside the gates of a military base, how much would they have to endure harassment and protests from the ignorant masses who think they're practicing Satanism and want to run them out of town? I've noticed a lot of open hostility towards earth-based religions on military bases.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-19 13:07:00", 
        "title": "Bewitching World", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "I guess, Peas, we can't count the pagan worship of the female form at the many topless dancing places that locate close the gates of the two big bases I work at? The worship of sex still seem alive... old fashion, old time religion like that is hard to kill. And then there are the military surplus stores that cater to the worship of violence. No specific deity but Mars might fit. Doesn't have to be god centered to be worship or even to have a 'spirit'.", 
        "intTime": 20090419, 
        "postID": 11, 
        "quote": "", 
        "reply": "I guess, Peas, we can't count the pagan worship of the female form at the many topless dancing places that locate close the gates of the two big bases I work at? The worship of sex still seem alive... old fashion, old time religion like that is hard to kill. And then there are the military surplus stores that cater to the worship of violence. No specific deity but Mars might fit. Doesn't have to be god centered to be worship or even to have a 'spirit'.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-19 14:05:00", 
        "title": "Bewitching World", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: I've seen lots of Christian bookstores and resource centers near military bases. That's all fine and good, of course. However, I've never seen a pagan supply center within easy access of a military base. I'm curious... if someone were to open such a store not far outside the gates of a military base, how much would they have to endure harassment and protests from the ignorant masses who think they're practicing Satanism and want to run them out of town? I've noticed a lot of open hostility towards earth-based religions on military bases. There is one of those right near the main gate of Tinker Air Force Base. As far as I know, they have never had anything but support from the military and the local community. I could be wrong though, I hope not.", 
        "intTime": 20090419, 
        "postID": 12, 
        "quote": "Originally posted by Whirled_Peas: I've seen lots of Christian bookstores and resource centers near military bases. That's all fine and good, of course. However, I've never seen a pagan supply center within easy access of a military base. I'm curious... if someone were to open such a store not far outside the gates of a military base, how much would they have to endure harassment and protests from the ignorant masses who think they're practicing Satanism and want to run them out of town? I've noticed a lot of open hostility towards earth-based religions on military bases.", 
        "reply": " There is one of those right near the main gate of Tinker Air Force Base. As far as I know, they have never had anything but support from the military and the local community. I could be wrong though, I hope not.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-19 14:26:00", 
        "title": "Bewitching World", 
        "userID": "DoD_Sim"
    }, 
    {
        "content": "Just in case anybody cares, my last show was about religion in the military specifically about the problems with the Air Force Academy lately and the prostylatising and pressure put on people in uniform to conform to domionist, and evangelical pressures within the military, as well as the discussion we had a few weeks ago on that thread that got shut down. Show date 4-7-09 You're preachin' to the choir here Peas. T", 
        "intTime": 20090419, 
        "postID": 13, 
        "quote": "", 
        "reply": "Just in case anybody cares, my last show was about religion in the military specifically about the problems with the Air Force Academy lately and the prostylatising and pressure put on people in uniform to conform to domionist, and evangelical pressures within the military, as well as the discussion we had a few weeks ago on that thread that got shut down. Show date 4-7-09 You're preachin' to the choir here Peas. T", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-19 17:44:00", 
        "title": "Bewitching World", 
        "userID": "tawodi"
    }, 
    {
        "content": "Ya gotta admit, the Wicca thing is a lot funnier than some religions. ********************************* Witches, ghost hunters gather in Salem By Associated Press Monday, April 20, 2009 SALEM — Dozens of witches, psychics and ghost hunters in Salem have finished two conventions on the \"paranormal world.\" GhoStock 7 — a four-day conference for paranormal investigators — ended Sunday after a group of ghost hunters searched for spirits at local hot spots like the Hawthorne Hotel’s basement. Others presented photos of what they believed to be ghosts. The Illinois-based Witch School International also wrapped up its \"three days of Wicca, Witchcraft and High Ritual\" gathering. Attendees had lunch from a \"Bewitched Menu,\" containing items served during filming of the Salem episodes of the TV show \"Bewitched\" 40 years ago. Both conferences attracted people from around the country.", 
        "intTime": 20090420, 
        "postID": 14, 
        "quote": "", 
        "reply": "Ya gotta admit, the Wicca thing is a lot funnier than some religions. ********************************* Witches, ghost hunters gather in Salem By Associated Press Monday, April 20, 2009 SALEM — Dozens of witches, psychics and ghost hunters in Salem have finished two conventions on the \"paranormal world.\" GhoStock 7 — a four-day conference for paranormal investigators — ended Sunday after a group of ghost hunters searched for spirits at local hot spots like the Hawthorne Hotel’s basement. Others presented photos of what they believed to be ghosts. The Illinois-based Witch School International also wrapped up its \"three days of Wicca, Witchcraft and High Ritual\" gathering. Attendees had lunch from a \"Bewitched Menu,\" containing items served during filming of the Salem episodes of the TV show \"Bewitched\" 40 years ago. Both conferences attracted people from around the country.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-20 15:34:00", 
        "title": "Bewitching World", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Just in case anybody cares, my last show was about religion in the military specifically about the problems with the Air Force Academy lately and the prostylatising and pressure put on people in uniform to conform to domionist, and evangelical pressures within the military, as well as the discussion we had a few weeks ago on that thread that got shut down. Show date 4-7-09 You're preachin' to the choir here Peas. T I know, T. I know that you don't like the Dominionist agenda of forcing religion on troops in \"captive\" situations either, nor their habit of belligerence towards anyone of a different faith than theirs. Despite being of different faiths, you and I have always agreed there, and you know I respect you for that.", 
        "intTime": 20090420, 
        "postID": 15, 
        "quote": "Originally posted by tawodi: Just in case anybody cares, my last show was about religion in the military specifically about the problems with the Air Force Academy lately and the prostylatising and pressure put on people in uniform to conform to domionist, and evangelical pressures within the military, as well as the discussion we had a few weeks ago on that thread that got shut down. Show date 4-7-09 You're preachin' to the choir here Peas. T", 
        "reply": " I know, T. I know that you don't like the Dominionist agenda of forcing religion on troops in \"captive\" situations either, nor their habit of belligerence towards anyone of a different faith than theirs. Despite being of different faiths, you and I have always agreed there, and you know I respect you for that.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-20 20:47:00", 
        "title": "Bewitching World", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by billbright: Ya gotta admit, the Wicca thing is a lot funnier than some religions. ********************************* Witches, ghost hunters gather in Salem By Associated Press Monday, April 20, 2009 SALEM — Dozens of witches, psychics and ghost hunters in Salem have finished two conventions on the \"paranormal world.\" GhoStock 7 — a four-day conference for paranormal investigators — ended Sunday after a group of ghost hunters searched for spirits at local hot spots like the Hawthorne Hotel’s basement. Others presented photos of what they believed to be ghosts. The Illinois-based Witch School International also wrapped up its \"three days of Wicca, Witchcraft and High Ritual\" gathering. Attendees had lunch from a \"Bewitched Menu,\" containing items served during filming of the Salem episodes of the TV show \"Bewitched\" 40 years ago. Both conferences attracted people from around the country. Hawthorne Hotel, huh? We stayed there during a Harry Potter convention back in 2005. Not haunted. At least, not that any rational person would consider \"haunted.\" To be serious, most pagans (including Wiccans) that I know don't go for the hoity-toity supernatural stuff with hauntings and so on. Far more \"naturalist\" and \"earth-based,\" not about ghosts and goblins. In the very least, it's not what my groups and I practice. But you're right - it's really funny. Oh, and the residents of Salem think the \"Bewitched\" statue and other paraphernalia garbage is stupid. I remember when they put it up. I never lived in Salem, but I was close enough that my favorite apothecary was in the Waterfront area of Salem and I went often. Nice place, good herbs and oils. Pay no attention to the tourist traps - they're garbage.", 
        "intTime": 20090420, 
        "postID": 16, 
        "quote": "Originally posted by billbright: Ya gotta admit, the Wicca thing is a lot funnier than some religions. ********************************* Witches, ghost hunters gather in Salem By Associated Press Monday, April 20, 2009 SALEM — Dozens of witches, psychics and ghost hunters in Salem have finished two conventions on the \"paranormal world.\" GhoStock 7 — a four-day conference for paranormal investigators — ended Sunday after a group of ghost hunters searched for spirits at local hot spots like the Hawthorne Hotel’s basement. Others presented photos of what they believed to be ghosts. The Illinois-based Witch School International also wrapped up its \"three days of Wicca, Witchcraft and High Ritual\" gathering. Attendees had lunch from a \"Bewitched Menu,\" containing items served during filming of the Salem episodes of the TV show \"Bewitched\" 40 years ago. Both conferences attracted people from around the country.", 
        "reply": " Hawthorne Hotel, huh? We stayed there during a Harry Potter convention back in 2005. Not haunted. At least, not that any rational person would consider \"haunted.\" To be serious, most pagans (including Wiccans) that I know don't go for the hoity-toity supernatural stuff with hauntings and so on. Far more \"naturalist\" and \"earth-based,\" not about ghosts and goblins. In the very least, it's not what my groups and I practice. But you're right - it's really funny. Oh, and the residents of Salem think the \"Bewitched\" statue and other paraphernalia garbage is stupid. I remember when they put it up. I never lived in Salem, but I was close enough that my favorite apothecary was in the Waterfront area of Salem and I went often. Nice place, good herbs and oils. Pay no attention to the tourist traps - they're garbage.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-20 20:53:00", 
        "title": "Bewitching World", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Nice place, good herbs and oils. Some say it all began with some particularly bad rye bread. Madness from ergot poisoning and resultant mass hysteria caused the behaviors that Salem interpreted as witchcraft. It makes a helluva lot more sense than \"She's a witch.\"", 
        "intTime": 20090421, 
        "postID": 17, 
        "quote": "Nice place, good herbs and oils.", 
        "reply": " Some say it all began with some particularly bad rye bread. Madness from ergot poisoning and resultant mass hysteria caused the behaviors that Salem interpreted as witchcraft. It makes a helluva lot more sense than \"She's a witch.\"", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-21 11:23:00", 
        "title": "Bewitching World", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Nice place, good herbs and oils. Some say it all began with some particularly bad rye bread. Madness from ergot poisoning and resultant mass hysteria caused the behaviors that Salem interpreted as witchcraft. It makes a helluva lot more sense than \"She's a witch.\" LSD was discovered in much the same manner.", 
        "intTime": 20090421, 
        "postID": 18, 
        "quote": "Originally posted by billbright: quote: Nice place, good herbs and oils. Some say it all began with some particularly bad rye bread. Madness from ergot poisoning and resultant mass hysteria caused the behaviors that Salem interpreted as witchcraft. It makes a helluva lot more sense than \"She's a witch.\"", 
        "reply": " LSD was discovered in much the same manner.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-21 12:07:00", 
        "title": "Bewitching World", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: LSD was discovered in much the same manner. I never managed to discover it.", 
        "intTime": 20090421, 
        "postID": 19, 
        "quote": "Originally posted by reducetension: LSD was discovered in much the same manner.", 
        "reply": " I never managed to discover it.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-21 16:35:00", 
        "title": "Bewitching World", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: Originally posted by reducetension: LSD was discovered in much the same manner. I never managed to discover it. You sure you tried hard enough? It probably contributed to some of the madness outbreaks in Europe at various times, growing as a 'mold culture' in bread. It's all in your head... keep your head, keep your head.", 
        "intTime": 20090421, 
        "postID": 20, 
        "quote": "Originally posted by billbright: quote: Originally posted by reducetension: LSD was discovered in much the same manner. I never managed to discover it.", 
        "reply": " You sure you tried hard enough? It probably contributed to some of the madness outbreaks in Europe at various times, growing as a 'mold culture' in bread. It's all in your head... keep your head, keep your head.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-21 16:49:00", 
        "title": "Bewitching World", 
        "userID": "reducetension"
    }, 
    {
        "content": "From WHAS 11 News: Witches, magic and spells: Wiccan religion fact and fiction 11:48 AM EDT on Saturday, April 25, 2009 (WHAS11) - Witches, magic and spells - there’s more to the growing Wiccan religion than what you’ve seen or read. WHAS11’s Adrianna Hopkins talked to a local witch to dispel the myth. We take you behind the magic and show you why this religion has cast its spell on Louisville. “Things are not quite what they seem.” Forget what you’ve seen on TV. “Can we ride brooms? No. We can’t ride brooms.” Walk into Linda Tipton’s store “Moonstruck” and amid the altars, the candles, the herbs and the statues. Linda Tipton said, “We can’t fly; we can’t jump from place to place; I can’t twitch my nose and clean my house - I wish I could! It’d be great!” Linda’s store has all things pagan. Linda Tipton said, “Paganism is real hard to explain. It doesn’t mean ungodly. It doesn’t mean that you don’t believe in any god. Most pagans believe in more than one god.” Linda Tipton said, “I was always interested in what you might call the cult things. I was always fascinated with witches and that kind of thing.” The worship tools you’ll find for sale are quite different from what she used to use. Linda Tipton said, “I grew up Christian. Disciples of Christ. I was at one time a Sunday School teacher, Choir Director, Children’s Choir Director. Sang in the choir myself. Was very active in church.” But at 17 years old, she scratched the itch and explored. She found a book about witches and witchcraft and before she knew it, she was spellbound. Linda Tipton said, “In Wicca, there is not a Jesus Christ or a Christ figure; there is no actual set book that we call our Bible; most Wiccans don’t believe in the devil; there is no version of sin. We don’t speak of sin,” Tipton explains. “There are spells and the best way to think about spells is they’re like prayers. They’re like petitions to the god and goddess. We do believe there is a place we go when we pass on. Our Wiccans call it ‘Summerland.’” Tipton says, Wicca is a “nature religion” and witches are “stewards of the Earth.” They see it as a living being. Linda also says the “craft” is centuries old—and the salvation for her agricultural Celtic ancestors. Linda Tipton said, “They had a great understanding of the season and of the animals and the plants and how it all interconnected.” The magic is still there. Hundreds of pagans gather for seasonal festivals throughout Kentucky. But like other religions, not everyone tolerates their beliefs. “There are many people who still think that wiccans are devil worshippers,” says Linda. “Be very careful not to judge other people until you really understand where they’re coming from because Christ said ‘judge not lest you be judged.” One of the pagan seasonal festivals, “Beltane,” is coming up May 1st, 2nd and 3rd. The festival is a celebration of the god and goddess and their union.", 
        "intTime": 20090426, 
        "postID": 21, 
        "quote": "", 
        "reply": "From WHAS 11 News: Witches, magic and spells: Wiccan religion fact and fiction 11:48 AM EDT on Saturday, April 25, 2009 (WHAS11) - Witches, magic and spells - there’s more to the growing Wiccan religion than what you’ve seen or read. WHAS11’s Adrianna Hopkins talked to a local witch to dispel the myth. We take you behind the magic and show you why this religion has cast its spell on Louisville. “Things are not quite what they seem.” Forget what you’ve seen on TV. “Can we ride brooms? No. We can’t ride brooms.” Walk into Linda Tipton’s store “Moonstruck” and amid the altars, the candles, the herbs and the statues. Linda Tipton said, “We can’t fly; we can’t jump from place to place; I can’t twitch my nose and clean my house - I wish I could! It’d be great!” Linda’s store has all things pagan. Linda Tipton said, “Paganism is real hard to explain. It doesn’t mean ungodly. It doesn’t mean that you don’t believe in any god. Most pagans believe in more than one god.” Linda Tipton said, “I was always interested in what you might call the cult things. I was always fascinated with witches and that kind of thing.” The worship tools you’ll find for sale are quite different from what she used to use. Linda Tipton said, “I grew up Christian. Disciples of Christ. I was at one time a Sunday School teacher, Choir Director, Children’s Choir Director. Sang in the choir myself. Was very active in church.” But at 17 years old, she scratched the itch and explored. She found a book about witches and witchcraft and before she knew it, she was spellbound. Linda Tipton said, “In Wicca, there is not a Jesus Christ or a Christ figure; there is no actual set book that we call our Bible; most Wiccans don’t believe in the devil; there is no version of sin. We don’t speak of sin,” Tipton explains. “There are spells and the best way to think about spells is they’re like prayers. They’re like petitions to the god and goddess. We do believe there is a place we go when we pass on. Our Wiccans call it ‘Summerland.’” Tipton says, Wicca is a “nature religion” and witches are “stewards of the Earth.” They see it as a living being. Linda also says the “craft” is centuries old—and the salvation for her agricultural Celtic ancestors. Linda Tipton said, “They had a great understanding of the season and of the animals and the plants and how it all interconnected.” The magic is still there. Hundreds of pagans gather for seasonal festivals throughout Kentucky. But like other religions, not everyone tolerates their beliefs. “There are many people who still think that wiccans are devil worshippers,” says Linda. “Be very careful not to judge other people until you really understand where they’re coming from because Christ said ‘judge not lest you be judged.” One of the pagan seasonal festivals, “Beltane,” is coming up May 1st, 2nd and 3rd. The festival is a celebration of the god and goddess and their union.", 
        "threadID": "1270031990001_6500035112001", 
        "time": "2009-04-26 18:58:00", 
        "title": "Bewitching World", 
        "userID": "billbright"
    }
]