[
    {
        "content": "By Wayne Besen: Keep Religion out of Military Rep. Ellen Tauscher (D-CA) introduced a bill this week to repeal Don't Ask, Don't Tell, a law that prohibits gay and lesbian military personnel from serving openly. While this is welcome news, there is no guarantee of a \"welcome mat\" for gay and lesbian soldiers if the ban is lifted. In the years since Don't Ask, Don't Tell was adopted in 1993, there has been a rigorous effort to force religion into the barracks. Fundamentalist Christian groups have infiltrated some of our leading military bases and have made life uncomfortable for anyone who does not conform. This first came to light in 2005 after the Air Force Academy in Colorado Springs had become a bastion of Anti-Semitism and Christian proselytizing. The problem escalated as some cadets were reportedly harassed and called \"filthy Jews.\" A chaplain who complained about the Biblical abuse was unceremoniously demoted and shipped off to Japan. To stop the attempted conversions, the military brass had to meet with the Anti-Defamation League. Sadly, the proselytizing continues with powerful military leaders behaving more like missionaries, than soldiers entrusted with fulfilling military missions. \"Why is it acceptable that soldiers are unable to serve this nation without attending state-led religious practices they find offensive and false?\" Specialist Dustin Chalker, an army medic based at Fort Detrick, in Maryland, asked in The New York Times. The Times article said that many service members are made uncomfortable by the outsized influence of private groups, such as Officers Christian Fellowship and the Campus Crusade for Christ's Military Ministry. \"You can't and shouldn't eliminate the spiritual component in the military,\" argued Bruce Fister, Executive Director of Officers' Christian Fellowship, in the Times. Excuse me, why is there a \"spiritual component\" in a pluralistic military whose goal is to safeguard a people governed by the United States Constitution? The very document that they are entrusted with protecting forbids a state religion. The fact is, a service member can pray anytime he or she desires. Within a ten mile radius of almost any base is a plethora of evangelical or fundamentalist churches to choose from. Thus, no one will be denied their freedom of religion if the presence of these predatory organizations is expunged from military bases. It is time to drain the swamp. Of course, we all know the purpose of these groups is to turn religion from a private, individual matter into a coercive team sport. \"Team Jesus\" is a better instrument to pressure cadets into converting -- especially if it offers ambitious soldiers a competitive advantage to rise through the ranks. (At the Air Force Academy in 2005, the football coach actually did post a locker room banner that read, \"Team Jesus.\") It is also problematic that a group with the name \"Crusade\" is allowed anywhere near our military. In case these religious renegades haven't noticed, we are fighting two wars in the Muslim world. The very word \"crusade\" is a potent rallying cry for Al Qaeda to recruit terrorists to murder U.S. forces. A group with a name like Campus Crusade sends the wrong message and may endanger our troops. Finally, religion does not always equate with moral superiority. I wouldn't doubt if the porn lobby is secretly cheering for mass conversions on military bases. A new nationwide study of credit card receipts from a major online adult entertainment provider shows that states that consume the most porn tend to be more conservative and religious than states with lower levels of consumption. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" said Benjamin Edelman at Harvard Business School. As we contemplate the battle over allowing openly gay people in the military, we should also consider what type of military they would serve in. As a nation, we must ensure that the military's number one priority is preparing for war, not worship. If we don't grapple with this issue, Don't Ask, Don't Tell may become, Do Tell, Live In Hell for gay and lesbian service members brave enough to come out. <end of excerpt from Huffington Post> This message has been edited. Last edited by: billbright, Tue 17 March 2009 08:53 AM", 
        "intTime": 20090316, 
        "postID": 1, 
        "quote": "", 
        "reply": "By Wayne Besen: Keep Religion out of Military Rep. Ellen Tauscher (D-CA) introduced a bill this week to repeal Don't Ask, Don't Tell, a law that prohibits gay and lesbian military personnel from serving openly. While this is welcome news, there is no guarantee of a \"welcome mat\" for gay and lesbian soldiers if the ban is lifted. In the years since Don't Ask, Don't Tell was adopted in 1993, there has been a rigorous effort to force religion into the barracks. Fundamentalist Christian groups have infiltrated some of our leading military bases and have made life uncomfortable for anyone who does not conform. This first came to light in 2005 after the Air Force Academy in Colorado Springs had become a bastion of Anti-Semitism and Christian proselytizing. The problem escalated as some cadets were reportedly harassed and called \"filthy Jews.\" A chaplain who complained about the Biblical abuse was unceremoniously demoted and shipped off to Japan. To stop the attempted conversions, the military brass had to meet with the Anti-Defamation League. Sadly, the proselytizing continues with powerful military leaders behaving more like missionaries, than soldiers entrusted with fulfilling military missions. \"Why is it acceptable that soldiers are unable to serve this nation without attending state-led religious practices they find offensive and false?\" Specialist Dustin Chalker, an army medic based at Fort Detrick, in Maryland, asked in The New York Times. The Times article said that many service members are made uncomfortable by the outsized influence of private groups, such as Officers Christian Fellowship and the Campus Crusade for Christ's Military Ministry. \"You can't and shouldn't eliminate the spiritual component in the military,\" argued Bruce Fister, Executive Director of Officers' Christian Fellowship, in the Times. Excuse me, why is there a \"spiritual component\" in a pluralistic military whose goal is to safeguard a people governed by the United States Constitution? The very document that they are entrusted with protecting forbids a state religion. The fact is, a service member can pray anytime he or she desires. Within a ten mile radius of almost any base is a plethora of evangelical or fundamentalist churches to choose from. Thus, no one will be denied their freedom of religion if the presence of these predatory organizations is expunged from military bases. It is time to drain the swamp. Of course, we all know the purpose of these groups is to turn religion from a private, individual matter into a coercive team sport. \"Team Jesus\" is a better instrument to pressure cadets into converting -- especially if it offers ambitious soldiers a competitive advantage to rise through the ranks. (At the Air Force Academy in 2005, the football coach actually did post a locker room banner that read, \"Team Jesus.\") It is also problematic that a group with the name \"Crusade\" is allowed anywhere near our military. In case these religious renegades haven't noticed, we are fighting two wars in the Muslim world. The very word \"crusade\" is a potent rallying cry for Al Qaeda to recruit terrorists to murder U.S. forces. A group with a name like Campus Crusade sends the wrong message and may endanger our troops. Finally, religion does not always equate with moral superiority. I wouldn't doubt if the porn lobby is secretly cheering for mass conversions on military bases. A new nationwide study of credit card receipts from a major online adult entertainment provider shows that states that consume the most porn tend to be more conservative and religious than states with lower levels of consumption. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" said Benjamin Edelman at Harvard Business School. As we contemplate the battle over allowing openly gay people in the military, we should also consider what type of military they would serve in. As a nation, we must ensure that the military's number one priority is preparing for war, not worship. If we don't grapple with this issue, Don't Ask, Don't Tell may become, Do Tell, Live In Hell for gay and lesbian service members brave enough to come out. <end of excerpt from Huffington Post> This message has been edited. Last edited by: billbright, Tue 17 March 2009 08:53 AM", 
        "threadID": "1270031990001_4320060812001", 
        "time": "2009-03-16 20:41:00", 
        "title": "Ask, Tell, Roast in Hell", 
        "userID": "billbright"
    }, 
    {
        "content": "MOD HAT ON Unless you wrote that piece yourself, you need to either post a link to where you got it, or cite the publisher as it's probably a copyrighted work. Additionally, you can't post a copyrighted work in it's entirety. You must edit out some of it to keep us from copyright infringement issues.", 
        "intTime": 20090316, 
        "postID": 2, 
        "quote": "", 
        "reply": "MOD HAT ON Unless you wrote that piece yourself, you need to either post a link to where you got it, or cite the publisher as it's probably a copyrighted work. Additionally, you can't post a copyrighted work in it's entirety. You must edit out some of it to keep us from copyright infringement issues.", 
        "threadID": "1270031990001_4320060812001", 
        "time": "2009-03-16 20:45:00", 
        "title": "Ask, Tell, Roast in Hell", 
        "userID": "stillkit"
    }, 
    {
        "content": "Bill, have you got a reference? I'd like to use it over in the 'gay' thread where I have been fighting with the sexual-phoebes.", 
        "intTime": 20090316, 
        "postID": 3, 
        "quote": "", 
        "reply": "Bill, have you got a reference? I'd like to use it over in the 'gay' thread where I have been fighting with the sexual-phoebes.", 
        "threadID": "1270031990001_4320060812001", 
        "time": "2009-03-16 21:20:00", 
        "title": "Ask, Tell, Roast in Hell", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Bruce Fister, Executive Director of Officers' Christian Fellowship Now there's an unfortunate name for a man in his position! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090317, 
        "postID": 4, 
        "quote": "Bruce Fister, Executive Director of Officers' Christian Fellowship", 
        "reply": " Now there's an unfortunate name for a man in his position! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_4320060812001", 
        "time": "2009-03-17 06:15:00", 
        "title": "Ask, Tell, Roast in Hell", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by stillkit: MOD HAT ON Unless you wrote that piece yourself, you need to either post a link to where you got it, or cite the publisher as it's probably a copyrighted work. Additionally, you can't post a copyrighted work in it's entirety. You must edit out some of it to keep us from copyright infringement issues. Oops. Sorry, Gary. Thought I did that. I fixed it. Huffington Post is one of those places where it's all opinion and very little fact. But, this piece did actually pull in some \"religion in the Military\" type news and I thought it would be useful on a group so named. This spells out a new dimension to the debate, also. If gays are recruited, they aren't closeted, and the military continues on its road to fraternal Christianity, what does that do for the safety and comfort of those gays recruits?", 
        "intTime": 20090317, 
        "postID": 5, 
        "quote": "Originally posted by stillkit: MOD HAT ON Unless you wrote that piece yourself, you need to either post a link to where you got it, or cite the publisher as it's probably a copyrighted work. Additionally, you can't post a copyrighted work in it's entirety. You must edit out some of it to keep us from copyright infringement issues.", 
        "reply": " Oops. Sorry, Gary. Thought I did that. I fixed it. Huffington Post is one of those places where it's all opinion and very little fact. But, this piece did actually pull in some \"religion in the Military\" type news and I thought it would be useful on a group so named. This spells out a new dimension to the debate, also. If gays are recruited, they aren't closeted, and the military continues on its road to fraternal Christianity, what does that do for the safety and comfort of those gays recruits?", 
        "threadID": "1270031990001_4320060812001", 
        "time": "2009-03-17 08:58:00", 
        "title": "Ask, Tell, Roast in Hell", 
        "userID": "billbright"
    }
]