[
    {
        "content": "Book of Matthew, Chapter 25, Verses 31 to 46: quote: [31] When the Son of man shall come in his glory, and all the holy angels with him, then shall he sit upon the throne of his glory: [32] And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats: [33] And he shall set the sheep on his right hand, but the goats on the left. [34] Then shall the King say unto them on his right hand, Come, ye blessed of my Father, inherit the kingdom prepared for you from the foundation of the world: [35] For I was hungry, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in: [36] Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me. [37] Then shall the righteous answer him, saying, Lord, when saw we thee hungry, and fed thee? or thirsty, and gave thee drink? [38] When saw we thee a stranger, and took thee in? or naked, and clothed thee? [39] Or when saw we thee sick, or in prison, and came unto thee? [40] And the King shall answer and say unto them, Verily I say unto you, Inasmuch as ye have done it unto one of the least of these my brethren, ye have done it unto me. [41] Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels: [42] For I was hungry, and ye gave me no meat: I was thirsty, and ye gave me no drink: [43] I was a stranger, and ye took me not in: naked, and ye clothed me not: sick, and in prison, and ye visited me not. [44] Then shall they also answer him, saying, Lord, when saw we thee hungry, or thirsty, or a stranger, or naked, or sick, or in prison, and did not minister unto thee? [45] Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me. [46] And these shall go away into everlasting punishment: but the righteous into life eternal. \"http://www.boston.com/news/local/new_hampshire/articles/2009/03/19/pastors_outreach_hits_a_nerve?mode=PF\" quote: Chichester, N.H. - At lunchtime yesterday, as reporters circled on the dirt road outside and the Rev. David Pinckney's cellphone kept ringing, the pastor took a break and sat down for lunch in the kitchen of his home with his new friend, convicted child killer Raymond Guay. The two men hardly knew each other a week ago. But since Friday, when Pinckney invited Guay, recently paroled, to live with him and his family of five children, the two men's lives have become intertwined. In recent days, both have become pariahs in this tiny, rural New Hampshire community in the hills outside Concord - Pinckney because of his act of kindness and Guay because of his act of evil. Some locals don't claim to understand either, and many want to run Guay out of town. Fear is rampant and growing. Many children here are no longer allowed to play outside. Pinckney said he has received more than one threatening phone call from angry people. \"No Kid Killers,\" says one sign in town, hanging off the side of a parked pickup truck. And people have appealed to elected officials as well. In a town meeting this week, more than 200 people gathered to ask that Guay go somewhere else. But forcing someone to leave isn't exactly easy, or legal. By order of a federal judge, Guay, 60, is supposed to remain in New Hampshire to serve three years of parole. And Pinckney, inviting a reporter into his home for the first time yesterday on the condition that no questions be asked of Guay, made it clear that, protests or not, he and his family are not backing down from their decision to allow Guay to live with them. In fact, on the contrary, Pinckney said, Guay is becoming a beloved house guest. The tall, lanky man with a narrow face and bushy gray beard is making himself useful around the house, helping the Pinckney family to complete an addition above the garage... Convinced that Guay is a changed man - a convert and devoted Christian - Pinckney decided to take the ex-convict into his home for the next two months. And so the *****ly problem of Raymond Guay came to tiny Chichester, population 2,400. \"We were warned,\" said Pinckney, who has four children, ages 13 to 18, living at home and a fifth, age 19, away at school. \"It was said this could disrupt life. People wouldn't like it. He's not liked. But at the end of the day, this is what Jesus did. He defended the defenseless. He was a friend of sinners.\" Few, if anyone, question Pinckney's intentions. The easygoing minister, who preaches on Sundays while wearing jeans and insists that people call him Dave, is well liked and respected in Chichester. But bringing a high-profile ex-convict, reformed or not, to a rural community where chickens outnumber police officers by a wide margin has not gone unnoticed. \"It's a quiet town,\" said Chichester Selectman Jeff Jordan. \"Somebody's cows getting out in the road, that's the worst thing that happens.\"... But now many locals feel like prisoners in their own homes. Smith said he will not allow his 11-year-old daughter to feed her pony, Wilma, alone anymore. Ingram, who lives near Pinckney, has blocked her back deck with the family's gas grill, a barrier to make sure the children do not go wandering. And police understand the fear. There are just four full-time officers in Chichester. \"My concern is safety,\" said Merrimack County Sheriff Scott Hilliard, whose department assists Chichester police. \"That's the priority, safety of the citizens. To be perfectly honest, I wouldn't want Mr. Guay to be living in my town. I'm a parent, too.\" Pinckney said he appreciates law enforcement officers' concerns - and their support. What's disappointed him, he said, are the reactions of others, given the lengths he is taking to keep Guay under close watch. Though Guay is legally free to go where he pleases, he has agreed to Pinckney's terms that he always remain under adult supervision, and has even volunteered to wear a movement-tracking ankle bracelet like an inmate on house arrest. \"I'm telling you, there are more dangers on my road with alcohol and firearms than there is with Raymond Guay,\" Pinckney said yesterday. \"I would not have brought him into my home if I thought he was a danger to my town, my neighborhood, my neighbors, or my children.\" \"http://www.boston.com/news/local/new_hampshire/articles/2009/03/19/pastors_outreach_hits_a_nerve/?page=2#commentAnchor\" quote: Liberals cannot seem to grasp the concepts of guilt and innocence, evil and good. let's spell it out. Murdering a child= bad, very bad. Murderer = bad, Child = innocent. Serving some time in prison does not make bad people good. Bad/evil people like this cannot be trusted near children because they have demonstrated that they like to harm and kill children. Prison does not change this, nothing changes this. Just as you cannot change a homosexual, or a heterosexual, you cannot cure a child predator. Child murderers do not earn back their innocence by doing time. They don't pay any debt to society, (ask the boy's mother if she feels \"repaid\" for the agony and loss she suffered). They are not and never will be safe, or trustworthy, that is why they should be executed. If I was the victims dad or mother, I would hunt this creep down and make sure he never destroyed another child. If I had terminal cancer, I might do it myself... quote: For all you religion bashers out there, this is more a symptom of Loony Left Liberalism, than that of religion. As a Christian, I believe that an eye for an eye should have come into play here, not 35 years in prison... quote: People in Chichester really want to get rid of this guy? It's quite simple. Stop going to the church this pastor works at. Once the collection plates run dry, the church will act and either fire him or transfer him... quote: I believe that Child welfare should step in and take all of his children away while the pastor and this fellow enjoy one anothers company in the comfort of the children's home. Crazy pastor... quote: I find it insane for him to bring the man into his home where his children live. That's great he thinks he's doing a good deed, but some things are just unforgivable. He also had no consideration for the neighbors... quote: Those of you, members of this Reverend's church; I think you should, all, boycott church services and meetings. March and protest outside of all services and meeting with signs showing your disapproval for what he is doing. We can see what a nut this Reverend is, but I wonder what kind of a nut the mother of these children is. She should put out the Rev. and his new boyfriend, or take the children and move out. If not, I think Child Protective Services should step in and remove these children from the dangerous situation in which they have been placed, by their own father and mother. C'mon, Mom, grow a backbone and don't allow this in your home. You carried these children for 9 months, gave birth, and have been nurturing them. Don't let this clown you married put their lives in danger. And finally: \"http://www.seacoastonline.com/articles/20090318-OPINION-90318016\" quote: When they learned that a local pastor was prepared to take a convicted child killer into his home after the man's release from prison, the townsfolk eagerly lit their handy dandy Acme Villager Torch and did their level best to make sure the new resident was not welcome. Nothing says \"ey, we're here to encourage you to learn to walk the straight and narrow!\"like blind hatred and arson threats... Everyone has their breaking point, and the Chichester residents are making a beeline for parolee Raymond Guay's. Maybe they think if enough people aim their hatred at Guay, he'll kill again and be put away for life. Problem solved... Nobody will hire this man. Anyone who offers to give him a home while he tries to put his life back together will be threatened. Anyone who shows him friendship will be made to suffer... The residents are claiming their children are frightened and can’t sleep. Now why would that be? It certainly couldn’t be due to the fact that they told their children awful things about Guay, could it? Surely all their children are psychic and suddenly, with no foreknowledge, awoke in the night from a premonitory dream, screaming, “Mommy, an evil man is coming to town I’m going to die next!” Children aren’t afraid of things they don’t know about. The town of Chichester is determined to spread their prejudice down through the generations. It’s the legacy they’re giving their children... From the accounts that came out of their little town meeting, it sounds like given half a chance, the women of this community would gladly load their shotguns and open fire on Guay rather than give him a chance to prove that he’s seen the error of his ways. It somehow eludes these people that they’ll be doing the same thing Guay did so many years ago. They’ll be killing someone’s child. In cold blood.", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "[31] When the Son of man shall come in his glory, and all the holy angels with him, then shall he sit upon the throne of his glory: [32] And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats: [33] And he shall set the sheep on his right hand, but the goats on the left. [34] Then shall the King say unto them on his right hand, Come, ye blessed of my Father, inherit the kingdom prepared for you from the foundation of the world: [35] For I was hungry, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in: [36] Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me. [37] Then shall the righteous answer him, saying, Lord, when saw we thee hungry, and fed thee? or thirsty, and gave thee drink? [38] When saw we thee a stranger, and took thee in? or naked, and clothed thee? [39] Or when saw we thee sick, or in prison, and came unto thee? [40] And the King shall answer and say unto them, Verily I say unto you, Inasmuch as ye have done it unto one of the least of these my brethren, ye have done it unto me. [41] Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels: [42] For I was hungry, and ye gave me no meat: I was thirsty, and ye gave me no drink: [43] I was a stranger, and ye took me not in: naked, and ye clothed me not: sick, and in prison, and ye visited me not. [44] Then shall they also answer him, saying, Lord, when saw we thee hungry, or thirsty, or a stranger, or naked, or sick, or in prison, and did not minister unto thee? [45] Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me. [46] And these shall go away into everlasting punishment: but the righteous into life eternal.", 
        "reply": "Book of Matthew, Chapter 25, Verses 31 to 46:  \"http://www.boston.com/news/local/new_hampshire/articles/2009/03/19/pastors_outreach_hits_a_nerve?mode=PF\" quote: Chichester, N.H. - At lunchtime yesterday, as reporters circled on the dirt road outside and the Rev. David Pinckney's cellphone kept ringing, the pastor took a break and sat down for lunch in the kitchen of his home with his new friend, convicted child killer Raymond Guay. The two men hardly knew each other a week ago. But since Friday, when Pinckney invited Guay, recently paroled, to live with him and his family of five children, the two men's lives have become intertwined. In recent days, both have become pariahs in this tiny, rural New Hampshire community in the hills outside Concord - Pinckney because of his act of kindness and Guay because of his act of evil. Some locals don't claim to understand either, and many want to run Guay out of town. Fear is rampant and growing. Many children here are no longer allowed to play outside. Pinckney said he has received more than one threatening phone call from angry people. \"No Kid Killers,\" says one sign in town, hanging off the side of a parked pickup truck. And people have appealed to elected officials as well. In a town meeting this week, more than 200 people gathered to ask that Guay go somewhere else. But forcing someone to leave isn't exactly easy, or legal. By order of a federal judge, Guay, 60, is supposed to remain in New Hampshire to serve three years of parole. And Pinckney, inviting a reporter into his home for the first time yesterday on the condition that no questions be asked of Guay, made it clear that, protests or not, he and his family are not backing down from their decision to allow Guay to live with them. In fact, on the contrary, Pinckney said, Guay is becoming a beloved house guest. The tall, lanky man with a narrow face and bushy gray beard is making himself useful around the house, helping the Pinckney family to complete an addition above the garage... Convinced that Guay is a changed man - a convert and devoted Christian - Pinckney decided to take the ex-convict into his home for the next two months. And so the *****ly problem of Raymond Guay came to tiny Chichester, population 2,400. \"We were warned,\" said Pinckney, who has four children, ages 13 to 18, living at home and a fifth, age 19, away at school. \"It was said this could disrupt life. People wouldn't like it. He's not liked. But at the end of the day, this is what Jesus did. He defended the defenseless. He was a friend of sinners.\" Few, if anyone, question Pinckney's intentions. The easygoing minister, who preaches on Sundays while wearing jeans and insists that people call him Dave, is well liked and respected in Chichester. But bringing a high-profile ex-convict, reformed or not, to a rural community where chickens outnumber police officers by a wide margin has not gone unnoticed. \"It's a quiet town,\" said Chichester Selectman Jeff Jordan. \"Somebody's cows getting out in the road, that's the worst thing that happens.\"... But now many locals feel like prisoners in their own homes. Smith said he will not allow his 11-year-old daughter to feed her pony, Wilma, alone anymore. Ingram, who lives near Pinckney, has blocked her back deck with the family's gas grill, a barrier to make sure the children do not go wandering. And police understand the fear. There are just four full-time officers in Chichester. \"My concern is safety,\" said Merrimack County Sheriff Scott Hilliard, whose department assists Chichester police. \"That's the priority, safety of the citizens. To be perfectly honest, I wouldn't want Mr. Guay to be living in my town. I'm a parent, too.\" Pinckney said he appreciates law enforcement officers' concerns - and their support. What's disappointed him, he said, are the reactions of others, given the lengths he is taking to keep Guay under close watch. Though Guay is legally free to go where he pleases, he has agreed to Pinckney's terms that he always remain under adult supervision, and has even volunteered to wear a movement-tracking ankle bracelet like an inmate on house arrest. \"I'm telling you, there are more dangers on my road with alcohol and firearms than there is with Raymond Guay,\" Pinckney said yesterday. \"I would not have brought him into my home if I thought he was a danger to my town, my neighborhood, my neighbors, or my children.\" \"http://www.boston.com/news/local/new_hampshire/articles/2009/03/19/pastors_outreach_hits_a_nerve/?page=2#commentAnchor\" quote: Liberals cannot seem to grasp the concepts of guilt and innocence, evil and good. let's spell it out. Murdering a child= bad, very bad. Murderer = bad, Child = innocent. Serving some time in prison does not make bad people good. Bad/evil people like this cannot be trusted near children because they have demonstrated that they like to harm and kill children. Prison does not change this, nothing changes this. Just as you cannot change a homosexual, or a heterosexual, you cannot cure a child predator. Child murderers do not earn back their innocence by doing time. They don't pay any debt to society, (ask the boy's mother if she feels \"repaid\" for the agony and loss she suffered). They are not and never will be safe, or trustworthy, that is why they should be executed. If I was the victims dad or mother, I would hunt this creep down and make sure he never destroyed another child. If I had terminal cancer, I might do it myself... quote: For all you religion bashers out there, this is more a symptom of Loony Left Liberalism, than that of religion. As a Christian, I believe that an eye for an eye should have come into play here, not 35 years in prison... quote: People in Chichester really want to get rid of this guy? It's quite simple. Stop going to the church this pastor works at. Once the collection plates run dry, the church will act and either fire him or transfer him... quote: I believe that Child welfare should step in and take all of his children away while the pastor and this fellow enjoy one anothers company in the comfort of the children's home. Crazy pastor... quote: I find it insane for him to bring the man into his home where his children live. That's great he thinks he's doing a good deed, but some things are just unforgivable. He also had no consideration for the neighbors... quote: Those of you, members of this Reverend's church; I think you should, all, boycott church services and meetings. March and protest outside of all services and meeting with signs showing your disapproval for what he is doing. We can see what a nut this Reverend is, but I wonder what kind of a nut the mother of these children is. She should put out the Rev. and his new boyfriend, or take the children and move out. If not, I think Child Protective Services should step in and remove these children from the dangerous situation in which they have been placed, by their own father and mother. C'mon, Mom, grow a backbone and don't allow this in your home. You carried these children for 9 months, gave birth, and have been nurturing them. Don't let this clown you married put their lives in danger. And finally: \"http://www.seacoastonline.com/articles/20090318-OPINION-90318016\" quote: When they learned that a local pastor was prepared to take a convicted child killer into his home after the man's release from prison, the townsfolk eagerly lit their handy dandy Acme Villager Torch and did their level best to make sure the new resident was not welcome. Nothing says \"ey, we're here to encourage you to learn to walk the straight and narrow!\"like blind hatred and arson threats... Everyone has their breaking point, and the Chichester residents are making a beeline for parolee Raymond Guay's. Maybe they think if enough people aim their hatred at Guay, he'll kill again and be put away for life. Problem solved... Nobody will hire this man. Anyone who offers to give him a home while he tries to put his life back together will be threatened. Anyone who shows him friendship will be made to suffer... The residents are claiming their children are frightened and can’t sleep. Now why would that be? It certainly couldn’t be due to the fact that they told their children awful things about Guay, could it? Surely all their children are psychic and suddenly, with no foreknowledge, awoke in the night from a premonitory dream, screaming, “Mommy, an evil man is coming to town I’m going to die next!” Children aren’t afraid of things they don’t know about. The town of Chichester is determined to spread their prejudice down through the generations. It’s the legacy they’re giving their children... From the accounts that came out of their little town meeting, it sounds like given half a chance, the women of this community would gladly load their shotguns and open fire on Guay rather than give him a chance to prove that he’s seen the error of his ways. It somehow eludes these people that they’ll be doing the same thing Guay did so many years ago. They’ll be killing someone’s child. In cold blood.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-20 06:54:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "You made a judgment. God is going to send everyone \"away into everlasting punishment [46]\" because they were fearful of a murdering rapist? Then, he isn't very Jesus-like, is he?", 
        "intTime": 20090320, 
        "postID": 2, 
        "quote": "", 
        "reply": "You made a judgment. God is going to send everyone \"away into everlasting punishment [46]\" because they were fearful of a murdering rapist? Then, he isn't very Jesus-like, is he?", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-20 07:47:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "I don't know all the details and backstory behind this particular incident, but I know the church doesn't mind sending child rapists into family neighborhoods. Found this on the news recently: \"http://www.unionleader.com/article.aspx?headline=Defrocked+child+rapist+owns+property+in+NH&articleId=94aeda7b-2e42-49fc-9f70-c24ad7d3fdeb The topic was linked on CNN a couple of days ago. Seems that this guy was guilty of multiple counts of child rape from a couple of decades ago. The church knew about it, but instead of turning him over to the police, they told him to go \"lay low\" in New Hampshire... in MY NEIGHBORHOOD. I used to ride my bicycle by this criminal's house every day during the summers. He lived there almost the entire time I lived there. When they finally caught, arrested, convicted, and sentenced him, he only served a few years... and now they're letting him loose again! And instead of taking care of their own dirt, Massachusetts is sending sending this guy back to New Hampshire for probation! But the point is that the church KNEW this guy was a child rapist, and they let him live in my neighborhood for years. That's a family neighborhood. Lots of kids, quiet streets. quote: Gale owns a camp at 100 Lake Shore Drive on Sunrise Lake in Middleton, according to registry records. He bought the property in 1983 when he was assigned to St. Luke Parish in Waltham, Mass., records show. I dunno, maybe Rev. David Pinckney thinks he's doing the work of Jesus, and at least I'll give him credit for not being a hypocrite about the teachings of Jesus in the Bible, but seriously... letting a convicted murderer into a home with children? If he wants to risk his own life, let him, but when there are kids involved, the rules change. In summary: As a member of the clergy, you'd think he would care about children... but clearly, based on the treatment of child rapists by the church in the past, church leadership really doesn't care about children at all.", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "Gale owns a camp at 100 Lake Shore Drive on Sunrise Lake in Middleton, according to registry records. He bought the property in 1983 when he was assigned to St. Luke Parish in Waltham, Mass., records show.", 
        "reply": "I don't know all the details and backstory behind this particular incident, but I know the church doesn't mind sending child rapists into family neighborhoods. Found this on the news recently: \"http://www.unionleader.com/article.aspx?headline=Defrocked+child+rapist+owns+property+in+NH&articleId=94aeda7b-2e42-49fc-9f70-c24ad7d3fdeb The topic was linked on CNN a couple of days ago. Seems that this guy was guilty of multiple counts of child rape from a couple of decades ago. The church knew about it, but instead of turning him over to the police, they told him to go \"lay low\" in New Hampshire... in MY NEIGHBORHOOD. I used to ride my bicycle by this criminal's house every day during the summers. He lived there almost the entire time I lived there. When they finally caught, arrested, convicted, and sentenced him, he only served a few years... and now they're letting him loose again! And instead of taking care of their own dirt, Massachusetts is sending sending this guy back to New Hampshire for probation! But the point is that the church KNEW this guy was a child rapist, and they let him live in my neighborhood for years. That's a family neighborhood. Lots of kids, quiet streets.  I dunno, maybe Rev. David Pinckney thinks he's doing the work of Jesus, and at least I'll give him credit for not being a hypocrite about the teachings of Jesus in the Bible, but seriously... letting a convicted murderer into a home with children? If he wants to risk his own life, let him, but when there are kids involved, the rules change. In summary: As a member of the clergy, you'd think he would care about children... but clearly, based on the treatment of child rapists by the church in the past, church leadership really doesn't care about children at all.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-20 11:17:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "I just re-read the scripture I quoted in my OP - and I failed to see where Jesus made an exception based on the type of the crime. He said \"I was in prison, and ye came unto me\", not \"I was in prison for a crime other than child abuse or child murder, and ye came unto me. If I was in prison for either child abuse or child murder, I could understand why you didn't come unto me\". Jesus also didn't say, \"If someone helps a former prisoner who committed child abuse or child murder, burn his home and place of worship to the ground and give his children to others to be raised to adulthood\", as some of those New Hampshire \"Christians\" are saying should be done.", 
        "intTime": 20090321, 
        "postID": 4, 
        "quote": "", 
        "reply": "I just re-read the scripture I quoted in my OP - and I failed to see where Jesus made an exception based on the type of the crime. He said \"I was in prison, and ye came unto me\", not \"I was in prison for a crime other than child abuse or child murder, and ye came unto me. If I was in prison for either child abuse or child murder, I could understand why you didn't come unto me\". Jesus also didn't say, \"If someone helps a former prisoner who committed child abuse or child murder, burn his home and place of worship to the ground and give his children to others to be raised to adulthood\", as some of those New Hampshire \"Christians\" are saying should be done.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-21 06:38:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I say it again. You don't find it a little crazy that this \"savior\" would send people away for eternal punishment for being afraid of a murdering rapist? Isn't he supposed to be the lamb, the light, and the gentle shepherd of his flock? But don't his actions bespeak a man who would turn on his friends like a viper for any perceived offense and send them to a punishment un-befitting the crime he perceived? Maybe the lesson you're trying to convey is valid. I don't know, and you can't know either. You haven't met the parson of whom you speak, nor have you met the con. You don't know if he actually is a rapist or sex offender. But, you're trying to make a blanket statement about the nature of nurture, if you will. It's an issue we all struggle with, no matter whether we've read the gospel or not. But you, unaware of what you're actually talking about first hand, suggest you would like us all to go to hell for eternity if we hesitate a moment when considering keeping a con in the house with our kids.", 
        "intTime": 20090321, 
        "postID": 5, 
        "quote": "", 
        "reply": "I say it again. You don't find it a little crazy that this \"savior\" would send people away for eternal punishment for being afraid of a murdering rapist? Isn't he supposed to be the lamb, the light, and the gentle shepherd of his flock? But don't his actions bespeak a man who would turn on his friends like a viper for any perceived offense and send them to a punishment un-befitting the crime he perceived? Maybe the lesson you're trying to convey is valid. I don't know, and you can't know either. You haven't met the parson of whom you speak, nor have you met the con. You don't know if he actually is a rapist or sex offender. But, you're trying to make a blanket statement about the nature of nurture, if you will. It's an issue we all struggle with, no matter whether we've read the gospel or not. But you, unaware of what you're actually talking about first hand, suggest you would like us all to go to hell for eternity if we hesitate a moment when considering keeping a con in the house with our kids.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-21 15:15:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "The \"con\" in question raped and murdered a twelve year old and while in prison stabbed another inmate I can't seem to find out what the fate of that inmate was.....not too amazing, it might cloud the issue of his, the released inmate's, \"rehabilitation\" Also he was transferred to several prisons during his incarceration and his crime, as near as I can find, was committed in Mass. He recieved his parole from the California board of corrections and parole and was remanded to New Hampshire for that parole. Once again all of the above shows how good life without parole is........ Now, it would be my suggestion, for who ever has a problem with people who do not want a child killer and rapist living next door to them, step forward put YOUR name on the list and bring them to YOUR home and neighborhood!! It will probably go as well for you, as it did for a local woman, who was the daughter of a former Connecticut Governor.Laurie Urs. In the bucholic town of Chatham MA. about eight years ago she had been having an in prison \"friendship\" and an out of prison \"relationship,\" with an inmate who had been rehabilitated. Well it seems that she considered the relationship over, but there was some small disagreement about that, with the soon to be former paramour. He showed up at two Oclock in the morning, armed with a shot gun, broke in raped mom a couple of times and while doing so, beat the crap out of her. Then Mom escaped from the evil cluthes of said nasty person, only forgetting one small detail......her fourteen year old daughter, who was cowering in the house listening to the beating and repeated rape of her mother, the child was understandably upset, you may grant. Well, upon discovering the weeping child the \"rehabilitated\" inmate then proceeded to rape, for fourteen hours, this child, who had been left behind, by her loving mother!! The police were duly notified and the standoff ensued. During this time of negotiation, the Inmate would partake of the daughter every hour and a half or so. He must have considered her to be quite succulent after her old worn out 34 year old mother after all, so who can blame the poor misunderstood inmate!!??!! Flash forward to now, nobody knows where the kid is, the mother has been in and out of rehab and counselling and by the way, everybody seems to have lost track of the kid!! But it's hard to find anybody who remembered the kid after the trauma the poor, poor, pitiful, misled mama, endured by the betrayal of the inmate!!! So as I said, suggestions for your ideas about a suitable place of residence will be entertained, as long as YOUR house is at the TOP of the list!!! Oh yes, the inmate is eligible for parole next year. Send in that name now!! Don't forget!!!!", 
        "intTime": 20090322, 
        "postID": 6, 
        "quote": "", 
        "reply": "The \"con\" in question raped and murdered a twelve year old and while in prison stabbed another inmate I can't seem to find out what the fate of that inmate was.....not too amazing, it might cloud the issue of his, the released inmate's, \"rehabilitation\" Also he was transferred to several prisons during his incarceration and his crime, as near as I can find, was committed in Mass. He recieved his parole from the California board of corrections and parole and was remanded to New Hampshire for that parole. Once again all of the above shows how good life without parole is........ Now, it would be my suggestion, for who ever has a problem with people who do not want a child killer and rapist living next door to them, step forward put YOUR name on the list and bring them to YOUR home and neighborhood!! It will probably go as well for you, as it did for a local woman, who was the daughter of a former Connecticut Governor.Laurie Urs. In the bucholic town of Chatham MA. about eight years ago she had been having an in prison \"friendship\" and an out of prison \"relationship,\" with an inmate who had been rehabilitated. Well it seems that she considered the relationship over, but there was some small disagreement about that, with the soon to be former paramour. He showed up at two Oclock in the morning, armed with a shot gun, broke in raped mom a couple of times and while doing so, beat the crap out of her. Then Mom escaped from the evil cluthes of said nasty person, only forgetting one small detail......her fourteen year old daughter, who was cowering in the house listening to the beating and repeated rape of her mother, the child was understandably upset, you may grant. Well, upon discovering the weeping child the \"rehabilitated\" inmate then proceeded to rape, for fourteen hours, this child, who had been left behind, by her loving mother!! The police were duly notified and the standoff ensued. During this time of negotiation, the Inmate would partake of the daughter every hour and a half or so. He must have considered her to be quite succulent after her old worn out 34 year old mother after all, so who can blame the poor misunderstood inmate!!??!! Flash forward to now, nobody knows where the kid is, the mother has been in and out of rehab and counselling and by the way, everybody seems to have lost track of the kid!! But it's hard to find anybody who remembered the kid after the trauma the poor, poor, pitiful, misled mama, endured by the betrayal of the inmate!!! So as I said, suggestions for your ideas about a suitable place of residence will be entertained, as long as YOUR house is at the TOP of the list!!! Oh yes, the inmate is eligible for parole next year. Send in that name now!! Don't forget!!!!", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 13:13:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "tawodi"
    }, 
    {
        "content": "Nobody ever promised that loving the un-lovable would be easy or without risk. But, loving them is EXACTLY what we're commanded to do in the Second Greatest Commandment. When Jesus said to \"love your neighbor,\" He wasn't talking about fellow believers. If he'd meant that, He would have said \"brothers,\" as He did other times. Nobody should suggest that we ought to turn a blind eye to the risk, which is substantial, but nobody should suggest that we spend the rest our lives, and theirs, condemning them for their sins either. I doubt any of us would want that standard applied to OUR sins, which are just as grievous in God's eyes.", 
        "intTime": 20090322, 
        "postID": 7, 
        "quote": "", 
        "reply": "Nobody ever promised that loving the un-lovable would be easy or without risk. But, loving them is EXACTLY what we're commanded to do in the Second Greatest Commandment. When Jesus said to \"love your neighbor,\" He wasn't talking about fellow believers. If he'd meant that, He would have said \"brothers,\" as He did other times. Nobody should suggest that we ought to turn a blind eye to the risk, which is substantial, but nobody should suggest that we spend the rest our lives, and theirs, condemning them for their sins either. I doubt any of us would want that standard applied to OUR sins, which are just as grievous in God's eyes.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 15:56:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "stillkit"
    }, 
    {
        "content": "There's that, Still. But, it would be the rare Christian or anyone else who would jump at the chance to bring a convicted sex murderer into a house full of kids... for good reason. I often go out of my way to look out for overlooked individuals. But, that don't make me no saint. I saw part of a segment on a newsy show the other day about skater Tonya Harding. She complained that people still bother her about her involvement in clobbering Nancy Kerrigan's knee, for which she says she has paid her dues. I didn't feel sorry.", 
        "intTime": 20090322, 
        "postID": 8, 
        "quote": "", 
        "reply": "There's that, Still. But, it would be the rare Christian or anyone else who would jump at the chance to bring a convicted sex murderer into a house full of kids... for good reason. I often go out of my way to look out for overlooked individuals. But, that don't make me no saint. I saw part of a segment on a newsy show the other day about skater Tonya Harding. She complained that people still bother her about her involvement in clobbering Nancy Kerrigan's knee, for which she says she has paid her dues. I didn't feel sorry.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 16:43:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by tawodi: The \"con\" in question raped and murdered a twelve year old and while in prison stabbed another inmate I can't seem to find out what the fate of that inmate was.....not too amazing, it might cloud the issue of his, the released inmate's, \"rehabilitation\" Also he was transferred to several prisons during his incarceration and his crime, as near as I can find, was committed in Mass. He recieved his parole from the California board of corrections and parole and was remanded to New Hampshire for that parole. Once again all of the above shows how good life without parole is........ Now, it would be my suggestion, for who ever has a problem with people who do not want a child killer and rapist living next door to them, step forward put YOUR name on the list and bring them to YOUR home and neighborhood!! It will probably go as well for you, as it did for a local woman, who was the daughter of a former Connecticut Governor.Laurie Urs. In the bucholic town of Chatham MA. about eight years ago she had been having an in prison \"friendship\" and an out of prison \"relationship,\" with an inmate who had been rehabilitated. Well it seems that she considered the relationship over, but there was some small disagreement about that, with the soon to be former paramour. He showed up at two Oclock in the morning, armed with a shot gun, broke in raped mom a couple of times and while doing so, beat the crap out of her. Then Mom escaped from the evil cluthes of said nasty person, only forgetting one small detail......her fourteen year old daughter, who was cowering in the house listening to the beating and repeated rape of her mother, the child was understandably upset, you may grant. Well, upon discovering the weeping child the \"rehabilitated\" inmate then proceeded to rape, for fourteen hours, this child, who had been left behind, by her loving mother!! The police were duly notified and the standoff ensued. During this time of negotiation, the Inmate would partake of the daughter every hour and a half or so. He must have considered her to be quite succulent after her old worn out 34 year old mother after all, so who can blame the poor misunderstood inmate!!??!! Flash forward to now, nobody knows where the kid is, the mother has been in and out of rehab and counselling and by the way, everybody seems to have lost track of the kid!! But it's hard to find anybody who remembered the kid after the trauma the poor, poor, pitiful, misled mama, endured by the betrayal of the inmate!!! So as I said, suggestions for your ideas about a suitable place of residence will be entertained, as long as YOUR house is at the TOP of the list!!! Oh yes, the inmate is eligible for parole next year. Send in that name now!! Don't forget!!!! I assume you're not talking to me.", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by tawodi: The \"con\" in question raped and murdered a twelve year old and while in prison stabbed another inmate I can't seem to find out what the fate of that inmate was.....not too amazing, it might cloud the issue of his, the released inmate's, \"rehabilitation\" Also he was transferred to several prisons during his incarceration and his crime, as near as I can find, was committed in Mass. He recieved his parole from the California board of corrections and parole and was remanded to New Hampshire for that parole. Once again all of the above shows how good life without parole is........ Now, it would be my suggestion, for who ever has a problem with people who do not want a child killer and rapist living next door to them, step forward put YOUR name on the list and bring them to YOUR home and neighborhood!! It will probably go as well for you, as it did for a local woman, who was the daughter of a former Connecticut Governor.Laurie Urs. In the bucholic town of Chatham MA. about eight years ago she had been having an in prison \"friendship\" and an out of prison \"relationship,\" with an inmate who had been rehabilitated. Well it seems that she considered the relationship over, but there was some small disagreement about that, with the soon to be former paramour. He showed up at two Oclock in the morning, armed with a shot gun, broke in raped mom a couple of times and while doing so, beat the crap out of her. Then Mom escaped from the evil cluthes of said nasty person, only forgetting one small detail......her fourteen year old daughter, who was cowering in the house listening to the beating and repeated rape of her mother, the child was understandably upset, you may grant. Well, upon discovering the weeping child the \"rehabilitated\" inmate then proceeded to rape, for fourteen hours, this child, who had been left behind, by her loving mother!! The police were duly notified and the standoff ensued. During this time of negotiation, the Inmate would partake of the daughter every hour and a half or so. He must have considered her to be quite succulent after her old worn out 34 year old mother after all, so who can blame the poor misunderstood inmate!!??!! Flash forward to now, nobody knows where the kid is, the mother has been in and out of rehab and counselling and by the way, everybody seems to have lost track of the kid!! But it's hard to find anybody who remembered the kid after the trauma the poor, poor, pitiful, misled mama, endured by the betrayal of the inmate!!! So as I said, suggestions for your ideas about a suitable place of residence will be entertained, as long as YOUR house is at the TOP of the list!!! Oh yes, the inmate is eligible for parole next year. Send in that name now!! Don't forget!!!!", 
        "reply": " I assume you're not talking to me.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 16:47:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Nobody ever promised that loving the un-lovable would be easy or without risk. But, loving them is EXACTLY what we're commanded to do in the Second Greatest Commandment. When Jesus said to \"love your neighbor,\" He wasn't talking about fellow believers. If he'd meant that, He would have said \"brothers,\" as He did other times. Nobody should suggest that we ought to turn a blind eye to the risk, which is substantial, but nobody should suggest that we spend the rest our lives, and theirs, condemning them for their sins either. I doubt any of us would want that standard applied to OUR sins, which are just as grievous in God's eyes. Reminds me of a line from the Simpsons: \"What's that religion with all the well-meaning rules that never work out in real life? Oh yeah....Christianity!!\"", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "Originally posted by stillkit: Nobody ever promised that loving the un-lovable would be easy or without risk. But, loving them is EXACTLY what we're commanded to do in the Second Greatest Commandment. When Jesus said to \"love your neighbor,\" He wasn't talking about fellow believers. If he'd meant that, He would have said \"brothers,\" as He did other times. Nobody should suggest that we ought to turn a blind eye to the risk, which is substantial, but nobody should suggest that we spend the rest our lives, and theirs, condemning them for their sins either. I doubt any of us would want that standard applied to OUR sins, which are just as grievous in God's eyes.", 
        "reply": " Reminds me of a line from the Simpsons: \"What's that religion with all the well-meaning rules that never work out in real life? Oh yeah....Christianity!!\"", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 21:22:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner.", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "", 
        "reply": "During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-23 04:24:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner. If a rabbid dog came into your yard and killed one of your children would you forgive that dog and continue to let your children to play with the dog in the yard or would you kill the dog. While working as a Security officer here in Okla. i hauled inmates out to the highways to clean the roads, I knew alot about each inmate that entered my truck, most were \"saved again xtians\" (in my opinion they clamed this so they could get early parol) These cons would recieve their early parol and would be back in prison within 6 months for the same crimes. I have heard alot about prison rehabilitation, I have never seen it work. It is my Opinion a person proven guilty of rape, child molesting, murder,crimes agains old people, and children, should be taken outside the court room door and hung from a tree with a signe around their necks saying what they were convicted of. This is just My Opinion as you can see I'm not the real forgiving type when it comes to these scumbags D.J.", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "Originally posted by xnavycg: During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner.", 
        "reply": " If a rabbid dog came into your yard and killed one of your children would you forgive that dog and continue to let your children to play with the dog in the yard or would you kill the dog. While working as a Security officer here in Okla. i hauled inmates out to the highways to clean the roads, I knew alot about each inmate that entered my truck, most were \"saved again xtians\" (in my opinion they clamed this so they could get early parol) These cons would recieve their early parol and would be back in prison within 6 months for the same crimes. I have heard alot about prison rehabilitation, I have never seen it work. It is my Opinion a person proven guilty of rape, child molesting, murder,crimes agains old people, and children, should be taken outside the court room door and hung from a tree with a signe around their necks saying what they were convicted of. This is just My Opinion as you can see I'm not the real forgiving type when it comes to these scumbags D.J.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-23 14:49:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "When a person is convicted of a crime such a that in the story I related, ( no Bill it wasn't \"addressed\" to anybody!) They should be segregated from society for the duration of their life. It is the duty of that society to do just that. The treatment of said prisoner ahould be humane and adequate care should be provided. Niether you, nor I, nor is society, compelled to subject itself to the continued danger such a person represents......PERIOD!!! I do not believe in the death penalty unless a full and proven confession is obtained from the miscreant or there is absolutely NO question of guilt ( apprehended in the commission of the crime) and then should be imposed with no appeals process, to salve the misplaced conscience of somebody suffering from some faulty \"group guilt think\" that so many seem to be infected with in this country today. T", 
        "intTime": 20090325, 
        "postID": 13, 
        "quote": "", 
        "reply": "When a person is convicted of a crime such a that in the story I related, ( no Bill it wasn't \"addressed\" to anybody!) They should be segregated from society for the duration of their life. It is the duty of that society to do just that. The treatment of said prisoner ahould be humane and adequate care should be provided. Niether you, nor I, nor is society, compelled to subject itself to the continued danger such a person represents......PERIOD!!! I do not believe in the death penalty unless a full and proven confession is obtained from the miscreant or there is absolutely NO question of guilt ( apprehended in the commission of the crime) and then should be imposed with no appeals process, to salve the misplaced conscience of somebody suffering from some faulty \"group guilt think\" that so many seem to be infected with in this country today. T", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-25 10:05:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "tawodi"
    }, 
    {
        "content": "And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. Paul, was Saul killer of Christians, yet even He was forgiven and become one of the main writers of Scripture knowing just how much HE had been forgiven. (I wonder did he only kill adult believers or did he kill entire families?) King David was an adulterer and a murderer, He too was forgiven. I guess by some folks standard of judgment abortion doctors and those men and women who have their babies killed by means of abortion can never be forgiven either? They even plan and make appointments for those murders to take place every day, yet it is legal to kill a child who is not yet out of the womb in this country.. When they repent..they too can be forgiven..Praise God!! However, I wonder, why if they are truly repentant, do they not stay in prison to live out their time? Why take an early parole? Why not acknowledge, this is the punishment/consequences for my crime, and I will stay here until my time is up? That to me, would show a more repentant heart than one accepting an early parole merely because they stayed out of trouble while in prison.. This message has been edited. Last edited by: 3678131, Sun 26 April 2009 11:24 AM", 
        "intTime": 20090426, 
        "postID": 14, 
        "quote": "", 
        "reply": "And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. Paul, was Saul killer of Christians, yet even He was forgiven and become one of the main writers of Scripture knowing just how much HE had been forgiven. (I wonder did he only kill adult believers or did he kill entire families?) King David was an adulterer and a murderer, He too was forgiven. I guess by some folks standard of judgment abortion doctors and those men and women who have their babies killed by means of abortion can never be forgiven either? They even plan and make appointments for those murders to take place every day, yet it is legal to kill a child who is not yet out of the womb in this country.. When they repent..they too can be forgiven..Praise God!! However, I wonder, why if they are truly repentant, do they not stay in prison to live out their time? Why take an early parole? Why not acknowledge, this is the punishment/consequences for my crime, and I will stay here until my time is up? That to me, would show a more repentant heart than one accepting an early parole merely because they stayed out of trouble while in prison.. This message has been edited. Last edited by: 3678131, Sun 26 April 2009 11:24 AM", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-04-26 10:56:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Praise's be to God that HE forgives even the vilest of sinners Bull. He doesn't forgive the blasphemer, unless, of course he bypasses/survives stoning and is ignorant (1 Tim 1:13) The buy bull is full of admonitions to stone the blasphemer to death, and that his soul won't be saved.", 
        "intTime": 20090426, 
        "postID": 15, 
        "quote": "Praise's be to God that HE forgives even the vilest of sinners", 
        "reply": " Bull. He doesn't forgive the blasphemer, unless, of course he bypasses/survives stoning and is ignorant (1 Tim 1:13) The buy bull is full of admonitions to stone the blasphemer to death, and that his soul won't be saved.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-04-26 13:48:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "funny thing about loving thy neighbor and the ability to forgive... I was just watching the story of jacob and joseph last night... the stories are from so long ago and yet all the lessons still apply today. I was very upset about the role the women played in those two stories... .. thank goodness there are positive stories of great women in the bible, after eve, rebecca, leah and the wife of the egyptian who sat out to get joseph, it was not looking good for the girls. I find the stories of the bible to be gentle reminders of what is right and wrong, and how to love and forgive.", 
        "intTime": 20090525, 
        "postID": 16, 
        "quote": "", 
        "reply": "funny thing about loving thy neighbor and the ability to forgive... I was just watching the story of jacob and joseph last night... the stories are from so long ago and yet all the lessons still apply today. I was very upset about the role the women played in those two stories... .. thank goodness there are positive stories of great women in the bible, after eve, rebecca, leah and the wife of the egyptian who sat out to get joseph, it was not looking good for the girls. I find the stories of the bible to be gentle reminders of what is right and wrong, and how to love and forgive.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-05-25 21:03:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner. Actually during this time there would have been a VERY good chance that the killer would have just had to pay a fine and would then have been released.", 
        "intTime": 20090526, 
        "postID": 17, 
        "quote": "Originally posted by xnavycg: During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner.", 
        "reply": " Actually during this time there would have been a VERY good chance that the killer would have just had to pay a fine and would then have been released.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-05-26 19:19:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by 3678131: And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. The Bible says that I, as a blasphemer of the holy spirit, shall never be forgiven - Mark 3:29 and Luke 12:10 It sounds like murder is less 'vile' than name-calling. Fortunately, there's no holy spirit to blaspheme and no eternal hellfire to fear as punishment. But to the extent that one takes the scripture as truth, I think it's important to reconcile the unethical suggestion that blasphemy deserves punishment worse than that handed out for murder, rape, or any other vile human action. http://www.blasphemychallenge.com/ (2006 campaign) Jason", 
        "intTime": 20090531, 
        "postID": 18, 
        "quote": "Originally posted by 3678131: And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven.", 
        "reply": " The Bible says that I, as a blasphemer of the holy spirit, shall never be forgiven - Mark 3:29 and Luke 12:10 It sounds like murder is less 'vile' than name-calling. Fortunately, there's no holy spirit to blaspheme and no eternal hellfire to fear as punishment. But to the extent that one takes the scripture as truth, I think it's important to reconcile the unethical suggestion that blasphemy deserves punishment worse than that handed out for murder, rape, or any other vile human action. http://www.blasphemychallenge.com/ (2006 campaign) Jason", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-05-31 20:17:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by dday76: quote: Originally posted by 3678131: And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. The Bible says that I, as a blasphemer of the holy spirit, shall never be forgiven - Mark 3:29 and Luke 12:10 It sounds like murder is less 'vile' than name-calling. Fortunately, there's no holy spirit to blaspheme and no eternal hellfire to fear as punishment. But to the extent that one takes the scripture as truth, I think it's important to reconcile the unethical suggestion that blasphemy deserves punishment worse than that handed out for murder, rape, or any other vile human action. http://www.blasphemychallenge.com/ (2006 campaign) Jason Yes, I agree ethically. However, what the blasphemer apparently is doing isn't to a human, thus not a 'vile human action.' It's a self preserving god-thing defending itself from question or cross examination or contrary thought that encompasses the 'sin of'. Obvious, from reading the Bible it becomes clear there is not all that much care for the 'vile humans' regardless of their god-talk - why, according to the myth, the god guy even lets his own son get tortured and murdered! Of course, the mental gymnastics to justify that is the murder/child sacrafice 'saves' everyone else that believes the story is true, etc. The whole issue of what can and cannot be forgiven is a confusing murky swamp of dubious salvation that can bog down any fearful treading insecure human in their quest to settle down their uneasy conscious. Then there is always the big surprise at the end and the folks who end up on the right hand of god (the good guys and gals) didn't even realize they were doing anything at all to placate the questionably forgiving God (Math 25 'sheep & goats' story.) But, as you note, it is just a story (a terror story, actually) and there is nothing like that to fret about. Our real state of being on this temporal fragile sphere is what one should fret about! Especially the population of religious nuts who attempt to bring about their madness in the name of their non-existent being!", 
        "intTime": 20090531, 
        "postID": 19, 
        "quote": "Originally posted by dday76: quote: Originally posted by 3678131: And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. The Bible says that I, as a blasphemer of the holy spirit, shall never be forgiven - Mark 3:29 and Luke 12:10 It sounds like murder is less 'vile' than name-calling. Fortunately, there's no holy spirit to blaspheme and no eternal hellfire to fear as punishment. But to the extent that one takes the scripture as truth, I think it's important to reconcile the unethical suggestion that blasphemy deserves punishment worse than that handed out for murder, rape, or any other vile human action. http://www.blasphemychallenge.com/ (2006 campaign) Jason", 
        "reply": " Yes, I agree ethically. However, what the blasphemer apparently is doing isn't to a human, thus not a 'vile human action.' It's a self preserving god-thing defending itself from question or cross examination or contrary thought that encompasses the 'sin of'. Obvious, from reading the Bible it becomes clear there is not all that much care for the 'vile humans' regardless of their god-talk - why, according to the myth, the god guy even lets his own son get tortured and murdered! Of course, the mental gymnastics to justify that is the murder/child sacrafice 'saves' everyone else that believes the story is true, etc. The whole issue of what can and cannot be forgiven is a confusing murky swamp of dubious salvation that can bog down any fearful treading insecure human in their quest to settle down their uneasy conscious. Then there is always the big surprise at the end and the folks who end up on the right hand of god (the good guys and gals) didn't even realize they were doing anything at all to placate the questionably forgiving God (Math 25 'sheep & goats' story.) But, as you note, it is just a story (a terror story, actually) and there is nothing like that to fret about. Our real state of being on this temporal fragile sphere is what one should fret about! Especially the population of religious nuts who attempt to bring about their madness in the name of their non-existent being!", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-05-31 20:30:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: However, what the blasphemer apparently is doing isn't to a human. Our real state of being on this temporal fragile sphere is what one should fret about! Especially the population of religious nuts who attempt to bring about their madness in the name of their non-existent being! I agree. I have plenty of awe and wonder and excitement as I spend my short life trying to create joy and love and purpose as I cling tightly to a small rock hurtling at 400,000 mph through this giant death trap of a universe. Jason ps. blasphemy is a victimless crime.", 
        "intTime": 20090601, 
        "postID": 20, 
        "quote": "Originally posted by reducetension: However, what the blasphemer apparently is doing isn't to a human. Our real state of being on this temporal fragile sphere is what one should fret about! Especially the population of religious nuts who attempt to bring about their madness in the name of their non-existent being!", 
        "reply": " I agree. I have plenty of awe and wonder and excitement as I spend my short life trying to create joy and love and purpose as I cling tightly to a small rock hurtling at 400,000 mph through this giant death trap of a universe. Jason ps. blasphemy is a victimless crime.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 06:59:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong.", 
        "intTime": 20090601, 
        "postID": 21, 
        "quote": "ps. blasphemy is a victimless crime.", 
        "reply": " You could not possibly be more wrong.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 09:10:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong. Blasphemy, noun a: the act of insulting or showing contempt or lack of reverence for God b: the act of claiming the attributes of deity The only \"victim\" of blasphemy is the individual who blasphemes - and those who might follow them (in the case of definition b., the followers of Pat Robertson or James Hagee or many televangelists who often treat these \"ministers\" as mini-deities or demi-gods).", 
        "intTime": 20090601, 
        "postID": 22, 
        "quote": "Originally posted by soscorpio: quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong.", 
        "reply": " Blasphemy, noun a: the act of insulting or showing contempt or lack of reverence for God b: the act of claiming the attributes of deity The only \"victim\" of blasphemy is the individual who blasphemes - and those who might follow them (in the case of definition b., the followers of Pat Robertson or James Hagee or many televangelists who often treat these \"ministers\" as mini-deities or demi-gods).", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 10:21:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong. A crime must have a formal sanction initiated by an authorized body of people (not gods) such as the legislature. Religion and its ideas has no weight in the matter for us humans. Thus, as far as I know, no where in the US is blasphemy a crime. \"Victimless\" is problematic as that usually involves a consensual act between two or more adults and the god-idea is neither human nor adult. It is victimless in that typically it is a voluntary act/expression by an individual concerning an idea that has no basis in reality. You can't arrest, prosecute or punish anyone for blasphemy in this modern secular society. It's a disturbing idea or even mental illness of sorts to believe the act of blasphemy will get you punished by unseen uncollaborated forces. It's a phobia of sort related to Zeusophobia- Fear of God or gods. It's another religious notion of terrorism to control and conscript people into the cult of 'boogie man's gona get ya' if you are not nice to her/him/it/that.", 
        "intTime": 20090601, 
        "postID": 23, 
        "quote": "Originally posted by soscorpio: quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong.", 
        "reply": " A crime must have a formal sanction initiated by an authorized body of people (not gods) such as the legislature. Religion and its ideas has no weight in the matter for us humans. Thus, as far as I know, no where in the US is blasphemy a crime. \"Victimless\" is problematic as that usually involves a consensual act between two or more adults and the god-idea is neither human nor adult. It is victimless in that typically it is a voluntary act/expression by an individual concerning an idea that has no basis in reality. You can't arrest, prosecute or punish anyone for blasphemy in this modern secular society. It's a disturbing idea or even mental illness of sorts to believe the act of blasphemy will get you punished by unseen uncollaborated forces. It's a phobia of sort related to Zeusophobia- Fear of God or gods. It's another religious notion of terrorism to control and conscript people into the cult of 'boogie man's gona get ya' if you are not nice to her/him/it/that.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 10:35:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: The only \"victim\" of blasphemy is the individual who blasphemes - and those who might follow them Bingo in bold type! Narcissism is a common trait among the most dangerous. Those that blaspheme against God usually do so to build themselves up in the eyes of their prospective followers. Blasphemy will lead more away from God and into sin than any other crime because of the narcisstic personalities that mankind enjoys fawning over. it's a horrible crime in which at one point or another we have all been victimized.", 
        "intTime": 20090601, 
        "postID": 24, 
        "quote": "The only \"victim\" of blasphemy is the individual who blasphemes - and those who might follow them", 
        "reply": " Bingo in bold type! Narcissism is a common trait among the most dangerous. Those that blaspheme against God usually do so to build themselves up in the eyes of their prospective followers. Blasphemy will lead more away from God and into sin than any other crime because of the narcisstic personalities that mankind enjoys fawning over. it's a horrible crime in which at one point or another we have all been victimized.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 11:28:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: it's a horrible crime in which at one point or another we have all been victimized. Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?'", 
        "intTime": 20090601, 
        "postID": 25, 
        "quote": "it's a horrible crime in which at one point or another we have all been victimized.", 
        "reply": " Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?'", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 11:44:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?' By definition, one cannot blaspheme a lie, but to blaspheme the truth causes great havoc for society, as modern times prove.", 
        "intTime": 20090601, 
        "postID": 26, 
        "quote": "Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?'", 
        "reply": " By definition, one cannot blaspheme a lie, but to blaspheme the truth causes great havoc for society, as modern times prove.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 11:50:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?' By definition, one cannot blaspheme a lie, but to blaspheme the truth causes great havoc for society, as modern times prove. And just how does it do that. Prove it.", 
        "intTime": 20090601, 
        "postID": 27, 
        "quote": "Originally posted by soscorpio: quote: Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?' By definition, one cannot blaspheme a lie, but to blaspheme the truth causes great havoc for society, as modern times prove.", 
        "reply": " And just how does it do that. Prove it.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 11:54:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: And just how does it do that. Prove it. Blasphemy is a vicious crime that has many, many victims. the good truth keeps mankind free, lies against the truth (blasphemy) enslave and do even worse than slavery.", 
        "intTime": 20090601, 
        "postID": 28, 
        "quote": "And just how does it do that. Prove it.", 
        "reply": " Blasphemy is a vicious crime that has many, many victims. the good truth keeps mankind free, lies against the truth (blasphemy) enslave and do even worse than slavery.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 12:06:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: And just how does it do that. Prove it. Blasphemy is a vicious crime that has many, many victims. the good truth keeps mankind free, lies against the truth (blasphemy) enslave and do even worse than slavery. Truth, eh? Then you admit you're a blasphemer against reason?", 
        "intTime": 20090601, 
        "postID": 29, 
        "quote": "Originally posted by soscorpio: quote: And just how does it do that. Prove it. Blasphemy is a vicious crime that has many, many victims. the good truth keeps mankind free, lies against the truth (blasphemy) enslave and do even worse than slavery.", 
        "reply": " Truth, eh? Then you admit you're a blasphemer against reason?", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 12:26:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "Blasphemy is only a crime of perspective. You can make a crass comment about Thor, and to you it's nothing but a joke. To those who honor Thor as their patron God, it's blasphemy. If I make a crass comment about Jesus, to you it's blasphemy against a deity. To me, it's a sarcastic jab at the people who follow a man that they think was a God. In a nation that has both freedom of religion and freedom of speech, it is impossible to declare blasphemy a crime. You can PERSONALLY treat it as wrong, but you will only see blasphemy that applies to your perspective, against your Gods. Blasphemy is defined only by those who believe in the deity being blasphemed. Blasphemy against Thor, Cernunnos, Herne, Apollo, Diana, Bridget, Hecate, Artemis, or Zeus would mean nothing to you, and you would mock all those deities without giving it a second thought. You are a non-believer and a blasphemer against that which you do not believe, no more and no less than I am a blasphemer against that which I do not believe. In your church, you would consider me a blasphemer; I do not attend your church. In my church, you would be considered a blasphemer; you do not attend my church. And in America, neither of us is guilty of a crime.", 
        "intTime": 20090601, 
        "postID": 30, 
        "quote": "", 
        "reply": "Blasphemy is only a crime of perspective. You can make a crass comment about Thor, and to you it's nothing but a joke. To those who honor Thor as their patron God, it's blasphemy. If I make a crass comment about Jesus, to you it's blasphemy against a deity. To me, it's a sarcastic jab at the people who follow a man that they think was a God. In a nation that has both freedom of religion and freedom of speech, it is impossible to declare blasphemy a crime. You can PERSONALLY treat it as wrong, but you will only see blasphemy that applies to your perspective, against your Gods. Blasphemy is defined only by those who believe in the deity being blasphemed. Blasphemy against Thor, Cernunnos, Herne, Apollo, Diana, Bridget, Hecate, Artemis, or Zeus would mean nothing to you, and you would mock all those deities without giving it a second thought. You are a non-believer and a blasphemer against that which you do not believe, no more and no less than I am a blasphemer against that which I do not believe. In your church, you would consider me a blasphemer; I do not attend your church. In my church, you would be considered a blasphemer; you do not attend my church. And in America, neither of us is guilty of a crime.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 13:05:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Book of Matthew, Chapter 25, Verses 31 to 46: quote: [31] When the Son of man shall come in his glory, and all the holy angels with him, then shall he sit upon the throne of his glory: [32] And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats: [33] And he shall set the sheep on his right hand, but the goats on the left. [34] Then shall the King say unto them on his right hand, Come, ye blessed of my Father, inherit the kingdom prepared for you from the foundation of the world: [35] For I was hungry, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in: [36] Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me. [37] Then shall the righteous answer him, saying, Lord, when saw we thee hungry, and fed thee? or thirsty, and gave thee drink? [38] When saw we thee a stranger, and took thee in? or naked, and clothed thee? [39] Or when saw we thee sick, or in prison, and came unto thee? [40] And the King shall answer and say unto them, Verily I say unto you, Inasmuch as ye have done it unto one of the least of these my brethren, ye have done it unto me. [41] Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels: [42] For I was hungry, and ye gave me no meat: I was thirsty, and ye gave me no drink: [43] I was a stranger, and ye took me not in: naked, and ye clothed me not: sick, and in prison, and ye visited me not. [44] Then shall they also answer him, saying, Lord, when saw we thee hungry, or thirsty, or a stranger, or naked, or sick, or in prison, and did not minister unto thee? [45] Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me. [46] And these shall go away into everlasting punishment: but the righteous into life eternal. \"http://www.boston.com/news/local/new_hampshire/articles/2009/03/19/pastors_outreach_hits_a_nerve?mode=PF\" quote: Chichester, N.H. - At lunchtime yesterday, as reporters circled on the dirt road outside and the Rev. David Pinckney's cellphone kept ringing, the pastor took a break and sat down for lunch in the kitchen of his home with his new friend, convicted child killer Raymond Guay. The two men hardly knew each other a week ago. But since Friday, when Pinckney invited Guay, recently paroled, to live with him and his family of five children, the two men's lives have become intertwined. In recent days, both have become pariahs in this tiny, rural New Hampshire community in the hills outside Concord - Pinckney because of his act of kindness and Guay because of his act of evil. Some locals don't claim to understand either, and many want to run Guay out of town. Fear is rampant and growing. Many children here are no longer allowed to play outside. Pinckney said he has received more than one threatening phone call from angry people. \"No Kid Killers,\" says one sign in town, hanging off the side of a parked pickup truck. And people have appealed to elected officials as well. In a town meeting this week, more than 200 people gathered to ask that Guay go somewhere else. But forcing someone to leave isn't exactly easy, or legal. By order of a federal judge, Guay, 60, is supposed to remain in New Hampshire to serve three years of parole. And Pinckney, inviting a reporter into his home for the first time yesterday on the condition that no questions be asked of Guay, made it clear that, protests or not, he and his family are not backing down from their decision to allow Guay to live with them. In fact, on the contrary, Pinckney said, Guay is becoming a beloved house guest. The tall, lanky man with a narrow face and bushy gray beard is making himself useful around the house, helping the Pinckney family to complete an addition above the garage... Convinced that Guay is a changed man - a convert and devoted Christian - Pinckney decided to take the ex-convict into his home for the next two months. And so the *****ly problem of Raymond Guay came to tiny Chichester, population 2,400. \"We were warned,\" said Pinckney, who has four children, ages 13 to 18, living at home and a fifth, age 19, away at school. \"It was said this could disrupt life. People wouldn't like it. He's not liked. But at the end of the day, this is what Jesus did. He defended the defenseless. He was a friend of sinners.\" Few, if anyone, question Pinckney's intentions. The easygoing minister, who preaches on Sundays while wearing jeans and insists that people call him Dave, is well liked and respected in Chichester. But bringing a high-profile ex-convict, reformed or not, to a rural community where chickens outnumber police officers by a wide margin has not gone unnoticed. \"It's a quiet town,\" said Chichester Selectman Jeff Jordan. \"Somebody's cows getting out in the road, that's the worst thing that happens.\"... But now many locals feel like prisoners in their own homes. Smith said he will not allow his 11-year-old daughter to feed her pony, Wilma, alone anymore. Ingram, who lives near Pinckney, has blocked her back deck with the family's gas grill, a barrier to make sure the children do not go wandering. And police understand the fear. There are just four full-time officers in Chichester. \"My concern is safety,\" said Merrimack County Sheriff Scott Hilliard, whose department assists Chichester police. \"That's the priority, safety of the citizens. To be perfectly honest, I wouldn't want Mr. Guay to be living in my town. I'm a parent, too.\" Pinckney said he appreciates law enforcement officers' concerns - and their support. What's disappointed him, he said, are the reactions of others, given the lengths he is taking to keep Guay under close watch. Though Guay is legally free to go where he pleases, he has agreed to Pinckney's terms that he always remain under adult supervision, and has even volunteered to wear a movement-tracking ankle bracelet like an inmate on house arrest. \"I'm telling you, there are more dangers on my road with alcohol and firearms than there is with Raymond Guay,\" Pinckney said yesterday. \"I would not have brought him into my home if I thought he was a danger to my town, my neighborhood, my neighbors, or my children.\" \"http://www.boston.com/news/local/new_hampshire/articles/2009/03/19/pastors_outreach_hits_a_nerve/?page=2#commentAnchor\" quote: Liberals cannot seem to grasp the concepts of guilt and innocence, evil and good. let's spell it out. Murdering a child= bad, very bad. Murderer = bad, Child = innocent. Serving some time in prison does not make bad people good. Bad/evil people like this cannot be trusted near children because they have demonstrated that they like to harm and kill children. Prison does not change this, nothing changes this. Just as you cannot change a homosexual, or a heterosexual, you cannot cure a child predator. Child murderers do not earn back their innocence by doing time. They don't pay any debt to society, (ask the boy's mother if she feels \"repaid\" for the agony and loss she suffered). They are not and never will be safe, or trustworthy, that is why they should be executed. If I was the victims dad or mother, I would hunt this creep down and make sure he never destroyed another child. If I had terminal cancer, I might do it myself... quote: For all you religion bashers out there, this is more a symptom of Loony Left Liberalism, than that of religion. As a Christian, I believe that an eye for an eye should have come into play here, not 35 years in prison... quote: People in Chichester really want to get rid of this guy? It's quite simple. Stop going to the church this pastor works at. Once the collection plates run dry, the church will act and either fire him or transfer him... quote: I believe that Child welfare should step in and take all of his children away while the pastor and this fellow enjoy one anothers company in the comfort of the children's home. Crazy pastor... quote: I find it insane for him to bring the man into his home where his children live. That's great he thinks he's doing a good deed, but some things are just unforgivable. He also had no consideration for the neighbors... quote: Those of you, members of this Reverend's church; I think you should, all, boycott church services and meetings. March and protest outside of all services and meeting with signs showing your disapproval for what he is doing. We can see what a nut this Reverend is, but I wonder what kind of a nut the mother of these children is. She should put out the Rev. and his new boyfriend, or take the children and move out. If not, I think Child Protective Services should step in and remove these children from the dangerous situation in which they have been placed, by their own father and mother. C'mon, Mom, grow a backbone and don't allow this in your home. You carried these children for 9 months, gave birth, and have been nurturing them. Don't let this clown you married put their lives in danger. And finally: \"http://www.seacoastonline.com/articles/20090318-OPINION-90318016\" quote: When they learned that a local pastor was prepared to take a convicted child killer into his home after the man's release from prison, the townsfolk eagerly lit their handy dandy Acme Villager Torch and did their level best to make sure the new resident was not welcome. Nothing says \"ey, we're here to encourage you to learn to walk the straight and narrow!\"like blind hatred and arson threats... Everyone has their breaking point, and the Chichester residents are making a beeline for parolee Raymond Guay's. Maybe they think if enough people aim their hatred at Guay, he'll kill again and be put away for life. Problem solved... Nobody will hire this man. Anyone who offers to give him a home while he tries to put his life back together will be threatened. Anyone who shows him friendship will be made to suffer... The residents are claiming their children are frightened and can’t sleep. Now why would that be? It certainly couldn’t be due to the fact that they told their children awful things about Guay, could it? Surely all their children are psychic and suddenly, with no foreknowledge, awoke in the night from a premonitory dream, screaming, “Mommy, an evil man is coming to town I’m going to die next!” Children aren’t afraid of things they don’t know about. The town of Chichester is determined to spread their prejudice down through the generations. It’s the legacy they’re giving their children... From the accounts that came out of their little town meeting, it sounds like given half a chance, the women of this community would gladly load their shotguns and open fire on Guay rather than give him a chance to prove that he’s seen the error of his ways. It somehow eludes these people that they’ll be doing the same thing Guay did so many years ago. They’ll be killing someone’s child. In cold blood.", 
        "intTime": 20090320, 
        "postID": 31, 
        "quote": "[31] When the Son of man shall come in his glory, and all the holy angels with him, then shall he sit upon the throne of his glory: [32] And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats: [33] And he shall set the sheep on his right hand, but the goats on the left. [34] Then shall the King say unto them on his right hand, Come, ye blessed of my Father, inherit the kingdom prepared for you from the foundation of the world: [35] For I was hungry, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in: [36] Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me. [37] Then shall the righteous answer him, saying, Lord, when saw we thee hungry, and fed thee? or thirsty, and gave thee drink? [38] When saw we thee a stranger, and took thee in? or naked, and clothed thee? [39] Or when saw we thee sick, or in prison, and came unto thee? [40] And the King shall answer and say unto them, Verily I say unto you, Inasmuch as ye have done it unto one of the least of these my brethren, ye have done it unto me. [41] Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels: [42] For I was hungry, and ye gave me no meat: I was thirsty, and ye gave me no drink: [43] I was a stranger, and ye took me not in: naked, and ye clothed me not: sick, and in prison, and ye visited me not. [44] Then shall they also answer him, saying, Lord, when saw we thee hungry, or thirsty, or a stranger, or naked, or sick, or in prison, and did not minister unto thee? [45] Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me. [46] And these shall go away into everlasting punishment: but the righteous into life eternal.", 
        "reply": "Book of Matthew, Chapter 25, Verses 31 to 46:  \"http://www.boston.com/news/local/new_hampshire/articles/2009/03/19/pastors_outreach_hits_a_nerve?mode=PF\" quote: Chichester, N.H. - At lunchtime yesterday, as reporters circled on the dirt road outside and the Rev. David Pinckney's cellphone kept ringing, the pastor took a break and sat down for lunch in the kitchen of his home with his new friend, convicted child killer Raymond Guay. The two men hardly knew each other a week ago. But since Friday, when Pinckney invited Guay, recently paroled, to live with him and his family of five children, the two men's lives have become intertwined. In recent days, both have become pariahs in this tiny, rural New Hampshire community in the hills outside Concord - Pinckney because of his act of kindness and Guay because of his act of evil. Some locals don't claim to understand either, and many want to run Guay out of town. Fear is rampant and growing. Many children here are no longer allowed to play outside. Pinckney said he has received more than one threatening phone call from angry people. \"No Kid Killers,\" says one sign in town, hanging off the side of a parked pickup truck. And people have appealed to elected officials as well. In a town meeting this week, more than 200 people gathered to ask that Guay go somewhere else. But forcing someone to leave isn't exactly easy, or legal. By order of a federal judge, Guay, 60, is supposed to remain in New Hampshire to serve three years of parole. And Pinckney, inviting a reporter into his home for the first time yesterday on the condition that no questions be asked of Guay, made it clear that, protests or not, he and his family are not backing down from their decision to allow Guay to live with them. In fact, on the contrary, Pinckney said, Guay is becoming a beloved house guest. The tall, lanky man with a narrow face and bushy gray beard is making himself useful around the house, helping the Pinckney family to complete an addition above the garage... Convinced that Guay is a changed man - a convert and devoted Christian - Pinckney decided to take the ex-convict into his home for the next two months. And so the *****ly problem of Raymond Guay came to tiny Chichester, population 2,400. \"We were warned,\" said Pinckney, who has four children, ages 13 to 18, living at home and a fifth, age 19, away at school. \"It was said this could disrupt life. People wouldn't like it. He's not liked. But at the end of the day, this is what Jesus did. He defended the defenseless. He was a friend of sinners.\" Few, if anyone, question Pinckney's intentions. The easygoing minister, who preaches on Sundays while wearing jeans and insists that people call him Dave, is well liked and respected in Chichester. But bringing a high-profile ex-convict, reformed or not, to a rural community where chickens outnumber police officers by a wide margin has not gone unnoticed. \"It's a quiet town,\" said Chichester Selectman Jeff Jordan. \"Somebody's cows getting out in the road, that's the worst thing that happens.\"... But now many locals feel like prisoners in their own homes. Smith said he will not allow his 11-year-old daughter to feed her pony, Wilma, alone anymore. Ingram, who lives near Pinckney, has blocked her back deck with the family's gas grill, a barrier to make sure the children do not go wandering. And police understand the fear. There are just four full-time officers in Chichester. \"My concern is safety,\" said Merrimack County Sheriff Scott Hilliard, whose department assists Chichester police. \"That's the priority, safety of the citizens. To be perfectly honest, I wouldn't want Mr. Guay to be living in my town. I'm a parent, too.\" Pinckney said he appreciates law enforcement officers' concerns - and their support. What's disappointed him, he said, are the reactions of others, given the lengths he is taking to keep Guay under close watch. Though Guay is legally free to go where he pleases, he has agreed to Pinckney's terms that he always remain under adult supervision, and has even volunteered to wear a movement-tracking ankle bracelet like an inmate on house arrest. \"I'm telling you, there are more dangers on my road with alcohol and firearms than there is with Raymond Guay,\" Pinckney said yesterday. \"I would not have brought him into my home if I thought he was a danger to my town, my neighborhood, my neighbors, or my children.\" \"http://www.boston.com/news/local/new_hampshire/articles/2009/03/19/pastors_outreach_hits_a_nerve/?page=2#commentAnchor\" quote: Liberals cannot seem to grasp the concepts of guilt and innocence, evil and good. let's spell it out. Murdering a child= bad, very bad. Murderer = bad, Child = innocent. Serving some time in prison does not make bad people good. Bad/evil people like this cannot be trusted near children because they have demonstrated that they like to harm and kill children. Prison does not change this, nothing changes this. Just as you cannot change a homosexual, or a heterosexual, you cannot cure a child predator. Child murderers do not earn back their innocence by doing time. They don't pay any debt to society, (ask the boy's mother if she feels \"repaid\" for the agony and loss she suffered). They are not and never will be safe, or trustworthy, that is why they should be executed. If I was the victims dad or mother, I would hunt this creep down and make sure he never destroyed another child. If I had terminal cancer, I might do it myself... quote: For all you religion bashers out there, this is more a symptom of Loony Left Liberalism, than that of religion. As a Christian, I believe that an eye for an eye should have come into play here, not 35 years in prison... quote: People in Chichester really want to get rid of this guy? It's quite simple. Stop going to the church this pastor works at. Once the collection plates run dry, the church will act and either fire him or transfer him... quote: I believe that Child welfare should step in and take all of his children away while the pastor and this fellow enjoy one anothers company in the comfort of the children's home. Crazy pastor... quote: I find it insane for him to bring the man into his home where his children live. That's great he thinks he's doing a good deed, but some things are just unforgivable. He also had no consideration for the neighbors... quote: Those of you, members of this Reverend's church; I think you should, all, boycott church services and meetings. March and protest outside of all services and meeting with signs showing your disapproval for what he is doing. We can see what a nut this Reverend is, but I wonder what kind of a nut the mother of these children is. She should put out the Rev. and his new boyfriend, or take the children and move out. If not, I think Child Protective Services should step in and remove these children from the dangerous situation in which they have been placed, by their own father and mother. C'mon, Mom, grow a backbone and don't allow this in your home. You carried these children for 9 months, gave birth, and have been nurturing them. Don't let this clown you married put their lives in danger. And finally: \"http://www.seacoastonline.com/articles/20090318-OPINION-90318016\" quote: When they learned that a local pastor was prepared to take a convicted child killer into his home after the man's release from prison, the townsfolk eagerly lit their handy dandy Acme Villager Torch and did their level best to make sure the new resident was not welcome. Nothing says \"ey, we're here to encourage you to learn to walk the straight and narrow!\"like blind hatred and arson threats... Everyone has their breaking point, and the Chichester residents are making a beeline for parolee Raymond Guay's. Maybe they think if enough people aim their hatred at Guay, he'll kill again and be put away for life. Problem solved... Nobody will hire this man. Anyone who offers to give him a home while he tries to put his life back together will be threatened. Anyone who shows him friendship will be made to suffer... The residents are claiming their children are frightened and can’t sleep. Now why would that be? It certainly couldn’t be due to the fact that they told their children awful things about Guay, could it? Surely all their children are psychic and suddenly, with no foreknowledge, awoke in the night from a premonitory dream, screaming, “Mommy, an evil man is coming to town I’m going to die next!” Children aren’t afraid of things they don’t know about. The town of Chichester is determined to spread their prejudice down through the generations. It’s the legacy they’re giving their children... From the accounts that came out of their little town meeting, it sounds like given half a chance, the women of this community would gladly load their shotguns and open fire on Guay rather than give him a chance to prove that he’s seen the error of his ways. It somehow eludes these people that they’ll be doing the same thing Guay did so many years ago. They’ll be killing someone’s child. In cold blood.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-20 06:54:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "You made a judgment. God is going to send everyone \"away into everlasting punishment [46]\" because they were fearful of a murdering rapist? Then, he isn't very Jesus-like, is he?", 
        "intTime": 20090320, 
        "postID": 32, 
        "quote": "", 
        "reply": "You made a judgment. God is going to send everyone \"away into everlasting punishment [46]\" because they were fearful of a murdering rapist? Then, he isn't very Jesus-like, is he?", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-20 07:47:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "I don't know all the details and backstory behind this particular incident, but I know the church doesn't mind sending child rapists into family neighborhoods. Found this on the news recently: \"http://www.unionleader.com/article.aspx?headline=Defrocked+child+rapist+owns+property+in+NH&articleId=94aeda7b-2e42-49fc-9f70-c24ad7d3fdeb The topic was linked on CNN a couple of days ago. Seems that this guy was guilty of multiple counts of child rape from a couple of decades ago. The church knew about it, but instead of turning him over to the police, they told him to go \"lay low\" in New Hampshire... in MY NEIGHBORHOOD. I used to ride my bicycle by this criminal's house every day during the summers. He lived there almost the entire time I lived there. When they finally caught, arrested, convicted, and sentenced him, he only served a few years... and now they're letting him loose again! And instead of taking care of their own dirt, Massachusetts is sending sending this guy back to New Hampshire for probation! But the point is that the church KNEW this guy was a child rapist, and they let him live in my neighborhood for years. That's a family neighborhood. Lots of kids, quiet streets. quote: Gale owns a camp at 100 Lake Shore Drive on Sunrise Lake in Middleton, according to registry records. He bought the property in 1983 when he was assigned to St. Luke Parish in Waltham, Mass., records show. I dunno, maybe Rev. David Pinckney thinks he's doing the work of Jesus, and at least I'll give him credit for not being a hypocrite about the teachings of Jesus in the Bible, but seriously... letting a convicted murderer into a home with children? If he wants to risk his own life, let him, but when there are kids involved, the rules change. In summary: As a member of the clergy, you'd think he would care about children... but clearly, based on the treatment of child rapists by the church in the past, church leadership really doesn't care about children at all.", 
        "intTime": 20090320, 
        "postID": 33, 
        "quote": "Gale owns a camp at 100 Lake Shore Drive on Sunrise Lake in Middleton, according to registry records. He bought the property in 1983 when he was assigned to St. Luke Parish in Waltham, Mass., records show.", 
        "reply": "I don't know all the details and backstory behind this particular incident, but I know the church doesn't mind sending child rapists into family neighborhoods. Found this on the news recently: \"http://www.unionleader.com/article.aspx?headline=Defrocked+child+rapist+owns+property+in+NH&articleId=94aeda7b-2e42-49fc-9f70-c24ad7d3fdeb The topic was linked on CNN a couple of days ago. Seems that this guy was guilty of multiple counts of child rape from a couple of decades ago. The church knew about it, but instead of turning him over to the police, they told him to go \"lay low\" in New Hampshire... in MY NEIGHBORHOOD. I used to ride my bicycle by this criminal's house every day during the summers. He lived there almost the entire time I lived there. When they finally caught, arrested, convicted, and sentenced him, he only served a few years... and now they're letting him loose again! And instead of taking care of their own dirt, Massachusetts is sending sending this guy back to New Hampshire for probation! But the point is that the church KNEW this guy was a child rapist, and they let him live in my neighborhood for years. That's a family neighborhood. Lots of kids, quiet streets.  I dunno, maybe Rev. David Pinckney thinks he's doing the work of Jesus, and at least I'll give him credit for not being a hypocrite about the teachings of Jesus in the Bible, but seriously... letting a convicted murderer into a home with children? If he wants to risk his own life, let him, but when there are kids involved, the rules change. In summary: As a member of the clergy, you'd think he would care about children... but clearly, based on the treatment of child rapists by the church in the past, church leadership really doesn't care about children at all.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-20 11:17:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "I just re-read the scripture I quoted in my OP - and I failed to see where Jesus made an exception based on the type of the crime. He said \"I was in prison, and ye came unto me\", not \"I was in prison for a crime other than child abuse or child murder, and ye came unto me. If I was in prison for either child abuse or child murder, I could understand why you didn't come unto me\". Jesus also didn't say, \"If someone helps a former prisoner who committed child abuse or child murder, burn his home and place of worship to the ground and give his children to others to be raised to adulthood\", as some of those New Hampshire \"Christians\" are saying should be done.", 
        "intTime": 20090321, 
        "postID": 34, 
        "quote": "", 
        "reply": "I just re-read the scripture I quoted in my OP - and I failed to see where Jesus made an exception based on the type of the crime. He said \"I was in prison, and ye came unto me\", not \"I was in prison for a crime other than child abuse or child murder, and ye came unto me. If I was in prison for either child abuse or child murder, I could understand why you didn't come unto me\". Jesus also didn't say, \"If someone helps a former prisoner who committed child abuse or child murder, burn his home and place of worship to the ground and give his children to others to be raised to adulthood\", as some of those New Hampshire \"Christians\" are saying should be done.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-21 06:38:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I say it again. You don't find it a little crazy that this \"savior\" would send people away for eternal punishment for being afraid of a murdering rapist? Isn't he supposed to be the lamb, the light, and the gentle shepherd of his flock? But don't his actions bespeak a man who would turn on his friends like a viper for any perceived offense and send them to a punishment un-befitting the crime he perceived? Maybe the lesson you're trying to convey is valid. I don't know, and you can't know either. You haven't met the parson of whom you speak, nor have you met the con. You don't know if he actually is a rapist or sex offender. But, you're trying to make a blanket statement about the nature of nurture, if you will. It's an issue we all struggle with, no matter whether we've read the gospel or not. But you, unaware of what you're actually talking about first hand, suggest you would like us all to go to hell for eternity if we hesitate a moment when considering keeping a con in the house with our kids.", 
        "intTime": 20090321, 
        "postID": 35, 
        "quote": "", 
        "reply": "I say it again. You don't find it a little crazy that this \"savior\" would send people away for eternal punishment for being afraid of a murdering rapist? Isn't he supposed to be the lamb, the light, and the gentle shepherd of his flock? But don't his actions bespeak a man who would turn on his friends like a viper for any perceived offense and send them to a punishment un-befitting the crime he perceived? Maybe the lesson you're trying to convey is valid. I don't know, and you can't know either. You haven't met the parson of whom you speak, nor have you met the con. You don't know if he actually is a rapist or sex offender. But, you're trying to make a blanket statement about the nature of nurture, if you will. It's an issue we all struggle with, no matter whether we've read the gospel or not. But you, unaware of what you're actually talking about first hand, suggest you would like us all to go to hell for eternity if we hesitate a moment when considering keeping a con in the house with our kids.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-21 15:15:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "The \"con\" in question raped and murdered a twelve year old and while in prison stabbed another inmate I can't seem to find out what the fate of that inmate was.....not too amazing, it might cloud the issue of his, the released inmate's, \"rehabilitation\" Also he was transferred to several prisons during his incarceration and his crime, as near as I can find, was committed in Mass. He recieved his parole from the California board of corrections and parole and was remanded to New Hampshire for that parole. Once again all of the above shows how good life without parole is........ Now, it would be my suggestion, for who ever has a problem with people who do not want a child killer and rapist living next door to them, step forward put YOUR name on the list and bring them to YOUR home and neighborhood!! It will probably go as well for you, as it did for a local woman, who was the daughter of a former Connecticut Governor.Laurie Urs. In the bucholic town of Chatham MA. about eight years ago she had been having an in prison \"friendship\" and an out of prison \"relationship,\" with an inmate who had been rehabilitated. Well it seems that she considered the relationship over, but there was some small disagreement about that, with the soon to be former paramour. He showed up at two Oclock in the morning, armed with a shot gun, broke in raped mom a couple of times and while doing so, beat the crap out of her. Then Mom escaped from the evil cluthes of said nasty person, only forgetting one small detail......her fourteen year old daughter, who was cowering in the house listening to the beating and repeated rape of her mother, the child was understandably upset, you may grant. Well, upon discovering the weeping child the \"rehabilitated\" inmate then proceeded to rape, for fourteen hours, this child, who had been left behind, by her loving mother!! The police were duly notified and the standoff ensued. During this time of negotiation, the Inmate would partake of the daughter every hour and a half or so. He must have considered her to be quite succulent after her old worn out 34 year old mother after all, so who can blame the poor misunderstood inmate!!??!! Flash forward to now, nobody knows where the kid is, the mother has been in and out of rehab and counselling and by the way, everybody seems to have lost track of the kid!! But it's hard to find anybody who remembered the kid after the trauma the poor, poor, pitiful, misled mama, endured by the betrayal of the inmate!!! So as I said, suggestions for your ideas about a suitable place of residence will be entertained, as long as YOUR house is at the TOP of the list!!! Oh yes, the inmate is eligible for parole next year. Send in that name now!! Don't forget!!!!", 
        "intTime": 20090322, 
        "postID": 36, 
        "quote": "", 
        "reply": "The \"con\" in question raped and murdered a twelve year old and while in prison stabbed another inmate I can't seem to find out what the fate of that inmate was.....not too amazing, it might cloud the issue of his, the released inmate's, \"rehabilitation\" Also he was transferred to several prisons during his incarceration and his crime, as near as I can find, was committed in Mass. He recieved his parole from the California board of corrections and parole and was remanded to New Hampshire for that parole. Once again all of the above shows how good life without parole is........ Now, it would be my suggestion, for who ever has a problem with people who do not want a child killer and rapist living next door to them, step forward put YOUR name on the list and bring them to YOUR home and neighborhood!! It will probably go as well for you, as it did for a local woman, who was the daughter of a former Connecticut Governor.Laurie Urs. In the bucholic town of Chatham MA. about eight years ago she had been having an in prison \"friendship\" and an out of prison \"relationship,\" with an inmate who had been rehabilitated. Well it seems that she considered the relationship over, but there was some small disagreement about that, with the soon to be former paramour. He showed up at two Oclock in the morning, armed with a shot gun, broke in raped mom a couple of times and while doing so, beat the crap out of her. Then Mom escaped from the evil cluthes of said nasty person, only forgetting one small detail......her fourteen year old daughter, who was cowering in the house listening to the beating and repeated rape of her mother, the child was understandably upset, you may grant. Well, upon discovering the weeping child the \"rehabilitated\" inmate then proceeded to rape, for fourteen hours, this child, who had been left behind, by her loving mother!! The police were duly notified and the standoff ensued. During this time of negotiation, the Inmate would partake of the daughter every hour and a half or so. He must have considered her to be quite succulent after her old worn out 34 year old mother after all, so who can blame the poor misunderstood inmate!!??!! Flash forward to now, nobody knows where the kid is, the mother has been in and out of rehab and counselling and by the way, everybody seems to have lost track of the kid!! But it's hard to find anybody who remembered the kid after the trauma the poor, poor, pitiful, misled mama, endured by the betrayal of the inmate!!! So as I said, suggestions for your ideas about a suitable place of residence will be entertained, as long as YOUR house is at the TOP of the list!!! Oh yes, the inmate is eligible for parole next year. Send in that name now!! Don't forget!!!!", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 13:13:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "tawodi"
    }, 
    {
        "content": "Nobody ever promised that loving the un-lovable would be easy or without risk. But, loving them is EXACTLY what we're commanded to do in the Second Greatest Commandment. When Jesus said to \"love your neighbor,\" He wasn't talking about fellow believers. If he'd meant that, He would have said \"brothers,\" as He did other times. Nobody should suggest that we ought to turn a blind eye to the risk, which is substantial, but nobody should suggest that we spend the rest our lives, and theirs, condemning them for their sins either. I doubt any of us would want that standard applied to OUR sins, which are just as grievous in God's eyes.", 
        "intTime": 20090322, 
        "postID": 37, 
        "quote": "", 
        "reply": "Nobody ever promised that loving the un-lovable would be easy or without risk. But, loving them is EXACTLY what we're commanded to do in the Second Greatest Commandment. When Jesus said to \"love your neighbor,\" He wasn't talking about fellow believers. If he'd meant that, He would have said \"brothers,\" as He did other times. Nobody should suggest that we ought to turn a blind eye to the risk, which is substantial, but nobody should suggest that we spend the rest our lives, and theirs, condemning them for their sins either. I doubt any of us would want that standard applied to OUR sins, which are just as grievous in God's eyes.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 15:56:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "stillkit"
    }, 
    {
        "content": "There's that, Still. But, it would be the rare Christian or anyone else who would jump at the chance to bring a convicted sex murderer into a house full of kids... for good reason. I often go out of my way to look out for overlooked individuals. But, that don't make me no saint. I saw part of a segment on a newsy show the other day about skater Tonya Harding. She complained that people still bother her about her involvement in clobbering Nancy Kerrigan's knee, for which she says she has paid her dues. I didn't feel sorry.", 
        "intTime": 20090322, 
        "postID": 38, 
        "quote": "", 
        "reply": "There's that, Still. But, it would be the rare Christian or anyone else who would jump at the chance to bring a convicted sex murderer into a house full of kids... for good reason. I often go out of my way to look out for overlooked individuals. But, that don't make me no saint. I saw part of a segment on a newsy show the other day about skater Tonya Harding. She complained that people still bother her about her involvement in clobbering Nancy Kerrigan's knee, for which she says she has paid her dues. I didn't feel sorry.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 16:43:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by tawodi: The \"con\" in question raped and murdered a twelve year old and while in prison stabbed another inmate I can't seem to find out what the fate of that inmate was.....not too amazing, it might cloud the issue of his, the released inmate's, \"rehabilitation\" Also he was transferred to several prisons during his incarceration and his crime, as near as I can find, was committed in Mass. He recieved his parole from the California board of corrections and parole and was remanded to New Hampshire for that parole. Once again all of the above shows how good life without parole is........ Now, it would be my suggestion, for who ever has a problem with people who do not want a child killer and rapist living next door to them, step forward put YOUR name on the list and bring them to YOUR home and neighborhood!! It will probably go as well for you, as it did for a local woman, who was the daughter of a former Connecticut Governor.Laurie Urs. In the bucholic town of Chatham MA. about eight years ago she had been having an in prison \"friendship\" and an out of prison \"relationship,\" with an inmate who had been rehabilitated. Well it seems that she considered the relationship over, but there was some small disagreement about that, with the soon to be former paramour. He showed up at two Oclock in the morning, armed with a shot gun, broke in raped mom a couple of times and while doing so, beat the crap out of her. Then Mom escaped from the evil cluthes of said nasty person, only forgetting one small detail......her fourteen year old daughter, who was cowering in the house listening to the beating and repeated rape of her mother, the child was understandably upset, you may grant. Well, upon discovering the weeping child the \"rehabilitated\" inmate then proceeded to rape, for fourteen hours, this child, who had been left behind, by her loving mother!! The police were duly notified and the standoff ensued. During this time of negotiation, the Inmate would partake of the daughter every hour and a half or so. He must have considered her to be quite succulent after her old worn out 34 year old mother after all, so who can blame the poor misunderstood inmate!!??!! Flash forward to now, nobody knows where the kid is, the mother has been in and out of rehab and counselling and by the way, everybody seems to have lost track of the kid!! But it's hard to find anybody who remembered the kid after the trauma the poor, poor, pitiful, misled mama, endured by the betrayal of the inmate!!! So as I said, suggestions for your ideas about a suitable place of residence will be entertained, as long as YOUR house is at the TOP of the list!!! Oh yes, the inmate is eligible for parole next year. Send in that name now!! Don't forget!!!! I assume you're not talking to me.", 
        "intTime": 20090322, 
        "postID": 39, 
        "quote": "Originally posted by tawodi: The \"con\" in question raped and murdered a twelve year old and while in prison stabbed another inmate I can't seem to find out what the fate of that inmate was.....not too amazing, it might cloud the issue of his, the released inmate's, \"rehabilitation\" Also he was transferred to several prisons during his incarceration and his crime, as near as I can find, was committed in Mass. He recieved his parole from the California board of corrections and parole and was remanded to New Hampshire for that parole. Once again all of the above shows how good life without parole is........ Now, it would be my suggestion, for who ever has a problem with people who do not want a child killer and rapist living next door to them, step forward put YOUR name on the list and bring them to YOUR home and neighborhood!! It will probably go as well for you, as it did for a local woman, who was the daughter of a former Connecticut Governor.Laurie Urs. In the bucholic town of Chatham MA. about eight years ago she had been having an in prison \"friendship\" and an out of prison \"relationship,\" with an inmate who had been rehabilitated. Well it seems that she considered the relationship over, but there was some small disagreement about that, with the soon to be former paramour. He showed up at two Oclock in the morning, armed with a shot gun, broke in raped mom a couple of times and while doing so, beat the crap out of her. Then Mom escaped from the evil cluthes of said nasty person, only forgetting one small detail......her fourteen year old daughter, who was cowering in the house listening to the beating and repeated rape of her mother, the child was understandably upset, you may grant. Well, upon discovering the weeping child the \"rehabilitated\" inmate then proceeded to rape, for fourteen hours, this child, who had been left behind, by her loving mother!! The police were duly notified and the standoff ensued. During this time of negotiation, the Inmate would partake of the daughter every hour and a half or so. He must have considered her to be quite succulent after her old worn out 34 year old mother after all, so who can blame the poor misunderstood inmate!!??!! Flash forward to now, nobody knows where the kid is, the mother has been in and out of rehab and counselling and by the way, everybody seems to have lost track of the kid!! But it's hard to find anybody who remembered the kid after the trauma the poor, poor, pitiful, misled mama, endured by the betrayal of the inmate!!! So as I said, suggestions for your ideas about a suitable place of residence will be entertained, as long as YOUR house is at the TOP of the list!!! Oh yes, the inmate is eligible for parole next year. Send in that name now!! Don't forget!!!!", 
        "reply": " I assume you're not talking to me.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 16:47:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Nobody ever promised that loving the un-lovable would be easy or without risk. But, loving them is EXACTLY what we're commanded to do in the Second Greatest Commandment. When Jesus said to \"love your neighbor,\" He wasn't talking about fellow believers. If he'd meant that, He would have said \"brothers,\" as He did other times. Nobody should suggest that we ought to turn a blind eye to the risk, which is substantial, but nobody should suggest that we spend the rest our lives, and theirs, condemning them for their sins either. I doubt any of us would want that standard applied to OUR sins, which are just as grievous in God's eyes. Reminds me of a line from the Simpsons: \"What's that religion with all the well-meaning rules that never work out in real life? Oh yeah....Christianity!!\"", 
        "intTime": 20090322, 
        "postID": 40, 
        "quote": "Originally posted by stillkit: Nobody ever promised that loving the un-lovable would be easy or without risk. But, loving them is EXACTLY what we're commanded to do in the Second Greatest Commandment. When Jesus said to \"love your neighbor,\" He wasn't talking about fellow believers. If he'd meant that, He would have said \"brothers,\" as He did other times. Nobody should suggest that we ought to turn a blind eye to the risk, which is substantial, but nobody should suggest that we spend the rest our lives, and theirs, condemning them for their sins either. I doubt any of us would want that standard applied to OUR sins, which are just as grievous in God's eyes.", 
        "reply": " Reminds me of a line from the Simpsons: \"What's that religion with all the well-meaning rules that never work out in real life? Oh yeah....Christianity!!\"", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-22 21:22:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner.", 
        "intTime": 20090323, 
        "postID": 41, 
        "quote": "", 
        "reply": "During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-23 04:24:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner. If a rabbid dog came into your yard and killed one of your children would you forgive that dog and continue to let your children to play with the dog in the yard or would you kill the dog. While working as a Security officer here in Okla. i hauled inmates out to the highways to clean the roads, I knew alot about each inmate that entered my truck, most were \"saved again xtians\" (in my opinion they clamed this so they could get early parol) These cons would recieve their early parol and would be back in prison within 6 months for the same crimes. I have heard alot about prison rehabilitation, I have never seen it work. It is my Opinion a person proven guilty of rape, child molesting, murder,crimes agains old people, and children, should be taken outside the court room door and hung from a tree with a signe around their necks saying what they were convicted of. This is just My Opinion as you can see I'm not the real forgiving type when it comes to these scumbags D.J.", 
        "intTime": 20090323, 
        "postID": 42, 
        "quote": "Originally posted by xnavycg: During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner.", 
        "reply": " If a rabbid dog came into your yard and killed one of your children would you forgive that dog and continue to let your children to play with the dog in the yard or would you kill the dog. While working as a Security officer here in Okla. i hauled inmates out to the highways to clean the roads, I knew alot about each inmate that entered my truck, most were \"saved again xtians\" (in my opinion they clamed this so they could get early parol) These cons would recieve their early parol and would be back in prison within 6 months for the same crimes. I have heard alot about prison rehabilitation, I have never seen it work. It is my Opinion a person proven guilty of rape, child molesting, murder,crimes agains old people, and children, should be taken outside the court room door and hung from a tree with a signe around their necks saying what they were convicted of. This is just My Opinion as you can see I'm not the real forgiving type when it comes to these scumbags D.J.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-23 14:49:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "When a person is convicted of a crime such a that in the story I related, ( no Bill it wasn't \"addressed\" to anybody!) They should be segregated from society for the duration of their life. It is the duty of that society to do just that. The treatment of said prisoner ahould be humane and adequate care should be provided. Niether you, nor I, nor is society, compelled to subject itself to the continued danger such a person represents......PERIOD!!! I do not believe in the death penalty unless a full and proven confession is obtained from the miscreant or there is absolutely NO question of guilt ( apprehended in the commission of the crime) and then should be imposed with no appeals process, to salve the misplaced conscience of somebody suffering from some faulty \"group guilt think\" that so many seem to be infected with in this country today. T", 
        "intTime": 20090325, 
        "postID": 43, 
        "quote": "", 
        "reply": "When a person is convicted of a crime such a that in the story I related, ( no Bill it wasn't \"addressed\" to anybody!) They should be segregated from society for the duration of their life. It is the duty of that society to do just that. The treatment of said prisoner ahould be humane and adequate care should be provided. Niether you, nor I, nor is society, compelled to subject itself to the continued danger such a person represents......PERIOD!!! I do not believe in the death penalty unless a full and proven confession is obtained from the miscreant or there is absolutely NO question of guilt ( apprehended in the commission of the crime) and then should be imposed with no appeals process, to salve the misplaced conscience of somebody suffering from some faulty \"group guilt think\" that so many seem to be infected with in this country today. T", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-03-25 10:05:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "tawodi"
    }, 
    {
        "content": "And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. Paul, was Saul killer of Christians, yet even He was forgiven and become one of the main writers of Scripture knowing just how much HE had been forgiven. (I wonder did he only kill adult believers or did he kill entire families?) King David was an adulterer and a murderer, He too was forgiven. I guess by some folks standard of judgment abortion doctors and those men and women who have their babies killed by means of abortion can never be forgiven either? They even plan and make appointments for those murders to take place every day, yet it is legal to kill a child who is not yet out of the womb in this country.. When they repent..they too can be forgiven..Praise God!! However, I wonder, why if they are truly repentant, do they not stay in prison to live out their time? Why take an early parole? Why not acknowledge, this is the punishment/consequences for my crime, and I will stay here until my time is up? That to me, would show a more repentant heart than one accepting an early parole merely because they stayed out of trouble while in prison.. This message has been edited. Last edited by: 3678131, Sun 26 April 2009 11:24 AM", 
        "intTime": 20090426, 
        "postID": 44, 
        "quote": "", 
        "reply": "And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. Paul, was Saul killer of Christians, yet even He was forgiven and become one of the main writers of Scripture knowing just how much HE had been forgiven. (I wonder did he only kill adult believers or did he kill entire families?) King David was an adulterer and a murderer, He too was forgiven. I guess by some folks standard of judgment abortion doctors and those men and women who have their babies killed by means of abortion can never be forgiven either? They even plan and make appointments for those murders to take place every day, yet it is legal to kill a child who is not yet out of the womb in this country.. When they repent..they too can be forgiven..Praise God!! However, I wonder, why if they are truly repentant, do they not stay in prison to live out their time? Why take an early parole? Why not acknowledge, this is the punishment/consequences for my crime, and I will stay here until my time is up? That to me, would show a more repentant heart than one accepting an early parole merely because they stayed out of trouble while in prison.. This message has been edited. Last edited by: 3678131, Sun 26 April 2009 11:24 AM", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-04-26 10:56:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Praise's be to God that HE forgives even the vilest of sinners Bull. He doesn't forgive the blasphemer, unless, of course he bypasses/survives stoning and is ignorant (1 Tim 1:13) The buy bull is full of admonitions to stone the blasphemer to death, and that his soul won't be saved.", 
        "intTime": 20090426, 
        "postID": 45, 
        "quote": "Praise's be to God that HE forgives even the vilest of sinners", 
        "reply": " Bull. He doesn't forgive the blasphemer, unless, of course he bypasses/survives stoning and is ignorant (1 Tim 1:13) The buy bull is full of admonitions to stone the blasphemer to death, and that his soul won't be saved.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-04-26 13:48:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "funny thing about loving thy neighbor and the ability to forgive... I was just watching the story of jacob and joseph last night... the stories are from so long ago and yet all the lessons still apply today. I was very upset about the role the women played in those two stories... .. thank goodness there are positive stories of great women in the bible, after eve, rebecca, leah and the wife of the egyptian who sat out to get joseph, it was not looking good for the girls. I find the stories of the bible to be gentle reminders of what is right and wrong, and how to love and forgive.", 
        "intTime": 20090525, 
        "postID": 46, 
        "quote": "", 
        "reply": "funny thing about loving thy neighbor and the ability to forgive... I was just watching the story of jacob and joseph last night... the stories are from so long ago and yet all the lessons still apply today. I was very upset about the role the women played in those two stories... .. thank goodness there are positive stories of great women in the bible, after eve, rebecca, leah and the wife of the egyptian who sat out to get joseph, it was not looking good for the girls. I find the stories of the bible to be gentle reminders of what is right and wrong, and how to love and forgive.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-05-25 21:03:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner. Actually during this time there would have been a VERY good chance that the killer would have just had to pay a fine and would then have been released.", 
        "intTime": 20090526, 
        "postID": 47, 
        "quote": "Originally posted by xnavycg: During the time this scripture was written, a murderer would not have had a prison sentence and been released at a latter date, they would have been killed. Big difference between a child murderer and a political prisoner.", 
        "reply": " Actually during this time there would have been a VERY good chance that the killer would have just had to pay a fine and would then have been released.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-05-26 19:19:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by 3678131: And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. The Bible says that I, as a blasphemer of the holy spirit, shall never be forgiven - Mark 3:29 and Luke 12:10 It sounds like murder is less 'vile' than name-calling. Fortunately, there's no holy spirit to blaspheme and no eternal hellfire to fear as punishment. But to the extent that one takes the scripture as truth, I think it's important to reconcile the unethical suggestion that blasphemy deserves punishment worse than that handed out for murder, rape, or any other vile human action. http://www.blasphemychallenge.com/ (2006 campaign) Jason", 
        "intTime": 20090531, 
        "postID": 48, 
        "quote": "Originally posted by 3678131: And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven.", 
        "reply": " The Bible says that I, as a blasphemer of the holy spirit, shall never be forgiven - Mark 3:29 and Luke 12:10 It sounds like murder is less 'vile' than name-calling. Fortunately, there's no holy spirit to blaspheme and no eternal hellfire to fear as punishment. But to the extent that one takes the scripture as truth, I think it's important to reconcile the unethical suggestion that blasphemy deserves punishment worse than that handed out for murder, rape, or any other vile human action. http://www.blasphemychallenge.com/ (2006 campaign) Jason", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-05-31 20:17:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: Originally posted by dday76: quote: Originally posted by 3678131: And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. The Bible says that I, as a blasphemer of the holy spirit, shall never be forgiven - Mark 3:29 and Luke 12:10 It sounds like murder is less 'vile' than name-calling. Fortunately, there's no holy spirit to blaspheme and no eternal hellfire to fear as punishment. But to the extent that one takes the scripture as truth, I think it's important to reconcile the unethical suggestion that blasphemy deserves punishment worse than that handed out for murder, rape, or any other vile human action. http://www.blasphemychallenge.com/ (2006 campaign) Jason Yes, I agree ethically. However, what the blasphemer apparently is doing isn't to a human, thus not a 'vile human action.' It's a self preserving god-thing defending itself from question or cross examination or contrary thought that encompasses the 'sin of'. Obvious, from reading the Bible it becomes clear there is not all that much care for the 'vile humans' regardless of their god-talk - why, according to the myth, the god guy even lets his own son get tortured and murdered! Of course, the mental gymnastics to justify that is the murder/child sacrafice 'saves' everyone else that believes the story is true, etc. The whole issue of what can and cannot be forgiven is a confusing murky swamp of dubious salvation that can bog down any fearful treading insecure human in their quest to settle down their uneasy conscious. Then there is always the big surprise at the end and the folks who end up on the right hand of god (the good guys and gals) didn't even realize they were doing anything at all to placate the questionably forgiving God (Math 25 'sheep & goats' story.) But, as you note, it is just a story (a terror story, actually) and there is nothing like that to fret about. Our real state of being on this temporal fragile sphere is what one should fret about! Especially the population of religious nuts who attempt to bring about their madness in the name of their non-existent being!", 
        "intTime": 20090531, 
        "postID": 49, 
        "quote": "Originally posted by dday76: quote: Originally posted by 3678131: And what things should not be forgiven? Praise's be to God that HE forgives even the vilest of sinners, lest none of us would ever be forgiven. The Bible says that I, as a blasphemer of the holy spirit, shall never be forgiven - Mark 3:29 and Luke 12:10 It sounds like murder is less 'vile' than name-calling. Fortunately, there's no holy spirit to blaspheme and no eternal hellfire to fear as punishment. But to the extent that one takes the scripture as truth, I think it's important to reconcile the unethical suggestion that blasphemy deserves punishment worse than that handed out for murder, rape, or any other vile human action. http://www.blasphemychallenge.com/ (2006 campaign) Jason", 
        "reply": " Yes, I agree ethically. However, what the blasphemer apparently is doing isn't to a human, thus not a 'vile human action.' It's a self preserving god-thing defending itself from question or cross examination or contrary thought that encompasses the 'sin of'. Obvious, from reading the Bible it becomes clear there is not all that much care for the 'vile humans' regardless of their god-talk - why, according to the myth, the god guy even lets his own son get tortured and murdered! Of course, the mental gymnastics to justify that is the murder/child sacrafice 'saves' everyone else that believes the story is true, etc. The whole issue of what can and cannot be forgiven is a confusing murky swamp of dubious salvation that can bog down any fearful treading insecure human in their quest to settle down their uneasy conscious. Then there is always the big surprise at the end and the folks who end up on the right hand of god (the good guys and gals) didn't even realize they were doing anything at all to placate the questionably forgiving God (Math 25 'sheep & goats' story.) But, as you note, it is just a story (a terror story, actually) and there is nothing like that to fret about. Our real state of being on this temporal fragile sphere is what one should fret about! Especially the population of religious nuts who attempt to bring about their madness in the name of their non-existent being!", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-05-31 20:30:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: However, what the blasphemer apparently is doing isn't to a human. Our real state of being on this temporal fragile sphere is what one should fret about! Especially the population of religious nuts who attempt to bring about their madness in the name of their non-existent being! I agree. I have plenty of awe and wonder and excitement as I spend my short life trying to create joy and love and purpose as I cling tightly to a small rock hurtling at 400,000 mph through this giant death trap of a universe. Jason ps. blasphemy is a victimless crime.", 
        "intTime": 20090601, 
        "postID": 50, 
        "quote": "Originally posted by reducetension: However, what the blasphemer apparently is doing isn't to a human. Our real state of being on this temporal fragile sphere is what one should fret about! Especially the population of religious nuts who attempt to bring about their madness in the name of their non-existent being!", 
        "reply": " I agree. I have plenty of awe and wonder and excitement as I spend my short life trying to create joy and love and purpose as I cling tightly to a small rock hurtling at 400,000 mph through this giant death trap of a universe. Jason ps. blasphemy is a victimless crime.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 06:59:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "dday76"
    }, 
    {
        "content": "quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong.", 
        "intTime": 20090601, 
        "postID": 51, 
        "quote": "ps. blasphemy is a victimless crime.", 
        "reply": " You could not possibly be more wrong.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 09:10:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong. Blasphemy, noun a: the act of insulting or showing contempt or lack of reverence for God b: the act of claiming the attributes of deity The only \"victim\" of blasphemy is the individual who blasphemes - and those who might follow them (in the case of definition b., the followers of Pat Robertson or James Hagee or many televangelists who often treat these \"ministers\" as mini-deities or demi-gods).", 
        "intTime": 20090601, 
        "postID": 52, 
        "quote": "Originally posted by soscorpio: quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong.", 
        "reply": " Blasphemy, noun a: the act of insulting or showing contempt or lack of reverence for God b: the act of claiming the attributes of deity The only \"victim\" of blasphemy is the individual who blasphemes - and those who might follow them (in the case of definition b., the followers of Pat Robertson or James Hagee or many televangelists who often treat these \"ministers\" as mini-deities or demi-gods).", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 10:21:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong. A crime must have a formal sanction initiated by an authorized body of people (not gods) such as the legislature. Religion and its ideas has no weight in the matter for us humans. Thus, as far as I know, no where in the US is blasphemy a crime. \"Victimless\" is problematic as that usually involves a consensual act between two or more adults and the god-idea is neither human nor adult. It is victimless in that typically it is a voluntary act/expression by an individual concerning an idea that has no basis in reality. You can't arrest, prosecute or punish anyone for blasphemy in this modern secular society. It's a disturbing idea or even mental illness of sorts to believe the act of blasphemy will get you punished by unseen uncollaborated forces. It's a phobia of sort related to Zeusophobia- Fear of God or gods. It's another religious notion of terrorism to control and conscript people into the cult of 'boogie man's gona get ya' if you are not nice to her/him/it/that.", 
        "intTime": 20090601, 
        "postID": 53, 
        "quote": "Originally posted by soscorpio: quote: ps. blasphemy is a victimless crime. You could not possibly be more wrong.", 
        "reply": " A crime must have a formal sanction initiated by an authorized body of people (not gods) such as the legislature. Religion and its ideas has no weight in the matter for us humans. Thus, as far as I know, no where in the US is blasphemy a crime. \"Victimless\" is problematic as that usually involves a consensual act between two or more adults and the god-idea is neither human nor adult. It is victimless in that typically it is a voluntary act/expression by an individual concerning an idea that has no basis in reality. You can't arrest, prosecute or punish anyone for blasphemy in this modern secular society. It's a disturbing idea or even mental illness of sorts to believe the act of blasphemy will get you punished by unseen uncollaborated forces. It's a phobia of sort related to Zeusophobia- Fear of God or gods. It's another religious notion of terrorism to control and conscript people into the cult of 'boogie man's gona get ya' if you are not nice to her/him/it/that.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 10:35:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: The only \"victim\" of blasphemy is the individual who blasphemes - and those who might follow them Bingo in bold type! Narcissism is a common trait among the most dangerous. Those that blaspheme against God usually do so to build themselves up in the eyes of their prospective followers. Blasphemy will lead more away from God and into sin than any other crime because of the narcisstic personalities that mankind enjoys fawning over. it's a horrible crime in which at one point or another we have all been victimized.", 
        "intTime": 20090601, 
        "postID": 54, 
        "quote": "The only \"victim\" of blasphemy is the individual who blasphemes - and those who might follow them", 
        "reply": " Bingo in bold type! Narcissism is a common trait among the most dangerous. Those that blaspheme against God usually do so to build themselves up in the eyes of their prospective followers. Blasphemy will lead more away from God and into sin than any other crime because of the narcisstic personalities that mankind enjoys fawning over. it's a horrible crime in which at one point or another we have all been victimized.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 11:28:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: it's a horrible crime in which at one point or another we have all been victimized. Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?'", 
        "intTime": 20090601, 
        "postID": 55, 
        "quote": "it's a horrible crime in which at one point or another we have all been victimized.", 
        "reply": " Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?'", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 11:44:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?' By definition, one cannot blaspheme a lie, but to blaspheme the truth causes great havoc for society, as modern times prove.", 
        "intTime": 20090601, 
        "postID": 56, 
        "quote": "Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?'", 
        "reply": " By definition, one cannot blaspheme a lie, but to blaspheme the truth causes great havoc for society, as modern times prove.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 11:50:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?' By definition, one cannot blaspheme a lie, but to blaspheme the truth causes great havoc for society, as modern times prove. And just how does it do that. Prove it.", 
        "intTime": 20090601, 
        "postID": 57, 
        "quote": "Originally posted by soscorpio: quote: Were the cartoonists who depicted Muhammad as a bomb with a burning fuse narcissistic? Were they wrong to do it? They were certainly blasphemous. Was Salmon Rushdie un-victimized? It seems that these blasphemers serve the purpose to tell the rest of the world that they are being a tad too righteous and cocksure in their religion. Wouldn't you agree with that? They stand right up there with the Joan-of-Arcs, the William-of-Wallaces, and all the others who stood against church and dominion with \"blasphemous\" statements. Certainly, in any row between beliefs there will be 'victims.' So it is with freedom and liberties. Is it wrong to create these 'victims?' By definition, one cannot blaspheme a lie, but to blaspheme the truth causes great havoc for society, as modern times prove.", 
        "reply": " And just how does it do that. Prove it.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 11:54:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: And just how does it do that. Prove it. Blasphemy is a vicious crime that has many, many victims. the good truth keeps mankind free, lies against the truth (blasphemy) enslave and do even worse than slavery.", 
        "intTime": 20090601, 
        "postID": 58, 
        "quote": "And just how does it do that. Prove it.", 
        "reply": " Blasphemy is a vicious crime that has many, many victims. the good truth keeps mankind free, lies against the truth (blasphemy) enslave and do even worse than slavery.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 12:06:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: And just how does it do that. Prove it. Blasphemy is a vicious crime that has many, many victims. the good truth keeps mankind free, lies against the truth (blasphemy) enslave and do even worse than slavery. Truth, eh? Then you admit you're a blasphemer against reason?", 
        "intTime": 20090601, 
        "postID": 59, 
        "quote": "Originally posted by soscorpio: quote: And just how does it do that. Prove it. Blasphemy is a vicious crime that has many, many victims. the good truth keeps mankind free, lies against the truth (blasphemy) enslave and do even worse than slavery.", 
        "reply": " Truth, eh? Then you admit you're a blasphemer against reason?", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 12:26:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "billbright"
    }, 
    {
        "content": "Blasphemy is only a crime of perspective. You can make a crass comment about Thor, and to you it's nothing but a joke. To those who honor Thor as their patron God, it's blasphemy. If I make a crass comment about Jesus, to you it's blasphemy against a deity. To me, it's a sarcastic jab at the people who follow a man that they think was a God. In a nation that has both freedom of religion and freedom of speech, it is impossible to declare blasphemy a crime. You can PERSONALLY treat it as wrong, but you will only see blasphemy that applies to your perspective, against your Gods. Blasphemy is defined only by those who believe in the deity being blasphemed. Blasphemy against Thor, Cernunnos, Herne, Apollo, Diana, Bridget, Hecate, Artemis, or Zeus would mean nothing to you, and you would mock all those deities without giving it a second thought. You are a non-believer and a blasphemer against that which you do not believe, no more and no less than I am a blasphemer against that which I do not believe. In your church, you would consider me a blasphemer; I do not attend your church. In my church, you would be considered a blasphemer; you do not attend my church. And in America, neither of us is guilty of a crime.", 
        "intTime": 20090601, 
        "postID": 60, 
        "quote": "", 
        "reply": "Blasphemy is only a crime of perspective. You can make a crass comment about Thor, and to you it's nothing but a joke. To those who honor Thor as their patron God, it's blasphemy. If I make a crass comment about Jesus, to you it's blasphemy against a deity. To me, it's a sarcastic jab at the people who follow a man that they think was a God. In a nation that has both freedom of religion and freedom of speech, it is impossible to declare blasphemy a crime. You can PERSONALLY treat it as wrong, but you will only see blasphemy that applies to your perspective, against your Gods. Blasphemy is defined only by those who believe in the deity being blasphemed. Blasphemy against Thor, Cernunnos, Herne, Apollo, Diana, Bridget, Hecate, Artemis, or Zeus would mean nothing to you, and you would mock all those deities without giving it a second thought. You are a non-believer and a blasphemer against that which you do not believe, no more and no less than I am a blasphemer against that which I do not believe. In your church, you would consider me a blasphemer; I do not attend your church. In my church, you would be considered a blasphemer; you do not attend my church. And in America, neither of us is guilty of a crime.", 
        "threadID": "1270031990001_8340004812001", 
        "time": "2009-06-01 13:05:00", 
        "title": "Living Christian, rather than just talking Christian = Trouble with neighbors", 
        "userID": "Whirled_Peas"
    }
]