[
    {
        "content": "THE FEW Our Pledge LORD GOD ALMIGHTY You have seen me fit to serve your will in this material world. My soul has been washed in the blood of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to exterminating evils in this life and beyond. I will love when love is in need. I will destroy when destruction be your will. If I falter, let your punishment be swift and fitting. If Saint Peter’s Eternal Guard will have me, I will have proven my mettle in the face of adversity and overcome tremendous horrors that others could not endure. I will never forget that your will was to see me through and grace me with the life as your servant. I speak not to others of my responsibilities and duties, for they not understand. I am your servant for eternity.", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "THE FEW Our Pledge LORD GOD ALMIGHTY You have seen me fit to serve your will in this material world. My soul has been washed in the blood of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to exterminating evils in this life and beyond. I will love when love is in need. I will destroy when destruction be your will. If I falter, let your punishment be swift and fitting. If Saint Peter’s Eternal Guard will have me, I will have proven my mettle in the face of adversity and overcome tremendous horrors that others could not endure. I will never forget that your will was to see me through and grace me with the life as your servant. I speak not to others of my responsibilities and duties, for they not understand. I am your servant for eternity.", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-18 11:49:00", 
        "title": "THE FEW  my pledge", 
        "userID": "20632193"
    }, 
    {
        "content": "GREAT LORD FSM, ALMIGHTY You have seen me fit to serve your will in this culinary world. My Pirate’s soul has been washed in the marinara of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to the enjoyment of good pasta. I will love when love is in the air. I will cook when gastronomy be your will. If I serve pasta other than al dente, let your punishment be swift and fitting. Even if Saint Rotini’s Eternal curl will leave me, I will have proven my mettle in the face of watery sauce and overcome tremendous ingredients that others could not endure. I will never forget that Your will was to see me through and grace me with the life as your servant. I am your cook and server for eternity. rAmen and rAmen", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "GREAT LORD FSM, ALMIGHTY You have seen me fit to serve your will in this culinary world. My Pirate’s soul has been washed in the marinara of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to the enjoyment of good pasta. I will love when love is in the air. I will cook when gastronomy be your will. If I serve pasta other than al dente, let your punishment be swift and fitting. Even if Saint Rotini’s Eternal curl will leave me, I will have proven my mettle in the face of watery sauce and overcome tremendous ingredients that others could not endure. I will never forget that Your will was to see me through and grace me with the life as your servant. I am your cook and server for eternity. rAmen and rAmen", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-18 13:19:00", 
        "title": "THE FEW  my pledge", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: GREAT LORD FSM, ALMIGHTY You have seen me fit to serve your will in this culinary world. My Pirate’s soul has been washed in the marinara of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to the enjoyment of good pasta. I will love when love is in the air. I will cook when gastronomy be your will. If I serve pasta other than al dente, let your punishment be swift and fitting. Even if Saint Rotini’s Eternal curl will leave me, I will have proven my mettle in the face of watery sauce and overcome tremendous ingredients that others could not endure. I will never forget that Your will was to see me through and grace me with the life as your servant. I am your cook and server for eternity. rAmen and rAmen 20 lashes with a wet noodle!", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "Originally posted by billbright: GREAT LORD FSM, ALMIGHTY You have seen me fit to serve your will in this culinary world. My Pirate’s soul has been washed in the marinara of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to the enjoyment of good pasta. I will love when love is in the air. I will cook when gastronomy be your will. If I serve pasta other than al dente, let your punishment be swift and fitting. Even if Saint Rotini’s Eternal curl will leave me, I will have proven my mettle in the face of watery sauce and overcome tremendous ingredients that others could not endure. I will never forget that Your will was to see me through and grace me with the life as your servant. I am your cook and server for eternity. rAmen and rAmen", 
        "reply": " 20 lashes with a wet noodle!", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-18 14:38:00", 
        "title": "THE FEW  my pledge", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Word dawg limp noodles rule", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "Word dawg limp noodles rule", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-18 15:07:00", 
        "title": "THE FEW  my pledge", 
        "userID": "20632193"
    }, 
    {
        "content": "If I change just a few words of this, can you then understand how frightening this is? quote: Originally posted by 20632193: THE FEW Our Pledge LORD GOD ALLAH ALMIGHTY You have seen me fit to serve your will in this material world. My soul has been washed in the blood of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to exterminating evils in this life and beyond. I will love when love is in need. I will destroy when destruction be your will. If I falter, let your punishment be swift and fitting. If Saint Peter Mohammed’s Eternal Guard will have me, I will have proven my mettle in the face of adversity and overcome tremendous horrors that others could not endure. I will never forget that your will was to see me through and grace me with the life as your servant. I speak not to others of my responsibilities and duties, for they not understand. I am your servant for eternity. Hell, I thought I'd have to change more than that! Can anybody tell me what the difference is between a Muslim fanatic and a Christian fanatic, other than the names they plug in?", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "Originally posted by 20632193: THE FEW Our Pledge LORD GOD ALLAH ALMIGHTY You have seen me fit to serve your will in this material world. My soul has been washed in the blood of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to exterminating evils in this life and beyond. I will love when love is in need. I will destroy when destruction be your will. If I falter, let your punishment be swift and fitting. If Saint Peter Mohammed’s Eternal Guard will have me, I will have proven my mettle in the face of adversity and overcome tremendous horrors that others could not endure. I will never forget that your will was to see me through and grace me with the life as your servant. I speak not to others of my responsibilities and duties, for they not understand. I am your servant for eternity.", 
        "reply": "If I change just a few words of this, can you then understand how frightening this is?  Hell, I thought I'd have to change more than that! Can anybody tell me what the difference is between a Muslim fanatic and a Christian fanatic, other than the names they plug in?", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-18 20:16:00", 
        "title": "THE FEW  my pledge", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Hell, I thought I'd have to change more than that! Can anybody tell me what the difference is between a Muslim fanatic and a Christian fanatic, other than the names they plug in? Are you kidding? 'http://www.dailymotion.com/video/x2jr6m_ied-in-iraq-120707_travel", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "Hell, I thought I'd have to change more than that! Can anybody tell me what the difference is between a Muslim fanatic and a Christian fanatic, other than the names they plug in?", 
        "reply": " Are you kidding? 'http://www.dailymotion.com/video/x2jr6m_ied-in-iraq-120707_travel", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-18 20:36:00", 
        "title": "THE FEW  my pledge", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: If I change just a few words of this, can you then understand how frightening this is? quote: Originally posted by 20632193: THE FEW Our Pledge LORD GOD ALLAH ALMIGHTY You have seen me fit to serve your will in this material world. My soul has been washed in the blood of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to exterminating evils in this life and beyond. I will love when love is in need. I will destroy when destruction be your will. If I falter, let your punishment be swift and fitting. If Saint Peter Mohammed’s Eternal Guard will have me, I will have proven my mettle in the face of adversity and overcome tremendous horrors that others could not endure. I will never forget that your will was to see me through and grace me with the life as your servant. I speak not to others of my responsibilities and duties, for they not understand. I am your servant for eternity. Hell, I thought I'd have to change more than that! Can anybody tell me what the difference is between a Muslim fanatic and a Christian fanatic, other than the names they plug in? One buggers little boys and the other goats?", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "Originally posted by SteveDeHaven: If I change just a few words of this, can you then understand how frightening this is? quote: Originally posted by 20632193: THE FEW Our Pledge LORD GOD ALLAH ALMIGHTY You have seen me fit to serve your will in this material world. My soul has been washed in the blood of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to exterminating evils in this life and beyond. I will love when love is in need. I will destroy when destruction be your will. If I falter, let your punishment be swift and fitting. If Saint Peter Mohammed’s Eternal Guard will have me, I will have proven my mettle in the face of adversity and overcome tremendous horrors that others could not endure. I will never forget that your will was to see me through and grace me with the life as your servant. I speak not to others of my responsibilities and duties, for they not understand. I am your servant for eternity. Hell, I thought I'd have to change more than that! Can anybody tell me what the difference is between a Muslim fanatic and a Christian fanatic, other than the names they plug in?", 
        "reply": " One buggers little boys and the other goats?", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-18 20:49:00", 
        "title": "THE FEW  my pledge", 
        "userID": "thorin001"
    }, 
    {
        "content": "What is funny about all of this is that the war we are currently in...is in fact a holy war, but society has been numbed to the point of no return. Ask any terrorist if it is a holy war.... We have to start seeing things as they truly are if we want to make a difference. I am not what you would call a traditional christian fanatic...I drink, I smoke, hell I curse as well as any sailor. I was lucky enough to live through things that I probably would not have made it through had it not been for my faith.... Spend some time hunting and killing terrorists then come tell me this is not in fact a holy war.", 
        "intTime": 20090319, 
        "postID": 8, 
        "quote": "", 
        "reply": "What is funny about all of this is that the war we are currently in...is in fact a holy war, but society has been numbed to the point of no return. Ask any terrorist if it is a holy war.... We have to start seeing things as they truly are if we want to make a difference. I am not what you would call a traditional christian fanatic...I drink, I smoke, hell I curse as well as any sailor. I was lucky enough to live through things that I probably would not have made it through had it not been for my faith.... Spend some time hunting and killing terrorists then come tell me this is not in fact a holy war.", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-19 05:41:00", 
        "title": "THE FEW  my pledge", 
        "userID": "20632193"
    }, 
    {
        "content": "If my enemy thinks I am fanatical as he is...that I have the same bent soul set to destroy what I believe is evil..then he may stop and think before attempting an attack on our innocent civilians.", 
        "intTime": 20090319, 
        "postID": 9, 
        "quote": "", 
        "reply": "If my enemy thinks I am fanatical as he is...that I have the same bent soul set to destroy what I believe is evil..then he may stop and think before attempting an attack on our innocent civilians.", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-19 05:44:00", 
        "title": "THE FEW  my pledge", 
        "userID": "20632193"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: If I change just a few words of this, can you then understand how frightening this is? quote: Originally posted by 20632193: THE FEW Our Pledge LORD GOD ALLAH ALMIGHTY You have seen me fit to serve your will in this material world. My soul has been washed in the blood of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to exterminating evils in this life and beyond. I will love when love is in need. I will destroy when destruction be your will. If I falter, let your punishment be swift and fitting. If Saint Peter Mohammed’s Eternal Guard will have me, I will have proven my mettle in the face of adversity and overcome tremendous horrors that others could not endure. I will never forget that your will was to see me through and grace me with the life as your servant. I speak not to others of my responsibilities and duties, for they not understand. I am your servant for eternity. Hell, I thought I'd have to change more than that! Can anybody tell me what the difference is between a Muslim fanatic and a Christian fanatic, other than the names they plug in? One of them will still eat bacon?", 
        "intTime": 20090319, 
        "postID": 10, 
        "quote": "Originally posted by SteveDeHaven: If I change just a few words of this, can you then understand how frightening this is? quote: Originally posted by 20632193: THE FEW Our Pledge LORD GOD ALLAH ALMIGHTY You have seen me fit to serve your will in this material world. My soul has been washed in the blood of those who came before me. Steer me true and give me strength to continue when others may fail. Help me to achieve when others think it not possible. I have given my soul to exterminating evils in this life and beyond. I will love when love is in need. I will destroy when destruction be your will. If I falter, let your punishment be swift and fitting. If Saint Peter Mohammed’s Eternal Guard will have me, I will have proven my mettle in the face of adversity and overcome tremendous horrors that others could not endure. I will never forget that your will was to see me through and grace me with the life as your servant. I speak not to others of my responsibilities and duties, for they not understand. I am your servant for eternity. Hell, I thought I'd have to change more than that! Can anybody tell me what the difference is between a Muslim fanatic and a Christian fanatic, other than the names they plug in?", 
        "reply": " One of them will still eat bacon?", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-19 06:37:00", 
        "title": "THE FEW  my pledge", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by 20632193: If my enemy thinks I am fanatical as he is...that I have the same bent soul set to destroy what I believe is evil..then he may stop and think before attempting an attack on our innocent civilians. Oh, yeah. Religious fanaticism on one side is ALWAYS held in check by equal fanaticism on the other side!! [/sarcasm]", 
        "intTime": 20090319, 
        "postID": 11, 
        "quote": "Originally posted by 20632193: If my enemy thinks I am fanatical as he is...that I have the same bent soul set to destroy what I believe is evil..then he may stop and think before attempting an attack on our innocent civilians.", 
        "reply": " Oh, yeah. Religious fanaticism on one side is ALWAYS held in check by equal fanaticism on the other side!! [/sarcasm]", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-19 08:01:00", 
        "title": "THE FEW  my pledge", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by 20632193: If my enemy thinks I am fanatical as he is...that I have the same bent soul set to destroy what I believe is evil..then he may stop and think before attempting an attack on our innocent civilians. Oh, yeah. Religious fanaticism on one side is ALWAYS held in check by equal fanaticism on the other side!! [/sarcasm] That's the question for the ages, isn't it. But, the greatest changes in history don't always bear out the use of greater force to overcome fanatic behavior. I suspect that the type A individual would prefer force. That's what we try to instill into our Marines and Airborne, after all. That all-go, no-stop mentality is needed in traditional warfare. But, how is it working when these same people are asked to do the work of the Peace Corp, guiding convoys of commerce; building schools and hospitals; and otherwise trying to win hearts and minds? I wonder if the predatory bent isn't standing in the way of true ambassadorial activities. Is it really a good idea to send your best killers to win souls?", 
        "intTime": 20090319, 
        "postID": 12, 
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by 20632193: If my enemy thinks I am fanatical as he is...that I have the same bent soul set to destroy what I believe is evil..then he may stop and think before attempting an attack on our innocent civilians. Oh, yeah. Religious fanaticism on one side is ALWAYS held in check by equal fanaticism on the other side!! [/sarcasm]", 
        "reply": " That's the question for the ages, isn't it. But, the greatest changes in history don't always bear out the use of greater force to overcome fanatic behavior. I suspect that the type A individual would prefer force. That's what we try to instill into our Marines and Airborne, after all. That all-go, no-stop mentality is needed in traditional warfare. But, how is it working when these same people are asked to do the work of the Peace Corp, guiding convoys of commerce; building schools and hospitals; and otherwise trying to win hearts and minds? I wonder if the predatory bent isn't standing in the way of true ambassadorial activities. Is it really a good idea to send your best killers to win souls?", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-19 08:30:00", 
        "title": "THE FEW  my pledge", 
        "userID": "billbright"
    }, 
    {
        "content": "You are correct.......... I was truly being a bit sarcastic with all of this to begin with.... Most of what I say is not MY point of view, but is a point of which I have seen others hold. This discussion was meant as an experiment of sorts....Yeah..I Know..It was a bit edgy, but that was the point. I wanted to see if there are people out there that had the wherewithal to grasp specific topics of interest in my anthropological/sociological survey. Thanks to all of you for your input...Keep it going... this is interesting.", 
        "intTime": 20090319, 
        "postID": 13, 
        "quote": "", 
        "reply": "You are correct.......... I was truly being a bit sarcastic with all of this to begin with.... Most of what I say is not MY point of view, but is a point of which I have seen others hold. This discussion was meant as an experiment of sorts....Yeah..I Know..It was a bit edgy, but that was the point. I wanted to see if there are people out there that had the wherewithal to grasp specific topics of interest in my anthropological/sociological survey. Thanks to all of you for your input...Keep it going... this is interesting.", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-19 10:13:00", 
        "title": "THE FEW  my pledge", 
        "userID": "20632193"
    }, 
    {
        "content": "quote: I wanted to see if there are people out there that had the wherewithal to grasp specific topics of interest in my anthropological/sociological survey. Yeah, sure.", 
        "intTime": 20090319, 
        "postID": 14, 
        "quote": "I wanted to see if there are people out there that had the wherewithal to grasp specific topics of interest in my anthropological/sociological survey.", 
        "reply": " Yeah, sure.", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-19 16:06:00", 
        "title": "THE FEW  my pledge", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by 20632193: If my enemy thinks I am fanatical as he is...that I have the same bent soul set to destroy what I believe is evil..then he may stop and think before attempting an attack on our innocent civilians. I don't think they think we are fanatical enough. As far as I know, they don't think we are religious enough PERIOD. It's not \"our\" gods that worry them, its our secular humanist ideals and all encompassing propaganda about democracy that get's them worked up. Same thing that gets the fanatics in our country worked up. They (over there) could care less about \"our\" gods. They are not going to stop and think... \"Ooooooh, their god is more fanatical than ours.\" There are no 'innocent civilians' in their scheme of things, just more reasons to eradicate the infidels and terrorize their like into submission to their view of their fanatical god. Never-the-less, who speaks for god is a very ancient debate... which imaginary superhero is greater. Marvel Comics couldn't do it better. So, I guess the most \"real\" god will win? I'd like to sit this one out... but I am afraid they'll both go after me given a chance to do so. So, I'm surrounded, regardless of what god names they hurl into space.", 
        "intTime": 20090319, 
        "postID": 15, 
        "quote": "Originally posted by 20632193: If my enemy thinks I am fanatical as he is...that I have the same bent soul set to destroy what I believe is evil..then he may stop and think before attempting an attack on our innocent civilians.", 
        "reply": " I don't think they think we are fanatical enough. As far as I know, they don't think we are religious enough PERIOD. It's not \"our\" gods that worry them, its our secular humanist ideals and all encompassing propaganda about democracy that get's them worked up. Same thing that gets the fanatics in our country worked up. They (over there) could care less about \"our\" gods. They are not going to stop and think... \"Ooooooh, their god is more fanatical than ours.\" There are no 'innocent civilians' in their scheme of things, just more reasons to eradicate the infidels and terrorize their like into submission to their view of their fanatical god. Never-the-less, who speaks for god is a very ancient debate... which imaginary superhero is greater. Marvel Comics couldn't do it better. So, I guess the most \"real\" god will win? I'd like to sit this one out... but I am afraid they'll both go after me given a chance to do so. So, I'm surrounded, regardless of what god names they hurl into space.", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-19 17:25:00", 
        "title": "THE FEW  my pledge", 
        "userID": "reducetension"
    }, 
    {
        "content": "Ya know Joe that is what gives me a chuckle whenever I think of it. The progressives want us to think of terrorists as \"freedom fighters\" reacting to the eeeeviiiil capitolists and extend every friggin' excuse they can to these monsters. Never do they understand that it is THEY these monsters HATE!! The licentiousness which our \"culture\" is permeated with, the disdain for morals, and everything being treated with the relative values as it is today, with no absolutes, makes the radicals crazy. So we, you and I, and ALL of us in the western world, owe a vote of thanks to \"progressivism\" and it's benefits.....Thank you............ These monsters don't want our poison in their societies and we the \"enlightened\", are giving them the rope they need to hang us with......It's all too rich for words!!! T", 
        "intTime": 20090320, 
        "postID": 16, 
        "quote": "", 
        "reply": "Ya know Joe that is what gives me a chuckle whenever I think of it. The progressives want us to think of terrorists as \"freedom fighters\" reacting to the eeeeviiiil capitolists and extend every friggin' excuse they can to these monsters. Never do they understand that it is THEY these monsters HATE!! The licentiousness which our \"culture\" is permeated with, the disdain for morals, and everything being treated with the relative values as it is today, with no absolutes, makes the radicals crazy. So we, you and I, and ALL of us in the western world, owe a vote of thanks to \"progressivism\" and it's benefits.....Thank you............ These monsters don't want our poison in their societies and we the \"enlightened\", are giving them the rope they need to hang us with......It's all too rich for words!!! T", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-20 06:29:00", 
        "title": "THE FEW  my pledge", 
        "userID": "tawodi"
    }, 
    {
        "content": "If I may, I do not feel there should be any Islam or other than our religions allowed in our country and we have established ourselfs and our beliefs are set and all we believe in has been done. I hate the fact they are taking certain words out of our schools and money, where has our value and morals gone, seems like we bend to every religion and sect in the world except the one this country was founde on.", 
        "intTime": 20090320, 
        "postID": 17, 
        "quote": "", 
        "reply": "If I may, I do not feel there should be any Islam or other than our religions allowed in our country and we have established ourselfs and our beliefs are set and all we believe in has been done. I hate the fact they are taking certain words out of our schools and money, where has our value and morals gone, seems like we bend to every religion and sect in the world except the one this country was founde on.", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-20 14:54:00", 
        "title": "THE FEW  my pledge", 
        "userID": "alzilla43"
    }, 
    {
        "content": "quote: Originally posted by alzilla43: If I may, I do not feel there should be any Islam or other than our religions allowed in our country and we have established ourselfs and our beliefs are set and all we believe in has been done. I hate the fact they are taking certain words out of our schools and money, where has our value and morals gone, seems like we bend to every religion and sect in the world except the one this country was founde on. What? You didn't have to study civics when in school? Granted, actually reading (much less comprehending) the Constitution probably seemed a bit of a drag to you but you really should have made the effort! It's never too late, you know! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090320, 
        "postID": 18, 
        "quote": "Originally posted by alzilla43: If I may, I do not feel there should be any Islam or other than our religions allowed in our country and we have established ourselfs and our beliefs are set and all we believe in has been done. I hate the fact they are taking certain words out of our schools and money, where has our value and morals gone, seems like we bend to every religion and sect in the world except the one this country was founde on.", 
        "reply": " What? You didn't have to study civics when in school? Granted, actually reading (much less comprehending) the Constitution probably seemed a bit of a drag to you but you really should have made the effort! It's never too late, you know! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-20 18:03:00", 
        "title": "THE FEW  my pledge", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by tawodi: The licentiousness which our \"culture\" is permeated with, the disdain for morals, and everything being treated with the relative values as it is today, with no absolutes, makes the radicals crazy. So we, you and I, and ALL of us in the western world, owe a vote of thanks to \"progressivism\" and it's benefits.....Thank you............ T Wow, Bruce! You're darn near waxing poetic, here! It's better than the limerick anyway! How'd it go with the Doc? It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090320, 
        "postID": 19, 
        "quote": "Originally posted by tawodi: The licentiousness which our \"culture\" is permeated with, the disdain for morals, and everything being treated with the relative values as it is today, with no absolutes, makes the radicals crazy. So we, you and I, and ALL of us in the western world, owe a vote of thanks to \"progressivism\" and it's benefits.....Thank you............ T", 
        "reply": " Wow, Bruce! You're darn near waxing poetic, here! It's better than the limerick anyway! How'd it go with the Doc? It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-20 18:12:00", 
        "title": "THE FEW  my pledge", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by alzilla43: If I may, I do not feel there should be any Islam or other than our religions allowed in our country and we have established ourselfs and our beliefs are set and all we believe in has been done. I hate the fact they are taking certain words out of our schools and money, where has our value and morals gone, seems like we bend to every religion and sect in the world except the one this country was founde on. Your profile says that you're a retired E-6. That tells me that, at least twice, you swore to \"support and defend the Constitution of the United States...\" Did those words mean nothing to you?", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "Originally posted by alzilla43: If I may, I do not feel there should be any Islam or other than our religions allowed in our country and we have established ourselfs and our beliefs are set and all we believe in has been done. I hate the fact they are taking certain words out of our schools and money, where has our value and morals gone, seems like we bend to every religion and sect in the world except the one this country was founde on.", 
        "reply": " Your profile says that you're a retired E-6. That tells me that, at least twice, you swore to \"support and defend the Constitution of the United States...\" Did those words mean nothing to you?", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-20 20:02:00", 
        "title": "THE FEW  my pledge", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "Hi Kim; No results yet, another appointment Tuesday (dermatoligist) and so it goes!! If the doc. got any interesting results from the lab she hasn't told me yet. Sometimes that's the way it works, the results get forwarded on the the next doc. in line and then you MIGHT find out, if, they deem you worthy of the knowledge that is!!! O.K> it wasn't a limerick!! It was a poem! Not a good one, but poem none the less!! GEEEESH!! Critics critics!! Everybodies a critic!!", 
        "intTime": 20090321, 
        "postID": 21, 
        "quote": "", 
        "reply": "Hi Kim; No results yet, another appointment Tuesday (dermatoligist) and so it goes!! If the doc. got any interesting results from the lab she hasn't told me yet. Sometimes that's the way it works, the results get forwarded on the the next doc. in line and then you MIGHT find out, if, they deem you worthy of the knowledge that is!!! O.K> it wasn't a limerick!! It was a poem! Not a good one, but poem none the less!! GEEEESH!! Critics critics!! Everybodies a critic!!", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-21 04:22:00", 
        "title": "THE FEW  my pledge", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Hi Kim; No results yet, another appointment Tuesday (dermatoligist) and so it goes!! If the doc. got any interesting results from the lab she hasn't told me yet. Sometimes that's the way it works, the results get forwarded on the the next doc. in line and then you MIGHT find out, if, they deem you worthy of the knowledge that is!!! I figured as much! Lab results always drag out the nail-chewing time! The interesting thing was that when I worked ER, most lab results could be had (in-house) within an hour or so! Of course, with none \"time-critical\" lab-work, it's generally farmed out to a contractor; if you're lucky, it's within your own state, but I've heard many of the sub-contracting Labs aren't even CONUS! quote: Originally posted by tawodi: O.K> it wasn't a limerick!! It was a poem! Not a good one, but poem none the less!! GEEEESH!! Critics critics!! Everybodies a critic!! That's OK! I knew what you were shooting for and after all, it was the last line you were really trying to stress anyway, wasn't it? It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090321, 
        "postID": 22, 
        "quote": "Originally posted by tawodi: Hi Kim; No results yet, another appointment Tuesday (dermatoligist) and so it goes!! If the doc. got any interesting results from the lab she hasn't told me yet. Sometimes that's the way it works, the results get forwarded on the the next doc. in line and then you MIGHT find out, if, they deem you worthy of the knowledge that is!!!", 
        "reply": " I figured as much! Lab results always drag out the nail-chewing time! The interesting thing was that when I worked ER, most lab results could be had (in-house) within an hour or so! Of course, with none \"time-critical\" lab-work, it's generally farmed out to a contractor; if you're lucky, it's within your own state, but I've heard many of the sub-contracting Labs aren't even CONUS! quote: Originally posted by tawodi: O.K> it wasn't a limerick!! It was a poem! Not a good one, but poem none the less!! GEEEESH!! Critics critics!! Everybodies a critic!! That's OK! I knew what you were shooting for and after all, it was the last line you were really trying to stress anyway, wasn't it? It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-21 06:38:00", 
        "title": "THE FEW  my pledge", 
        "userID": "KJ1110"
    }, 
    {
        "content": "You get the gold star!! When I did it, I had never before written anything with a \"lisp\" T", 
        "intTime": 20090321, 
        "postID": 23, 
        "quote": "", 
        "reply": "You get the gold star!! When I did it, I had never before written anything with a \"lisp\" T", 
        "threadID": "1270031990001_8730022812001", 
        "time": "2009-03-21 13:08:00", 
        "title": "THE FEW  my pledge", 
        "userID": "tawodi"
    }
]