[
    {
        "content": "Research causes divide The embryonic stem cell research debate is steeped with religious arguments, with some faith traditions convinced the research amounts to killing innocent life, others citing the moral imperative to alleviate suffering, and plenty of religious believers caught somewhere in between. President Barack Obama's order Monday opening the door for federal taxpayer dollars to fund expanded embryonic stem cell research again brings those often colliding interests to the fore. Cardinal Justin Rigali, chairman of the U.S. Conference of Catholic Bishops' Committee on Pro-Life Activities, called Obama's move \"a sad victory of politics over science and ethics.\" \"This action is morally wrong because it encourages the destruction of innocent human life, treating vulnerable human beings as mere products to be harvested,\" Rigali, the archbishop of Philadelphia, said in a statement. On the other side is the Rev. Susan Brooks Thistlethwaite, a United Church of Christ minister and a professor at Chicago Theological Seminary. \"There is an ethical imperative to relieve suffering and promote healing,\" she said. \"This is good policy for a religiously pluralistic society that cares about human suffering and the relief of human suffering.\" Obama alluded to religion in announcing the changes, saying, \"As a person of faith, I believe we are called to care for each other and work to ease human suffering. I believe we have been given the capacity and will to pursue this research and the humanity and conscience to do so responsibly.\" Some religious traditions teach that because life begins at conception, any research that destroys a human embryo, as this research does, is tantamount to murder and is never justified. The Roman Catholic Church and the Southern Baptist Convention are among those that oppose the research. Other more liberal traditions, including mainline Protestant and Jewish institutions, believe the promise to relieve suffering is paramount. In 2004, the governing body of the Episcopal Church said it would favor the research as long as it used embryos that otherwise would have been destroyed, that embryos were not created for research purposes, or were not bought and sold. Under Jewish law, an embryo is genetic material that does not have the status of a person. According to the Talmud, the embryo is \"simply water\" in the first 40 days of gestation. Healing and preserving human life takes precedence over all the other commandments in Judaism. Some groups and faiths are divided on the issue. Muslims disagree over — among other things — whether an embryo in the early stage of development has a soul. The Church of Jesus Christ of Latter-day Saints, or the Mormon church, has not taken a position. The Rev. Joel Hunter, an evangelical pastor from Orlando, Fla., who serves on an Obama White House advisory panel, said he was encouraged by Monday's developments. \"The principle is still that it's not only understandable but in some ways moral to use embryonic stem cells that are destined for destruction for research for helping people,\" he said. \"I think we have to tread very lightly and very carefully, and I think we have to be vigilant for years to come.\" But most evangelicals criticized Obama's move. Gilbert Meilaender, a Christian ethicist at Valparaiso University and a member of the President's Council on Bioethics, created by President George W. Bush, said Obama's decision was especially disappointing because scientists are advancing toward being able to produce cells that act like embryonic stem cells without destroying any human embryos. Meilaender said that while there is no good solution for frozen embryos left in storage at fertility clinics, destroying them for stem cell research is not the answer. \"My own position is that having, as it were, produced and used them once in the use of someone else's project, for a reproductive purpose, that using it once for someone else's purpose is enough,\" said Meilaender, a member of the Lutheran Church-Missouri Synod. Catholic bishops have been outspoken in opposing embryonic stem cell research. Other Catholics, though, are more open to lifting the Bush-era restrictions, with caveats. The Rev. Tom Reese, a senior fellow at the Woodstock Theological Center at Georgetown University, said restrictions should be put on embryonic stem cell research — including prohibition on their buying and selling, and using only embryos that otherwise would be destroyed. \"I'm trying to make an argument for some middle ground here,\" Reese said. \"Hopefully down the line we can reach a point where we don't have to use embryonic stem cell research.\" Polls show some believers are willing to buck their leaders on the issue. Fifty-nine percent of white, non-Hispanic Catholics and 58 percent of white mainline Protestants favor embryonic stem cell research, according to a poll released in July 2008 by the Pew Forum on Religion and Public Life. Only 31 percent of white evangelical Protestants, however, favored the research. Princeton University politics professor Robert George, a Catholic and another member of the Bush-era Council on Bioethics, said the moral argument over embryonic stem cell research is not rooted in religion but in ethics and equality. He said research shows that an embryo is a human being in its earliest form of development, so we have to ask ourselves whether all human life should be treated equally, with dignity and respect. \"I don't think the question has anything to do with religion or pulling out our microscope and trying to find souls,\" George said. \"We live in a pluralistic society where some people believe there are no such things as souls. Does that mean we should not have moral objections to killing 17-year-old adolescents?\" <end of excerpt> You would think that a grown man, and a professor, to boot, could come up with a lot better argument than equating the destruction of a single cell with terminating a thriving teen. If this is the best they've got, maybe Bush should be examined for idiocy. All this time has been wasted while science has had its hands tied over crap like this.", 
        "intTime": 20090309, 
        "postID": 1, 
        "quote": "", 
        "reply": "Research causes divide The embryonic stem cell research debate is steeped with religious arguments, with some faith traditions convinced the research amounts to killing innocent life, others citing the moral imperative to alleviate suffering, and plenty of religious believers caught somewhere in between. President Barack Obama's order Monday opening the door for federal taxpayer dollars to fund expanded embryonic stem cell research again brings those often colliding interests to the fore. Cardinal Justin Rigali, chairman of the U.S. Conference of Catholic Bishops' Committee on Pro-Life Activities, called Obama's move \"a sad victory of politics over science and ethics.\" \"This action is morally wrong because it encourages the destruction of innocent human life, treating vulnerable human beings as mere products to be harvested,\" Rigali, the archbishop of Philadelphia, said in a statement. On the other side is the Rev. Susan Brooks Thistlethwaite, a United Church of Christ minister and a professor at Chicago Theological Seminary. \"There is an ethical imperative to relieve suffering and promote healing,\" she said. \"This is good policy for a religiously pluralistic society that cares about human suffering and the relief of human suffering.\" Obama alluded to religion in announcing the changes, saying, \"As a person of faith, I believe we are called to care for each other and work to ease human suffering. I believe we have been given the capacity and will to pursue this research and the humanity and conscience to do so responsibly.\" Some religious traditions teach that because life begins at conception, any research that destroys a human embryo, as this research does, is tantamount to murder and is never justified. The Roman Catholic Church and the Southern Baptist Convention are among those that oppose the research. Other more liberal traditions, including mainline Protestant and Jewish institutions, believe the promise to relieve suffering is paramount. In 2004, the governing body of the Episcopal Church said it would favor the research as long as it used embryos that otherwise would have been destroyed, that embryos were not created for research purposes, or were not bought and sold. Under Jewish law, an embryo is genetic material that does not have the status of a person. According to the Talmud, the embryo is \"simply water\" in the first 40 days of gestation. Healing and preserving human life takes precedence over all the other commandments in Judaism. Some groups and faiths are divided on the issue. Muslims disagree over — among other things — whether an embryo in the early stage of development has a soul. The Church of Jesus Christ of Latter-day Saints, or the Mormon church, has not taken a position. The Rev. Joel Hunter, an evangelical pastor from Orlando, Fla., who serves on an Obama White House advisory panel, said he was encouraged by Monday's developments. \"The principle is still that it's not only understandable but in some ways moral to use embryonic stem cells that are destined for destruction for research for helping people,\" he said. \"I think we have to tread very lightly and very carefully, and I think we have to be vigilant for years to come.\" But most evangelicals criticized Obama's move. Gilbert Meilaender, a Christian ethicist at Valparaiso University and a member of the President's Council on Bioethics, created by President George W. Bush, said Obama's decision was especially disappointing because scientists are advancing toward being able to produce cells that act like embryonic stem cells without destroying any human embryos. Meilaender said that while there is no good solution for frozen embryos left in storage at fertility clinics, destroying them for stem cell research is not the answer. \"My own position is that having, as it were, produced and used them once in the use of someone else's project, for a reproductive purpose, that using it once for someone else's purpose is enough,\" said Meilaender, a member of the Lutheran Church-Missouri Synod. Catholic bishops have been outspoken in opposing embryonic stem cell research. Other Catholics, though, are more open to lifting the Bush-era restrictions, with caveats. The Rev. Tom Reese, a senior fellow at the Woodstock Theological Center at Georgetown University, said restrictions should be put on embryonic stem cell research — including prohibition on their buying and selling, and using only embryos that otherwise would be destroyed. \"I'm trying to make an argument for some middle ground here,\" Reese said. \"Hopefully down the line we can reach a point where we don't have to use embryonic stem cell research.\" Polls show some believers are willing to buck their leaders on the issue. Fifty-nine percent of white, non-Hispanic Catholics and 58 percent of white mainline Protestants favor embryonic stem cell research, according to a poll released in July 2008 by the Pew Forum on Religion and Public Life. Only 31 percent of white evangelical Protestants, however, favored the research. Princeton University politics professor Robert George, a Catholic and another member of the Bush-era Council on Bioethics, said the moral argument over embryonic stem cell research is not rooted in religion but in ethics and equality. He said research shows that an embryo is a human being in its earliest form of development, so we have to ask ourselves whether all human life should be treated equally, with dignity and respect. \"I don't think the question has anything to do with religion or pulling out our microscope and trying to find souls,\" George said. \"We live in a pluralistic society where some people believe there are no such things as souls. Does that mean we should not have moral objections to killing 17-year-old adolescents?\" <end of excerpt> You would think that a grown man, and a professor, to boot, could come up with a lot better argument than equating the destruction of a single cell with terminating a thriving teen. If this is the best they've got, maybe Bush should be examined for idiocy. All this time has been wasted while science has had its hands tied over crap like this.", 
        "threadID": "1270031990001_9770093712001", 
        "time": "2009-03-09 19:20:00", 
        "title": "Stem Cell", 
        "userID": "billbright"
    }, 
    {
        "content": "Bill, In the interest of accuracy, I should point out that science hasn't exactly \"had its hands tied\" all this time. Embryonic stem cell research wasn't illegal before, it just didn't receive federal funding. Which also makes all the back-and-forth about souls irrelevant, IMHO. The question on my mind is, if this research receives federal funding, will the federal government have exclusive (or dominating) control over how the results are used? Are there no independent groups, such as the Gates Foundation, who might be persuaded to help fund this research to keep it independent?", 
        "intTime": 20090309, 
        "postID": 2, 
        "quote": "", 
        "reply": "Bill, In the interest of accuracy, I should point out that science hasn't exactly \"had its hands tied\" all this time. Embryonic stem cell research wasn't illegal before, it just didn't receive federal funding. Which also makes all the back-and-forth about souls irrelevant, IMHO. The question on my mind is, if this research receives federal funding, will the federal government have exclusive (or dominating) control over how the results are used? Are there no independent groups, such as the Gates Foundation, who might be persuaded to help fund this research to keep it independent?", 
        "threadID": "1270031990001_9770093712001", 
        "time": "2009-03-09 19:45:00", 
        "title": "Stem Cell", 
        "userID": "SteveDeHaven"
    }, 
    {
        "content": "quote: Originally posted by SteveDeHaven: Bill, In the interest of accuracy, I should point out that science hasn't exactly \"had its hands tied\" all this time. Embryonic stem cell research wasn't illegal before, it just didn't receive federal funding. Which also makes all the back-and-forth about souls irrelevant, IMHO. The question on my mind is, if this research receives federal funding, will the federal government have exclusive (or dominating) control over how the results are used? Are there no independent groups, such as the Gates Foundation, who might be persuaded to help fund this research to keep it independent? I doubt it. It never really worked that way in the past. Partnerships have usually been done only where the gov't had a significant facility to offer. With this issue, the gov't has had such a hands-off attitude that grants should give the grantee a lot of control over the product. By not supporting the research, they may as well have \"tied hands.\" And it was hampered by the work-around techniques and limitations of using existing cells. If there's anything this country needs now it's a lot, lot, lot of innovation. The Bushies were only capable of spending money on military research, and as a result we got to see major medical and other research being done in Europe, especially, and Japan.", 
        "intTime": 20090309, 
        "postID": 3, 
        "quote": "Originally posted by SteveDeHaven: Bill, In the interest of accuracy, I should point out that science hasn't exactly \"had its hands tied\" all this time. Embryonic stem cell research wasn't illegal before, it just didn't receive federal funding. Which also makes all the back-and-forth about souls irrelevant, IMHO. The question on my mind is, if this research receives federal funding, will the federal government have exclusive (or dominating) control over how the results are used? Are there no independent groups, such as the Gates Foundation, who might be persuaded to help fund this research to keep it independent?", 
        "reply": " I doubt it. It never really worked that way in the past. Partnerships have usually been done only where the gov't had a significant facility to offer. With this issue, the gov't has had such a hands-off attitude that grants should give the grantee a lot of control over the product. By not supporting the research, they may as well have \"tied hands.\" And it was hampered by the work-around techniques and limitations of using existing cells. If there's anything this country needs now it's a lot, lot, lot of innovation. The Bushies were only capable of spending money on military research, and as a result we got to see major medical and other research being done in Europe, especially, and Japan.", 
        "threadID": "1270031990001_9770093712001", 
        "time": "2009-03-09 20:57:00", 
        "title": "Stem Cell", 
        "userID": "billbright"
    }, 
    {
        "content": "I stand corrected. This is an email I got from a science group who thinks I'm smart enough to get mail from eggheads: **************** As you likely know, today President Obama issued an Executive Order (here) overturning the Bush Administration's policy of restricting stem cell research to stem cell lines already in place on August 9, 2001. The new policy will open up the ability to use federal funding for research on any stem cell line in existence. The National Institutes of Health will now have 120 days to develop guidelines for federal funding for such research. You can watch the President sign the Order here. The Executive Order does not affect the prohibition on using federal funding for creating destroying, or discarding human embryos. This prohibition first became law in 1996 and is known as the Dickey-Wicker amendment. Subsequent laws appropriating money for the Department of Health and Human Services all carry this prohibition (shown here in H.$. 3043, the 2008 appropriations for HHS). After today, federal dollars can go toward research on hundreds of cell lines in existence, but not to creating new lines. President Obama also issued a Presidential Memorandum (which you can see here) designed to forward his goal of restoring \"science to its rightful place.\" According to President Obama, the Memorandum will direct the head of the White House Office of Science and Technology Policy (OSTP) \"to develop strategies for restoring scientific integrity to government decision making.\" In particular, Obama mentioned ensuring that public policy is based on the soundest science, appointing federal advisors based on their credentials, and ensuring that the government be open and honest about the science behind government decisions. This update is brought to you as part of the SHARP Network of Scientists and Engineers for America. For more information on science policy in Congress and the Administration, visit our homepage and find your Congressional Representatives!", 
        "intTime": 20090309, 
        "postID": 4, 
        "quote": "", 
        "reply": "I stand corrected. This is an email I got from a science group who thinks I'm smart enough to get mail from eggheads: **************** As you likely know, today President Obama issued an Executive Order (here) overturning the Bush Administration's policy of restricting stem cell research to stem cell lines already in place on August 9, 2001. The new policy will open up the ability to use federal funding for research on any stem cell line in existence. The National Institutes of Health will now have 120 days to develop guidelines for federal funding for such research. You can watch the President sign the Order here. The Executive Order does not affect the prohibition on using federal funding for creating destroying, or discarding human embryos. This prohibition first became law in 1996 and is known as the Dickey-Wicker amendment. Subsequent laws appropriating money for the Department of Health and Human Services all carry this prohibition (shown here in H.$. 3043, the 2008 appropriations for HHS). After today, federal dollars can go toward research on hundreds of cell lines in existence, but not to creating new lines. President Obama also issued a Presidential Memorandum (which you can see here) designed to forward his goal of restoring \"science to its rightful place.\" According to President Obama, the Memorandum will direct the head of the White House Office of Science and Technology Policy (OSTP) \"to develop strategies for restoring scientific integrity to government decision making.\" In particular, Obama mentioned ensuring that public policy is based on the soundest science, appointing federal advisors based on their credentials, and ensuring that the government be open and honest about the science behind government decisions. This update is brought to you as part of the SHARP Network of Scientists and Engineers for America. For more information on science policy in Congress and the Administration, visit our homepage and find your Congressional Representatives!", 
        "threadID": "1270031990001_9770093712001", 
        "time": "2009-03-09 22:15:00", 
        "title": "Stem Cell", 
        "userID": "billbright"
    }, 
    {
        "content": "What I never see is any reference whatsoever to umbilical cord donations for stem cells. Millions of them over the last twenty years have been donated but that isn't good enough I guess. We need to culture human beings now so we can kill them.", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "", 
        "reply": "What I never see is any reference whatsoever to umbilical cord donations for stem cells. Millions of them over the last twenty years have been donated but that isn't good enough I guess. We need to culture human beings now so we can kill them.", 
        "threadID": "1270031990001_9770093712001", 
        "time": "2009-03-10 09:33:00", 
        "title": "Stem Cell", 
        "userID": "tawodi"
    }, 
    {
        "content": "Embryonic stem cells are “pluripotent” cells, meaning they have the potential to transform into any of the 200 cells that make up the human body. They're found in the center of a “blastocyst,” the hollow, tiny ball of about 130 cells that forms a few days after the sperm and egg join. (A blastocyst is the size of the period at the end of this sentence.) To save a cell, the embryo must be destroyed. The thing is.... they were going to be destroyed, anyway, when either when the umbilicus/amniotic fluid was thrown in the incinerator, or the aborted fetus. Hello? So far, there are five sources of stem cells for research: embryonic, amniotic fluid, umbilical cord, adult bone marrow and the newest form, from genetically reprogrammed skin cells. The most promising are embryonic, which so far are the only, ONLY, ones able to turn into any kind of cell needed by the human body. Do you understand that? Embryonic are BETTER. But the religious got all fired up and had to have a *******ed amendment to prevent their use. I was talking to a woman today at the studio. She has MS. Her twin brother died, just recently. Though this woman can't walk except with a walker and has a terrible time making herself understood because her mouth muscles don't function properly, she's sharp as a tack. Her paintings look like a child's, but she chooses the most perfect palette of colors. And she has the most friendly sense of humor. She was sitting by me when another woman came in to see a friend of hers who works at the studio also. They were chatting about the one gal's sweatshirt: it was a souvenir from the Obama inauguration soiree. She and the other lady chittered on and on about Obama, like he was some kind of returned freakin' messiah, or something. Then the sweatshirt lady mentioned that He had lifted the ban on stem cells. I announced that he had only lifted the ban on federal funding of research, not the ban on using newly-created cells. You'd have thought I'd shot her only cow. The two of them went off on me like a tricky shotgun... both barrels. I told her that the Obama of two years ago wouldn't have kowtowed to the religious and gone in with half-measures, but she'd have none of that. Well, don't you know, the MS lady sat through the entire harangue, and after the two left to go somewhere else and talk about me, she said, almost in a whisper, \"My doctor told me that I mightn't have lost my brother if they'd been able to use new embryonic cells.\" She cried a little, and I had to steady her so she wouldn't fall. Don't get me started.", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "", 
        "reply": "Embryonic stem cells are “pluripotent” cells, meaning they have the potential to transform into any of the 200 cells that make up the human body. They're found in the center of a “blastocyst,” the hollow, tiny ball of about 130 cells that forms a few days after the sperm and egg join. (A blastocyst is the size of the period at the end of this sentence.) To save a cell, the embryo must be destroyed. The thing is.... they were going to be destroyed, anyway, when either when the umbilicus/amniotic fluid was thrown in the incinerator, or the aborted fetus. Hello? So far, there are five sources of stem cells for research: embryonic, amniotic fluid, umbilical cord, adult bone marrow and the newest form, from genetically reprogrammed skin cells. The most promising are embryonic, which so far are the only, ONLY, ones able to turn into any kind of cell needed by the human body. Do you understand that? Embryonic are BETTER. But the religious got all fired up and had to have a *******ed amendment to prevent their use. I was talking to a woman today at the studio. She has MS. Her twin brother died, just recently. Though this woman can't walk except with a walker and has a terrible time making herself understood because her mouth muscles don't function properly, she's sharp as a tack. Her paintings look like a child's, but she chooses the most perfect palette of colors. And she has the most friendly sense of humor. She was sitting by me when another woman came in to see a friend of hers who works at the studio also. They were chatting about the one gal's sweatshirt: it was a souvenir from the Obama inauguration soiree. She and the other lady chittered on and on about Obama, like he was some kind of returned freakin' messiah, or something. Then the sweatshirt lady mentioned that He had lifted the ban on stem cells. I announced that he had only lifted the ban on federal funding of research, not the ban on using newly-created cells. You'd have thought I'd shot her only cow. The two of them went off on me like a tricky shotgun... both barrels. I told her that the Obama of two years ago wouldn't have kowtowed to the religious and gone in with half-measures, but she'd have none of that. Well, don't you know, the MS lady sat through the entire harangue, and after the two left to go somewhere else and talk about me, she said, almost in a whisper, \"My doctor told me that I mightn't have lost my brother if they'd been able to use new embryonic cells.\" She cried a little, and I had to steady her so she wouldn't fall. Don't get me started.", 
        "threadID": "1270031990001_9770093712001", 
        "time": "2009-03-12 19:28:00", 
        "title": "Stem Cell", 
        "userID": "billbright"
    }
]