[
    {
        "content": "The Chaplaincy of Full Gospel Churches (CFGC) is a chaplain endorsing agency headed by retired Army colonel and chaplain Jim Ammerman, and authorized by the Department of Defense to provide the ecclesiastical endorsement required by the military for all military chaplains, with several hundred of its chaplains currently serving in all branches of the military. Some are saying that the CFGC should be disqualified as an endorsing agency because of its repeated denigration of all other religions and Christian denominations that aren't Charismatic or Pentecostal, which is completely contrary to Department of Defense Instruction Number 1304.28. For example, the CFGC's September 2006 newsletter included an article titled \"Can a Good Muslim be a Good American?,\" which gave 10 reasons why the answer is \"no,\" including: quote: Because he cannot accept the American Constitution since it is based on Biblical principles...after much study and deliberation, perhaps we should be very suspicious of ALL MUSLIMS in this country. They obviously cannot be both 'good' Muslims and good Americans. Jim Ammerman was also the chaplain endorser who revoked the CFGC endorsement of Don Larsen, the chaplain who converted from Christianity to Wicca. . This is what Ammerman said about Wicca and Chaplain Larsen, from a Washington Post article by Alan Cooperman. quote: Jim Ammerman, a retired Army colonel who is president and founder of the Chaplaincy of Full Gospel Churches, acknowledges that there is a longstanding agreement among endorsers not to summarily pull the papers of a chaplain who wants to make a valid switch. \"'But if it's not a valid thing, all bets are off,' Ammerman says, adding that Wiccans \"run around naked in the woods\" and \"draw blood with a dagger\" in their ceremonies. 'You can't do that in the military. It's against good order and discipline.' The CFGC is also clearly anti-Catholic, describing Catholics in its July 2007 newsletter as being quote: bound by traditions and ceremonies, and without a real thirst for the truth. Colonel (ret.) Ammerman is a member and leader of the Prophecy Club who have produced videos which include the following: quote: Remember, the demons believe in Jesus Christ. They believe in the truth - see that's Jesus Christ - and they tremble. And so the demons inside these greedy world bankers are trembling that Americans would come to find the truth about what they're all about. They are as scared as little tiny mice running up and down the curtains in the cathedrals. Now, they're in the cathedrals. They're in the churches. They're controlling pulpits. That's how mainstream Protestantism has declined. Because they invaded the churches, and the mainstream Protestant churches stopped hearing the truth. So they want to squelch the truth by taking over the church. Now, this is not in my notes, but I was inspired by God because these are demonic, dastardly creatures from the pit of hell, and we need to stomp them out. Another of their videos declares that all translations of the Bible other than the King James Version are the work of Satan to confuse people, so any Protestant denominations using these Bibles are deluded. I realize we need Chaplains of many beliefs to minister to servicemen and servicewomen, their spouses and their families - but do we need Chaplains who teach that mainstream Protestant churches are run by demons of Satan, that the revised Standard translation of the Bible is the work of the Devil and that all American Muslims are suspicious and cannot be good Americans if they remain Muslims?", 
        "intTime": 20090521, 
        "postID": 1, 
        "quote": "Because he cannot accept the American Constitution since it is based on Biblical principles...after much study and deliberation, perhaps we should be very suspicious of ALL MUSLIMS in this country. They obviously cannot be both 'good' Muslims and good Americans.", 
        "reply": "The Chaplaincy of Full Gospel Churches (CFGC) is a chaplain endorsing agency headed by retired Army colonel and chaplain Jim Ammerman, and authorized by the Department of Defense to provide the ecclesiastical endorsement required by the military for all military chaplains, with several hundred of its chaplains currently serving in all branches of the military. Some are saying that the CFGC should be disqualified as an endorsing agency because of its repeated denigration of all other religions and Christian denominations that aren't Charismatic or Pentecostal, which is completely contrary to Department of Defense Instruction Number 1304.28. For example, the CFGC's September 2006 newsletter included an article titled \"Can a Good Muslim be a Good American?,\" which gave 10 reasons why the answer is \"no,\" including:  Jim Ammerman was also the chaplain endorser who revoked the CFGC endorsement of Don Larsen, the chaplain who converted from Christianity to Wicca. . This is what Ammerman said about Wicca and Chaplain Larsen, from a Washington Post article by Alan Cooperman. quote: Jim Ammerman, a retired Army colonel who is president and founder of the Chaplaincy of Full Gospel Churches, acknowledges that there is a longstanding agreement among endorsers not to summarily pull the papers of a chaplain who wants to make a valid switch. \"'But if it's not a valid thing, all bets are off,' Ammerman says, adding that Wiccans \"run around naked in the woods\" and \"draw blood with a dagger\" in their ceremonies. 'You can't do that in the military. It's against good order and discipline.' The CFGC is also clearly anti-Catholic, describing Catholics in its July 2007 newsletter as being quote: bound by traditions and ceremonies, and without a real thirst for the truth. Colonel (ret.) Ammerman is a member and leader of the Prophecy Club who have produced videos which include the following: quote: Remember, the demons believe in Jesus Christ. They believe in the truth - see that's Jesus Christ - and they tremble. And so the demons inside these greedy world bankers are trembling that Americans would come to find the truth about what they're all about. They are as scared as little tiny mice running up and down the curtains in the cathedrals. Now, they're in the cathedrals. They're in the churches. They're controlling pulpits. That's how mainstream Protestantism has declined. Because they invaded the churches, and the mainstream Protestant churches stopped hearing the truth. So they want to squelch the truth by taking over the church. Now, this is not in my notes, but I was inspired by God because these are demonic, dastardly creatures from the pit of hell, and we need to stomp them out. Another of their videos declares that all translations of the Bible other than the King James Version are the work of Satan to confuse people, so any Protestant denominations using these Bibles are deluded. I realize we need Chaplains of many beliefs to minister to servicemen and servicewomen, their spouses and their families - but do we need Chaplains who teach that mainstream Protestant churches are run by demons of Satan, that the revised Standard translation of the Bible is the work of the Devil and that all American Muslims are suspicious and cannot be good Americans if they remain Muslims?", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-21 08:55:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "The CFCG's own mission statement is in direct opposition to the mission of the Chaplain Corps. They can't follow both. Therefore, they are unable to serve properly as Chaplains to the military. End of discussion.", 
        "intTime": 20090521, 
        "postID": 2, 
        "quote": "", 
        "reply": "The CFCG's own mission statement is in direct opposition to the mission of the Chaplain Corps. They can't follow both. Therefore, they are unable to serve properly as Chaplains to the military. End of discussion.", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-21 09:36:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Guess I need an excorcism....damn that's gonna really screw up the weekend!!", 
        "intTime": 20090521, 
        "postID": 3, 
        "quote": "", 
        "reply": "Guess I need an excorcism....damn that's gonna really screw up the weekend!!", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-21 11:23:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Guess I need an excorcism....damn that's gonna really screw up the weekend!! Evidently the military needs the exorcists, too! With all those 'holy rollers' it will be no time at all that the military will be cleansed of the evil and victory in battles will be won with the mighty hand of God once again! PTL!", 
        "intTime": 20090521, 
        "postID": 4, 
        "quote": "Originally posted by tawodi: Guess I need an excorcism....damn that's gonna really screw up the weekend!!", 
        "reply": " Evidently the military needs the exorcists, too! With all those 'holy rollers' it will be no time at all that the military will be cleansed of the evil and victory in battles will be won with the mighty hand of God once again! PTL!", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-21 14:36:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "reducetension"
    }, 
    {
        "content": "Where I work we were all required to do an elearning course on the Navy's policy on religious discrimination just this month. Anyone who follows the CFGC's teaching is blatantly in violation of the US Navy's policy. The Army's policy is very similar. The Air Force policy has been deliberately watered down, but the CFGC would even be in violation of their policy. Military regs aren't served up like a buffet, where you can select the ones you like and reject the rest. I say if they can't follow orders and support official policy instructions they have no business serving the US military.", 
        "intTime": 20090522, 
        "postID": 5, 
        "quote": "", 
        "reply": "Where I work we were all required to do an elearning course on the Navy's policy on religious discrimination just this month. Anyone who follows the CFGC's teaching is blatantly in violation of the US Navy's policy. The Army's policy is very similar. The Air Force policy has been deliberately watered down, but the CFGC would even be in violation of their policy. Military regs aren't served up like a buffet, where you can select the ones you like and reject the rest. I say if they can't follow orders and support official policy instructions they have no business serving the US military.", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-22 00:32:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "So....why the hell isn't the brass enforcing those regs?? Could they be part of the problem?? Just askin'!!", 
        "intTime": 20090522, 
        "postID": 6, 
        "quote": "", 
        "reply": "So....why the hell isn't the brass enforcing those regs?? Could they be part of the problem?? Just askin'!!", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-22 06:02:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tawodi: So....why the hell isn't the brass enforcing those regs?? Could they be part of the problem?? Just askin'!! That's certainly the case in the Air Force. It also seems that being a part of the problem is not uncommon at the Pentagon in general.", 
        "intTime": 20090522, 
        "postID": 7, 
        "quote": "Originally posted by tawodi: So....why the hell isn't the brass enforcing those regs?? Could they be part of the problem?? Just askin'!!", 
        "reply": " That's certainly the case in the Air Force. It also seems that being a part of the problem is not uncommon at the Pentagon in general.", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-22 07:01:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by tawodi: So....why the hell isn't the brass enforcing those regs?? Could they be part of the problem?? Just askin'!! That's certainly the case in the Air Force. It also seems that being a part of the problem is not uncommon at the Pentagon in general. Exactly. The problem runs up and down the entire chain of command. I saw it in the Army brass, too. They're certainly part of the problem! In fact, the chaplain I had on one assignment, although Christian, was the LEAST pushy of any officer I encountered there, and was the most accepting. He'd cater to the needs of all the troops.", 
        "intTime": 20090522, 
        "postID": 8, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by tawodi: So....why the hell isn't the brass enforcing those regs?? Could they be part of the problem?? Just askin'!! That's certainly the case in the Air Force. It also seems that being a part of the problem is not uncommon at the Pentagon in general.", 
        "reply": " Exactly. The problem runs up and down the entire chain of command. I saw it in the Army brass, too. They're certainly part of the problem! In fact, the chaplain I had on one assignment, although Christian, was the LEAST pushy of any officer I encountered there, and was the most accepting. He'd cater to the needs of all the troops.", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-22 08:29:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Though I no longer work with the Chaplains as I did when a civilian secular \"referee\" with Army Family Advocacy and at the military prison, I hear there is discord among the various denominations on what they should be up to. Capturing the hearts and minds of service members seems to be a heavy handed emphasis among the more 'overly-religious' types (including the so called \"Full Gospel\" sects) and that includes fabricating history to make it look like that was what our great leaders wanted, too. Dave Barton is one of those civilians pimpingg his fiction in the military. I've had my run in with his ilk in the Chaplaincy in the last year or so. But, having said that, I actually encounter few in the military who have any troubling stories to tell of being required to be religious, etc. It appears to vary from base to base, Fort to Fort, ship to ship, etc. Most of the military people I see and get to know are college students in uniform and they rarely have any personal interest in religion but are fascinated about how religion works as a social/political tool. I'm not as concerned about it as I was since I see more military people who are fully capable of resisting, debunking and ignoring the overly-holy. Either they are so worldly they can't stand the religious or they are well enough educated and intelligent not to be duped by it. In between that you find the flotsam of faith. This message has been edited. Last edited by: reducetension, Fri 22 May 2009 03:19 PM", 
        "intTime": 20090522, 
        "postID": 9, 
        "quote": "", 
        "reply": "Though I no longer work with the Chaplains as I did when a civilian secular \"referee\" with Army Family Advocacy and at the military prison, I hear there is discord among the various denominations on what they should be up to. Capturing the hearts and minds of service members seems to be a heavy handed emphasis among the more 'overly-religious' types (including the so called \"Full Gospel\" sects) and that includes fabricating history to make it look like that was what our great leaders wanted, too. Dave Barton is one of those civilians pimpingg his fiction in the military. I've had my run in with his ilk in the Chaplaincy in the last year or so. But, having said that, I actually encounter few in the military who have any troubling stories to tell of being required to be religious, etc. It appears to vary from base to base, Fort to Fort, ship to ship, etc. Most of the military people I see and get to know are college students in uniform and they rarely have any personal interest in religion but are fascinated about how religion works as a social/political tool. I'm not as concerned about it as I was since I see more military people who are fully capable of resisting, debunking and ignoring the overly-holy. Either they are so worldly they can't stand the religious or they are well enough educated and intelligent not to be duped by it. In between that you find the flotsam of faith. This message has been edited. Last edited by: reducetension, Fri 22 May 2009 03:19 PM", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-22 10:23:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by BPCR45_90: quote: Originally posted by tawodi: So....why the hell isn't the brass enforcing those regs?? Could they be part of the problem?? Just askin'!! That's certainly the case in the Air Force. It also seems that being a part of the problem is not uncommon at the Pentagon in general. Exactly. The problem runs up and down the entire chain of command. I saw it in the Army brass, too. They're certainly part of the problem! In fact, the chaplain I had on one assignment, although Christian, was the LEAST pushy of any officer I encountered there, and was the most accepting. He'd cater to the needs of all the troops. Then he clearly understood his mission!", 
        "intTime": 20090522, 
        "postID": 10, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by BPCR45_90: quote: Originally posted by tawodi: So....why the hell isn't the brass enforcing those regs?? Could they be part of the problem?? Just askin'!! That's certainly the case in the Air Force. It also seems that being a part of the problem is not uncommon at the Pentagon in general. Exactly. The problem runs up and down the entire chain of command. I saw it in the Army brass, too. They're certainly part of the problem! In fact, the chaplain I had on one assignment, although Christian, was the LEAST pushy of any officer I encountered there, and was the most accepting. He'd cater to the needs of all the troops.", 
        "reply": " Then he clearly understood his mission!", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-22 12:38:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "Two of the best Chaplains I ever knew in the military were both Roman Catholics. Coincidentally, they were both Jesuit priests. Even though I am not a Roman Catholic, I felt they were excellent chaplains, and they both became personal friends. Of course according to the CFGC, those two fine chaplains shouldn't have been allowed to be Army chaplains - because they were Roman Catholics and, in the eyes of the CFGC, weren't Christians.", 
        "intTime": 20090522, 
        "postID": 11, 
        "quote": "", 
        "reply": "Two of the best Chaplains I ever knew in the military were both Roman Catholics. Coincidentally, they were both Jesuit priests. Even though I am not a Roman Catholic, I felt they were excellent chaplains, and they both became personal friends. Of course according to the CFGC, those two fine chaplains shouldn't have been allowed to be Army chaplains - because they were Roman Catholics and, in the eyes of the CFGC, weren't Christians.", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-22 13:44:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "There was an engineering officer on one of the ships I was stationed on in the sixties. He was an ordained Baptist minister and doubled as the ship's Chaplain and a more biggoted racist S.O.B. I never met in my life!! I wound up taking a bust in rate because the dumb S.O.B. thought the guy on report was the only black man on the ship when it was me. He sent the papers up for capt's. mast before he even knew who he was going to drop!! When he learned it was me he called me in and apologised and said he would make it up to me. I stood mast and then later he did make it good and then I got the S.O.B. but good. I forced him to approve a transfer to governor's island for that man, so he would be out of harm's way till the end of his enlistment, and he did so vowing to get me. After he did as I asked, I turned him in to the captain with proofs of what had happened!! Nothing really happened to him I thought, but two years later, on another ship, just before I was discharged, I heard that he retired with out making full commander and quietly left the service. I had absolutely NO qualms of conscience over that P.O.S. then, or now!!", 
        "intTime": 20090522, 
        "postID": 12, 
        "quote": "", 
        "reply": "There was an engineering officer on one of the ships I was stationed on in the sixties. He was an ordained Baptist minister and doubled as the ship's Chaplain and a more biggoted racist S.O.B. I never met in my life!! I wound up taking a bust in rate because the dumb S.O.B. thought the guy on report was the only black man on the ship when it was me. He sent the papers up for capt's. mast before he even knew who he was going to drop!! When he learned it was me he called me in and apologised and said he would make it up to me. I stood mast and then later he did make it good and then I got the S.O.B. but good. I forced him to approve a transfer to governor's island for that man, so he would be out of harm's way till the end of his enlistment, and he did so vowing to get me. After he did as I asked, I turned him in to the captain with proofs of what had happened!! Nothing really happened to him I thought, but two years later, on another ship, just before I was discharged, I heard that he retired with out making full commander and quietly left the service. I had absolutely NO qualms of conscience over that P.O.S. then, or now!!", 
        "threadID": "1270031990001_2140078322001", 
        "time": "2009-05-22 20:15:00", 
        "title": "The Chaplaincy of Full Gospel Churches (CFGC)", 
        "userID": "tawodi"
    }
]