[
    {
        "content": "On Tuesday (March 10th, 2009) I will be taking the Entered Apprentance degree. I am very excited about taking this step and I wanted to let you you know that this discussion board help me reach the decision to become a Mason. I have visited this discussion board numerous times over the past year and half. I have always been impressed with how responses to positive and negative postings have been addressed. By reading the information on this discussion board, I was able to obtain the basic knowledge I needed to take the step to submit my petition to Beach Lodge #354 in Indiatlantic, Florida. I would like to thank you all for your honest and thoughtful writings. Many times, your words spoke to my heart and I was able to see your passion and desire. That is something I will carry with me on my Masonic journey. So any advice/things I should know for the day would be greatly appreciated. Again, thank you very much. V/R, T.J. DeLaine CWO2, USN Retired", 
        "intTime": 20090309, 
        "postID": 1, 
        "quote": "", 
        "reply": "On Tuesday (March 10th, 2009) I will be taking the Entered Apprentance degree. I am very excited about taking this step and I wanted to let you you know that this discussion board help me reach the decision to become a Mason. I have visited this discussion board numerous times over the past year and half. I have always been impressed with how responses to positive and negative postings have been addressed. By reading the information on this discussion board, I was able to obtain the basic knowledge I needed to take the step to submit my petition to Beach Lodge #354 in Indiatlantic, Florida. I would like to thank you all for your honest and thoughtful writings. Many times, your words spoke to my heart and I was able to see your passion and desire. That is something I will carry with me on my Masonic journey. So any advice/things I should know for the day would be greatly appreciated. Again, thank you very much. V/R, T.J. DeLaine CWO2, USN Retired", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-09 13:14:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "tdelaine"
    }, 
    {
        "content": "Sir, your posting has made my day. As the individual who suggested the establishment of this discussion group, I have seen many men such as yourself, make the decision to petition our Gentle Craft. You are beginning a journey of self-enrichment, and personal enlightenment, unlike any you have ever taken before. May the Great Architect of the Universe, guide your steps.", 
        "intTime": 20090309, 
        "postID": 2, 
        "quote": "", 
        "reply": "Sir, your posting has made my day. As the individual who suggested the establishment of this discussion group, I have seen many men such as yourself, make the decision to petition our Gentle Craft. You are beginning a journey of self-enrichment, and personal enlightenment, unlike any you have ever taken before. May the Great Architect of the Universe, guide your steps.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-09 22:19:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "cemab4y"
    }, 
    {
        "content": "quote: Originally posted by tdelaine: On Tuesday (March 10th, 2009) I will be taking the Entered Apprentance degree. I am very excited about taking this step and I wanted to let you you know that this discussion board help me reach the decision to become a Mason. I have visited this discussion board numerous times over the past year and half. I have always been impressed with how responses to positive and negative postings have been addressed. By reading the information on this discussion board, I was able to obtain the basic knowledge I needed to take the step to submit my petition to Beach Lodge #354 in Indiatlantic, Florida. I would like to thank you all for your honest and thoughtful writings. Many times, your words spoke to my heart and I was able to see your passion and desire. That is something I will carry with me on my Masonic journey. So any advice/things I should know for the day would be greatly appreciated. Again, thank you very much. V/R, T.J. DeLaine CWO2, USN Retired Congratulations! I hope that in a small way, some of my words were influential to you and your decision to become a Freemason. In many ways we share some common interests. I too am a retired military officer (U.S. Army). My father who is deceased was a Freemason and he is retired U.S. Navy and I was a Navy dependant. It was upon my father's passing and at his Masonic Memorial that I wanted to learn more about Freemasonry since the male members of my dad's side of the family were all Masons except me. That changed after dad's passing. The rest is history. I was assigned to Patrick Air Force Base, Cocoa Beach, Florida, in 1985-1986 for a military course and I lived in Indiana Harbor Beach and visit there on occasion. Send me a private message and I would be glad to sit in lodge with you brother. My only advice is to keep an open mind and listen carefully to the teachings you will be learning. Then put to practice what you learn. As one wise Master Mason once told me, \"It is easier to give ten Masonic lectures than it is to live one.\" Remember this one thought, \"You will get out of Freemasonry what you put into it.\" My only regrets was not becoming a Mason much earlier in my life, but dad came from the old school where he could not ask me to join. Visit other lodges and meet everyone you can. I have met wonderful new friends that I would not have if I did not join the fraternity of Free and Accepted Masons. Again, congratulations and let us all know the dates of your degrees. You never know, someone that visits this forum might show up to meet you in lodge. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "Originally posted by tdelaine: On Tuesday (March 10th, 2009) I will be taking the Entered Apprentance degree. I am very excited about taking this step and I wanted to let you you know that this discussion board help me reach the decision to become a Mason. I have visited this discussion board numerous times over the past year and half. I have always been impressed with how responses to positive and negative postings have been addressed. By reading the information on this discussion board, I was able to obtain the basic knowledge I needed to take the step to submit my petition to Beach Lodge #354 in Indiatlantic, Florida. I would like to thank you all for your honest and thoughtful writings. Many times, your words spoke to my heart and I was able to see your passion and desire. That is something I will carry with me on my Masonic journey. So any advice/things I should know for the day would be greatly appreciated. Again, thank you very much. V/R, T.J. DeLaine CWO2, USN Retired", 
        "reply": " Congratulations! I hope that in a small way, some of my words were influential to you and your decision to become a Freemason. In many ways we share some common interests. I too am a retired military officer (U.S. Army). My father who is deceased was a Freemason and he is retired U.S. Navy and I was a Navy dependant. It was upon my father's passing and at his Masonic Memorial that I wanted to learn more about Freemasonry since the male members of my dad's side of the family were all Masons except me. That changed after dad's passing. The rest is history. I was assigned to Patrick Air Force Base, Cocoa Beach, Florida, in 1985-1986 for a military course and I lived in Indiana Harbor Beach and visit there on occasion. Send me a private message and I would be glad to sit in lodge with you brother. My only advice is to keep an open mind and listen carefully to the teachings you will be learning. Then put to practice what you learn. As one wise Master Mason once told me, \"It is easier to give ten Masonic lectures than it is to live one.\" Remember this one thought, \"You will get out of Freemasonry what you put into it.\" My only regrets was not becoming a Mason much earlier in my life, but dad came from the old school where he could not ask me to join. Visit other lodges and meet everyone you can. I have met wonderful new friends that I would not have if I did not join the fraternity of Free and Accepted Masons. Again, congratulations and let us all know the dates of your degrees. You never know, someone that visits this forum might show up to meet you in lodge. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-10 01:39:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "quote: Originally posted by cemab4y: Sir, your posting has made my day. As the individual who suggested the establishment of this discussion group, I have seen many men such as yourself, make the decision to petition our Gentle Craft. You are beginning a journey of self-enrichment, and personal enlightenment, unlike any you have ever taken before. May the Great Architect of the Universe, guide your steps. Thank you for your kind words. This morning, I woke up with a great sense of excitement. Please know that your efforts will continue to bear fruit in the future. I enjoy reading your passionate writings that reflect your commitment to Freemasonary. I plan to write my reflections on receiving my EA degree in future posts. Take care and I greatly appreciate your commitment and focus on making good men better. This message has been edited. Last edited by: tdelaine, Tue 10 March 2009 06:22 AM", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "Originally posted by cemab4y: Sir, your posting has made my day. As the individual who suggested the establishment of this discussion group, I have seen many men such as yourself, make the decision to petition our Gentle Craft. You are beginning a journey of self-enrichment, and personal enlightenment, unlike any you have ever taken before. May the Great Architect of the Universe, guide your steps.", 
        "reply": " Thank you for your kind words. This morning, I woke up with a great sense of excitement. Please know that your efforts will continue to bear fruit in the future. I enjoy reading your passionate writings that reflect your commitment to Freemasonary. I plan to write my reflections on receiving my EA degree in future posts. Take care and I greatly appreciate your commitment and focus on making good men better. This message has been edited. Last edited by: tdelaine, Tue 10 March 2009 06:22 AM", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-10 06:02:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "tdelaine"
    }, 
    {
        "content": "quote: Originally posted by TerryTCT: Congratulations! I hope that in a small way, some of my words were influential to you and your decision to become a Freemason. I was assigned to Patrick Air Force Base, Cocoa Beach, Florida, in 1985-1986 for a military course and I lived in Indiana Harbor Beach and visit there on occasion. Send me a private message and I would be glad to sit in lodge with you brother. My only advice is to keep an open mind and listen carefully to the teachings you will be learning. Then put to practice what you learn. As one wise Master Mason once told me, \"It is easier to give ten Masonic lectures than it is to live one.\" Remember this one thought, \"You will get out of Freemasonry what you put into it.\" Again, congratulations and let us all know the dates of your degrees. You never know, someone that visits this forum might show up to meet you in lodge. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator Terry, Thanks for your words of wisdom. I have read the first booklet and it was a eye opening experience to read such deep and thought provoking concepts. Additionally, I greatly cherish your advice. It makes a lot of common sense to me and I truly believe that practicing what I learn will be essential to applying the tenets of Freemasonry to my daily life. Needless to say, I am very excited about beginning my journey. I will keep everyone informed on my degree dates! It would be an honor to meet you in lodge.", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "Originally posted by TerryTCT: Congratulations! I hope that in a small way, some of my words were influential to you and your decision to become a Freemason. I was assigned to Patrick Air Force Base, Cocoa Beach, Florida, in 1985-1986 for a military course and I lived in Indiana Harbor Beach and visit there on occasion. Send me a private message and I would be glad to sit in lodge with you brother. My only advice is to keep an open mind and listen carefully to the teachings you will be learning. Then put to practice what you learn. As one wise Master Mason once told me, \"It is easier to give ten Masonic lectures than it is to live one.\" Remember this one thought, \"You will get out of Freemasonry what you put into it.\" Again, congratulations and let us all know the dates of your degrees. You never know, someone that visits this forum might show up to meet you in lodge. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "reply": " Terry, Thanks for your words of wisdom. I have read the first booklet and it was a eye opening experience to read such deep and thought provoking concepts. Additionally, I greatly cherish your advice. It makes a lot of common sense to me and I truly believe that practicing what I learn will be essential to applying the tenets of Freemasonry to my daily life. Needless to say, I am very excited about beginning my journey. I will keep everyone informed on my degree dates! It would be an honor to meet you in lodge.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-10 06:13:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "tdelaine"
    }, 
    {
        "content": "I am delighted to hear of your progress. I have a truly wonderful link, that each newly made mason should read. Please send me an email, and I will send the link to you (or anyone) directly.", 
        "intTime": 20090310, 
        "postID": 6, 
        "quote": "", 
        "reply": "I am delighted to hear of your progress. I have a truly wonderful link, that each newly made mason should read. Please send me an email, and I will send the link to you (or anyone) directly.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-10 09:22:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "cemab4y"
    }, 
    {
        "content": "quote: Originally posted by tdelaine: Terry, Thanks for your words of wisdom. I have read the first booklet and it was a eye opening experience to read such deep and thought provoking concepts. Additionally, I greatly cherish your advice. It makes a lot of common sense to me and I truly believe that practicing what I learn will be essential to applying the tenets of Freemasonry to my daily life. Needless to say, I am very excited about beginning my journey. I will keep everyone informed on my degree dates! It would be an honor to meet you in lodge. Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Once you have received your EA degree, you are now a Mason. Once you have received all three dgrees, then you are a Master Mason, the last and highest degree of ancient craft Masonry. Anyway, I tell all new brethren after receiving the EA degree, wait a couple of days then get a mentor to tutor you through the catechism (teachings of the EA degree). Now, you will be looking for Masonic rings on the hands of everyone you see and the square and compass on the backs of cars from here on out.When you see (PM) behind the name of a Mason, this means that he is a Past Master, which is title of distinction where the brother in question went through the chairs of the lodge and sat in the East and presided as Worshipful Master. Regardless, a PM is a MM, so, we say that as Masons, \"We all meet on the level.\" You will learn what this means in time and practice. Again, hopefully my congratulations are inorder. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "intTime": 20090310, 
        "postID": 7, 
        "quote": "Originally posted by tdelaine: Terry, Thanks for your words of wisdom. I have read the first booklet and it was a eye opening experience to read such deep and thought provoking concepts. Additionally, I greatly cherish your advice. It makes a lot of common sense to me and I truly believe that practicing what I learn will be essential to applying the tenets of Freemasonry to my daily life. Needless to say, I am very excited about beginning my journey. I will keep everyone informed on my degree dates! It would be an honor to meet you in lodge.", 
        "reply": " Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Once you have received your EA degree, you are now a Mason. Once you have received all three dgrees, then you are a Master Mason, the last and highest degree of ancient craft Masonry. Anyway, I tell all new brethren after receiving the EA degree, wait a couple of days then get a mentor to tutor you through the catechism (teachings of the EA degree). Now, you will be looking for Masonic rings on the hands of everyone you see and the square and compass on the backs of cars from here on out.When you see (PM) behind the name of a Mason, this means that he is a Past Master, which is title of distinction where the brother in question went through the chairs of the lodge and sat in the East and presided as Worshipful Master. Regardless, a PM is a MM, so, we say that as Masons, \"We all meet on the level.\" You will learn what this means in time and practice. Again, hopefully my congratulations are inorder. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-10 18:15:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "quote: Originally posted by TerryTCT: quote: Originally posted by tdelaine: Terry, Thanks for your words of wisdom. I have read the first booklet and it was a eye opening experience to read such deep and thought provoking concepts. Additionally, I greatly cherish your advice. It makes a lot of common sense to me and I truly believe that practicing what I learn will be essential to applying the tenets of Freemasonry to my daily life. Needless to say, I am very excited about beginning my journey. I will keep everyone informed on my degree dates! It would be an honor to meet you in lodge. Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Once you have received your EA degree, you are now a Mason. Once you have received all three degrees, then you are a Master Mason, the last and highest degree of ancient craft Masonry. Anyway, I tell all new brethren after receiving the EA degree, wait a couple of days then get a mentor to tutor you through the catechism (teachings of the EA degree). Now, you will be looking for Masonic rings on the hands of everyone you see and the square and compass on the backs of cars from here on out. When you see (PM) behind the name of a Mason, this means that he is a Past Master, which is title of distinction where the brother in question went through the chairs of the lodge and sat in the East and presided as Worshipful Master. Regardless, a PM is a MM, so, we say that as Masons, \"We all meet on the level.\" You will learn what this means in time and practice. Again, hopefully my congratulations are inorder. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "Originally posted by TerryTCT: quote: Originally posted by tdelaine: Terry, Thanks for your words of wisdom. I have read the first booklet and it was a eye opening experience to read such deep and thought provoking concepts. Additionally, I greatly cherish your advice. It makes a lot of common sense to me and I truly believe that practicing what I learn will be essential to applying the tenets of Freemasonry to my daily life. Needless to say, I am very excited about beginning my journey. I will keep everyone informed on my degree dates! It would be an honor to meet you in lodge. Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Once you have received your EA degree, you are now a Mason. Once you have received all three degrees, then you are a Master Mason, the last and highest degree of ancient craft Masonry. Anyway, I tell all new brethren after receiving the EA degree, wait a couple of days then get a mentor to tutor you through the catechism (teachings of the EA degree). Now, you will be looking for Masonic rings on the hands of everyone you see and the square and compass on the backs of cars from here on out. When you see (PM) behind the name of a Mason, this means that he is a Past Master, which is title of distinction where the brother in question went through the chairs of the lodge and sat in the East and presided as Worshipful Master. Regardless, a PM is a MM, so, we say that as Masons, \"We all meet on the level.\" You will learn what this means in time and practice. Again, hopefully my congratulations are inorder. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "reply": "", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-11 03:29:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "quote: Originally posted by TerryTCT: Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator Good Morning, Yes, I completed my EA degree last evening and it was truly a special moment in my life. I felt such love and warmth . . . it is simply hard to describe in words. I was deeply moved by the fact that I had spoken to other Masons at a lodge in Melbourne last June (2008) and they had tracked my progress and attend my EA degree as well. This reflected something I have not ever experienced in my life to date and I was so touched by their presence and support. I have been assigned an advisor and instructor so I believe that things will be starting up shortly. The catechism will be another new opportunity for me to learn more about Freemasonry as well. I was equally surprised that I, along with two other new EAs, were given the opportunity to speak as well. The smiles on the faces of my fellow Brothers was truly special to see and experience. The trust I felt towards my fellow Brothers last evening, was something I have not felt in many, many years. My heart, mind and soul connected in a manner that was real and comforting. It is a wondeful feeling to be able to trust individuals who truly care about you and truly want to work and support you to become a better man. That means the world to me. Thanks again for everyone's support and I am very excited about taking the next steps in my Masonic journey", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "Originally posted by TerryTCT: Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "reply": " Good Morning, Yes, I completed my EA degree last evening and it was truly a special moment in my life. I felt such love and warmth . . . it is simply hard to describe in words. I was deeply moved by the fact that I had spoken to other Masons at a lodge in Melbourne last June (2008) and they had tracked my progress and attend my EA degree as well. This reflected something I have not ever experienced in my life to date and I was so touched by their presence and support. I have been assigned an advisor and instructor so I believe that things will be starting up shortly. The catechism will be another new opportunity for me to learn more about Freemasonry as well. I was equally surprised that I, along with two other new EAs, were given the opportunity to speak as well. The smiles on the faces of my fellow Brothers was truly special to see and experience. The trust I felt towards my fellow Brothers last evening, was something I have not felt in many, many years. My heart, mind and soul connected in a manner that was real and comforting. It is a wondeful feeling to be able to trust individuals who truly care about you and truly want to work and support you to become a better man. That means the world to me. Thanks again for everyone's support and I am very excited about taking the next steps in my Masonic journey", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-11 05:11:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "tdelaine"
    }, 
    {
        "content": "Congratulations Brother, and welcome to our craft. Hang in there and get your other 2 degrees. Believe me you won't be disappointed. Brother Terry is right in saying that you get out of Masonry what you put into it.", 
        "intTime": 20090314, 
        "postID": 10, 
        "quote": "", 
        "reply": "Congratulations Brother, and welcome to our craft. Hang in there and get your other 2 degrees. Believe me you won't be disappointed. Brother Terry is right in saying that you get out of Masonry what you put into it.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-14 08:41:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "gmcneill"
    }, 
    {
        "content": "quote: Originally posted by tdelaine: quote: Originally posted by TerryTCT: Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator Good Morning, Yes, I completed my EA degree last evening and it was truly a special moment in my life. I felt such love and warmth . . . it is simply hard to describe in words. I was deeply moved by the fact that I had spoken to other Masons at a lodge in Melbourne last June (2008) and they had tracked my progress and attend my EA degree as well. This reflected something I have not ever experienced in my life to date and I was so touched by their presence and support. I have been assigned an advisor and instructor so I believe that things will be starting up shortly. The catechism will be another new opportunity for me to learn more about Freemasonry as well. I was equally surprised that I, along with two other new EAs, were given the opportunity to speak as well. The smiles on the faces of my fellow Brothers was truly special to see and experience. The trust I felt towards my fellow Brothers last evening, was something I have not felt in many, many years. My heart, mind and soul connected in a manner that was real and comforting. It is a wondeful feeling to be able to trust individuals who truly care about you and truly want to work and support you to become a better man. That means the world to me. Thanks again for everyone's support and I am very excited about taking the next steps in my Masonic journey I am so very happy for you my brother! safe travels!", 
        "intTime": 20090314, 
        "postID": 11, 
        "quote": "Originally posted by tdelaine: quote: Originally posted by TerryTCT: Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator Good Morning, Yes, I completed my EA degree last evening and it was truly a special moment in my life. I felt such love and warmth . . . it is simply hard to describe in words. I was deeply moved by the fact that I had spoken to other Masons at a lodge in Melbourne last June (2008) and they had tracked my progress and attend my EA degree as well. This reflected something I have not ever experienced in my life to date and I was so touched by their presence and support. I have been assigned an advisor and instructor so I believe that things will be starting up shortly. The catechism will be another new opportunity for me to learn more about Freemasonry as well. I was equally surprised that I, along with two other new EAs, were given the opportunity to speak as well. The smiles on the faces of my fellow Brothers was truly special to see and experience. The trust I felt towards my fellow Brothers last evening, was something I have not felt in many, many years. My heart, mind and soul connected in a manner that was real and comforting. It is a wondeful feeling to be able to trust individuals who truly care about you and truly want to work and support you to become a better man. That means the world to me. Thanks again for everyone's support and I am very excited about taking the next steps in my Masonic journey", 
        "reply": " I am so very happy for you my brother! safe travels!", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-14 14:38:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "load1987"
    }, 
    {
        "content": "welcome my new brother.i was raised to mm on feb 12 and so far the journey has been eye opening to say the least.i still learn every time i converse or sit in lodge with my fellow brothers.just remember to always keep an open ear.", 
        "intTime": 20090314, 
        "postID": 12, 
        "quote": "", 
        "reply": "welcome my new brother.i was raised to mm on feb 12 and so far the journey has been eye opening to say the least.i still learn every time i converse or sit in lodge with my fellow brothers.just remember to always keep an open ear.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-14 21:32:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "oldhand"
    }, 
    {
        "content": "quote: Originally posted by load1987: I am so very happy for you my brother! safe travels![/QUOTE] Thanks! I have my first instruction this evening so, I am very excited about working with my fellow EAs! I will keep everyone posted on my progress.", 
        "intTime": 20090317, 
        "postID": 13, 
        "quote": "Originally posted by load1987:", 
        "reply": " I am so very happy for you my brother! safe travels![/QUOTE] Thanks! I have my first instruction this evening so, I am very excited about working with my fellow EAs! I will keep everyone posted on my progress.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-17 07:56:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "tdelaine"
    }, 
    {
        "content": "quote: Originally posted by oldhand: welcome my new brother.i was raised to mm on feb 12 and so far the journey has been eye opening to say the least.i still learn every time i converse or sit in lodge with my fellow brothers.just remember to always keep an open ear. Congrats oldhand on your raising to mm! I will keep my ears open!", 
        "intTime": 20090317, 
        "postID": 14, 
        "quote": "Originally posted by oldhand: welcome my new brother.i was raised to mm on feb 12 and so far the journey has been eye opening to say the least.i still learn every time i converse or sit in lodge with my fellow brothers.just remember to always keep an open ear.", 
        "reply": " Congrats oldhand on your raising to mm! I will keep my ears open!", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-17 07:57:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "tdelaine"
    }, 
    {
        "content": "quote: Originally posted by tdelaine: quote: Originally posted by TerryTCT: Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator Good Morning, Yes, I completed my EA degree last evening and it was truly a special moment in my life. I felt such love and warmth . . . it is simply hard to describe in words. I was deeply moved by the fact that I had spoken to other Masons at a lodge in Melbourne last June (2008) and they had tracked my progress and attend my EA degree as well. This reflected something I have not ever experienced in my life to date and I was so touched by their presence and support. I have been assigned an advisor and instructor so I believe that things will be starting up shortly. The catechism will be another new opportunity for me to learn more about Freemasonry as well. I was equally surprised that I, along with two other new EAs, were given the opportunity to speak as well. The smiles on the faces of my fellow Brothers was truly special to see and experience. The trust I felt towards my fellow Brothers last evening, was something I have not felt in many, many years. My heart, mind and soul connected in a manner that was real and comforting. It is a wondeful feeling to be able to trust individuals who truly care about you and truly want to work and support you to become a better man. That means the world to me. Thanks again for everyone's support and I am very excited about taking the next steps in my Masonic journey Congratulations Brother! Now take a few days off, then hit the catechism hard every day with your mentor. Return to your lodge to prove your proficiency, then receive your Fellow Craft degree and do the same. Then you will be raised to the sublime degree of a Master Mason and repeat the process. Finally, put into practice what you have learned. It sounds like everyone else did and this is the brotherly love and affections you felt in lodge. This is how it is everywhere there is devoted Masons. I knew you were not going to be disappointed. Remember to stand upright as the youngest Entered Apprentist (EA). Remember your obligation and what was said in the EA charge. Again, congratulations. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "intTime": 20090317, 
        "postID": 15, 
        "quote": "Originally posted by tdelaine: quote: Originally posted by TerryTCT: Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator Good Morning, Yes, I completed my EA degree last evening and it was truly a special moment in my life. I felt such love and warmth . . . it is simply hard to describe in words. I was deeply moved by the fact that I had spoken to other Masons at a lodge in Melbourne last June (2008) and they had tracked my progress and attend my EA degree as well. This reflected something I have not ever experienced in my life to date and I was so touched by their presence and support. I have been assigned an advisor and instructor so I believe that things will be starting up shortly. The catechism will be another new opportunity for me to learn more about Freemasonry as well. I was equally surprised that I, along with two other new EAs, were given the opportunity to speak as well. The smiles on the faces of my fellow Brothers was truly special to see and experience. The trust I felt towards my fellow Brothers last evening, was something I have not felt in many, many years. My heart, mind and soul connected in a manner that was real and comforting. It is a wondeful feeling to be able to trust individuals who truly care about you and truly want to work and support you to become a better man. That means the world to me. Thanks again for everyone's support and I am very excited about taking the next steps in my Masonic journey", 
        "reply": " Congratulations Brother! Now take a few days off, then hit the catechism hard every day with your mentor. Return to your lodge to prove your proficiency, then receive your Fellow Craft degree and do the same. Then you will be raised to the sublime degree of a Master Mason and repeat the process. Finally, put into practice what you have learned. It sounds like everyone else did and this is the brotherly love and affections you felt in lodge. This is how it is everywhere there is devoted Masons. I knew you were not going to be disappointed. Remember to stand upright as the youngest Entered Apprentist (EA). Remember your obligation and what was said in the EA charge. Again, congratulations. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-17 20:41:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "Greetings all, I too am about to begin my Masonic Journey (First Degree in April), and I am currently Active Duty Army. Question for all, I have a Cmdr that is fair, but strickly by the book in all matters. I am concerned that he will question me regarding the Freemasons, and I want to make sure I have all my ducks (soldiers?) in a row! Are there any rules or regulations prohibiting Active Duty service members from joining the Masons, or displaying the symbol or licence plates on our vehicles? Being located in SC, I have had a few folks tell me that the Freemasons are considered on the same level as the KKK (I know this is NOT true!) but the local lodges do remain separate when it comes to black and white Freemasons. I just want to be prepared to give an answer, if I am indeed questioned.", 
        "intTime": 20090325, 
        "postID": 16, 
        "quote": "", 
        "reply": "Greetings all, I too am about to begin my Masonic Journey (First Degree in April), and I am currently Active Duty Army. Question for all, I have a Cmdr that is fair, but strickly by the book in all matters. I am concerned that he will question me regarding the Freemasons, and I want to make sure I have all my ducks (soldiers?) in a row! Are there any rules or regulations prohibiting Active Duty service members from joining the Masons, or displaying the symbol or licence plates on our vehicles? Being located in SC, I have had a few folks tell me that the Freemasons are considered on the same level as the KKK (I know this is NOT true!) but the local lodges do remain separate when it comes to black and white Freemasons. I just want to be prepared to give an answer, if I am indeed questioned.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-25 05:52:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "davidbeals"
    }, 
    {
        "content": "There is no military regulation against joining the Freemasons' fraternity. There are lodges on many military bases in the USA and overseas. So relax. From George Washington, through Douglas MacArthur, and Omar Bradley, and George Patton, many soldiers, NCOs, and general officers have been Masons. If you go to the Pentagon, look around at all the masonic rings on the officers and NCOs. As to your personal vehicles, you may get masonic vehicle license plates, and window stickers, as you wish. Masonry is a non-racial organization. All men, regardless of color or ethnic group, meet in lodge as brothers and equals. If your commander is interested in learning more about Masonry, I suggest: (a certain website) PM me, and I will send you the URL It has a huge amount of information, \"warts and all\", that will answer any question that he has. BTW- Military courtesy is suspended in lodge. I knew a Marine Gunnery Sergeant, who did the ceremonial work, on a 2-Star general.", 
        "intTime": 20090326, 
        "postID": 17, 
        "quote": "", 
        "reply": "There is no military regulation against joining the Freemasons' fraternity. There are lodges on many military bases in the USA and overseas. So relax. From George Washington, through Douglas MacArthur, and Omar Bradley, and George Patton, many soldiers, NCOs, and general officers have been Masons. If you go to the Pentagon, look around at all the masonic rings on the officers and NCOs. As to your personal vehicles, you may get masonic vehicle license plates, and window stickers, as you wish. Masonry is a non-racial organization. All men, regardless of color or ethnic group, meet in lodge as brothers and equals. If your commander is interested in learning more about Masonry, I suggest: (a certain website) PM me, and I will send you the URL It has a huge amount of information, \"warts and all\", that will answer any question that he has. BTW- Military courtesy is suspended in lodge. I knew a Marine Gunnery Sergeant, who did the ceremonial work, on a 2-Star general.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-26 23:43:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "cemab4y"
    }, 
    {
        "content": "quote: Originally posted by davidbeals: Greetings all, I too am about to begin my Masonic Journey (First Degree in April), and I am currently Active Duty Army. Question for all, I have a Cmdr that is fair, but strickly by the book in all matters. I am concerned that he will question me regarding the Freemasons, and I want to make sure I have all my ducks (soldiers?) in a row! Are there any rules or regulations prohibiting Active Duty service members from joining the Masons, or displaying the symbol or licence plates on our vehicles? Being located in SC, I have had a few folks tell me that the Freemasons are considered on the same level as the KKK (I know this is NOT true!) but the local lodges do remain separate when it comes to black and white Freemasons. I just want to be prepared to give an answer, if I am indeed questioned. Be prepared to say, this is the same in religion in this country, there are Black churches and predominately White churches, but neither discriminate. The ole saying applies here, \"Birds of a feather usually flock together.\" On a personal level, Masons all meet on the level regardless of the color of one's skin because there are Black and White Masons, but the lodge of affiliation is based on one's own choice like in the example of churches above. My .02 cents. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "intTime": 20090327, 
        "postID": 18, 
        "quote": "Originally posted by davidbeals: Greetings all, I too am about to begin my Masonic Journey (First Degree in April), and I am currently Active Duty Army. Question for all, I have a Cmdr that is fair, but strickly by the book in all matters. I am concerned that he will question me regarding the Freemasons, and I want to make sure I have all my ducks (soldiers?) in a row! Are there any rules or regulations prohibiting Active Duty service members from joining the Masons, or displaying the symbol or licence plates on our vehicles? Being located in SC, I have had a few folks tell me that the Freemasons are considered on the same level as the KKK (I know this is NOT true!) but the local lodges do remain separate when it comes to black and white Freemasons. I just want to be prepared to give an answer, if I am indeed questioned.", 
        "reply": " Be prepared to say, this is the same in religion in this country, there are Black churches and predominately White churches, but neither discriminate. The ole saying applies here, \"Birds of a feather usually flock together.\" On a personal level, Masons all meet on the level regardless of the color of one's skin because there are Black and White Masons, but the lodge of affiliation is based on one's own choice like in the example of churches above. My .02 cents. Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-03-27 19:28:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "quote: Originally posted by load1987: quote: Originally posted by tdelaine: quote: Originally posted by TerryTCT: Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator Good Morning, Yes, I completed my EA degree last evening and it was truly a special moment in my life. I felt such love and warmth . . . it is simply hard to describe in words. I was deeply moved by the fact that I had spoken to other Masons at a lodge in Melbourne last June (2008) and they had tracked my progress and attend my EA degree as well. This reflected something I have not ever experienced in my life to date and I was so touched by their presence and support. I have been assigned an advisor and instructor so I believe that things will be starting up shortly. The catechism will be another new opportunity for me to learn more about Freemasonry as well. I was equally surprised that I, along with two other new EAs, were given the opportunity to speak as well. The smiles on the faces of my fellow Brothers was truly special to see and experience. The trust I felt towards my fellow Brothers last evening, was something I have not felt in many, many years. My heart, mind and soul connected in a manner that was real and comforting. It is a wondeful feeling to be able to trust individuals who truly care about you and truly want to work and support you to become a better man. That means the world to me. Thanks again for everyone's support and I am very excited about taking the next steps in my Masonic journey I am so very happy for you my brother! safe travels! Just s quick note to let everyone know that my memory work is going great and it is such a unique opportunity to work with such great Brothers. I will continue to post on my progress. Thanks!", 
        "intTime": 20090415, 
        "postID": 19, 
        "quote": "Originally posted by load1987: quote: Originally posted by tdelaine: quote: Originally posted by TerryTCT: Are you the youngest Entered Apprentist (EA) yet? Let us know how it went, but don't say too much. (Remember what you heard during the degree). Fraternally, /s/ Terry, PM Freemason Hot Topics Moderator Good Morning, Yes, I completed my EA degree last evening and it was truly a special moment in my life. I felt such love and warmth . . . it is simply hard to describe in words. I was deeply moved by the fact that I had spoken to other Masons at a lodge in Melbourne last June (2008) and they had tracked my progress and attend my EA degree as well. This reflected something I have not ever experienced in my life to date and I was so touched by their presence and support. I have been assigned an advisor and instructor so I believe that things will be starting up shortly. The catechism will be another new opportunity for me to learn more about Freemasonry as well. I was equally surprised that I, along with two other new EAs, were given the opportunity to speak as well. The smiles on the faces of my fellow Brothers was truly special to see and experience. The trust I felt towards my fellow Brothers last evening, was something I have not felt in many, many years. My heart, mind and soul connected in a manner that was real and comforting. It is a wondeful feeling to be able to trust individuals who truly care about you and truly want to work and support you to become a better man. That means the world to me. Thanks again for everyone's support and I am very excited about taking the next steps in my Masonic journey I am so very happy for you my brother! safe travels!", 
        "reply": " Just s quick note to let everyone know that my memory work is going great and it is such a unique opportunity to work with such great Brothers. I will continue to post on my progress. Thanks!", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-04-15 11:28:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "tdelaine"
    }, 
    {
        "content": "Welcome to the Fraternity. Fred Cross PM St Georges Lodge #41 Kingsville, Ontario, Canada", 
        "intTime": 20090420, 
        "postID": 20, 
        "quote": "", 
        "reply": "Welcome to the Fraternity. Fred Cross PM St Georges Lodge #41 Kingsville, Ontario, Canada", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-04-20 15:50:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "fredcross"
    }, 
    {
        "content": "Welcome my brother quote: Originally posted by tdelaine: On Tuesday (March 10th, 2009) I will be taking the Entered Apprentance degree. I am very excited about taking this step and I wanted to let you you know that this discussion board help me reach the decision to become a Mason. I have visited this discussion board numerous times over the past year and half. I have always been impressed with how responses to positive and negative postings have been addressed. By reading the information on this discussion board, I was able to obtain the basic knowledge I needed to take the step to submit my petition to Beach Lodge #354 in Indiatlantic, Florida. I would like to thank you all for your honest and thoughtful writings. Many times, your words spoke to my heart and I was able to see your passion and desire. That is something I will carry with me on my Masonic journey. So any advice/things I should know for the day would be greatly appreciated. Again, thank you very much. V/R, T.J. DeLaine CWO2, USN Retired", 
        "intTime": 20090430, 
        "postID": 21, 
        "quote": "Originally posted by tdelaine: On Tuesday (March 10th, 2009) I will be taking the Entered Apprentance degree. I am very excited about taking this step and I wanted to let you you know that this discussion board help me reach the decision to become a Mason. I have visited this discussion board numerous times over the past year and half. I have always been impressed with how responses to positive and negative postings have been addressed. By reading the information on this discussion board, I was able to obtain the basic knowledge I needed to take the step to submit my petition to Beach Lodge #354 in Indiatlantic, Florida. I would like to thank you all for your honest and thoughtful writings. Many times, your words spoke to my heart and I was able to see your passion and desire. That is something I will carry with me on my Masonic journey. So any advice/things I should know for the day would be greatly appreciated. Again, thank you very much. V/R, T.J. DeLaine CWO2, USN Retired", 
        "reply": "Welcome my brother ", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-04-30 16:42:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "load1987"
    }, 
    {
        "content": "I bid you a huge welcome as well!! By now, you may well have completed your journey - let us know!", 
        "intTime": 20090523, 
        "postID": 22, 
        "quote": "", 
        "reply": "I bid you a huge welcome as well!! By now, you may well have completed your journey - let us know!", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-05-23 21:06:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "B_12"
    }, 
    {
        "content": "quote: Originally posted by load1987: Welcome my brother quote: Originally posted by tdelaine: On Tuesday (March 10th, 2009) I will be taking the Entered Apprentance degree. I am very excited about taking this step and I wanted to let you you know that this discussion board help me reach the decision to become a Mason. I have visited this discussion board numerous times over the past year and half. I have always been impressed with how responses to positive and negative postings have been addressed. By reading the information on this discussion board, I was able to obtain the basic knowledge I needed to take the step to submit my petition to Beach Lodge #354 in Indiatlantic, Florida. I would like to thank you all for your honest and thoughtful writings. Many times, your words spoke to my heart and I was able to see your passion and desire. That is something I will carry with me on my Masonic journey. So any advice/things I should know for the day would be greatly appreciated. Again, thank you very much. V/R, T.J. DeLaine CWO2, USN Retired Remember that you will get out of Freemasonry what you put into it. Remember that every Mason you meet is your brother, treat him as you would would like other Masons or anyone else for that matter treats you. Remember that in Masonry, fancy titles and fancy aprons mean nothing to the outside world of non-Masons. However, they will be watching you. Remember that you represent Freemasonry 24 x 7 and your conduct as Mason is noted by other Masons and non-Masons alike. Remember that no one can intimidate you unless you let them, specifically, anti-Masons, or Masons who might step on your toes for whatever reason, making a mistake in lodge or degreework etc. Remember that all Masons are created \"Equal.\" This is why we meet on the level. (Don't let any Mason intimidate you because of his title i.e. Past Master etc). My .02 cents. Fraternally, /s/ Terry, Past Master Centre Lodge No. 23 F.&A.M. Hot Topics Moderator", 
        "intTime": 20090525, 
        "postID": 23, 
        "quote": "Originally posted by load1987: Welcome my brother quote: Originally posted by tdelaine: On Tuesday (March 10th, 2009) I will be taking the Entered Apprentance degree. I am very excited about taking this step and I wanted to let you you know that this discussion board help me reach the decision to become a Mason. I have visited this discussion board numerous times over the past year and half. I have always been impressed with how responses to positive and negative postings have been addressed. By reading the information on this discussion board, I was able to obtain the basic knowledge I needed to take the step to submit my petition to Beach Lodge #354 in Indiatlantic, Florida. I would like to thank you all for your honest and thoughtful writings. Many times, your words spoke to my heart and I was able to see your passion and desire. That is something I will carry with me on my Masonic journey. So any advice/things I should know for the day would be greatly appreciated. Again, thank you very much. V/R, T.J. DeLaine CWO2, USN Retired", 
        "reply": " Remember that you will get out of Freemasonry what you put into it. Remember that every Mason you meet is your brother, treat him as you would would like other Masons or anyone else for that matter treats you. Remember that in Masonry, fancy titles and fancy aprons mean nothing to the outside world of non-Masons. However, they will be watching you. Remember that you represent Freemasonry 24 x 7 and your conduct as Mason is noted by other Masons and non-Masons alike. Remember that no one can intimidate you unless you let them, specifically, anti-Masons, or Masons who might step on your toes for whatever reason, making a mistake in lodge or degreework etc. Remember that all Masons are created \"Equal.\" This is why we meet on the level. (Don't let any Mason intimidate you because of his title i.e. Past Master etc). My .02 cents. Fraternally, /s/ Terry, Past Master Centre Lodge No. 23 F.&A.M. Hot Topics Moderator", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-05-25 01:58:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "hello, my name is J.R. Chappell and i will be entering into OCS hopefully by the end of the year (as long as the board accepts my packet!). i am thinking about joining the santa monica, ca lodge and am hoping that somebody on here can give me some insight about how to go about contacting them. do i need to attend a meeting as a prospective candidate? am i allowed into the lodge before applying for membership? any advice is much appreciated! thanks, j.r. chappell", 
        "intTime": 20090527, 
        "postID": 24, 
        "quote": "", 
        "reply": "hello, my name is J.R. Chappell and i will be entering into OCS hopefully by the end of the year (as long as the board accepts my packet!). i am thinking about joining the santa monica, ca lodge and am hoping that somebody on here can give me some insight about how to go about contacting them. do i need to attend a meeting as a prospective candidate? am i allowed into the lodge before applying for membership? any advice is much appreciated! thanks, j.r. chappell", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-05-27 20:34:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "21229940"
    }, 
    {
        "content": "21229940, I cheated. I took one of my business cards and wrote, \"I'm interested in joining - please call!\" and dropped it through the mail-slot of the front door of the Temple. A brother just cheated more... he looked up the Lodge in the phone book and left a message on their machine. Warcraft1, I would contact his Lodge to see if they would like them as a donation for historical purposes. If you don't want to, just put them up on E-bay. Personally, I would rather see them donated to be put on display.", 
        "intTime": 20090527, 
        "postID": 25, 
        "quote": "", 
        "reply": "21229940, I cheated. I took one of my business cards and wrote, \"I'm interested in joining - please call!\" and dropped it through the mail-slot of the front door of the Temple. A brother just cheated more... he looked up the Lodge in the phone book and left a message on their machine. Warcraft1, I would contact his Lodge to see if they would like them as a donation for historical purposes. If you don't want to, just put them up on E-bay. Personally, I would rather see them donated to be put on display.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-05-27 22:39:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "B_12"
    }, 
    {
        "content": "quote: Originally posted by 21229940: i am thinking about joining the santa monica, ca lodge and am hoping that somebody on here can give me some insight about how to go about contacting them. do i need to attend a meeting as a prospective candidate? am i allowed into the lodge before applying for membership? any advice is much appreciated! thanks, j.r. chappell You can not attend a meeting until you are accepted and initiated as an entered apprentice. You can, Im sure, get a tour of the building if that is what you are asking about. We normally give a tour to all petitioners. there are 3 lodges in Santa Monica, 2 of them meet in the same building, their phone numbers are 394-2835, 395-5888 and 452-3943. If you have the address of the one you are considering joining I can give you more exact information", 
        "intTime": 20090528, 
        "postID": 26, 
        "quote": "Originally posted by 21229940: i am thinking about joining the santa monica, ca lodge and am hoping that somebody on here can give me some insight about how to go about contacting them. do i need to attend a meeting as a prospective candidate? am i allowed into the lodge before applying for membership? any advice is much appreciated! thanks, j.r. chappell", 
        "reply": " You can not attend a meeting until you are accepted and initiated as an entered apprentice. You can, Im sure, get a tour of the building if that is what you are asking about. We normally give a tour to all petitioners. there are 3 lodges in Santa Monica, 2 of them meet in the same building, their phone numbers are 394-2835, 395-5888 and 452-3943. If you have the address of the one you are considering joining I can give you more exact information", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-05-28 08:38:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "SgtWilk"
    }, 
    {
        "content": "thank you so much for getting back to me quickly. i am referring to lodge #307 at 926 santa monica blvd. please forward any additional info you have. thanks again!", 
        "intTime": 20090528, 
        "postID": 27, 
        "quote": "", 
        "reply": "thank you so much for getting back to me quickly. i am referring to lodge #307 at 926 santa monica blvd. please forward any additional info you have. thanks again!", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-05-28 18:45:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "21229940"
    }, 
    {
        "content": "I will be glad to help you. Send me an email at cemab4y@hotmail.com and I can send you some links. The Grand Lodge of California has an excellent webpage. You need to contact the lodge directly. Santa Monica lodge has their own website. Email me, and I will send you the URL Email the lodge directly at santamonicamasonry@verizon.net I encourage you to contact the lodge, and inform them of your desire to be admitted into Masonry. The lodge will contact you, and tell you how to proceed.", 
        "intTime": 20090529, 
        "postID": 28, 
        "quote": "", 
        "reply": "I will be glad to help you. Send me an email at cemab4y@hotmail.com and I can send you some links. The Grand Lodge of California has an excellent webpage. You need to contact the lodge directly. Santa Monica lodge has their own website. Email me, and I will send you the URL Email the lodge directly at santamonicamasonry@verizon.net I encourage you to contact the lodge, and inform them of your desire to be admitted into Masonry. The lodge will contact you, and tell you how to proceed.", 
        "threadID": "1350075960001_4930063712001", 
        "time": "2009-05-29 07:43:00", 
        "title": "Beginning Masonic Journey", 
        "userID": "cemab4y"
    }
]