[
    {
        "content": "What would you like to see changed in Masonry? (Including the appendant/concordant bodies?) My Grand lodge voted to lower the entrance age to 18. I was all in favor, but it has not resulted in any huge influx of petitions. The change only started last October. The Shrine removed the requirement for petitioners to be York/Scottish Rite Masons. Here again, there was no headlong flood of applicants for the Shrine. What else would you like to see changed? I would love to see more \"openness\" in Masonry. The Grand Lodge of Massachusetts, has two state-wide open houses each year. The GL announces the open houses widely on TV and in the print media. The lodges around the state open on Saturday, and the serve coffee and desserts. They hand out literature, and have members present who can answer questions about the Fraternity. The result is that many men who otherwise would have no introduction to Masonry, are able to get a \"quick course\" in the fraternity. The result is many new petitions. Some lodges in Mass have a waiting list! In 2007, the only states in the USA, which showed an increase in the number of Masons, were Delaware and Massachusetts. I would also like to see every lodge in America have a web page. They can be obtained for free, or at little cost. In the internet age, no lodge should shut themselves off from the internet. What say you?", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "", 
        "reply": "What would you like to see changed in Masonry? (Including the appendant/concordant bodies?) My Grand lodge voted to lower the entrance age to 18. I was all in favor, but it has not resulted in any huge influx of petitions. The change only started last October. The Shrine removed the requirement for petitioners to be York/Scottish Rite Masons. Here again, there was no headlong flood of applicants for the Shrine. What else would you like to see changed? I would love to see more \"openness\" in Masonry. The Grand Lodge of Massachusetts, has two state-wide open houses each year. The GL announces the open houses widely on TV and in the print media. The lodges around the state open on Saturday, and the serve coffee and desserts. They hand out literature, and have members present who can answer questions about the Fraternity. The result is that many men who otherwise would have no introduction to Masonry, are able to get a \"quick course\" in the fraternity. The result is many new petitions. Some lodges in Mass have a waiting list! In 2007, the only states in the USA, which showed an increase in the number of Masons, were Delaware and Massachusetts. I would also like to see every lodge in America have a web page. They can be obtained for free, or at little cost. In the internet age, no lodge should shut themselves off from the internet. What say you?", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-20 08:44:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "Web Pages, most certainly (I'll be taking care of that for my lodge next year) Open houses: very helpful. We started doing these \"Officially\" here in Utah last year. they do need to be announced well in advance. We usually do ours right after our largest parade in town every year and we do get some interest. Lowering the petition age to 18 is OK, but IMHO you need to have younger members to bring in younger members. generally your old members (past retirement age) are in the majority in a lodge and their circle of aquaintences is their brother Masons. Bringing in a young man brings in a circle of aquaintences who have had no contact with Masonry before. Further, some of the older members are still stuck in the \"say nothing\" frame of mind from 50 years ago. I make absolutely no secret that I am a Mason and people talk to me about it. Its not a secret society and if you are not ashamed to be a member, BE OPEN about your membership. let people know what your Lodges are doing in the community and get out there to show yourselves. Steve", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "", 
        "reply": "Web Pages, most certainly (I'll be taking care of that for my lodge next year) Open houses: very helpful. We started doing these \"Officially\" here in Utah last year. they do need to be announced well in advance. We usually do ours right after our largest parade in town every year and we do get some interest. Lowering the petition age to 18 is OK, but IMHO you need to have younger members to bring in younger members. generally your old members (past retirement age) are in the majority in a lodge and their circle of aquaintences is their brother Masons. Bringing in a young man brings in a circle of aquaintences who have had no contact with Masonry before. Further, some of the older members are still stuck in the \"say nothing\" frame of mind from 50 years ago. I make absolutely no secret that I am a Mason and people talk to me about it. Its not a secret society and if you are not ashamed to be a member, BE OPEN about your membership. let people know what your Lodges are doing in the community and get out there to show yourselves. Steve", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-20 12:59:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "SgtWilk"
    }, 
    {
        "content": "I agree with both sets of comments. Here in Ontario some Lodges do have Open Houses but like it was said before you have to get the word out early and keepn that word going. As you must know from your Lodges, Lions, Optimists and all other clubs and fraternities numbers are getting smaller and smaller. The old boys talk about change but do we really see it? I don't think so. We have to keep up the course of change so that change does in fact come about then maybe we will start getting the need influx of new younger members. Fred Cross St Georges Lodge #41 Ontario, Canada", 
        "intTime": 20090420, 
        "postID": 3, 
        "quote": "", 
        "reply": "I agree with both sets of comments. Here in Ontario some Lodges do have Open Houses but like it was said before you have to get the word out early and keepn that word going. As you must know from your Lodges, Lions, Optimists and all other clubs and fraternities numbers are getting smaller and smaller. The old boys talk about change but do we really see it? I don't think so. We have to keep up the course of change so that change does in fact come about then maybe we will start getting the need influx of new younger members. Fred Cross St Georges Lodge #41 Ontario, Canada", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-20 15:42:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "fredcross"
    }, 
    {
        "content": "quote: Originally posted by cemab4y: What would you like to see changed in Masonry? (Including the appendant/concordant bodies?) My Grand lodge voted to lower the entrance age to 18. I was all in favor, but it has not resulted in any huge influx of petitions. The change only started last October. The Shrine removed the requirement for petitioners to be York/Scottish Rite Masons. Here again, there was no headlong flood of applicants for the Shrine. What else would you like to see changed? I would love to see more \"openness\" in Masonry. The Grand Lodge of Massachusetts, has two state-wide open houses each year. The GL announces the open houses widely on TV and in the print media. The lodges around the state open on Saturday, and the serve coffee and desserts. They hand out literature, and have members present who can answer questions about the Fraternity. The result is that many men who otherwise would have no introduction to Masonry, are able to get a \"quick course\" in the fraternity. The result is many new petitions. Some lodges in Mass have a waiting list! In 2007, the only states in the USA, which showed an increase in the number of Masons, were Delaware and Massachusetts. I would also like to see every lodge in America have a web page. They can be obtained for free, or at little cost. In the internet age, no lodge should shut themselves off from the internet. What say you? Bro. Charles: If you have not noticed, fraternal organizations are all in decline from the Rotarians, Kiwanas, Odd Fellows, and Freemasonry. Lowering the age for petitions from 21 to 18 is nothing more than a sign of the times. The use of One Day Classes to make a Mason in one day are once again a sign of the times. Changes like this are not the answer. So, how can an ancient organization like Freemasonry make fundamental changes to draw members? I believe that there are no \"Cookie Cutter,\" answers to that question for the fraternity no more than how other fraternal organizations are dealing with the same issue. Of course some of these changes are nothing more than what some call \"Rearranging the deck chairs on the Titanic.\" Don't get me wrong, if there are to be changes, they must be fundamental changes and significant otherwise, such minor changes are doing nothing more than putting a bandaid on a sucking chest wound. Not to sound blunt, but a return to some basics would be a good first step. - The changes that would make a difference would be a return to Freemasonry like it was decades ago when the fraternity was at it's peak. Everyone that was someone was a Freemason. I will stop there, hopefully, my point is made with that statement. (What happened was that the fraternity lost a generation from being a closed society of men who did not recruit members for the future and they just waited around for petitions to come, but they didn't come). - I believe that Freemasons should return to the basics of our obligations towards one another to help, aid and assist eachother however possible with the obvious exceptions. This is why we are brothers, or at least should be in my opinion. My .02 cents on the subject. Any takers on this topic? Fraternally, /s/ Terry, PM Hot Topics Moderator", 
        "intTime": 20090423, 
        "postID": 4, 
        "quote": "Originally posted by cemab4y: What would you like to see changed in Masonry? (Including the appendant/concordant bodies?) My Grand lodge voted to lower the entrance age to 18. I was all in favor, but it has not resulted in any huge influx of petitions. The change only started last October. The Shrine removed the requirement for petitioners to be York/Scottish Rite Masons. Here again, there was no headlong flood of applicants for the Shrine. What else would you like to see changed? I would love to see more \"openness\" in Masonry. The Grand Lodge of Massachusetts, has two state-wide open houses each year. The GL announces the open houses widely on TV and in the print media. The lodges around the state open on Saturday, and the serve coffee and desserts. They hand out literature, and have members present who can answer questions about the Fraternity. The result is that many men who otherwise would have no introduction to Masonry, are able to get a \"quick course\" in the fraternity. The result is many new petitions. Some lodges in Mass have a waiting list! In 2007, the only states in the USA, which showed an increase in the number of Masons, were Delaware and Massachusetts. I would also like to see every lodge in America have a web page. They can be obtained for free, or at little cost. In the internet age, no lodge should shut themselves off from the internet. What say you?", 
        "reply": " Bro. Charles: If you have not noticed, fraternal organizations are all in decline from the Rotarians, Kiwanas, Odd Fellows, and Freemasonry. Lowering the age for petitions from 21 to 18 is nothing more than a sign of the times. The use of One Day Classes to make a Mason in one day are once again a sign of the times. Changes like this are not the answer. So, how can an ancient organization like Freemasonry make fundamental changes to draw members? I believe that there are no \"Cookie Cutter,\" answers to that question for the fraternity no more than how other fraternal organizations are dealing with the same issue. Of course some of these changes are nothing more than what some call \"Rearranging the deck chairs on the Titanic.\" Don't get me wrong, if there are to be changes, they must be fundamental changes and significant otherwise, such minor changes are doing nothing more than putting a bandaid on a sucking chest wound. Not to sound blunt, but a return to some basics would be a good first step. - The changes that would make a difference would be a return to Freemasonry like it was decades ago when the fraternity was at it's peak. Everyone that was someone was a Freemason. I will stop there, hopefully, my point is made with that statement. (What happened was that the fraternity lost a generation from being a closed society of men who did not recruit members for the future and they just waited around for petitions to come, but they didn't come). - I believe that Freemasons should return to the basics of our obligations towards one another to help, aid and assist eachother however possible with the obvious exceptions. This is why we are brothers, or at least should be in my opinion. My .02 cents on the subject. Any takers on this topic? Fraternally, /s/ Terry, PM Hot Topics Moderator", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-23 03:31:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "I know most states already do, but I would like to see my state of Tennessee recognize Prince Hall Masons. I see no reason why we can't be in fellowship with each other.", 
        "intTime": 20090423, 
        "postID": 5, 
        "quote": "", 
        "reply": "I know most states already do, but I would like to see my state of Tennessee recognize Prince Hall Masons. I see no reason why we can't be in fellowship with each other.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-23 10:03:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "gmcneill"
    }, 
    {
        "content": "quote: Originally posted by gmcneill: I know most states already do, but I would like to see my state of Tennessee recognize Prince Hall Masons. I see no reason why we can't be in fellowship with each other. Brother, none of us can see no logical reason why Prince Hall Masons cannot be recognized in all fifty (50) states, not just most. Not to bring the skeletons out of the closet, but the data is on the internet anyway, below is a link that shows what states recognize Prince Hall and those that don't. Take a look at which states were part of the former Confedercy and where the Mason-Dixon line is or once was and then draw your own conclusions. We need to tear down these walls because it is alittle more than politics that is going on here. Like you said brother, there is absolutely no reason on earth why Prince Hall lodges cannot be fully recognized in all 50 states of the U.S. of A. period end of discussion. http://bessel.org/masrec/phamapshistorical.htm Respectfully submitted: /s/ Terry, PM Hot Topics Moderator", 
        "intTime": 20090423, 
        "postID": 6, 
        "quote": "Originally posted by gmcneill: I know most states already do, but I would like to see my state of Tennessee recognize Prince Hall Masons. I see no reason why we can't be in fellowship with each other.", 
        "reply": " Brother, none of us can see no logical reason why Prince Hall Masons cannot be recognized in all fifty (50) states, not just most. Not to bring the skeletons out of the closet, but the data is on the internet anyway, below is a link that shows what states recognize Prince Hall and those that don't. Take a look at which states were part of the former Confedercy and where the Mason-Dixon line is or once was and then draw your own conclusions. We need to tear down these walls because it is alittle more than politics that is going on here. Like you said brother, there is absolutely no reason on earth why Prince Hall lodges cannot be fully recognized in all 50 states of the U.S. of A. period end of discussion. http://bessel.org/masrec/phamapshistorical.htm Respectfully submitted: /s/ Terry, PM Hot Topics Moderator", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-23 13:40:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "I pray for the day when all Masons, regardless of color, are recognized as brothers and equals. The Grand Master of Masons in North Carolina, pushed for the recognition, and was able to pull it off. It will take the combined push of ordinary masons from all of the remaining states, to get the final states to recognize Prince Hall Masonry. The situation makes it particularly irksome for Masons who hold plural memberships. If a man belongs to lodges (simutaneously) in multiple states, and one of his Grand Lodges recognizes Prince Hall Masonry, and one does not, then he risks being suspended or expelled if he visits a Prince Hall lodge, even though one of his Masonic memberships makes it permissible! I hope that military Masons, who freely visit Prince Hall lodges on military posts worldwide, will be the ones who push their Grand Lodges for change.", 
        "intTime": 20090423, 
        "postID": 7, 
        "quote": "", 
        "reply": "I pray for the day when all Masons, regardless of color, are recognized as brothers and equals. The Grand Master of Masons in North Carolina, pushed for the recognition, and was able to pull it off. It will take the combined push of ordinary masons from all of the remaining states, to get the final states to recognize Prince Hall Masonry. The situation makes it particularly irksome for Masons who hold plural memberships. If a man belongs to lodges (simutaneously) in multiple states, and one of his Grand Lodges recognizes Prince Hall Masonry, and one does not, then he risks being suspended or expelled if he visits a Prince Hall lodge, even though one of his Masonic memberships makes it permissible! I hope that military Masons, who freely visit Prince Hall lodges on military posts worldwide, will be the ones who push their Grand Lodges for change.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-23 14:21:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "I have read where North Carolina now recognizes Prince Hall. That gives me along with other bretheren here in Tennessee hope that it will happen here.", 
        "intTime": 20090424, 
        "postID": 8, 
        "quote": "", 
        "reply": "I have read where North Carolina now recognizes Prince Hall. That gives me along with other bretheren here in Tennessee hope that it will happen here.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-24 05:09:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "gmcneill"
    }, 
    {
        "content": "It takes more than hope. YOU will have to push your Grand Lodge into taking the step of recognizing Prince Hall Masonry. At present, there are about 38 or so states which have full fraternal relations with Prince Hall Masonry. Tennessee and Kentucky, are among the hold-outs. Since it takes a super-majority (usually 2/3) to get an amendment through the constitution/bylaws, change is slow to come. The Grand Master of Masons in North Carolina, personally pushed for the recognition, and it took some years, and several failed votes, before recognition occured.", 
        "intTime": 20090425, 
        "postID": 9, 
        "quote": "", 
        "reply": "It takes more than hope. YOU will have to push your Grand Lodge into taking the step of recognizing Prince Hall Masonry. At present, there are about 38 or so states which have full fraternal relations with Prince Hall Masonry. Tennessee and Kentucky, are among the hold-outs. Since it takes a super-majority (usually 2/3) to get an amendment through the constitution/bylaws, change is slow to come. The Grand Master of Masons in North Carolina, personally pushed for the recognition, and it took some years, and several failed votes, before recognition occured.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-25 10:34:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "quote: Originally posted by cemab4y: It takes more than hope. YOU will have to push your Grand Lodge into taking the step of recognizing Prince Hall Masonry. At present, there are about 38 or so states which have full fraternal relations with Prince Hall Masonry. Tennessee and Kentucky, are among the hold-outs. Since it takes a super-majority (usually 2/3) to get an amendment through the constitution/bylaws, change is slow to come. The Grand Master of Masons in North Carolina, personally pushed for the recognition, and it took some years, and several failed votes, before recognition occured. Unfortunate but true. It would appear easier to push molassas uphill on a cold day given that the Civil War was lost many decades ago, but the Mason and Dixon Line has not gone away given the map of recognition. http://bessel.org/masrec/phamapshistorical.htm That not only looks bad for the fraternity, it would be unexcusable and unacceptable to the public at large. Like the late Rev. Dr. Martin Luther King, Jr., once said: \"The ultimate measure of a man is not where he stands in moments of comfort, but where he stands at times of challenge and controversy. We must therefore learn to live together as brothers, or parish as fools.\" Rev. Dr. Martin Luther King, Jr. Respectfully submitted, /s/ Terry, PM Hot Topics Moderator", 
        "intTime": 20090427, 
        "postID": 10, 
        "quote": "Originally posted by cemab4y: It takes more than hope. YOU will have to push your Grand Lodge into taking the step of recognizing Prince Hall Masonry. At present, there are about 38 or so states which have full fraternal relations with Prince Hall Masonry. Tennessee and Kentucky, are among the hold-outs. Since it takes a super-majority (usually 2/3) to get an amendment through the constitution/bylaws, change is slow to come. The Grand Master of Masons in North Carolina, personally pushed for the recognition, and it took some years, and several failed votes, before recognition occured.", 
        "reply": " Unfortunate but true. It would appear easier to push molassas uphill on a cold day given that the Civil War was lost many decades ago, but the Mason and Dixon Line has not gone away given the map of recognition. http://bessel.org/masrec/phamapshistorical.htm That not only looks bad for the fraternity, it would be unexcusable and unacceptable to the public at large. Like the late Rev. Dr. Martin Luther King, Jr., once said: \"The ultimate measure of a man is not where he stands in moments of comfort, but where he stands at times of challenge and controversy. We must therefore learn to live together as brothers, or parish as fools.\" Rev. Dr. Martin Luther King, Jr. Respectfully submitted, /s/ Terry, PM Hot Topics Moderator", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-27 16:56:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "We should take to heart the words of Samuel Adams: \"It does not take a majority to prevail ... but rather an irate, tireless minority, keen on setting brushfires of freedom in the minds of men\"", 
        "intTime": 20090428, 
        "postID": 11, 
        "quote": "", 
        "reply": "We should take to heart the words of Samuel Adams: \"It does not take a majority to prevail ... but rather an irate, tireless minority, keen on setting brushfires of freedom in the minds of men\"", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-28 05:00:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "One thing to remember about growth, and I'm not sure if it's been said yet (many long wordy replies to work through still, and here's one more) but there's a reason that Masonry in the states, and in other countries grew so quickly about 50 or more years ago. If you do the math, the big expansion for Freemasonry happened right after WWII. All the veterans that came back from the war (and this is from both what I've been told and read) found a place in Masonry where they belonged, it provided them with many types of support to help them get through after that. We watch our numbers drop now, and it is because those veterans are aging quite rapidly and at the end of their lives now. With nearly all of them in their 80's and 90's that are left, their time is unfortunately limited. So you can see the drop in numbers isn't entirely due to a lack of success in bringing new people in, but that the greatest number that ever came in are on their way to that house in the heavens. It is my belief, and that of others, that as the wars in the Mideast draw to a close, and over the coming years, we will again see a similar increase (not quite in the same numbers as WWII) in petitions. So do not worry Brothers that our craft is in trouble due to dropping membership numbers, it is not, it is just flowing forward in time and dealing with natural events. ------------------------------- As for changes, I'm not a fan of one day classes..I can see how they brought these about, but I disagree with them entirely. I think they go against the fundamentals of Freemasonry. More importantly, I would rather Freemasonry have fewer members who are stronger in the Craft, than many members who pay their dues and vanish from view.", 
        "intTime": 20090506, 
        "postID": 12, 
        "quote": "", 
        "reply": "One thing to remember about growth, and I'm not sure if it's been said yet (many long wordy replies to work through still, and here's one more) but there's a reason that Masonry in the states, and in other countries grew so quickly about 50 or more years ago. If you do the math, the big expansion for Freemasonry happened right after WWII. All the veterans that came back from the war (and this is from both what I've been told and read) found a place in Masonry where they belonged, it provided them with many types of support to help them get through after that. We watch our numbers drop now, and it is because those veterans are aging quite rapidly and at the end of their lives now. With nearly all of them in their 80's and 90's that are left, their time is unfortunately limited. So you can see the drop in numbers isn't entirely due to a lack of success in bringing new people in, but that the greatest number that ever came in are on their way to that house in the heavens. It is my belief, and that of others, that as the wars in the Mideast draw to a close, and over the coming years, we will again see a similar increase (not quite in the same numbers as WWII) in petitions. So do not worry Brothers that our craft is in trouble due to dropping membership numbers, it is not, it is just flowing forward in time and dealing with natural events. ------------------------------- As for changes, I'm not a fan of one day classes..I can see how they brought these about, but I disagree with them entirely. I think they go against the fundamentals of Freemasonry. More importantly, I would rather Freemasonry have fewer members who are stronger in the Craft, than many members who pay their dues and vanish from view.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-06 02:52:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "Ajaxus"
    }, 
    {
        "content": "I live in Northern Virginia (suburban Washington DC), and I have been working in Iraq/Afghanistan for the past four years. In the DC metro area, there are men who spend four hours a day, in their cars. Two hours driving in to work, working 8 hours, then two hours driving home. We have the 2d worst commute in the USA, only Los Angeles is worse. One-Day classes, conducted on a Saturday, have enabled men who otherwise could never have been Masons to participate in the fraternity. Each masonic district has the option of conducting one such class a year. You meet at the lodge at 0600am, and eat a breakfast. Then you do the degrees all day, and walk out at 6pm a Master Mason. Many of the brothers who conduct the classes, are the \"best of the best\", and the ritual work is always top-notch. Some of the graduates of ODC's have gone on to serve as officers in various lodges, and some into the appendant bodies. It is only a matter of time, before a ODC mason will serve in the Grand Line. Some masons call these men \"McMasons\". I think that ODC's are in the finest traditions of Masonry. Masonic lodges ran 24 hours a day, during the WW2 years, preparing men, who were going overseas. In Florida, there is a proposal to reduce the time between the Craft Degrees. Indiana, can make a man a Mason in 2-3 weeks.", 
        "intTime": 20090506, 
        "postID": 13, 
        "quote": "", 
        "reply": "I live in Northern Virginia (suburban Washington DC), and I have been working in Iraq/Afghanistan for the past four years. In the DC metro area, there are men who spend four hours a day, in their cars. Two hours driving in to work, working 8 hours, then two hours driving home. We have the 2d worst commute in the USA, only Los Angeles is worse. One-Day classes, conducted on a Saturday, have enabled men who otherwise could never have been Masons to participate in the fraternity. Each masonic district has the option of conducting one such class a year. You meet at the lodge at 0600am, and eat a breakfast. Then you do the degrees all day, and walk out at 6pm a Master Mason. Many of the brothers who conduct the classes, are the \"best of the best\", and the ritual work is always top-notch. Some of the graduates of ODC's have gone on to serve as officers in various lodges, and some into the appendant bodies. It is only a matter of time, before a ODC mason will serve in the Grand Line. Some masons call these men \"McMasons\". I think that ODC's are in the finest traditions of Masonry. Masonic lodges ran 24 hours a day, during the WW2 years, preparing men, who were going overseas. In Florida, there is a proposal to reduce the time between the Craft Degrees. Indiana, can make a man a Mason in 2-3 weeks.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-06 11:13:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "I'm sorry, Cemab, but I must disagree with you on this one. They might walk out that evening having completed the MM degree, but what about their proficiency? If they dont have time to work on that between the degrees, what suddenly gives them the time to do it later? How do they honestly answer the third question in the FC and MM Degree from the SD, JW, SW and WM? I feel if you want to be a Mason you will find the time to take the degrees in the old manner....how long do you think days were for our ancestors in the 1700's, but they still found the time after a long day to become proficient.", 
        "intTime": 20090506, 
        "postID": 14, 
        "quote": "", 
        "reply": "I'm sorry, Cemab, but I must disagree with you on this one. They might walk out that evening having completed the MM degree, but what about their proficiency? If they dont have time to work on that between the degrees, what suddenly gives them the time to do it later? How do they honestly answer the third question in the FC and MM Degree from the SD, JW, SW and WM? I feel if you want to be a Mason you will find the time to take the degrees in the old manner....how long do you think days were for our ancestors in the 1700's, but they still found the time after a long day to become proficient.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-06 15:25:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "SgtWilk"
    }, 
    {
        "content": "I would disagree as well for a few reasons. If you can not make the time for the degrees (which don't take that much) then how can you make the time for participation? You make the case that many of them became line officers..being an officer in a Lodge requires a lot of time..if they were able to do so, then it can be argued that they either should have waited until their careers gave them the time for Masonry or that they had the ability to make the time and did not. As for your statement about Indiana, my home state, I did not know someone could go through the degrees that quickly. I do know we have the ODC, but for regular degrees there's usually a month between each one. Yes we have seen some make it in about 6-7 weeks at times, but that is rare. We require full proficiency in the Q&A before you can move on to the next degree.", 
        "intTime": 20090507, 
        "postID": 15, 
        "quote": "", 
        "reply": "I would disagree as well for a few reasons. If you can not make the time for the degrees (which don't take that much) then how can you make the time for participation? You make the case that many of them became line officers..being an officer in a Lodge requires a lot of time..if they were able to do so, then it can be argued that they either should have waited until their careers gave them the time for Masonry or that they had the ability to make the time and did not. As for your statement about Indiana, my home state, I did not know someone could go through the degrees that quickly. I do know we have the ODC, but for regular degrees there's usually a month between each one. Yes we have seen some make it in about 6-7 weeks at times, but that is rare. We require full proficiency in the Q&A before you can move on to the next degree.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-07 02:30:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "Ajaxus"
    }, 
    {
        "content": "No one is suggesting that one-day classes are a panacea for Masonry. One-Day classes have produced some excellent Masons. I have fellowshipped with some in Virginia. Ohio, and some other states have ODC's now. Some other states are considering ODC's. There are many individuals, for whom participating in degree work at night, is impossible. Moving the degree work to a Saturday, is the only way to accomodate them. In Virginia, the ODC masons must complete proficiency, just like any other Mason. There are weekend classes, where the men can learn proficiency. Virginia (and other states) have \"daylight\" lodges that meet on Saturday mornings, for their stated meetings. Many ODC masons participate in these lodges. As far as the questions in FC/MM, the question is posed: Has he completed proficiency in the preceding degree? Answer - To the satisfaction of this lodge, he has. The questions are phrased, so that the degree work can continue. You must remember, that during the WW2 years, lodges worked \"round the clock\" making new masons in less than a day. Many of these men went overseas, and upon their return, served Masonry well. The important thing to remember, is that it is not the time spent between the Craft Degrees, that makes a man a good mason. It is the quality of the man, and his commitment to the fraternity, that is paramount. Many men have to adjust the time they can devote to Masonry, depending on career and family commitments. I spent a couple of months in Fort Wayne, IN. I met with Masons and learned that once a man has completed a degree, he is assigned a coach. The coach works with him, to ensure that he has absorbed the degree work properly. Once the coach is satisfied, then the next degree can proceed, there is no minimum time between the Craft degrees, some men complete the entire degree process in less than a month.", 
        "intTime": 20090507, 
        "postID": 16, 
        "quote": "", 
        "reply": "No one is suggesting that one-day classes are a panacea for Masonry. One-Day classes have produced some excellent Masons. I have fellowshipped with some in Virginia. Ohio, and some other states have ODC's now. Some other states are considering ODC's. There are many individuals, for whom participating in degree work at night, is impossible. Moving the degree work to a Saturday, is the only way to accomodate them. In Virginia, the ODC masons must complete proficiency, just like any other Mason. There are weekend classes, where the men can learn proficiency. Virginia (and other states) have \"daylight\" lodges that meet on Saturday mornings, for their stated meetings. Many ODC masons participate in these lodges. As far as the questions in FC/MM, the question is posed: Has he completed proficiency in the preceding degree? Answer - To the satisfaction of this lodge, he has. The questions are phrased, so that the degree work can continue. You must remember, that during the WW2 years, lodges worked \"round the clock\" making new masons in less than a day. Many of these men went overseas, and upon their return, served Masonry well. The important thing to remember, is that it is not the time spent between the Craft Degrees, that makes a man a good mason. It is the quality of the man, and his commitment to the fraternity, that is paramount. Many men have to adjust the time they can devote to Masonry, depending on career and family commitments. I spent a couple of months in Fort Wayne, IN. I met with Masons and learned that once a man has completed a degree, he is assigned a coach. The coach works with him, to ensure that he has absorbed the degree work properly. Once the coach is satisfied, then the next degree can proceed, there is no minimum time between the Craft degrees, some men complete the entire degree process in less than a month.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-07 07:04:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "I would like to see a whole bunch of changes in my lodge, my Grand Lodge, and Freemasonry in the USA: 1- Every lodge should be required to have a web site. Sites can be had for free, so there is no reason why every lodge should not have one! 2- Every Grand Lodge should recognize Prince Hall Masonry. 3- Every Grand Lodge should host a statewide Open House, similar to Massachusetts. 4- Every state should have an official Masonic vehicle license plate, issued by the state Department of Motor Vehicles. 5- Every state Grand Lodge website, should have as a minimum: -Precise instructions on how to locate a lodge, and how to petition a lodge -A petition form, downloadable 6- Every Grand Lodge should have a Liaison office- assisting and promoting Masonic youth groups. This office will provide guidance and assistance to lodges towards setting up and running Masonic youth Groups. 7- Every lodge should have a \"new Mason's program\"- Each new mason should receive intense instruction in: -What it means to be a Mason -Introduction to the Appendant/Concordant bodies -How to participate in lodge meetings (how to introduce motions,etc) -Masonic etiquette -How to visit other lodges -How to tell your wife and family about Masonry -Masonic History 8- Every Grand Lodge should provide for Masonic education, at the district level in the following: -Ritual Schools. Any Mason interested in learning ritual, can attend the schools, and be instructed in masonic ritual, and be given practices and rehearsals. -Leadership schools. Any Mason, prior to going through the chairs, and becoming a lodge officer, should receive intense instruction (at the district level), in how to run a lodge. Lessons in parliamentary procedure, lessons in how to run a non-profit organization, etc. 9-Every lodge should host an annual \"county fair\", where all of the appendant/concordant bodies in the area would be invited in, on a Saturday. Each organization would set up a booth at the lodge hall. Masons (and the public) could attend the county fair, and learn about the appendant/concordant bodies, and the groups could distribute literature, and provide the attendees with application forms, and answer questions, etc. 10- Every lodge should sponsor a \"Masonic Square and Compasses Club\". These clubs would meet outside the tyled lodge, and provide social activities, and dances, and barbecues,etc. There would be no degree work, nor any tyled meetings. Anyone interested in Masonry, can participate. 11- We need to realize that Prohibition is over (See the 22d amendment). We are all adults, and it is about time, that we brought alcohol, back into our lodges. Nearly every masonic Grand Lodge in the world (except for the USA) permits alcoholic beverages to be served in the lodge for refreshment. These are just a few of the things I would like to see changed in Craft Masonry in the USA", 
        "intTime": 20090508, 
        "postID": 17, 
        "quote": "", 
        "reply": "I would like to see a whole bunch of changes in my lodge, my Grand Lodge, and Freemasonry in the USA: 1- Every lodge should be required to have a web site. Sites can be had for free, so there is no reason why every lodge should not have one! 2- Every Grand Lodge should recognize Prince Hall Masonry. 3- Every Grand Lodge should host a statewide Open House, similar to Massachusetts. 4- Every state should have an official Masonic vehicle license plate, issued by the state Department of Motor Vehicles. 5- Every state Grand Lodge website, should have as a minimum: -Precise instructions on how to locate a lodge, and how to petition a lodge -A petition form, downloadable 6- Every Grand Lodge should have a Liaison office- assisting and promoting Masonic youth groups. This office will provide guidance and assistance to lodges towards setting up and running Masonic youth Groups. 7- Every lodge should have a \"new Mason's program\"- Each new mason should receive intense instruction in: -What it means to be a Mason -Introduction to the Appendant/Concordant bodies -How to participate in lodge meetings (how to introduce motions,etc) -Masonic etiquette -How to visit other lodges -How to tell your wife and family about Masonry -Masonic History 8- Every Grand Lodge should provide for Masonic education, at the district level in the following: -Ritual Schools. Any Mason interested in learning ritual, can attend the schools, and be instructed in masonic ritual, and be given practices and rehearsals. -Leadership schools. Any Mason, prior to going through the chairs, and becoming a lodge officer, should receive intense instruction (at the district level), in how to run a lodge. Lessons in parliamentary procedure, lessons in how to run a non-profit organization, etc. 9-Every lodge should host an annual \"county fair\", where all of the appendant/concordant bodies in the area would be invited in, on a Saturday. Each organization would set up a booth at the lodge hall. Masons (and the public) could attend the county fair, and learn about the appendant/concordant bodies, and the groups could distribute literature, and provide the attendees with application forms, and answer questions, etc. 10- Every lodge should sponsor a \"Masonic Square and Compasses Club\". These clubs would meet outside the tyled lodge, and provide social activities, and dances, and barbecues,etc. There would be no degree work, nor any tyled meetings. Anyone interested in Masonry, can participate. 11- We need to realize that Prohibition is over (See the 22d amendment). We are all adults, and it is about time, that we brought alcohol, back into our lodges. Nearly every masonic Grand Lodge in the world (except for the USA) permits alcoholic beverages to be served in the lodge for refreshment. These are just a few of the things I would like to see changed in Craft Masonry in the USA", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-08 07:13:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "Our lodge just started a program that assigns a coach with each new member. We asked the last two M/M did they really understand about Masonary. They recommended that it should slow down and give the member more info. After and when the coach feels the member is ready we set the date for the next step. Thanks Bob", 
        "intTime": 20090508, 
        "postID": 18, 
        "quote": "", 
        "reply": "Our lodge just started a program that assigns a coach with each new member. We asked the last two M/M did they really understand about Masonary. They recommended that it should slow down and give the member more info. After and when the coach feels the member is ready we set the date for the next step. Thanks Bob", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-08 18:51:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "AKCSJAKE"
    }, 
    {
        "content": "Its time to shed the past and realize its every brothers duty to positively project the benefits and good works of masonry. I proudly display my compass and square emblem in my office and garage at home. I get many comments and questions when others see it and when asked, I simply point to a printout of \"Why Im a Mason\" Author unknown. People have asked me from time to time, what I get from being a Mason. What is it that I learned, or discovered in Lodge, that makes it so interesting or valuable to me? Why do I keep going back to Lodge, paying Dues, serving as an Officer, spend so much time on the Internet and in my books researching and discussing Masonry? I don't think anyone really learns anything new in Masonry. I know I didn't, though I really expected to. Much to my surprise I was, and continue to be, reminded of several principles and virtues that I had already inculcated as my own long before I became a Mason. Most, if not all, Masons it has been my pleasure to meet also accept these Principles and Virtues as valid and true in their lives. What are these Virtues? What are these Principles? I will enumerate and describe them, as best I can, one at a time. Brotherly Love: This Virtue admonishes us to regard the entire human race as family. We were, after all, created by the same Creator, and the tie that binds us is stronger than we sometimes think. In all that we do, we should consider our family, known and unknown. What is best for them, and for ourselves? Relief: Whenever we encounter a fellow creature in need, particularly at times when we are in abundance (but even when we are not), we should never fail to do what we are able to relieve their distress. The simple act of a warm handshake can often uplift a downhearted friend and Brother. Truth: This should always have the highest priority, above personal agendas and disagreements. We must be always ready, not only to seek, find and speak the Truth, but we must be prepared to hear it as well. This is not always easy. In fact, hearing an unwelcome Truth is usually difficult. Still, hear it we sometimes must, and accept it as well. Faith: When we believe in something bigger than ourselves, something greater than we can aspire to becoming, we are humbled. Humility inspires us to do our best. Not because we can equal the Creator, but to imitate Him and make something of Beauty ourselves. Beauty gives both pleasure and brings the following Virtue. Hope: A better world awaits us. Even in this life, we may look forward to an improved existence. Educating our Children will insure that they will be able to make good decisions when it is their time to do so. Here I speak not of empty Hope, but a Hope based on the secure knowledge that we have all done our best to make the world of tomorrow better than it is today. Charity: Beyond Relief, we should always work hard to improve the condition of those around us. Where Relief leaves off, Charity begins. Going beyond soothing an affliction or satisfying a need, Charity is the act or acts designed to prevent those needs from ever existing again. Preventing distress, not for the recognition, thanks or acclaim, but because it improves some part of the world, is the highest form of Charity. Tolerance: By this principle of life and conduct we are reminded that it is seldom necessary to prove someone else wrong for us to be right. We do not have to cause another to fail in order to succeed. In the 60s, there was a term called win-win. Both sides of almost every conflict can find a \"middle ground\" in which satisfaction may be a shared commodity, if both sides are willing to allow the other to win also. Temperance: Doing almost anything to excess is harmful. Charity, given to excess, can leave one impoverished. Love, given to excess, may be smothering. The effects of drugs and alcohol, when used to excess, are well known. However, consider the effect of too much Truth. Truth without tact (the knowledge of when NOT to say things) can hurt feelings and even destroy friendships. Fortitude: Without Fortitude, no one can succeed. Everything gets difficult sometimes; there is always the temptation to give in or give up. When we show Fortitude, we learn to \"stick it out\" and overcome obstacles to accomplish goals. Prudence: The mark of a Polite person is knowing when to speak and when not to. What to say and what not to. \"To everything, there is a season.\" This is not only a quotation from Scripture, and a popular song of a previous decade, but good advice as well. Justice: Everyone deserves to have his fair due, whatever that may be. Like Truth, we must be prepared not only to dispense Justice, but to have it dispensed to us. We must be able to put aside our own wants and needs sometimes, in order to insure that Justice is served. All these Principles and Virtues are bigger than ourselves, greater than our personal desires. Observing and practicing them, we are making this a better world, not only for ourselves, but for all who inhabit it. This is what I get from Masonry. This is why I read, research, discuss Masonry and why I continue to attend and visit with my Brothers in Lodge: to be reminded of these principles, and learn more about them.", 
        "intTime": 20090511, 
        "postID": 19, 
        "quote": "", 
        "reply": "Its time to shed the past and realize its every brothers duty to positively project the benefits and good works of masonry. I proudly display my compass and square emblem in my office and garage at home. I get many comments and questions when others see it and when asked, I simply point to a printout of \"Why Im a Mason\" Author unknown. People have asked me from time to time, what I get from being a Mason. What is it that I learned, or discovered in Lodge, that makes it so interesting or valuable to me? Why do I keep going back to Lodge, paying Dues, serving as an Officer, spend so much time on the Internet and in my books researching and discussing Masonry? I don't think anyone really learns anything new in Masonry. I know I didn't, though I really expected to. Much to my surprise I was, and continue to be, reminded of several principles and virtues that I had already inculcated as my own long before I became a Mason. Most, if not all, Masons it has been my pleasure to meet also accept these Principles and Virtues as valid and true in their lives. What are these Virtues? What are these Principles? I will enumerate and describe them, as best I can, one at a time. Brotherly Love: This Virtue admonishes us to regard the entire human race as family. We were, after all, created by the same Creator, and the tie that binds us is stronger than we sometimes think. In all that we do, we should consider our family, known and unknown. What is best for them, and for ourselves? Relief: Whenever we encounter a fellow creature in need, particularly at times when we are in abundance (but even when we are not), we should never fail to do what we are able to relieve their distress. The simple act of a warm handshake can often uplift a downhearted friend and Brother. Truth: This should always have the highest priority, above personal agendas and disagreements. We must be always ready, not only to seek, find and speak the Truth, but we must be prepared to hear it as well. This is not always easy. In fact, hearing an unwelcome Truth is usually difficult. Still, hear it we sometimes must, and accept it as well. Faith: When we believe in something bigger than ourselves, something greater than we can aspire to becoming, we are humbled. Humility inspires us to do our best. Not because we can equal the Creator, but to imitate Him and make something of Beauty ourselves. Beauty gives both pleasure and brings the following Virtue. Hope: A better world awaits us. Even in this life, we may look forward to an improved existence. Educating our Children will insure that they will be able to make good decisions when it is their time to do so. Here I speak not of empty Hope, but a Hope based on the secure knowledge that we have all done our best to make the world of tomorrow better than it is today. Charity: Beyond Relief, we should always work hard to improve the condition of those around us. Where Relief leaves off, Charity begins. Going beyond soothing an affliction or satisfying a need, Charity is the act or acts designed to prevent those needs from ever existing again. Preventing distress, not for the recognition, thanks or acclaim, but because it improves some part of the world, is the highest form of Charity. Tolerance: By this principle of life and conduct we are reminded that it is seldom necessary to prove someone else wrong for us to be right. We do not have to cause another to fail in order to succeed. In the 60s, there was a term called win-win. Both sides of almost every conflict can find a \"middle ground\" in which satisfaction may be a shared commodity, if both sides are willing to allow the other to win also. Temperance: Doing almost anything to excess is harmful. Charity, given to excess, can leave one impoverished. Love, given to excess, may be smothering. The effects of drugs and alcohol, when used to excess, are well known. However, consider the effect of too much Truth. Truth without tact (the knowledge of when NOT to say things) can hurt feelings and even destroy friendships. Fortitude: Without Fortitude, no one can succeed. Everything gets difficult sometimes; there is always the temptation to give in or give up. When we show Fortitude, we learn to \"stick it out\" and overcome obstacles to accomplish goals. Prudence: The mark of a Polite person is knowing when to speak and when not to. What to say and what not to. \"To everything, there is a season.\" This is not only a quotation from Scripture, and a popular song of a previous decade, but good advice as well. Justice: Everyone deserves to have his fair due, whatever that may be. Like Truth, we must be prepared not only to dispense Justice, but to have it dispensed to us. We must be able to put aside our own wants and needs sometimes, in order to insure that Justice is served. All these Principles and Virtues are bigger than ourselves, greater than our personal desires. Observing and practicing them, we are making this a better world, not only for ourselves, but for all who inhabit it. This is what I get from Masonry. This is why I read, research, discuss Masonry and why I continue to attend and visit with my Brothers in Lodge: to be reminded of these principles, and learn more about them.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-11 11:35:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "toddllove"
    }, 
    {
        "content": "Our lodge does assign a coach to each new EA. The coaches are folks who are willing and able to instruct the new member in his proficiency and help with history and so forth. Some of the coaches work (such as myself), others are retired and available whatever time is best for the candidate, some are semi-retired. Best coach is assigned based on the times available between the coach and candidate...if a candidate starts out with me in the evenings and then switches shifts at work, then we will move him to a different coach who can do the work during the days. We will do a degree on any day or time except Sunday...whatever works best for the candidate is what we will do. I still must respectfully disagree with the concept of one day classes. While I am certain there are some fine Masons who come out of them, what is the percentage of those men compared to overall attendees? For every fine Mason, how many are rarely seen in Lodge again?", 
        "intTime": 20090511, 
        "postID": 20, 
        "quote": "", 
        "reply": "Our lodge does assign a coach to each new EA. The coaches are folks who are willing and able to instruct the new member in his proficiency and help with history and so forth. Some of the coaches work (such as myself), others are retired and available whatever time is best for the candidate, some are semi-retired. Best coach is assigned based on the times available between the coach and candidate...if a candidate starts out with me in the evenings and then switches shifts at work, then we will move him to a different coach who can do the work during the days. We will do a degree on any day or time except Sunday...whatever works best for the candidate is what we will do. I still must respectfully disagree with the concept of one day classes. While I am certain there are some fine Masons who come out of them, what is the percentage of those men compared to overall attendees? For every fine Mason, how many are rarely seen in Lodge again?", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-11 12:02:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "SgtWilk"
    }, 
    {
        "content": "It is my personal opinion that the one day classes are actually hurting the organization. Between the ritual and the testing, I had ample opportunity to digest and review everything that I went through. I flooded my mentor with questions and he REALLY struggled to keep my curiosity sated... without giving away anything he couldn't. Going through all three degrees in one day doesn't give the candidate/Brother a chance to do this. There are so many things in the various degrees and rituals that NEED to be answered, described and explained!! I agree that the minimum age should be lowered to 18. To counter some prior posts, there is a valid reason to NOT recognize the Prince Hall Lodges - which could be fixed with one piece of paper. The original charter stated PH could start a Lodge and confer degrees, but not charter any other Lodges... which he did. If the GLE issued a new charter (backdated or not), and said that PH could officially charter new Lodges, then outside of blatant racism there would be no reason to NOT recognize them. MM, GL of Ohio York Rite Commandery", 
        "intTime": 20090523, 
        "postID": 21, 
        "quote": "", 
        "reply": "It is my personal opinion that the one day classes are actually hurting the organization. Between the ritual and the testing, I had ample opportunity to digest and review everything that I went through. I flooded my mentor with questions and he REALLY struggled to keep my curiosity sated... without giving away anything he couldn't. Going through all three degrees in one day doesn't give the candidate/Brother a chance to do this. There are so many things in the various degrees and rituals that NEED to be answered, described and explained!! I agree that the minimum age should be lowered to 18. To counter some prior posts, there is a valid reason to NOT recognize the Prince Hall Lodges - which could be fixed with one piece of paper. The original charter stated PH could start a Lodge and confer degrees, but not charter any other Lodges... which he did. If the GLE issued a new charter (backdated or not), and said that PH could officially charter new Lodges, then outside of blatant racism there would be no reason to NOT recognize them. MM, GL of Ohio York Rite Commandery", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-23 20:53:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "B_12"
    }, 
    {
        "content": "What would you like to see changed in Masonry? (Including the appendant/concordant bodies?) My Grand lodge voted to lower the entrance age to 18. I was all in favor, but it has not resulted in any huge influx of petitions. The change only started last October. The Shrine removed the requirement for petitioners to be York/Scottish Rite Masons. Here again, there was no headlong flood of applicants for the Shrine. What else would you like to see changed? I would love to see more \"openness\" in Masonry. The Grand Lodge of Massachusetts, has two state-wide open houses each year. The GL announces the open houses widely on TV and in the print media. The lodges around the state open on Saturday, and the serve coffee and desserts. They hand out literature, and have members present who can answer questions about the Fraternity. The result is that many men who otherwise would have no introduction to Masonry, are able to get a \"quick course\" in the fraternity. The result is many new petitions. Some lodges in Mass have a waiting list! In 2007, the only states in the USA, which showed an increase in the number of Masons, were Delaware and Massachusetts. I would also like to see every lodge in America have a web page. They can be obtained for free, or at little cost. In the internet age, no lodge should shut themselves off from the internet. What say you?", 
        "intTime": 20090420, 
        "postID": 31, 
        "quote": "", 
        "reply": "What would you like to see changed in Masonry? (Including the appendant/concordant bodies?) My Grand lodge voted to lower the entrance age to 18. I was all in favor, but it has not resulted in any huge influx of petitions. The change only started last October. The Shrine removed the requirement for petitioners to be York/Scottish Rite Masons. Here again, there was no headlong flood of applicants for the Shrine. What else would you like to see changed? I would love to see more \"openness\" in Masonry. The Grand Lodge of Massachusetts, has two state-wide open houses each year. The GL announces the open houses widely on TV and in the print media. The lodges around the state open on Saturday, and the serve coffee and desserts. They hand out literature, and have members present who can answer questions about the Fraternity. The result is that many men who otherwise would have no introduction to Masonry, are able to get a \"quick course\" in the fraternity. The result is many new petitions. Some lodges in Mass have a waiting list! In 2007, the only states in the USA, which showed an increase in the number of Masons, were Delaware and Massachusetts. I would also like to see every lodge in America have a web page. They can be obtained for free, or at little cost. In the internet age, no lodge should shut themselves off from the internet. What say you?", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-20 08:44:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "Web Pages, most certainly (I'll be taking care of that for my lodge next year) Open houses: very helpful. We started doing these \"Officially\" here in Utah last year. they do need to be announced well in advance. We usually do ours right after our largest parade in town every year and we do get some interest. Lowering the petition age to 18 is OK, but IMHO you need to have younger members to bring in younger members. generally your old members (past retirement age) are in the majority in a lodge and their circle of aquaintences is their brother Masons. Bringing in a young man brings in a circle of aquaintences who have had no contact with Masonry before. Further, some of the older members are still stuck in the \"say nothing\" frame of mind from 50 years ago. I make absolutely no secret that I am a Mason and people talk to me about it. Its not a secret society and if you are not ashamed to be a member, BE OPEN about your membership. let people know what your Lodges are doing in the community and get out there to show yourselves. Steve", 
        "intTime": 20090420, 
        "postID": 32, 
        "quote": "", 
        "reply": "Web Pages, most certainly (I'll be taking care of that for my lodge next year) Open houses: very helpful. We started doing these \"Officially\" here in Utah last year. they do need to be announced well in advance. We usually do ours right after our largest parade in town every year and we do get some interest. Lowering the petition age to 18 is OK, but IMHO you need to have younger members to bring in younger members. generally your old members (past retirement age) are in the majority in a lodge and their circle of aquaintences is their brother Masons. Bringing in a young man brings in a circle of aquaintences who have had no contact with Masonry before. Further, some of the older members are still stuck in the \"say nothing\" frame of mind from 50 years ago. I make absolutely no secret that I am a Mason and people talk to me about it. Its not a secret society and if you are not ashamed to be a member, BE OPEN about your membership. let people know what your Lodges are doing in the community and get out there to show yourselves. Steve", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-20 12:59:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "SgtWilk"
    }, 
    {
        "content": "I agree with both sets of comments. Here in Ontario some Lodges do have Open Houses but like it was said before you have to get the word out early and keepn that word going. As you must know from your Lodges, Lions, Optimists and all other clubs and fraternities numbers are getting smaller and smaller. The old boys talk about change but do we really see it? I don't think so. We have to keep up the course of change so that change does in fact come about then maybe we will start getting the need influx of new younger members. Fred Cross St Georges Lodge #41 Ontario, Canada", 
        "intTime": 20090420, 
        "postID": 33, 
        "quote": "", 
        "reply": "I agree with both sets of comments. Here in Ontario some Lodges do have Open Houses but like it was said before you have to get the word out early and keepn that word going. As you must know from your Lodges, Lions, Optimists and all other clubs and fraternities numbers are getting smaller and smaller. The old boys talk about change but do we really see it? I don't think so. We have to keep up the course of change so that change does in fact come about then maybe we will start getting the need influx of new younger members. Fred Cross St Georges Lodge #41 Ontario, Canada", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-20 15:42:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "fredcross"
    }, 
    {
        "content": "quote: Originally posted by cemab4y: What would you like to see changed in Masonry? (Including the appendant/concordant bodies?) My Grand lodge voted to lower the entrance age to 18. I was all in favor, but it has not resulted in any huge influx of petitions. The change only started last October. The Shrine removed the requirement for petitioners to be York/Scottish Rite Masons. Here again, there was no headlong flood of applicants for the Shrine. What else would you like to see changed? I would love to see more \"openness\" in Masonry. The Grand Lodge of Massachusetts, has two state-wide open houses each year. The GL announces the open houses widely on TV and in the print media. The lodges around the state open on Saturday, and the serve coffee and desserts. They hand out literature, and have members present who can answer questions about the Fraternity. The result is that many men who otherwise would have no introduction to Masonry, are able to get a \"quick course\" in the fraternity. The result is many new petitions. Some lodges in Mass have a waiting list! In 2007, the only states in the USA, which showed an increase in the number of Masons, were Delaware and Massachusetts. I would also like to see every lodge in America have a web page. They can be obtained for free, or at little cost. In the internet age, no lodge should shut themselves off from the internet. What say you? Bro. Charles: If you have not noticed, fraternal organizations are all in decline from the Rotarians, Kiwanas, Odd Fellows, and Freemasonry. Lowering the age for petitions from 21 to 18 is nothing more than a sign of the times. The use of One Day Classes to make a Mason in one day are once again a sign of the times. Changes like this are not the answer. So, how can an ancient organization like Freemasonry make fundamental changes to draw members? I believe that there are no \"Cookie Cutter,\" answers to that question for the fraternity no more than how other fraternal organizations are dealing with the same issue. Of course some of these changes are nothing more than what some call \"Rearranging the deck chairs on the Titanic.\" Don't get me wrong, if there are to be changes, they must be fundamental changes and significant otherwise, such minor changes are doing nothing more than putting a bandaid on a sucking chest wound. Not to sound blunt, but a return to some basics would be a good first step. - The changes that would make a difference would be a return to Freemasonry like it was decades ago when the fraternity was at it's peak. Everyone that was someone was a Freemason. I will stop there, hopefully, my point is made with that statement. (What happened was that the fraternity lost a generation from being a closed society of men who did not recruit members for the future and they just waited around for petitions to come, but they didn't come). - I believe that Freemasons should return to the basics of our obligations towards one another to help, aid and assist eachother however possible with the obvious exceptions. This is why we are brothers, or at least should be in my opinion. My .02 cents on the subject. Any takers on this topic? Fraternally, /s/ Terry, PM Hot Topics Moderator", 
        "intTime": 20090423, 
        "postID": 34, 
        "quote": "Originally posted by cemab4y: What would you like to see changed in Masonry? (Including the appendant/concordant bodies?) My Grand lodge voted to lower the entrance age to 18. I was all in favor, but it has not resulted in any huge influx of petitions. The change only started last October. The Shrine removed the requirement for petitioners to be York/Scottish Rite Masons. Here again, there was no headlong flood of applicants for the Shrine. What else would you like to see changed? I would love to see more \"openness\" in Masonry. The Grand Lodge of Massachusetts, has two state-wide open houses each year. The GL announces the open houses widely on TV and in the print media. The lodges around the state open on Saturday, and the serve coffee and desserts. They hand out literature, and have members present who can answer questions about the Fraternity. The result is that many men who otherwise would have no introduction to Masonry, are able to get a \"quick course\" in the fraternity. The result is many new petitions. Some lodges in Mass have a waiting list! In 2007, the only states in the USA, which showed an increase in the number of Masons, were Delaware and Massachusetts. I would also like to see every lodge in America have a web page. They can be obtained for free, or at little cost. In the internet age, no lodge should shut themselves off from the internet. What say you?", 
        "reply": " Bro. Charles: If you have not noticed, fraternal organizations are all in decline from the Rotarians, Kiwanas, Odd Fellows, and Freemasonry. Lowering the age for petitions from 21 to 18 is nothing more than a sign of the times. The use of One Day Classes to make a Mason in one day are once again a sign of the times. Changes like this are not the answer. So, how can an ancient organization like Freemasonry make fundamental changes to draw members? I believe that there are no \"Cookie Cutter,\" answers to that question for the fraternity no more than how other fraternal organizations are dealing with the same issue. Of course some of these changes are nothing more than what some call \"Rearranging the deck chairs on the Titanic.\" Don't get me wrong, if there are to be changes, they must be fundamental changes and significant otherwise, such minor changes are doing nothing more than putting a bandaid on a sucking chest wound. Not to sound blunt, but a return to some basics would be a good first step. - The changes that would make a difference would be a return to Freemasonry like it was decades ago when the fraternity was at it's peak. Everyone that was someone was a Freemason. I will stop there, hopefully, my point is made with that statement. (What happened was that the fraternity lost a generation from being a closed society of men who did not recruit members for the future and they just waited around for petitions to come, but they didn't come). - I believe that Freemasons should return to the basics of our obligations towards one another to help, aid and assist eachother however possible with the obvious exceptions. This is why we are brothers, or at least should be in my opinion. My .02 cents on the subject. Any takers on this topic? Fraternally, /s/ Terry, PM Hot Topics Moderator", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-23 03:31:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "I know most states already do, but I would like to see my state of Tennessee recognize Prince Hall Masons. I see no reason why we can't be in fellowship with each other.", 
        "intTime": 20090423, 
        "postID": 35, 
        "quote": "", 
        "reply": "I know most states already do, but I would like to see my state of Tennessee recognize Prince Hall Masons. I see no reason why we can't be in fellowship with each other.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-23 10:03:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "gmcneill"
    }, 
    {
        "content": "quote: Originally posted by gmcneill: I know most states already do, but I would like to see my state of Tennessee recognize Prince Hall Masons. I see no reason why we can't be in fellowship with each other. Brother, none of us can see no logical reason why Prince Hall Masons cannot be recognized in all fifty (50) states, not just most. Not to bring the skeletons out of the closet, but the data is on the internet anyway, below is a link that shows what states recognize Prince Hall and those that don't. Take a look at which states were part of the former Confedercy and where the Mason-Dixon line is or once was and then draw your own conclusions. We need to tear down these walls because it is alittle more than politics that is going on here. Like you said brother, there is absolutely no reason on earth why Prince Hall lodges cannot be fully recognized in all 50 states of the U.S. of A. period end of discussion. http://bessel.org/masrec/phamapshistorical.htm Respectfully submitted: /s/ Terry, PM Hot Topics Moderator", 
        "intTime": 20090423, 
        "postID": 36, 
        "quote": "Originally posted by gmcneill: I know most states already do, but I would like to see my state of Tennessee recognize Prince Hall Masons. I see no reason why we can't be in fellowship with each other.", 
        "reply": " Brother, none of us can see no logical reason why Prince Hall Masons cannot be recognized in all fifty (50) states, not just most. Not to bring the skeletons out of the closet, but the data is on the internet anyway, below is a link that shows what states recognize Prince Hall and those that don't. Take a look at which states were part of the former Confedercy and where the Mason-Dixon line is or once was and then draw your own conclusions. We need to tear down these walls because it is alittle more than politics that is going on here. Like you said brother, there is absolutely no reason on earth why Prince Hall lodges cannot be fully recognized in all 50 states of the U.S. of A. period end of discussion. http://bessel.org/masrec/phamapshistorical.htm Respectfully submitted: /s/ Terry, PM Hot Topics Moderator", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-23 13:40:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "I pray for the day when all Masons, regardless of color, are recognized as brothers and equals. The Grand Master of Masons in North Carolina, pushed for the recognition, and was able to pull it off. It will take the combined push of ordinary masons from all of the remaining states, to get the final states to recognize Prince Hall Masonry. The situation makes it particularly irksome for Masons who hold plural memberships. If a man belongs to lodges (simutaneously) in multiple states, and one of his Grand Lodges recognizes Prince Hall Masonry, and one does not, then he risks being suspended or expelled if he visits a Prince Hall lodge, even though one of his Masonic memberships makes it permissible! I hope that military Masons, who freely visit Prince Hall lodges on military posts worldwide, will be the ones who push their Grand Lodges for change.", 
        "intTime": 20090423, 
        "postID": 37, 
        "quote": "", 
        "reply": "I pray for the day when all Masons, regardless of color, are recognized as brothers and equals. The Grand Master of Masons in North Carolina, pushed for the recognition, and was able to pull it off. It will take the combined push of ordinary masons from all of the remaining states, to get the final states to recognize Prince Hall Masonry. The situation makes it particularly irksome for Masons who hold plural memberships. If a man belongs to lodges (simutaneously) in multiple states, and one of his Grand Lodges recognizes Prince Hall Masonry, and one does not, then he risks being suspended or expelled if he visits a Prince Hall lodge, even though one of his Masonic memberships makes it permissible! I hope that military Masons, who freely visit Prince Hall lodges on military posts worldwide, will be the ones who push their Grand Lodges for change.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-23 14:21:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "I have read where North Carolina now recognizes Prince Hall. That gives me along with other bretheren here in Tennessee hope that it will happen here.", 
        "intTime": 20090424, 
        "postID": 38, 
        "quote": "", 
        "reply": "I have read where North Carolina now recognizes Prince Hall. That gives me along with other bretheren here in Tennessee hope that it will happen here.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-24 05:09:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "gmcneill"
    }, 
    {
        "content": "It takes more than hope. YOU will have to push your Grand Lodge into taking the step of recognizing Prince Hall Masonry. At present, there are about 38 or so states which have full fraternal relations with Prince Hall Masonry. Tennessee and Kentucky, are among the hold-outs. Since it takes a super-majority (usually 2/3) to get an amendment through the constitution/bylaws, change is slow to come. The Grand Master of Masons in North Carolina, personally pushed for the recognition, and it took some years, and several failed votes, before recognition occured.", 
        "intTime": 20090425, 
        "postID": 39, 
        "quote": "", 
        "reply": "It takes more than hope. YOU will have to push your Grand Lodge into taking the step of recognizing Prince Hall Masonry. At present, there are about 38 or so states which have full fraternal relations with Prince Hall Masonry. Tennessee and Kentucky, are among the hold-outs. Since it takes a super-majority (usually 2/3) to get an amendment through the constitution/bylaws, change is slow to come. The Grand Master of Masons in North Carolina, personally pushed for the recognition, and it took some years, and several failed votes, before recognition occured.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-25 10:34:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "quote: Originally posted by cemab4y: It takes more than hope. YOU will have to push your Grand Lodge into taking the step of recognizing Prince Hall Masonry. At present, there are about 38 or so states which have full fraternal relations with Prince Hall Masonry. Tennessee and Kentucky, are among the hold-outs. Since it takes a super-majority (usually 2/3) to get an amendment through the constitution/bylaws, change is slow to come. The Grand Master of Masons in North Carolina, personally pushed for the recognition, and it took some years, and several failed votes, before recognition occured. Unfortunate but true. It would appear easier to push molassas uphill on a cold day given that the Civil War was lost many decades ago, but the Mason and Dixon Line has not gone away given the map of recognition. http://bessel.org/masrec/phamapshistorical.htm That not only looks bad for the fraternity, it would be unexcusable and unacceptable to the public at large. Like the late Rev. Dr. Martin Luther King, Jr., once said: \"The ultimate measure of a man is not where he stands in moments of comfort, but where he stands at times of challenge and controversy. We must therefore learn to live together as brothers, or parish as fools.\" Rev. Dr. Martin Luther King, Jr. Respectfully submitted, /s/ Terry, PM Hot Topics Moderator", 
        "intTime": 20090427, 
        "postID": 40, 
        "quote": "Originally posted by cemab4y: It takes more than hope. YOU will have to push your Grand Lodge into taking the step of recognizing Prince Hall Masonry. At present, there are about 38 or so states which have full fraternal relations with Prince Hall Masonry. Tennessee and Kentucky, are among the hold-outs. Since it takes a super-majority (usually 2/3) to get an amendment through the constitution/bylaws, change is slow to come. The Grand Master of Masons in North Carolina, personally pushed for the recognition, and it took some years, and several failed votes, before recognition occured.", 
        "reply": " Unfortunate but true. It would appear easier to push molassas uphill on a cold day given that the Civil War was lost many decades ago, but the Mason and Dixon Line has not gone away given the map of recognition. http://bessel.org/masrec/phamapshistorical.htm That not only looks bad for the fraternity, it would be unexcusable and unacceptable to the public at large. Like the late Rev. Dr. Martin Luther King, Jr., once said: \"The ultimate measure of a man is not where he stands in moments of comfort, but where he stands at times of challenge and controversy. We must therefore learn to live together as brothers, or parish as fools.\" Rev. Dr. Martin Luther King, Jr. Respectfully submitted, /s/ Terry, PM Hot Topics Moderator", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-27 16:56:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "We should take to heart the words of Samuel Adams: \"It does not take a majority to prevail ... but rather an irate, tireless minority, keen on setting brushfires of freedom in the minds of men\"", 
        "intTime": 20090428, 
        "postID": 41, 
        "quote": "", 
        "reply": "We should take to heart the words of Samuel Adams: \"It does not take a majority to prevail ... but rather an irate, tireless minority, keen on setting brushfires of freedom in the minds of men\"", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-04-28 05:00:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "One thing to remember about growth, and I'm not sure if it's been said yet (many long wordy replies to work through still, and here's one more) but there's a reason that Masonry in the states, and in other countries grew so quickly about 50 or more years ago. If you do the math, the big expansion for Freemasonry happened right after WWII. All the veterans that came back from the war (and this is from both what I've been told and read) found a place in Masonry where they belonged, it provided them with many types of support to help them get through after that. We watch our numbers drop now, and it is because those veterans are aging quite rapidly and at the end of their lives now. With nearly all of them in their 80's and 90's that are left, their time is unfortunately limited. So you can see the drop in numbers isn't entirely due to a lack of success in bringing new people in, but that the greatest number that ever came in are on their way to that house in the heavens. It is my belief, and that of others, that as the wars in the Mideast draw to a close, and over the coming years, we will again see a similar increase (not quite in the same numbers as WWII) in petitions. So do not worry Brothers that our craft is in trouble due to dropping membership numbers, it is not, it is just flowing forward in time and dealing with natural events. ------------------------------- As for changes, I'm not a fan of one day classes..I can see how they brought these about, but I disagree with them entirely. I think they go against the fundamentals of Freemasonry. More importantly, I would rather Freemasonry have fewer members who are stronger in the Craft, than many members who pay their dues and vanish from view.", 
        "intTime": 20090506, 
        "postID": 42, 
        "quote": "", 
        "reply": "One thing to remember about growth, and I'm not sure if it's been said yet (many long wordy replies to work through still, and here's one more) but there's a reason that Masonry in the states, and in other countries grew so quickly about 50 or more years ago. If you do the math, the big expansion for Freemasonry happened right after WWII. All the veterans that came back from the war (and this is from both what I've been told and read) found a place in Masonry where they belonged, it provided them with many types of support to help them get through after that. We watch our numbers drop now, and it is because those veterans are aging quite rapidly and at the end of their lives now. With nearly all of them in their 80's and 90's that are left, their time is unfortunately limited. So you can see the drop in numbers isn't entirely due to a lack of success in bringing new people in, but that the greatest number that ever came in are on their way to that house in the heavens. It is my belief, and that of others, that as the wars in the Mideast draw to a close, and over the coming years, we will again see a similar increase (not quite in the same numbers as WWII) in petitions. So do not worry Brothers that our craft is in trouble due to dropping membership numbers, it is not, it is just flowing forward in time and dealing with natural events. ------------------------------- As for changes, I'm not a fan of one day classes..I can see how they brought these about, but I disagree with them entirely. I think they go against the fundamentals of Freemasonry. More importantly, I would rather Freemasonry have fewer members who are stronger in the Craft, than many members who pay their dues and vanish from view.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-06 02:52:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "Ajaxus"
    }, 
    {
        "content": "I live in Northern Virginia (suburban Washington DC), and I have been working in Iraq/Afghanistan for the past four years. In the DC metro area, there are men who spend four hours a day, in their cars. Two hours driving in to work, working 8 hours, then two hours driving home. We have the 2d worst commute in the USA, only Los Angeles is worse. One-Day classes, conducted on a Saturday, have enabled men who otherwise could never have been Masons to participate in the fraternity. Each masonic district has the option of conducting one such class a year. You meet at the lodge at 0600am, and eat a breakfast. Then you do the degrees all day, and walk out at 6pm a Master Mason. Many of the brothers who conduct the classes, are the \"best of the best\", and the ritual work is always top-notch. Some of the graduates of ODC's have gone on to serve as officers in various lodges, and some into the appendant bodies. It is only a matter of time, before a ODC mason will serve in the Grand Line. Some masons call these men \"McMasons\". I think that ODC's are in the finest traditions of Masonry. Masonic lodges ran 24 hours a day, during the WW2 years, preparing men, who were going overseas. In Florida, there is a proposal to reduce the time between the Craft Degrees. Indiana, can make a man a Mason in 2-3 weeks.", 
        "intTime": 20090506, 
        "postID": 43, 
        "quote": "", 
        "reply": "I live in Northern Virginia (suburban Washington DC), and I have been working in Iraq/Afghanistan for the past four years. In the DC metro area, there are men who spend four hours a day, in their cars. Two hours driving in to work, working 8 hours, then two hours driving home. We have the 2d worst commute in the USA, only Los Angeles is worse. One-Day classes, conducted on a Saturday, have enabled men who otherwise could never have been Masons to participate in the fraternity. Each masonic district has the option of conducting one such class a year. You meet at the lodge at 0600am, and eat a breakfast. Then you do the degrees all day, and walk out at 6pm a Master Mason. Many of the brothers who conduct the classes, are the \"best of the best\", and the ritual work is always top-notch. Some of the graduates of ODC's have gone on to serve as officers in various lodges, and some into the appendant bodies. It is only a matter of time, before a ODC mason will serve in the Grand Line. Some masons call these men \"McMasons\". I think that ODC's are in the finest traditions of Masonry. Masonic lodges ran 24 hours a day, during the WW2 years, preparing men, who were going overseas. In Florida, there is a proposal to reduce the time between the Craft Degrees. Indiana, can make a man a Mason in 2-3 weeks.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-06 11:13:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "I'm sorry, Cemab, but I must disagree with you on this one. They might walk out that evening having completed the MM degree, but what about their proficiency? If they dont have time to work on that between the degrees, what suddenly gives them the time to do it later? How do they honestly answer the third question in the FC and MM Degree from the SD, JW, SW and WM? I feel if you want to be a Mason you will find the time to take the degrees in the old manner....how long do you think days were for our ancestors in the 1700's, but they still found the time after a long day to become proficient.", 
        "intTime": 20090506, 
        "postID": 44, 
        "quote": "", 
        "reply": "I'm sorry, Cemab, but I must disagree with you on this one. They might walk out that evening having completed the MM degree, but what about their proficiency? If they dont have time to work on that between the degrees, what suddenly gives them the time to do it later? How do they honestly answer the third question in the FC and MM Degree from the SD, JW, SW and WM? I feel if you want to be a Mason you will find the time to take the degrees in the old manner....how long do you think days were for our ancestors in the 1700's, but they still found the time after a long day to become proficient.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-06 15:25:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "SgtWilk"
    }, 
    {
        "content": "I would disagree as well for a few reasons. If you can not make the time for the degrees (which don't take that much) then how can you make the time for participation? You make the case that many of them became line officers..being an officer in a Lodge requires a lot of time..if they were able to do so, then it can be argued that they either should have waited until their careers gave them the time for Masonry or that they had the ability to make the time and did not. As for your statement about Indiana, my home state, I did not know someone could go through the degrees that quickly. I do know we have the ODC, but for regular degrees there's usually a month between each one. Yes we have seen some make it in about 6-7 weeks at times, but that is rare. We require full proficiency in the Q&A before you can move on to the next degree.", 
        "intTime": 20090507, 
        "postID": 45, 
        "quote": "", 
        "reply": "I would disagree as well for a few reasons. If you can not make the time for the degrees (which don't take that much) then how can you make the time for participation? You make the case that many of them became line officers..being an officer in a Lodge requires a lot of time..if they were able to do so, then it can be argued that they either should have waited until their careers gave them the time for Masonry or that they had the ability to make the time and did not. As for your statement about Indiana, my home state, I did not know someone could go through the degrees that quickly. I do know we have the ODC, but for regular degrees there's usually a month between each one. Yes we have seen some make it in about 6-7 weeks at times, but that is rare. We require full proficiency in the Q&A before you can move on to the next degree.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-07 02:30:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "Ajaxus"
    }, 
    {
        "content": "No one is suggesting that one-day classes are a panacea for Masonry. One-Day classes have produced some excellent Masons. I have fellowshipped with some in Virginia. Ohio, and some other states have ODC's now. Some other states are considering ODC's. There are many individuals, for whom participating in degree work at night, is impossible. Moving the degree work to a Saturday, is the only way to accomodate them. In Virginia, the ODC masons must complete proficiency, just like any other Mason. There are weekend classes, where the men can learn proficiency. Virginia (and other states) have \"daylight\" lodges that meet on Saturday mornings, for their stated meetings. Many ODC masons participate in these lodges. As far as the questions in FC/MM, the question is posed: Has he completed proficiency in the preceding degree? Answer - To the satisfaction of this lodge, he has. The questions are phrased, so that the degree work can continue. You must remember, that during the WW2 years, lodges worked \"round the clock\" making new masons in less than a day. Many of these men went overseas, and upon their return, served Masonry well. The important thing to remember, is that it is not the time spent between the Craft Degrees, that makes a man a good mason. It is the quality of the man, and his commitment to the fraternity, that is paramount. Many men have to adjust the time they can devote to Masonry, depending on career and family commitments. I spent a couple of months in Fort Wayne, IN. I met with Masons and learned that once a man has completed a degree, he is assigned a coach. The coach works with him, to ensure that he has absorbed the degree work properly. Once the coach is satisfied, then the next degree can proceed, there is no minimum time between the Craft degrees, some men complete the entire degree process in less than a month.", 
        "intTime": 20090507, 
        "postID": 46, 
        "quote": "", 
        "reply": "No one is suggesting that one-day classes are a panacea for Masonry. One-Day classes have produced some excellent Masons. I have fellowshipped with some in Virginia. Ohio, and some other states have ODC's now. Some other states are considering ODC's. There are many individuals, for whom participating in degree work at night, is impossible. Moving the degree work to a Saturday, is the only way to accomodate them. In Virginia, the ODC masons must complete proficiency, just like any other Mason. There are weekend classes, where the men can learn proficiency. Virginia (and other states) have \"daylight\" lodges that meet on Saturday mornings, for their stated meetings. Many ODC masons participate in these lodges. As far as the questions in FC/MM, the question is posed: Has he completed proficiency in the preceding degree? Answer - To the satisfaction of this lodge, he has. The questions are phrased, so that the degree work can continue. You must remember, that during the WW2 years, lodges worked \"round the clock\" making new masons in less than a day. Many of these men went overseas, and upon their return, served Masonry well. The important thing to remember, is that it is not the time spent between the Craft Degrees, that makes a man a good mason. It is the quality of the man, and his commitment to the fraternity, that is paramount. Many men have to adjust the time they can devote to Masonry, depending on career and family commitments. I spent a couple of months in Fort Wayne, IN. I met with Masons and learned that once a man has completed a degree, he is assigned a coach. The coach works with him, to ensure that he has absorbed the degree work properly. Once the coach is satisfied, then the next degree can proceed, there is no minimum time between the Craft degrees, some men complete the entire degree process in less than a month.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-07 07:04:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "I would like to see a whole bunch of changes in my lodge, my Grand Lodge, and Freemasonry in the USA: 1- Every lodge should be required to have a web site. Sites can be had for free, so there is no reason why every lodge should not have one! 2- Every Grand Lodge should recognize Prince Hall Masonry. 3- Every Grand Lodge should host a statewide Open House, similar to Massachusetts. 4- Every state should have an official Masonic vehicle license plate, issued by the state Department of Motor Vehicles. 5- Every state Grand Lodge website, should have as a minimum: -Precise instructions on how to locate a lodge, and how to petition a lodge -A petition form, downloadable 6- Every Grand Lodge should have a Liaison office- assisting and promoting Masonic youth groups. This office will provide guidance and assistance to lodges towards setting up and running Masonic youth Groups. 7- Every lodge should have a \"new Mason's program\"- Each new mason should receive intense instruction in: -What it means to be a Mason -Introduction to the Appendant/Concordant bodies -How to participate in lodge meetings (how to introduce motions,etc) -Masonic etiquette -How to visit other lodges -How to tell your wife and family about Masonry -Masonic History 8- Every Grand Lodge should provide for Masonic education, at the district level in the following: -Ritual Schools. Any Mason interested in learning ritual, can attend the schools, and be instructed in masonic ritual, and be given practices and rehearsals. -Leadership schools. Any Mason, prior to going through the chairs, and becoming a lodge officer, should receive intense instruction (at the district level), in how to run a lodge. Lessons in parliamentary procedure, lessons in how to run a non-profit organization, etc. 9-Every lodge should host an annual \"county fair\", where all of the appendant/concordant bodies in the area would be invited in, on a Saturday. Each organization would set up a booth at the lodge hall. Masons (and the public) could attend the county fair, and learn about the appendant/concordant bodies, and the groups could distribute literature, and provide the attendees with application forms, and answer questions, etc. 10- Every lodge should sponsor a \"Masonic Square and Compasses Club\". These clubs would meet outside the tyled lodge, and provide social activities, and dances, and barbecues,etc. There would be no degree work, nor any tyled meetings. Anyone interested in Masonry, can participate. 11- We need to realize that Prohibition is over (See the 22d amendment). We are all adults, and it is about time, that we brought alcohol, back into our lodges. Nearly every masonic Grand Lodge in the world (except for the USA) permits alcoholic beverages to be served in the lodge for refreshment. These are just a few of the things I would like to see changed in Craft Masonry in the USA", 
        "intTime": 20090508, 
        "postID": 47, 
        "quote": "", 
        "reply": "I would like to see a whole bunch of changes in my lodge, my Grand Lodge, and Freemasonry in the USA: 1- Every lodge should be required to have a web site. Sites can be had for free, so there is no reason why every lodge should not have one! 2- Every Grand Lodge should recognize Prince Hall Masonry. 3- Every Grand Lodge should host a statewide Open House, similar to Massachusetts. 4- Every state should have an official Masonic vehicle license plate, issued by the state Department of Motor Vehicles. 5- Every state Grand Lodge website, should have as a minimum: -Precise instructions on how to locate a lodge, and how to petition a lodge -A petition form, downloadable 6- Every Grand Lodge should have a Liaison office- assisting and promoting Masonic youth groups. This office will provide guidance and assistance to lodges towards setting up and running Masonic youth Groups. 7- Every lodge should have a \"new Mason's program\"- Each new mason should receive intense instruction in: -What it means to be a Mason -Introduction to the Appendant/Concordant bodies -How to participate in lodge meetings (how to introduce motions,etc) -Masonic etiquette -How to visit other lodges -How to tell your wife and family about Masonry -Masonic History 8- Every Grand Lodge should provide for Masonic education, at the district level in the following: -Ritual Schools. Any Mason interested in learning ritual, can attend the schools, and be instructed in masonic ritual, and be given practices and rehearsals. -Leadership schools. Any Mason, prior to going through the chairs, and becoming a lodge officer, should receive intense instruction (at the district level), in how to run a lodge. Lessons in parliamentary procedure, lessons in how to run a non-profit organization, etc. 9-Every lodge should host an annual \"county fair\", where all of the appendant/concordant bodies in the area would be invited in, on a Saturday. Each organization would set up a booth at the lodge hall. Masons (and the public) could attend the county fair, and learn about the appendant/concordant bodies, and the groups could distribute literature, and provide the attendees with application forms, and answer questions, etc. 10- Every lodge should sponsor a \"Masonic Square and Compasses Club\". These clubs would meet outside the tyled lodge, and provide social activities, and dances, and barbecues,etc. There would be no degree work, nor any tyled meetings. Anyone interested in Masonry, can participate. 11- We need to realize that Prohibition is over (See the 22d amendment). We are all adults, and it is about time, that we brought alcohol, back into our lodges. Nearly every masonic Grand Lodge in the world (except for the USA) permits alcoholic beverages to be served in the lodge for refreshment. These are just a few of the things I would like to see changed in Craft Masonry in the USA", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-08 07:13:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "cemab4y"
    }, 
    {
        "content": "Our lodge just started a program that assigns a coach with each new member. We asked the last two M/M did they really understand about Masonary. They recommended that it should slow down and give the member more info. After and when the coach feels the member is ready we set the date for the next step. Thanks Bob", 
        "intTime": 20090508, 
        "postID": 48, 
        "quote": "", 
        "reply": "Our lodge just started a program that assigns a coach with each new member. We asked the last two M/M did they really understand about Masonary. They recommended that it should slow down and give the member more info. After and when the coach feels the member is ready we set the date for the next step. Thanks Bob", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-08 18:51:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "AKCSJAKE"
    }, 
    {
        "content": "Its time to shed the past and realize its every brothers duty to positively project the benefits and good works of masonry. I proudly display my compass and square emblem in my office and garage at home. I get many comments and questions when others see it and when asked, I simply point to a printout of \"Why Im a Mason\" Author unknown. People have asked me from time to time, what I get from being a Mason. What is it that I learned, or discovered in Lodge, that makes it so interesting or valuable to me? Why do I keep going back to Lodge, paying Dues, serving as an Officer, spend so much time on the Internet and in my books researching and discussing Masonry? I don't think anyone really learns anything new in Masonry. I know I didn't, though I really expected to. Much to my surprise I was, and continue to be, reminded of several principles and virtues that I had already inculcated as my own long before I became a Mason. Most, if not all, Masons it has been my pleasure to meet also accept these Principles and Virtues as valid and true in their lives. What are these Virtues? What are these Principles? I will enumerate and describe them, as best I can, one at a time. Brotherly Love: This Virtue admonishes us to regard the entire human race as family. We were, after all, created by the same Creator, and the tie that binds us is stronger than we sometimes think. In all that we do, we should consider our family, known and unknown. What is best for them, and for ourselves? Relief: Whenever we encounter a fellow creature in need, particularly at times when we are in abundance (but even when we are not), we should never fail to do what we are able to relieve their distress. The simple act of a warm handshake can often uplift a downhearted friend and Brother. Truth: This should always have the highest priority, above personal agendas and disagreements. We must be always ready, not only to seek, find and speak the Truth, but we must be prepared to hear it as well. This is not always easy. In fact, hearing an unwelcome Truth is usually difficult. Still, hear it we sometimes must, and accept it as well. Faith: When we believe in something bigger than ourselves, something greater than we can aspire to becoming, we are humbled. Humility inspires us to do our best. Not because we can equal the Creator, but to imitate Him and make something of Beauty ourselves. Beauty gives both pleasure and brings the following Virtue. Hope: A better world awaits us. Even in this life, we may look forward to an improved existence. Educating our Children will insure that they will be able to make good decisions when it is their time to do so. Here I speak not of empty Hope, but a Hope based on the secure knowledge that we have all done our best to make the world of tomorrow better than it is today. Charity: Beyond Relief, we should always work hard to improve the condition of those around us. Where Relief leaves off, Charity begins. Going beyond soothing an affliction or satisfying a need, Charity is the act or acts designed to prevent those needs from ever existing again. Preventing distress, not for the recognition, thanks or acclaim, but because it improves some part of the world, is the highest form of Charity. Tolerance: By this principle of life and conduct we are reminded that it is seldom necessary to prove someone else wrong for us to be right. We do not have to cause another to fail in order to succeed. In the 60s, there was a term called win-win. Both sides of almost every conflict can find a \"middle ground\" in which satisfaction may be a shared commodity, if both sides are willing to allow the other to win also. Temperance: Doing almost anything to excess is harmful. Charity, given to excess, can leave one impoverished. Love, given to excess, may be smothering. The effects of drugs and alcohol, when used to excess, are well known. However, consider the effect of too much Truth. Truth without tact (the knowledge of when NOT to say things) can hurt feelings and even destroy friendships. Fortitude: Without Fortitude, no one can succeed. Everything gets difficult sometimes; there is always the temptation to give in or give up. When we show Fortitude, we learn to \"stick it out\" and overcome obstacles to accomplish goals. Prudence: The mark of a Polite person is knowing when to speak and when not to. What to say and what not to. \"To everything, there is a season.\" This is not only a quotation from Scripture, and a popular song of a previous decade, but good advice as well. Justice: Everyone deserves to have his fair due, whatever that may be. Like Truth, we must be prepared not only to dispense Justice, but to have it dispensed to us. We must be able to put aside our own wants and needs sometimes, in order to insure that Justice is served. All these Principles and Virtues are bigger than ourselves, greater than our personal desires. Observing and practicing them, we are making this a better world, not only for ourselves, but for all who inhabit it. This is what I get from Masonry. This is why I read, research, discuss Masonry and why I continue to attend and visit with my Brothers in Lodge: to be reminded of these principles, and learn more about them.", 
        "intTime": 20090511, 
        "postID": 49, 
        "quote": "", 
        "reply": "Its time to shed the past and realize its every brothers duty to positively project the benefits and good works of masonry. I proudly display my compass and square emblem in my office and garage at home. I get many comments and questions when others see it and when asked, I simply point to a printout of \"Why Im a Mason\" Author unknown. People have asked me from time to time, what I get from being a Mason. What is it that I learned, or discovered in Lodge, that makes it so interesting or valuable to me? Why do I keep going back to Lodge, paying Dues, serving as an Officer, spend so much time on the Internet and in my books researching and discussing Masonry? I don't think anyone really learns anything new in Masonry. I know I didn't, though I really expected to. Much to my surprise I was, and continue to be, reminded of several principles and virtues that I had already inculcated as my own long before I became a Mason. Most, if not all, Masons it has been my pleasure to meet also accept these Principles and Virtues as valid and true in their lives. What are these Virtues? What are these Principles? I will enumerate and describe them, as best I can, one at a time. Brotherly Love: This Virtue admonishes us to regard the entire human race as family. We were, after all, created by the same Creator, and the tie that binds us is stronger than we sometimes think. In all that we do, we should consider our family, known and unknown. What is best for them, and for ourselves? Relief: Whenever we encounter a fellow creature in need, particularly at times when we are in abundance (but even when we are not), we should never fail to do what we are able to relieve their distress. The simple act of a warm handshake can often uplift a downhearted friend and Brother. Truth: This should always have the highest priority, above personal agendas and disagreements. We must be always ready, not only to seek, find and speak the Truth, but we must be prepared to hear it as well. This is not always easy. In fact, hearing an unwelcome Truth is usually difficult. Still, hear it we sometimes must, and accept it as well. Faith: When we believe in something bigger than ourselves, something greater than we can aspire to becoming, we are humbled. Humility inspires us to do our best. Not because we can equal the Creator, but to imitate Him and make something of Beauty ourselves. Beauty gives both pleasure and brings the following Virtue. Hope: A better world awaits us. Even in this life, we may look forward to an improved existence. Educating our Children will insure that they will be able to make good decisions when it is their time to do so. Here I speak not of empty Hope, but a Hope based on the secure knowledge that we have all done our best to make the world of tomorrow better than it is today. Charity: Beyond Relief, we should always work hard to improve the condition of those around us. Where Relief leaves off, Charity begins. Going beyond soothing an affliction or satisfying a need, Charity is the act or acts designed to prevent those needs from ever existing again. Preventing distress, not for the recognition, thanks or acclaim, but because it improves some part of the world, is the highest form of Charity. Tolerance: By this principle of life and conduct we are reminded that it is seldom necessary to prove someone else wrong for us to be right. We do not have to cause another to fail in order to succeed. In the 60s, there was a term called win-win. Both sides of almost every conflict can find a \"middle ground\" in which satisfaction may be a shared commodity, if both sides are willing to allow the other to win also. Temperance: Doing almost anything to excess is harmful. Charity, given to excess, can leave one impoverished. Love, given to excess, may be smothering. The effects of drugs and alcohol, when used to excess, are well known. However, consider the effect of too much Truth. Truth without tact (the knowledge of when NOT to say things) can hurt feelings and even destroy friendships. Fortitude: Without Fortitude, no one can succeed. Everything gets difficult sometimes; there is always the temptation to give in or give up. When we show Fortitude, we learn to \"stick it out\" and overcome obstacles to accomplish goals. Prudence: The mark of a Polite person is knowing when to speak and when not to. What to say and what not to. \"To everything, there is a season.\" This is not only a quotation from Scripture, and a popular song of a previous decade, but good advice as well. Justice: Everyone deserves to have his fair due, whatever that may be. Like Truth, we must be prepared not only to dispense Justice, but to have it dispensed to us. We must be able to put aside our own wants and needs sometimes, in order to insure that Justice is served. All these Principles and Virtues are bigger than ourselves, greater than our personal desires. Observing and practicing them, we are making this a better world, not only for ourselves, but for all who inhabit it. This is what I get from Masonry. This is why I read, research, discuss Masonry and why I continue to attend and visit with my Brothers in Lodge: to be reminded of these principles, and learn more about them.", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-11 11:35:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "toddllove"
    }, 
    {
        "content": "Our lodge does assign a coach to each new EA. The coaches are folks who are willing and able to instruct the new member in his proficiency and help with history and so forth. Some of the coaches work (such as myself), others are retired and available whatever time is best for the candidate, some are semi-retired. Best coach is assigned based on the times available between the coach and candidate...if a candidate starts out with me in the evenings and then switches shifts at work, then we will move him to a different coach who can do the work during the days. We will do a degree on any day or time except Sunday...whatever works best for the candidate is what we will do. I still must respectfully disagree with the concept of one day classes. While I am certain there are some fine Masons who come out of them, what is the percentage of those men compared to overall attendees? For every fine Mason, how many are rarely seen in Lodge again?", 
        "intTime": 20090511, 
        "postID": 50, 
        "quote": "", 
        "reply": "Our lodge does assign a coach to each new EA. The coaches are folks who are willing and able to instruct the new member in his proficiency and help with history and so forth. Some of the coaches work (such as myself), others are retired and available whatever time is best for the candidate, some are semi-retired. Best coach is assigned based on the times available between the coach and candidate...if a candidate starts out with me in the evenings and then switches shifts at work, then we will move him to a different coach who can do the work during the days. We will do a degree on any day or time except Sunday...whatever works best for the candidate is what we will do. I still must respectfully disagree with the concept of one day classes. While I am certain there are some fine Masons who come out of them, what is the percentage of those men compared to overall attendees? For every fine Mason, how many are rarely seen in Lodge again?", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-11 12:02:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "SgtWilk"
    }, 
    {
        "content": "It is my personal opinion that the one day classes are actually hurting the organization. Between the ritual and the testing, I had ample opportunity to digest and review everything that I went through. I flooded my mentor with questions and he REALLY struggled to keep my curiosity sated... without giving away anything he couldn't. Going through all three degrees in one day doesn't give the candidate/Brother a chance to do this. There are so many things in the various degrees and rituals that NEED to be answered, described and explained!! I agree that the minimum age should be lowered to 18. To counter some prior posts, there is a valid reason to NOT recognize the Prince Hall Lodges - which could be fixed with one piece of paper. The original charter stated PH could start a Lodge and confer degrees, but not charter any other Lodges... which he did. If the GLE issued a new charter (backdated or not), and said that PH could officially charter new Lodges, then outside of blatant racism there would be no reason to NOT recognize them. MM, GL of Ohio York Rite Commandery", 
        "intTime": 20090523, 
        "postID": 51, 
        "quote": "", 
        "reply": "It is my personal opinion that the one day classes are actually hurting the organization. Between the ritual and the testing, I had ample opportunity to digest and review everything that I went through. I flooded my mentor with questions and he REALLY struggled to keep my curiosity sated... without giving away anything he couldn't. Going through all three degrees in one day doesn't give the candidate/Brother a chance to do this. There are so many things in the various degrees and rituals that NEED to be answered, described and explained!! I agree that the minimum age should be lowered to 18. To counter some prior posts, there is a valid reason to NOT recognize the Prince Hall Lodges - which could be fixed with one piece of paper. The original charter stated PH could start a Lodge and confer degrees, but not charter any other Lodges... which he did. If the GLE issued a new charter (backdated or not), and said that PH could officially charter new Lodges, then outside of blatant racism there would be no reason to NOT recognize them. MM, GL of Ohio York Rite Commandery", 
        "threadID": "1350075960001_1460062122001", 
        "time": "2009-05-23 20:53:00", 
        "title": "What would you like to see changed in Masonry?", 
        "userID": "B_12"
    }
]