[
    {
        "content": "A really good friend of mine is now a MM at one of the local lodges where I reside. I could not believe how much he has changed (for the better) when he joined. I am happy to say that as soon as I get back in country, and ETS, I will be petitioning his lodge for membership, and he will be my coach. I've met most of the people in the lodge, including the WM, and they are outstanding people. I can't wait to be a part of Freemasonry!", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "", 
        "reply": "A really good friend of mine is now a MM at one of the local lodges where I reside. I could not believe how much he has changed (for the better) when he joined. I am happy to say that as soon as I get back in country, and ETS, I will be petitioning his lodge for membership, and he will be my coach. I've met most of the people in the lodge, including the WM, and they are outstanding people. I can't wait to be a part of Freemasonry!", 
        "threadID": "1350075960001_3740092312001", 
        "time": "2009-03-03 14:37:00", 
        "title": "2b1ask1", 
        "userID": "CMTaMedic"
    }, 
    {
        "content": "quote: Originally posted by CMTaMedic: A really good friend of mine is now a MM at one of the local lodges where I reside. I could not believe how much he has changed (for the better) when he joined. I am happy to say that as soon as I get back in country, and ETS, I will be petitioning his lodge for membership, and he will be my coach. I've met most of the people in the lodge, including the WM, and they are outstanding people. I can't wait to be a part of Freemasonry! This is what makes Freemasonry great, good men seeking the company with other good men through a fraternal organization. Freemasonry does not seek out good men, they seek out our gentle craft. Freemasonry does not solicit members to petition our fraternity, but we will not turn down a good man. We call one another \"Brother\" and that is for good reason, it is our fraternal bond for we are a band of brothers bound by a fraternal obligation to one another. So Mote It Be. We look forward to calling you brother one day. Let us know when that day comes and invite us all. If possible, I would like to sit in lodge with you one day. Fraternally, /s/ Terry, Past Master Freemason Hot Topics Moderator", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "Originally posted by CMTaMedic: A really good friend of mine is now a MM at one of the local lodges where I reside. I could not believe how much he has changed (for the better) when he joined. I am happy to say that as soon as I get back in country, and ETS, I will be petitioning his lodge for membership, and he will be my coach. I've met most of the people in the lodge, including the WM, and they are outstanding people. I can't wait to be a part of Freemasonry!", 
        "reply": " This is what makes Freemasonry great, good men seeking the company with other good men through a fraternal organization. Freemasonry does not seek out good men, they seek out our gentle craft. Freemasonry does not solicit members to petition our fraternity, but we will not turn down a good man. We call one another \"Brother\" and that is for good reason, it is our fraternal bond for we are a band of brothers bound by a fraternal obligation to one another. So Mote It Be. We look forward to calling you brother one day. Let us know when that day comes and invite us all. If possible, I would like to sit in lodge with you one day. Fraternally, /s/ Terry, Past Master Freemason Hot Topics Moderator", 
        "threadID": "1350075960001_3740092312001", 
        "time": "2009-03-03 21:31:00", 
        "title": "2b1ask1", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "Greetings, Could someone please explain what a PM (Past Mason) is?? Is that someone who is no longer a Mason??", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "", 
        "reply": "Greetings, Could someone please explain what a PM (Past Mason) is?? Is that someone who is no longer a Mason??", 
        "threadID": "1350075960001_3740092312001", 
        "time": "2009-03-25 10:10:00", 
        "title": "2b1ask1", 
        "userID": "davidbeals"
    }, 
    {
        "content": "PM = Past Master, i.e. Former Worshipful Master of a Lodge.", 
        "intTime": 20090326, 
        "postID": 10, 
        "quote": "", 
        "reply": "PM = Past Master, i.e. Former Worshipful Master of a Lodge.", 
        "threadID": "1350075960001_3740092312001", 
        "time": "2009-03-26 15:42:00", 
        "title": "2b1ask1", 
        "userID": "SgtWilk"
    }, 
    {
        "content": "Terry I see all of our organizations but one, Shrine????? Just a question brother. Fred Cross PM St Georges Lodge #41 Kingsville, Ontario", 
        "intTime": 20090420, 
        "postID": 11, 
        "quote": "", 
        "reply": "Terry I see all of our organizations but one, Shrine????? Just a question brother. Fred Cross PM St Georges Lodge #41 Kingsville, Ontario", 
        "threadID": "1350075960001_3740092312001", 
        "time": "2009-04-20 16:00:00", 
        "title": "2b1ask1", 
        "userID": "fredcross"
    }, 
    {
        "content": "quote: Originally posted by fredcross: Terry I see all of our organizations but one, Shrine????? Just a question brother. Fred Cross PM St Georges Lodge #41 Kingsville, Ontario Bro. Fred, You are corrrect. I am not a Shriner, for many reasons too numerous to mention i.e. not enough time, money and interest, just to name a few. Heard too many war stories from a Past Potentate that made me loose interest. Maybe some day, I might revisit the Shrine issue. Fraternally, /s/ Terry, PM Hot Topics Moderator", 
        "intTime": 20090421, 
        "postID": 12, 
        "quote": "Originally posted by fredcross: Terry I see all of our organizations but one, Shrine????? Just a question brother. Fred Cross PM St Georges Lodge #41 Kingsville, Ontario", 
        "reply": " Bro. Fred, You are corrrect. I am not a Shriner, for many reasons too numerous to mention i.e. not enough time, money and interest, just to name a few. Heard too many war stories from a Past Potentate that made me loose interest. Maybe some day, I might revisit the Shrine issue. Fraternally, /s/ Terry, PM Hot Topics Moderator", 
        "threadID": "1350075960001_3740092312001", 
        "time": "2009-04-21 23:32:00", 
        "title": "2b1ask1", 
        "userID": "TerryTCT"
    }, 
    {
        "content": "Good and Bad in all organizations.", 
        "intTime": 20090422, 
        "postID": 13, 
        "quote": "", 
        "reply": "Good and Bad in all organizations.", 
        "threadID": "1350075960001_3740092312001", 
        "time": "2009-04-22 10:49:00", 
        "title": "2b1ask1", 
        "userID": "fredcross"
    }, 
    {
        "content": "The Shrine is a marvelous organization. I am an inactive Shriner, hard to attend meetings, when you are on a mountaintop base in Afghanistan. Our hospitals are the finest children's orthopaedic and burns hospitals in the world, and all treatment is provided free. You can learn more about the Shrine at the Shriner's Headquarters website. (get it on google). If you know of a child who could benefit from the excellent treatment at one of our hospitals, please call the toll-free number of the hospitals (see it at the website).", 
        "intTime": 20090422, 
        "postID": 14, 
        "quote": "", 
        "reply": "The Shrine is a marvelous organization. I am an inactive Shriner, hard to attend meetings, when you are on a mountaintop base in Afghanistan. Our hospitals are the finest children's orthopaedic and burns hospitals in the world, and all treatment is provided free. You can learn more about the Shrine at the Shriner's Headquarters website. (get it on google). If you know of a child who could benefit from the excellent treatment at one of our hospitals, please call the toll-free number of the hospitals (see it at the website).", 
        "threadID": "1350075960001_3740092312001", 
        "time": "2009-04-22 15:45:00", 
        "title": "2b1ask1", 
        "userID": "cemab4y"
    }
]