[
    {
        "content": "quote: By KARIN LAUB, Associated Press Writer Karin Laub, Associated Press Writer – Thu May 21, 4:26 pm ET JEBALIYA, Gaza Strip – Dr. Izzeldin Abuelaish, a Gaza infertility specialist, is a familiar figure to Israelis — a Palestinian who crossed the lines of enmity years ago to work in Israeli hospitals and become a frequent guest on Israeli TV and radio. But the interview he did on Jan. 16, as Israeli forces waged war on Gaza's Hamas rulers, was horrifyingly different: Israeli tank shells had just killed three of his daughters, and he was phoning an Israeli journalist-friend, live on the air, to plead for help in evacuating the wounded, including another daughter and a niece. Four months later, far from voicing bitterness over his loss, Abuelaish is trying to turn his tragedy into hope, raising money for a scholarship fund for Gaza girls and an Israeli hospital, and preaching reconciliation. \"We need to open our eyes, our minds and to have big hearts, to smash the mental and physical barriers and borders, to build the broken trust,\" said the Harvard-trained son of a Gaza laborer, sitting in the apartment where 14-year-old Aya, 15-year-old Mayar and 21-year-old Bissan were killed two days before the war ended. At a time when U.S. President Barack Obama has begun a round of meetings with Middle East leaders on how to end the Middle East conflict, Abuelaish's story illuminates the reality at ground level. With Israelis and Palestinians increasingly separated by fences and fear, it has offered a rare example of suffering on one side drawing empathy from the other. More here: (*http://www.ksl.com/?nid=125&sid=6561069*)", 
        "intTime": 20090521, 
        "postID": 1, 
        "quote": "By KARIN LAUB, Associated Press Writer Karin Laub, Associated Press Writer – Thu May 21, 4:26 pm ET JEBALIYA, Gaza Strip – Dr. Izzeldin Abuelaish, a Gaza infertility specialist, is a familiar figure to Israelis — a Palestinian who crossed the lines of enmity years ago to work in Israeli hospitals and become a frequent guest on Israeli TV and radio. But the interview he did on Jan. 16, as Israeli forces waged war on Gaza's Hamas rulers, was horrifyingly different: Israeli tank shells had just killed three of his daughters, and he was phoning an Israeli journalist-friend, live on the air, to plead for help in evacuating the wounded, including another daughter and a niece. Four months later, far from voicing bitterness over his loss, Abuelaish is trying to turn his tragedy into hope, raising money for a scholarship fund for Gaza girls and an Israeli hospital, and preaching reconciliation. \"We need to open our eyes, our minds and to have big hearts, to smash the mental and physical barriers and borders, to build the broken trust,\" said the Harvard-trained son of a Gaza laborer, sitting in the apartment where 14-year-old Aya, 15-year-old Mayar and 21-year-old Bissan were killed two days before the war ended. At a time when U.S. President Barack Obama has begun a round of meetings with Middle East leaders on how to end the Middle East conflict, Abuelaish's story illuminates the reality at ground level. With Israelis and Palestinians increasingly separated by fences and fear, it has offered a rare example of suffering on one side drawing empathy from the other. More here: (*http://www.ksl.com/?nid=125&sid=6561069*)", 
        "reply": "", 
        "threadID": "2341971921_8260039322001", 
        "time": "2009-05-21 22:10:00", 
        "title": "Gaza father's loss captures Israeli sympathy", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "America should not be supporting the oppressive occupation forces that shelled his teenage daughters, and the hundreds and hundreds of other children / civilians in Gaza; not to mention the thousands and thousands of other civilians killed and millions forced into being refugees since the 1940s. I hope Obama at least takes a more neutral position between the oppressor and the oppressed. Wouldn't that be a REAL \"change\", as he swore to accomplish when he was running for President?", 
        "intTime": 20090522, 
        "postID": 2, 
        "quote": "", 
        "reply": "America should not be supporting the oppressive occupation forces that shelled his teenage daughters, and the hundreds and hundreds of other children / civilians in Gaza; not to mention the thousands and thousands of other civilians killed and millions forced into being refugees since the 1940s. I hope Obama at least takes a more neutral position between the oppressor and the oppressed. Wouldn't that be a REAL \"change\", as he swore to accomplish when he was running for President?", 
        "threadID": "2341971921_8260039322001", 
        "time": "2009-05-22 20:23:00", 
        "title": "Gaza father's loss captures Israeli sympathy", 
        "userID": "DougSabbag"
    }, 
    {
        "content": "quote: Originally posted by DougSabbag: America should not be supporting the oppressive occupation forces that shelled his teenage daughters, and the hundreds and hundreds of other children / civilians in Gaza; not to mention the thousands and thousands of other civilians killed and millions forced into being refugees since the 1940s. I hope Obama at least takes a more neutral position between the oppressor and the oppressed. Wouldn't that be a REAL \"change\", as he swore to accomplish when he was running for President? Well, I give up. Did you even go to the link and read the whole story? I thought you might see this as the positive step it is, toward your professed goals. But you are not interested in peace amoung the two peoples. I can see that now. You go on and rant all you want. I'm out.", 
        "intTime": 20090522, 
        "postID": 3, 
        "quote": "Originally posted by DougSabbag: America should not be supporting the oppressive occupation forces that shelled his teenage daughters, and the hundreds and hundreds of other children / civilians in Gaza; not to mention the thousands and thousands of other civilians killed and millions forced into being refugees since the 1940s. I hope Obama at least takes a more neutral position between the oppressor and the oppressed. Wouldn't that be a REAL \"change\", as he swore to accomplish when he was running for President?", 
        "reply": " Well, I give up. Did you even go to the link and read the whole story? I thought you might see this as the positive step it is, toward your professed goals. But you are not interested in peace amoung the two peoples. I can see that now. You go on and rant all you want. I'm out.", 
        "threadID": "2341971921_8260039322001", 
        "time": "2009-05-22 20:50:00", 
        "title": "Gaza father's loss captures Israeli sympathy", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by DougSabbag: America should not be supporting the oppressive occupation forces that shelled his teenage daughters, and the hundreds and hundreds of other children / civilians in Gaza; not to mention the thousands and thousands of other civilians killed and millions forced into being refugees since the 1940s. I hope Obama at least takes a more neutral position between the oppressor and the oppressed. Wouldn't that be a REAL \"change\", as he swore to accomplish when he was running for President? Well, I give up. Did you even go to the link and read the whole story? I thought you might see this as the positive step it is, toward your professed goals. But you are not interested in peace amoung the two peoples. I can see that now. You go on and rant all you want. I'm out. Angel... what is wrong with what I said? I am saying that we need a change in direction in order to accomplish peace. The direction we've been on for decades, has not worked has it? So, since I too want to see peace, and believe that will only be obtained through justice for all, and since I am an American, I want to see a change which could be led by America and American Principles to finally end the vicious cycle of injustice and extermination of the loosers. This particular Palestinian Doctor, is not the only Palestinian who wants peace. Actually they all do. These are just people, and rather than hating and fighting they just want justice and a chance to build their own lives in a healthy way, as everyone wants. You don't have to see these thoughts as in conflict with your views.. That would be inaccurate.", 
        "intTime": 20090523, 
        "postID": 4, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by DougSabbag: America should not be supporting the oppressive occupation forces that shelled his teenage daughters, and the hundreds and hundreds of other children / civilians in Gaza; not to mention the thousands and thousands of other civilians killed and millions forced into being refugees since the 1940s. I hope Obama at least takes a more neutral position between the oppressor and the oppressed. Wouldn't that be a REAL \"change\", as he swore to accomplish when he was running for President? Well, I give up. Did you even go to the link and read the whole story? I thought you might see this as the positive step it is, toward your professed goals. But you are not interested in peace amoung the two peoples. I can see that now. You go on and rant all you want. I'm out.", 
        "reply": " Angel... what is wrong with what I said? I am saying that we need a change in direction in order to accomplish peace. The direction we've been on for decades, has not worked has it? So, since I too want to see peace, and believe that will only be obtained through justice for all, and since I am an American, I want to see a change which could be led by America and American Principles to finally end the vicious cycle of injustice and extermination of the loosers. This particular Palestinian Doctor, is not the only Palestinian who wants peace. Actually they all do. These are just people, and rather than hating and fighting they just want justice and a chance to build their own lives in a healthy way, as everyone wants. You don't have to see these thoughts as in conflict with your views.. That would be inaccurate.", 
        "threadID": "2341971921_8260039322001", 
        "time": "2009-05-23 11:19:00", 
        "title": "Gaza father's loss captures Israeli sympathy", 
        "userID": "DougSabbag"
    }
]