[
    {
        "content": "I came across this article and wanted to get some opinions. What are your thoughts. I think he makes a good point. Sailor's Mom By Charles Krauthammer, Columnist with Washington Post Friday, January 30, 2009; Page A19 Every new president flatters himself that he, kinder and gentler, is beginning the world anew. Yet, when Barack Obama in his inaugural address reached out to Muslims by saying \"to the Muslim world, we seek a new way forward, based on mutual interest and mutual respect,\" his formulation was needlessly defensive and apologetic. Is it \"new\" to acknowledge Muslim interests and show respect to the Muslim world? Obama doesn't just think so, he said so again to millions in his al-Arabiya interview, insisting on the need to \"restore\" the \"same respect and partnership that America had with the Muslim world as recently as 20 or 30 years ago.\" Astonishing. In these most recent 20 years -- the alleged winter of our disrespect of the Islamic world -- America did not just respect Muslims, it bled for them. It engaged in five military campaigns, every one of which involved -- and resulted in -- the liberation of a Muslim people: Bosnia, Kosovo, Kuwait, Afghanistan and Iraq. The two Balkan interventions -- as well as the failed 1992-93 Somalia intervention to feed starving African Muslims (43 Americans were killed) -- were humanitarian exercises of the highest order, there being no significant U.S. strategic interest at stake. In these 20 years, this nation has done more for suffering and oppressed Muslims than any nation, Muslim or non-Muslim, anywhere on Earth. Why are we apologizing? And what of that happy U.S.-Muslim relationship that Obama imagines existed \"as recently as 20 or 30 years ago\" that he has now come to restore? Thirty years ago, 1979, saw the greatest U.S.-Muslim rupture in our 233-year history: Iran's radical Islamic revolution, the seizure of the U.S. Embassy, the 14 months of America held hostage. Which came just a few years after the Arab oil embargo that sent the United States into a long and punishing recession. Which, in turn, was preceded by the kidnapping and cold-blooded execution by Arab terrorists of the U.S. ambassador in Sudan and his chargé d'affaires. This is to say nothing of the Marine barracks massacre of 1983, and the innumerable attacks on U.S. embassies and installations around the world during what Obama now characterizes as the halcyon days of U.S.-Islamic relations. Look. If Barack Obama wants to say, as he said to al-Arabiya, I have Muslim roots, Muslim family members, have lived in a Muslim country -- implying a special affinity that uniquely positions him to establish good relations -- that's fine. But it is both false and deeply injurious to this country to draw a historical line dividing America under Obama from a benighted past when Islam was supposedly disrespected and demonized. As in Obama's grand admonition: \"We cannot paint with a broad brush a faith as a consequence of the violence that is done in that faith's name.\" Have \"we\" been doing that, smearing Islam because of a small minority? George W. Bush went to the Islamic Center in Washington six days after the Sept. 11 attacks, when the fires of Ground Zero were still smoldering, to declare \"Islam is peace,\" to extend fellowship and friendship to Muslims, to insist that Americans treat them with respect and generosity of spirit. And America listened. In these seven years since Sept. 11 -- seven years during which thousands of Muslims rioted all over the world (resulting in the death of more than 100) to avenge a bunch of cartoons -- there's not been a single anti-Muslim riot in the United States to avenge the massacre of 3,000 innocents. On the contrary. In its aftermath, we elected our first Muslim member of Congress and our first president of Muslim parentage. \"My job,\" says Obama, \"is to communicate to the American people that the Muslim world is filled with extraordinary people who simply want to live their lives and see their children live better lives.\" That's his job? Do the American people think otherwise? Does he think he is bravely breaking new ground? George Bush, Condoleezza Rice and countless other leaders offered myriad expressions of that same universalist sentiment. Every president has the right to portray himself as ushering in a new era of this or that. Obama wants to pursue new ties with Muslim nations, drawing on his own identity and associations. Good. But when his self-inflation as redeemer of U.S.-Muslim relations leads him to suggest that pre-Obama America was disrespectful or insensitive or uncaring of Muslims, he is engaging not just in fiction but in gratuitous disparagement of the country he is now privileged to lead. Iran has already responded to the Obama overture. In perfect tune with Obama's defensiveness, President Mahmoud Ahmadinejad declared that better relations might be possible -- after America apologized for 60 years of crimes against Iran. Note the 60 years. The mullahs are as mystified by Obama's pre-1979 (or 1989) good old days as I am.", 
        "intTime": 20090301, 
        "postID": 1, 
        "quote": "", 
        "reply": "I came across this article and wanted to get some opinions. What are your thoughts. I think he makes a good point. Sailor's Mom By Charles Krauthammer, Columnist with Washington Post Friday, January 30, 2009; Page A19 Every new president flatters himself that he, kinder and gentler, is beginning the world anew. Yet, when Barack Obama in his inaugural address reached out to Muslims by saying \"to the Muslim world, we seek a new way forward, based on mutual interest and mutual respect,\" his formulation was needlessly defensive and apologetic. Is it \"new\" to acknowledge Muslim interests and show respect to the Muslim world? Obama doesn't just think so, he said so again to millions in his al-Arabiya interview, insisting on the need to \"restore\" the \"same respect and partnership that America had with the Muslim world as recently as 20 or 30 years ago.\" Astonishing. In these most recent 20 years -- the alleged winter of our disrespect of the Islamic world -- America did not just respect Muslims, it bled for them. It engaged in five military campaigns, every one of which involved -- and resulted in -- the liberation of a Muslim people: Bosnia, Kosovo, Kuwait, Afghanistan and Iraq. The two Balkan interventions -- as well as the failed 1992-93 Somalia intervention to feed starving African Muslims (43 Americans were killed) -- were humanitarian exercises of the highest order, there being no significant U.S. strategic interest at stake. In these 20 years, this nation has done more for suffering and oppressed Muslims than any nation, Muslim or non-Muslim, anywhere on Earth. Why are we apologizing? And what of that happy U.S.-Muslim relationship that Obama imagines existed \"as recently as 20 or 30 years ago\" that he has now come to restore? Thirty years ago, 1979, saw the greatest U.S.-Muslim rupture in our 233-year history: Iran's radical Islamic revolution, the seizure of the U.S. Embassy, the 14 months of America held hostage. Which came just a few years after the Arab oil embargo that sent the United States into a long and punishing recession. Which, in turn, was preceded by the kidnapping and cold-blooded execution by Arab terrorists of the U.S. ambassador in Sudan and his chargé d'affaires. This is to say nothing of the Marine barracks massacre of 1983, and the innumerable attacks on U.S. embassies and installations around the world during what Obama now characterizes as the halcyon days of U.S.-Islamic relations. Look. If Barack Obama wants to say, as he said to al-Arabiya, I have Muslim roots, Muslim family members, have lived in a Muslim country -- implying a special affinity that uniquely positions him to establish good relations -- that's fine. But it is both false and deeply injurious to this country to draw a historical line dividing America under Obama from a benighted past when Islam was supposedly disrespected and demonized. As in Obama's grand admonition: \"We cannot paint with a broad brush a faith as a consequence of the violence that is done in that faith's name.\" Have \"we\" been doing that, smearing Islam because of a small minority? George W. Bush went to the Islamic Center in Washington six days after the Sept. 11 attacks, when the fires of Ground Zero were still smoldering, to declare \"Islam is peace,\" to extend fellowship and friendship to Muslims, to insist that Americans treat them with respect and generosity of spirit. And America listened. In these seven years since Sept. 11 -- seven years during which thousands of Muslims rioted all over the world (resulting in the death of more than 100) to avenge a bunch of cartoons -- there's not been a single anti-Muslim riot in the United States to avenge the massacre of 3,000 innocents. On the contrary. In its aftermath, we elected our first Muslim member of Congress and our first president of Muslim parentage. \"My job,\" says Obama, \"is to communicate to the American people that the Muslim world is filled with extraordinary people who simply want to live their lives and see their children live better lives.\" That's his job? Do the American people think otherwise? Does he think he is bravely breaking new ground? George Bush, Condoleezza Rice and countless other leaders offered myriad expressions of that same universalist sentiment. Every president has the right to portray himself as ushering in a new era of this or that. Obama wants to pursue new ties with Muslim nations, drawing on his own identity and associations. Good. But when his self-inflation as redeemer of U.S.-Muslim relations leads him to suggest that pre-Obama America was disrespectful or insensitive or uncaring of Muslims, he is engaging not just in fiction but in gratuitous disparagement of the country he is now privileged to lead. Iran has already responded to the Obama overture. In perfect tune with Obama's defensiveness, President Mahmoud Ahmadinejad declared that better relations might be possible -- after America apologized for 60 years of crimes against Iran. Note the 60 years. The mullahs are as mystified by Obama's pre-1979 (or 1989) good old days as I am.", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-01 14:55:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "SailorsMom1966"
    }, 
    {
        "content": "Iran isn't something that I lose a lot of sleep over. China is something I am sure that we will have a confrontation someday. What I fear is that the people have lost their sense of liberty. We have two parties that have no regard for the lives and liberties of Americans but have sold their souls to a tiny, belligerent country in the middle east. This doesn't require that we wait for Iran to take over the middle east or for China to build up a fleet: This is happening now! Let the Iranian President and the Mullahs talk. They have no chance of harming us. The Radical Islam that we should worry about is the kind that starts in the prison and on the college campus. Those people have no Islamic tradition and only wear it as a sign of defiance against an imaginary establishment: The Man. What they surely know is that they control the establishment: that is, the government, the media, and the university. Those cowards are a discredit to themselves and their families. We don't need such people. Who we need are all of you misguided patriots out there who clamor for war with Islamic countries. The march of Islam was stopped decisively in two of the greatest battles of western history: Tours and Lepanto. If they ever become strong enough that they may threaten us so, then we will again face them and defeat them on the field of honor. Right now, we have a greater enemy: Those who would trample on our rights as expressed in the Constitution. Obama has continued in the way of Bush before him with an open border policy, and seeks to take away your rights to self-defense. That is what you should worry about - not his middle name \"Hussein\" or his poor dealings with Iranian realpolitik.", 
        "intTime": 20090301, 
        "postID": 2, 
        "quote": "", 
        "reply": "Iran isn't something that I lose a lot of sleep over. China is something I am sure that we will have a confrontation someday. What I fear is that the people have lost their sense of liberty. We have two parties that have no regard for the lives and liberties of Americans but have sold their souls to a tiny, belligerent country in the middle east. This doesn't require that we wait for Iran to take over the middle east or for China to build up a fleet: This is happening now! Let the Iranian President and the Mullahs talk. They have no chance of harming us. The Radical Islam that we should worry about is the kind that starts in the prison and on the college campus. Those people have no Islamic tradition and only wear it as a sign of defiance against an imaginary establishment: The Man. What they surely know is that they control the establishment: that is, the government, the media, and the university. Those cowards are a discredit to themselves and their families. We don't need such people. Who we need are all of you misguided patriots out there who clamor for war with Islamic countries. The march of Islam was stopped decisively in two of the greatest battles of western history: Tours and Lepanto. If they ever become strong enough that they may threaten us so, then we will again face them and defeat them on the field of honor. Right now, we have a greater enemy: Those who would trample on our rights as expressed in the Constitution. Obama has continued in the way of Bush before him with an open border policy, and seeks to take away your rights to self-defense. That is what you should worry about - not his middle name \"Hussein\" or his poor dealings with Iranian realpolitik.", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-01 18:27:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "Sailor's Mom, Our history in Iran and the surrounding region doesn't bear close scrutiny. Sad to say, our hands aren't that clean, and sixty odd years ago, we were right in the thick of things regarding oil-based imperialism. To understand just how ****ed off the Iranians are, you need to review the results of the following actions by the CIA and State Department: We also supported Iraq during the deadly Iran-Iraq war. Iran suffered half a million killed, 1 million casualties in a country of 63 million. In other words one in three men of military age during the conflict were either killed or wounded. Those types of casualties won't be forgotten for a couple of generations. When you add it all up, you have one heck of a reason for their government to dislike, distrust and discredit anything the US does or takes interest in, including our steadfast support of Israel (whom they don't even recognize as a country). I'm not saying they are these events and references are completely accurate. Whether they are or not is really immaterial. The important thing to remember it that their government plays up these events in their propaganda, media and schools. The Iranian public opinion of the US intentions and motivations are consequently somewhat jaded, no matter what our current president says or does. In short, we are and have been considered the enemy of this regime. In many ways, we've earned that title, for good or ill. Overcoming that will take a great deal more that handshakes and promises of peace initiatives. Thrust - the battles of Tours and Lepanto should never be confused as 'the march of Islam.' Neither should they be lumped together in any discussion of relative history. They are completely unrelated. The first, despite the claims of the Franks, was little more than a raid accross the Pyranees. It never was an attempt at conquest. Lepanto was engineered by an entirely different culture, that of the Ottoman Turks. That they were a Muslim country was incidental to both their political and military goals and endeavors. Besides, the real 'defeat' occured some six years before the naval battle, when the Knights of Malta resisted a siege by the Sultan (1565). Once the Holy League was formed based upon that victory, the battle of Lepanto and the subsequent decline of the Ottoman Navy was virtually a foregone conclusion. One of the curiosities of that battle was once it was fought, BOTH sides lost the Mediterranean. The Ottomans never threatened in the same manner even though they rebuilt their navy (too many specialists lost), Venice was all but bankrupt and never again was able to field a navy of any size, Spain was destined to throw their full focus north to the Neatherlands in an unwinnable war and compound their folly with a disasterous naval campaign (The Armada of 1588), and the Papal States begain a slow decline, being trapped both politically and economically int he growing conflict between Spain and France. In short, there were no 'victors' from Lepanto. Absolutely none of the participants were able to recover from the losses or to garner any appreciable advantage from the victory. About all that could be said is that coastal raiding of Christian lands changed from an organized state occupation of the Ottomans to a disorganized commercial occupation of the pirates of the Babary States (which incidentally continued for another two hundred years until the Napoleanic Wars put a stop to it). Sullivan013 MOD HAT ON Hot links deleted. This message has been edited. Last edited by: stillkit, Mon 02 March 2009 08:02 PM", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "", 
        "reply": "Sailor's Mom, Our history in Iran and the surrounding region doesn't bear close scrutiny. Sad to say, our hands aren't that clean, and sixty odd years ago, we were right in the thick of things regarding oil-based imperialism. To understand just how ****ed off the Iranians are, you need to review the results of the following actions by the CIA and State Department: We also supported Iraq during the deadly Iran-Iraq war. Iran suffered half a million killed, 1 million casualties in a country of 63 million. In other words one in three men of military age during the conflict were either killed or wounded. Those types of casualties won't be forgotten for a couple of generations. When you add it all up, you have one heck of a reason for their government to dislike, distrust and discredit anything the US does or takes interest in, including our steadfast support of Israel (whom they don't even recognize as a country). I'm not saying they are these events and references are completely accurate. Whether they are or not is really immaterial. The important thing to remember it that their government plays up these events in their propaganda, media and schools. The Iranian public opinion of the US intentions and motivations are consequently somewhat jaded, no matter what our current president says or does. In short, we are and have been considered the enemy of this regime. In many ways, we've earned that title, for good or ill. Overcoming that will take a great deal more that handshakes and promises of peace initiatives. Thrust - the battles of Tours and Lepanto should never be confused as 'the march of Islam.' Neither should they be lumped together in any discussion of relative history. They are completely unrelated. The first, despite the claims of the Franks, was little more than a raid accross the Pyranees. It never was an attempt at conquest. Lepanto was engineered by an entirely different culture, that of the Ottoman Turks. That they were a Muslim country was incidental to both their political and military goals and endeavors. Besides, the real 'defeat' occured some six years before the naval battle, when the Knights of Malta resisted a siege by the Sultan (1565). Once the Holy League was formed based upon that victory, the battle of Lepanto and the subsequent decline of the Ottoman Navy was virtually a foregone conclusion. One of the curiosities of that battle was once it was fought, BOTH sides lost the Mediterranean. The Ottomans never threatened in the same manner even though they rebuilt their navy (too many specialists lost), Venice was all but bankrupt and never again was able to field a navy of any size, Spain was destined to throw their full focus north to the Neatherlands in an unwinnable war and compound their folly with a disasterous naval campaign (The Armada of 1588), and the Papal States begain a slow decline, being trapped both politically and economically int he growing conflict between Spain and France. In short, there were no 'victors' from Lepanto. Absolutely none of the participants were able to recover from the losses or to garner any appreciable advantage from the victory. About all that could be said is that coastal raiding of Christian lands changed from an organized state occupation of the Ottomans to a disorganized commercial occupation of the pirates of the Babary States (which incidentally continued for another two hundred years until the Napoleanic Wars put a stop to it). Sullivan013 MOD HAT ON Hot links deleted. This message has been edited. Last edited by: stillkit, Mon 02 March 2009 08:02 PM", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-02 08:54:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Thrust - the battles of Tours and Lepanto should never be confused as 'the march of Islam.' Neither should they be lumped together in any discussion of relative history. They are completely unrelated. The first, despite the claims of the Franks, was little more than a raid accross the Pyranees. It never was an attempt at conquest. That is the same argument that Islamic scholars use but I disagree with it entirely. They were on the march in force in Western Europe in the same manner as they had been elsewhere in the world. That they were defeated in decisive battle and retreated across the Pyrenees should illustrate the importance and realism of decisive battle against an overextended force. It proved true enough for the Islamic armies themselves at Yarmuk. Also important to understanding why the battle of France is so important is because Islamic law dictates that they have permanent dominion over anything that they have ever conquered. The various Hispanic kings took centuries to drive them out because of this, while Charles Martel and Charlemagne after him were able to do it largely within their lifetimes. Considering that Charlemagne is the man who, more than any other, preserved Western (Christian) civilization, I think it is fair to say that our civilizations were certainly great rivals at one point. It doesn't need to be embellished: I think our greatest threat is something completely different. On the rise of Venice: Lepanto was the product of their expansion as a Capitalist experiment. Spain's downfall was best described, in my opinion, by Adam Smith. I don't know how you could say that Lepanto wasn't a decisive setback for the Ottoman Empire though. It was the first time that they were decisively engaged and beaten, to never conquer again. Even the battle of Vienna can't rank as high as they retained control over the Balkans for centuries afterwards.", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "Thrust - the battles of Tours and Lepanto should never be confused as 'the march of Islam.' Neither should they be lumped together in any discussion of relative history. They are completely unrelated. The first, despite the claims of the Franks, was little more than a raid accross the Pyranees. It never was an attempt at conquest.", 
        "reply": " That is the same argument that Islamic scholars use but I disagree with it entirely. They were on the march in force in Western Europe in the same manner as they had been elsewhere in the world. That they were defeated in decisive battle and retreated across the Pyrenees should illustrate the importance and realism of decisive battle against an overextended force. It proved true enough for the Islamic armies themselves at Yarmuk. Also important to understanding why the battle of France is so important is because Islamic law dictates that they have permanent dominion over anything that they have ever conquered. The various Hispanic kings took centuries to drive them out because of this, while Charles Martel and Charlemagne after him were able to do it largely within their lifetimes. Considering that Charlemagne is the man who, more than any other, preserved Western (Christian) civilization, I think it is fair to say that our civilizations were certainly great rivals at one point. It doesn't need to be embellished: I think our greatest threat is something completely different. On the rise of Venice: Lepanto was the product of their expansion as a Capitalist experiment. Spain's downfall was best described, in my opinion, by Adam Smith. I don't know how you could say that Lepanto wasn't a decisive setback for the Ottoman Empire though. It was the first time that they were decisively engaged and beaten, to never conquer again. Even the battle of Vienna can't rank as high as they retained control over the Balkans for centuries afterwards.", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-02 13:18:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "You use the word \"They\" to denote two very different cultures separated by nearly 700 years and joined by only the most tenuous link of a common religion (which, after 700 years was a very different animal indeed). It just doesn't work that way. The 8th century Moors and Berber tribesmen of North Africa had an entirely different and distinctive culture from that of the 14th-15th Century Turkish tribes of Central Asia and Anatolia. They neither coordinated nor joined in any manner, other than a very loose collaboration much later in their existence. Even then the link was less substantial than the Ottoman Empire had with ostensibly Christian nations; that of France and Venice for instance. It is an ironic point of fact that the diplomatic and military alliance between the Ottomans and pre-Bourbon France was a far more substantial and real threat to the other \"Christian\" nations of the Mediterranean than that of the Barbary States. Besides, if they were indeed linked as you imply you would think that the Morisco insurrection that the Spanish fought just prior to Lepanto would have been sponsored or even acknowledged by the Ottomans. It wasn't. The Ottomans neither cared nor bothered with any support of their co-religionists in Spain. Ironically, this was stated by the man who ought to know best: Don Juan of Austria, who led both the Hapsburg fight against the Moriscos and was the Holy League's commander at Lepanto. I never said Lepanto wasn't decisive, only that the conditions for success for the Ottomans were incredibly steep. By rights, Ali Pasha should have never fought the encounter, as a tactical withdrawal would have been much better than the strategic defeat they suffered. I seriously doubt if Piale Pasha (his more experienced predecessor) would have made the same mistake. My only point was that for such a overwhelming victory by the Holy League, the spoils weren't all that much. As 'decisive' and dramatic as it seemed at the time, it was in fact only a very marginal victory for each member of the alliance. As the league dissolved almost as soon as the victory was achieved, the result must be viewed in that light. Actually, the first time the Ottomans under Suleiman were decisively 'beaten' was in 1565 at the Siege of Malta. Had the knight's fortresses fallen, it would have meant the Holy League would have lost before it was even formed. As it was, the loss of the cream of the Janissary Corps meant that the next six years were relatively free from any sailing of the Ottoman fleet, even though the fleet itself was still operational. It was after all an amphibious force rather than an exclusively naval fleet. REFERENCE: This amphibious nature of Galley warfare is best described by John Guilmartins' excellent book \"Gunpowder and Galleys\" (I suggest an inter-library loan - the cheapest version I've found was around $90 used on Amazon). Incidentally, the Ottoman's biggest 'setback' in the West might have been the Pyrrhic victory at Mohacs in 1526. What had started as political pressure to exclude Hapsburg influence in the Hungarian succession ended in the unwanted death of the young king (who drowned in the retreat), thereby ensuring the worst case scenario for the Ottomans - a continuous war with the Hapsburg Empire rather than a submissive border state of a cowed but ostensibly independent Hungary. For all their threats and attempts at Vienna, the city was just too far operationally for a pre-Napoleonic army, however well organized the Janissary Corps was at the time. The round trip march time from Adrianople to Vienna meant an inadequate time for reduction of the Viennese fortifications by available siege guns of the time before the onset of fall/winter closed the passes through the Balkans. Surprise was impossible (largely due to the excellent spy network of the Knights of St. John), and an Army of the size needed to take the city was impossible to supply in the field throughout the winter. All in all, the Ottoman threat to Vienna was real, but the war itself was an unwise endeavor that was UNWANTED by the Sultan Suleiman at the time. Taking Vienna was virtually impossible for the Ottomans to accomplish in all but the most favorable conditions. Neither the siege of 1529 (begun too late in the season) nor that of 1683 (begun a year late giving the Viennese 15 months to coordinate a relieving force) were conducted under anything close to favorable conditions. Want to know the real reason behind the decline of the Ottomans? Incredibly, it was due to the singular influence of an obscure Circassian slave girl named 'the laughing one' by her captors. She ended life as the most influential woman of the time, both in real power at the time and the lasting influence as her son's Regent. Without her, the Ottomans were all but unstoppable. After her rise, they never really threatened again. Her actions over the succession of her son is the source of the internal conflict that culminated in the Ottoman Empire becoming the 'Sick Man of Europe' so soon after being the 'Scourge of God'. Look up the name 'Roxelanna.' Fascinating story. Her rise to power may be commemorated by a significant change in the rules for the game of chess. The original Persian game had a queen, but it was just as weak and immobile as the King. After her death, the modern game of chess with the nearly all-powerful queen became popular in Europe. Sullivan013", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "", 
        "reply": "You use the word \"They\" to denote two very different cultures separated by nearly 700 years and joined by only the most tenuous link of a common religion (which, after 700 years was a very different animal indeed). It just doesn't work that way. The 8th century Moors and Berber tribesmen of North Africa had an entirely different and distinctive culture from that of the 14th-15th Century Turkish tribes of Central Asia and Anatolia. They neither coordinated nor joined in any manner, other than a very loose collaboration much later in their existence. Even then the link was less substantial than the Ottoman Empire had with ostensibly Christian nations; that of France and Venice for instance. It is an ironic point of fact that the diplomatic and military alliance between the Ottomans and pre-Bourbon France was a far more substantial and real threat to the other \"Christian\" nations of the Mediterranean than that of the Barbary States. Besides, if they were indeed linked as you imply you would think that the Morisco insurrection that the Spanish fought just prior to Lepanto would have been sponsored or even acknowledged by the Ottomans. It wasn't. The Ottomans neither cared nor bothered with any support of their co-religionists in Spain. Ironically, this was stated by the man who ought to know best: Don Juan of Austria, who led both the Hapsburg fight against the Moriscos and was the Holy League's commander at Lepanto. I never said Lepanto wasn't decisive, only that the conditions for success for the Ottomans were incredibly steep. By rights, Ali Pasha should have never fought the encounter, as a tactical withdrawal would have been much better than the strategic defeat they suffered. I seriously doubt if Piale Pasha (his more experienced predecessor) would have made the same mistake. My only point was that for such a overwhelming victory by the Holy League, the spoils weren't all that much. As 'decisive' and dramatic as it seemed at the time, it was in fact only a very marginal victory for each member of the alliance. As the league dissolved almost as soon as the victory was achieved, the result must be viewed in that light. Actually, the first time the Ottomans under Suleiman were decisively 'beaten' was in 1565 at the Siege of Malta. Had the knight's fortresses fallen, it would have meant the Holy League would have lost before it was even formed. As it was, the loss of the cream of the Janissary Corps meant that the next six years were relatively free from any sailing of the Ottoman fleet, even though the fleet itself was still operational. It was after all an amphibious force rather than an exclusively naval fleet. REFERENCE: This amphibious nature of Galley warfare is best described by John Guilmartins' excellent book \"Gunpowder and Galleys\" (I suggest an inter-library loan - the cheapest version I've found was around $90 used on Amazon). Incidentally, the Ottoman's biggest 'setback' in the West might have been the Pyrrhic victory at Mohacs in 1526. What had started as political pressure to exclude Hapsburg influence in the Hungarian succession ended in the unwanted death of the young king (who drowned in the retreat), thereby ensuring the worst case scenario for the Ottomans - a continuous war with the Hapsburg Empire rather than a submissive border state of a cowed but ostensibly independent Hungary. For all their threats and attempts at Vienna, the city was just too far operationally for a pre-Napoleonic army, however well organized the Janissary Corps was at the time. The round trip march time from Adrianople to Vienna meant an inadequate time for reduction of the Viennese fortifications by available siege guns of the time before the onset of fall/winter closed the passes through the Balkans. Surprise was impossible (largely due to the excellent spy network of the Knights of St. John), and an Army of the size needed to take the city was impossible to supply in the field throughout the winter. All in all, the Ottoman threat to Vienna was real, but the war itself was an unwise endeavor that was UNWANTED by the Sultan Suleiman at the time. Taking Vienna was virtually impossible for the Ottomans to accomplish in all but the most favorable conditions. Neither the siege of 1529 (begun too late in the season) nor that of 1683 (begun a year late giving the Viennese 15 months to coordinate a relieving force) were conducted under anything close to favorable conditions. Want to know the real reason behind the decline of the Ottomans? Incredibly, it was due to the singular influence of an obscure Circassian slave girl named 'the laughing one' by her captors. She ended life as the most influential woman of the time, both in real power at the time and the lasting influence as her son's Regent. Without her, the Ottomans were all but unstoppable. After her rise, they never really threatened again. Her actions over the succession of her son is the source of the internal conflict that culminated in the Ottoman Empire becoming the 'Sick Man of Europe' so soon after being the 'Scourge of God'. Look up the name 'Roxelanna.' Fascinating story. Her rise to power may be commemorated by a significant change in the rules for the game of chess. The original Persian game had a queen, but it was just as weak and immobile as the King. After her death, the modern game of chess with the nearly all-powerful queen became popular in Europe. Sullivan013", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-03 12:22:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "sullivan013"
    }, 
    {
        "content": "What difference does it make which nation or ethnicity it is? Islam has carried the sword against the west under many different nationalities, just as many different Western nations have stood most imminently in the defense of our Civilization. France would be the foremost of these until its Revolution, at which point all of our nations were split apart by ideologies and the Free Christian became the target of ideological demagoguery on an unprecedented scale. That was my original point and I think that it all comes back together nicely: Our main problem isn't Islam. The great Islamic nations haven't threatened us signifigantly for centuries (unless you happen to be an Orthodox Christian, but that's another issue and I think you know where I stand on that). Our greatest threat comes from within. Being distracted with blind allegiance to nothing other than politicians and a rag on a pole is what allowed us to become embroiled in an unnecessary war, no matter how just we may want it to be.....and I truly do hope that Iraq becomes a great Republic that shines like a beacon from the Middle East, despite our bungling and misguided zealotry of the past several years. What is more important is that we reclaim our status of a Republic that is guided by Morality and Reason, and overcome the surge of mindless populism.", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "", 
        "reply": "What difference does it make which nation or ethnicity it is? Islam has carried the sword against the west under many different nationalities, just as many different Western nations have stood most imminently in the defense of our Civilization. France would be the foremost of these until its Revolution, at which point all of our nations were split apart by ideologies and the Free Christian became the target of ideological demagoguery on an unprecedented scale. That was my original point and I think that it all comes back together nicely: Our main problem isn't Islam. The great Islamic nations haven't threatened us signifigantly for centuries (unless you happen to be an Orthodox Christian, but that's another issue and I think you know where I stand on that). Our greatest threat comes from within. Being distracted with blind allegiance to nothing other than politicians and a rag on a pole is what allowed us to become embroiled in an unnecessary war, no matter how just we may want it to be.....and I truly do hope that Iraq becomes a great Republic that shines like a beacon from the Middle East, despite our bungling and misguided zealotry of the past several years. What is more important is that we reclaim our status of a Republic that is guided by Morality and Reason, and overcome the surge of mindless populism.", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-03 16:13:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "France?!! You must be joking. The Ottomans had no better ally than pre-Bourbon, Bourbon and Revolutionary France. That's nearly 300 years of staunch support against the likes of Genoa, Venice, and especially Spain (actually Aragon, but including Castille after the 1490s). Hell, Josephine's (Nappy's first wife) best friend from childhood became the mother of the Sultan! They were friends at a convent in Martinique enroute to France when it was waylaid by pirates. Josephine's family was wealthy enough to ransom her, but not her cousin who eventually was purchased in Constantinople for the Sultan's seraglio. She eventually became a favorite and was known as the Sultana Valida. They regularly traded correspondence and had amazing influence on their husbands. If you want a champion of Christianity against Islam, look no further than Aragon and Castille. The reconquista took nearly 600 years. Even afterwards, Spain waged war against the Moors, the Berbers and the Turks. The greatest contingent of vessels at Lepanto flew the Spanish flag (there was not a single French ship, I might add). From the begining of the Moorish conquest, through the Crusades, the Renaissance and up to the Thirty Year's War (1618-1638), Spain's greatest military deployments were against the followers of Islam. However, that being said, to equate all co-religionists is to miss the most significant motivations and reasons for conflict. For instance, do you equate Irish Catholics with Spanish, French and Italian Catholics? How about Protestants? Are they all the same too? Is a German Lutheran prince from say 1628 motivated by the same influences that a Lutheran King from Sweden, even if they fight on the same side in a war? It's utter nonsense to pretend that is so, as both have significant cultural differences and economic interests. Failing to understand those differences leads one down a difficult path when reading history, as events like the Thirty Years War fail to make any sense. It wasn't just a matter of faith, and neither were the 'battles against Islam' throughout history. If you fail to address all factors, you will badly misinterpret the significance of events and thereby lose whatever understanding that can be gained by a thorough investigation of the subject matter. Sullivan013", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "", 
        "reply": "France?!! You must be joking. The Ottomans had no better ally than pre-Bourbon, Bourbon and Revolutionary France. That's nearly 300 years of staunch support against the likes of Genoa, Venice, and especially Spain (actually Aragon, but including Castille after the 1490s). Hell, Josephine's (Nappy's first wife) best friend from childhood became the mother of the Sultan! They were friends at a convent in Martinique enroute to France when it was waylaid by pirates. Josephine's family was wealthy enough to ransom her, but not her cousin who eventually was purchased in Constantinople for the Sultan's seraglio. She eventually became a favorite and was known as the Sultana Valida. They regularly traded correspondence and had amazing influence on their husbands. If you want a champion of Christianity against Islam, look no further than Aragon and Castille. The reconquista took nearly 600 years. Even afterwards, Spain waged war against the Moors, the Berbers and the Turks. The greatest contingent of vessels at Lepanto flew the Spanish flag (there was not a single French ship, I might add). From the begining of the Moorish conquest, through the Crusades, the Renaissance and up to the Thirty Year's War (1618-1638), Spain's greatest military deployments were against the followers of Islam. However, that being said, to equate all co-religionists is to miss the most significant motivations and reasons for conflict. For instance, do you equate Irish Catholics with Spanish, French and Italian Catholics? How about Protestants? Are they all the same too? Is a German Lutheran prince from say 1628 motivated by the same influences that a Lutheran King from Sweden, even if they fight on the same side in a war? It's utter nonsense to pretend that is so, as both have significant cultural differences and economic interests. Failing to understand those differences leads one down a difficult path when reading history, as events like the Thirty Years War fail to make any sense. It wasn't just a matter of faith, and neither were the 'battles against Islam' throughout history. If you fail to address all factors, you will badly misinterpret the significance of events and thereby lose whatever understanding that can be gained by a thorough investigation of the subject matter. Sullivan013", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-03 20:13:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "sullivan013"
    }, 
    {
        "content": "I wouldn't call the Franco-Ottoman friendship anything more than an anti-Hapsburg collaberation, much to the benefit of the entire world. A lot of the conflict that came after Henry the 4th was of a different and far more drastic nature than the wars that preceded it, but that gets into a whole different subject than the contention between the two great civilizations of Christendom and Dar el Islam. It isn't the battle of Lepanto that would cause me to list France as the champion of Western Civilization. That was the victory of Spain and Genoa, and was but one turning point. France was responsible for the other great battle for the west - Tours - as well as many smaller wars that traversed the civilizations. My list: Tours. We've discussed it already. Charlemagne. Aside from his war with the remnats of Islamic civilization on his side of the Pyrenees, he also formed a great empire which became the foundation for the future of Christian Europe. The Normans. They took civilization to the next level in England (and from there to the rest of Britain and to Ireland) under William the Conquerer. They ejected the Arabs from Sicily and established principalities across the mediterranean. The Crusades. Mostly a French affair. The last Crusade was in the 15th century, and it was under the direction of a French king. Afterwards the wars against Islamic countries were defensive in nature and took place in eastern Europe. After the reformation it matters very much how your personal beliefs affect your judgement, but suffice to say, France pulled the Protestants out of the fire in the Apocalyptic 30 Years War. Sure it had a lot to do with political needs of the time, but it wouldn't have happened had they not already gone through such a war themselves in the prior century. In the end, it was Western Civilization that benefitted from it all. The bloated, decaying Holy Roman Empire was permanently broken and eventually put out of its misery by Napoleon (who also squashed the directorate and aborted such horror for almost a century). France took the side of Liberty against Despotism in our Revolution, and helped secure a definitive victory to follow our victorious land war. The Revolution changed the nature of the world forever but this eventually came to an end, and for most of the 19th century France once more sided against the forces of darkness: Austria-Hungary, the Czar, and Abraham Lincoln. I would say that their track record in defending Western Civilization or advancing its cause is very good. Interpretations as to whether they were right or wrong is another matter. That we have more in common with each other to make us all a part of \"Western Civilization\" should be obvious. The Islamic Civilization is also a great one, but one that is defined by its own laws and similarities, even though they have as many peculiarities amongst themselves as we do. I think nothing illustrates this better than the fact that Lepanto was celebrated even in the Protestant nations.", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "", 
        "reply": "I wouldn't call the Franco-Ottoman friendship anything more than an anti-Hapsburg collaberation, much to the benefit of the entire world. A lot of the conflict that came after Henry the 4th was of a different and far more drastic nature than the wars that preceded it, but that gets into a whole different subject than the contention between the two great civilizations of Christendom and Dar el Islam. It isn't the battle of Lepanto that would cause me to list France as the champion of Western Civilization. That was the victory of Spain and Genoa, and was but one turning point. France was responsible for the other great battle for the west - Tours - as well as many smaller wars that traversed the civilizations. My list: Tours. We've discussed it already. Charlemagne. Aside from his war with the remnats of Islamic civilization on his side of the Pyrenees, he also formed a great empire which became the foundation for the future of Christian Europe. The Normans. They took civilization to the next level in England (and from there to the rest of Britain and to Ireland) under William the Conquerer. They ejected the Arabs from Sicily and established principalities across the mediterranean. The Crusades. Mostly a French affair. The last Crusade was in the 15th century, and it was under the direction of a French king. Afterwards the wars against Islamic countries were defensive in nature and took place in eastern Europe. After the reformation it matters very much how your personal beliefs affect your judgement, but suffice to say, France pulled the Protestants out of the fire in the Apocalyptic 30 Years War. Sure it had a lot to do with political needs of the time, but it wouldn't have happened had they not already gone through such a war themselves in the prior century. In the end, it was Western Civilization that benefitted from it all. The bloated, decaying Holy Roman Empire was permanently broken and eventually put out of its misery by Napoleon (who also squashed the directorate and aborted such horror for almost a century). France took the side of Liberty against Despotism in our Revolution, and helped secure a definitive victory to follow our victorious land war. The Revolution changed the nature of the world forever but this eventually came to an end, and for most of the 19th century France once more sided against the forces of darkness: Austria-Hungary, the Czar, and Abraham Lincoln. I would say that their track record in defending Western Civilization or advancing its cause is very good. Interpretations as to whether they were right or wrong is another matter. That we have more in common with each other to make us all a part of \"Western Civilization\" should be obvious. The Islamic Civilization is also a great one, but one that is defined by its own laws and similarities, even though they have as many peculiarities amongst themselves as we do. I think nothing illustrates this better than the fact that Lepanto was celebrated even in the Protestant nations.", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-03 21:23:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "Before you color the Normans as 'French', and important distinction needs to be made. They were originally \"Norsemen\" - Danes, Swedes and Norwegians. Their nobles may have spoken the language, but their neither the French crown nor the Normans themselves up to and including Richard Coeur-de-Lion thought of themselves as 'French' for several centuries. It wasn't really until the end of the Hundred Year's War (1453) that the province of Normandy was considered part of France by any stretch of the imagination. Re: the Hapsburgs The French alliance with the Ottomans predates the anti-Hapsburg coalition by over a century. The Spanish connection wasn't until the marriage of Phillip the Fair to the daughter of Ferdinand and Isabella (Joanna the Mad) in 1496. Even then, neither she nor her husband actually ruled Spain. Thier son didn't even rule until 1516 (upon the death of Ferdinand). Even if you consider Charles V exclusively a Hapsburg (a mistake, he was part Valois, Aragon and Castillian too), his son Phillip II was Spanish both politically and practically. He may have been born in Aachen, but he lived and died in Madrid, and virtually abdicated any involvement with the Hapsburg family once he became King of Spain in 1527. Since he reigned until 1598, you can't really say that Spain was under 'Hapsburg influence' until well into the 17th century. Re: France in the 30 Year's War Don't know where you get your information. Ever hear of Gustavis Adolphus? He was the Swedish King and it was his involvement that changed the nature of the war and the practice of warfare up to and beyond Napoleon (Nappy listed him as his idol). Both Richelieu and Mazarin were concerned with nothing but the interests of France. Since they were both cardinals of the Catholic Church, I seriously doubt they were motivated by anything more than Realpolitik. Involvement in the war was merely a means to an end. Same for the Bourbon involvement with the rebellion in America. It had nothing to do with the cause of 'Liberty.' Don't take the romaticism of a very young nobleman (Lafayette) to heart. The French crown was ONLY concerned with the interests of France alone. They never gave a rat about us and our cause. Neither did Napoleon, the Bourbon kings who followed him, Napoleon III nor any other French government up to and including the present day. France has always been about France and French interests. If they happened to coincide with our own, it was merely happenstance, and NOT a specific policy of friendship. Their entire involvement in the League of Nations, SEATO, NATO, United Nations and any other international alliance bears this fact out. They have historically been the fly in the ointment and only after their own interests, usually to the detriment of any foreign alliance (De Gaulle's military withdrawal from NATO, SEATO, etc.). As for France of the 19th Century opposing 'the Czar.' Only between the years 1812 and 1870. They were more than happy to ally themselves with Russia once Germany was unified, despite both Alexander II and Nicolas II being far more brutal than the previous two enlightened rulers that France 'opposed' (Alexander I and Nicholas I). I must caution you against romaticism in your study of history. It colors your judgement and leads to misinterpretation of events, nations, motivations and the actions of their rulers. Sullivan013", 
        "intTime": 20090304, 
        "postID": 9, 
        "quote": "", 
        "reply": "Before you color the Normans as 'French', and important distinction needs to be made. They were originally \"Norsemen\" - Danes, Swedes and Norwegians. Their nobles may have spoken the language, but their neither the French crown nor the Normans themselves up to and including Richard Coeur-de-Lion thought of themselves as 'French' for several centuries. It wasn't really until the end of the Hundred Year's War (1453) that the province of Normandy was considered part of France by any stretch of the imagination. Re: the Hapsburgs The French alliance with the Ottomans predates the anti-Hapsburg coalition by over a century. The Spanish connection wasn't until the marriage of Phillip the Fair to the daughter of Ferdinand and Isabella (Joanna the Mad) in 1496. Even then, neither she nor her husband actually ruled Spain. Thier son didn't even rule until 1516 (upon the death of Ferdinand). Even if you consider Charles V exclusively a Hapsburg (a mistake, he was part Valois, Aragon and Castillian too), his son Phillip II was Spanish both politically and practically. He may have been born in Aachen, but he lived and died in Madrid, and virtually abdicated any involvement with the Hapsburg family once he became King of Spain in 1527. Since he reigned until 1598, you can't really say that Spain was under 'Hapsburg influence' until well into the 17th century. Re: France in the 30 Year's War Don't know where you get your information. Ever hear of Gustavis Adolphus? He was the Swedish King and it was his involvement that changed the nature of the war and the practice of warfare up to and beyond Napoleon (Nappy listed him as his idol). Both Richelieu and Mazarin were concerned with nothing but the interests of France. Since they were both cardinals of the Catholic Church, I seriously doubt they were motivated by anything more than Realpolitik. Involvement in the war was merely a means to an end. Same for the Bourbon involvement with the rebellion in America. It had nothing to do with the cause of 'Liberty.' Don't take the romaticism of a very young nobleman (Lafayette) to heart. The French crown was ONLY concerned with the interests of France alone. They never gave a rat about us and our cause. Neither did Napoleon, the Bourbon kings who followed him, Napoleon III nor any other French government up to and including the present day. France has always been about France and French interests. If they happened to coincide with our own, it was merely happenstance, and NOT a specific policy of friendship. Their entire involvement in the League of Nations, SEATO, NATO, United Nations and any other international alliance bears this fact out. They have historically been the fly in the ointment and only after their own interests, usually to the detriment of any foreign alliance (De Gaulle's military withdrawal from NATO, SEATO, etc.). As for France of the 19th Century opposing 'the Czar.' Only between the years 1812 and 1870. They were more than happy to ally themselves with Russia once Germany was unified, despite both Alexander II and Nicolas II being far more brutal than the previous two enlightened rulers that France 'opposed' (Alexander I and Nicholas I). I must caution you against romaticism in your study of history. It colors your judgement and leads to misinterpretation of events, nations, motivations and the actions of their rulers. Sullivan013", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-04 06:04:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "sullivan013"
    }, 
    {
        "content": "Thrust, i must agree with Sullivan. Richelieu aid to protestants was Realpolitik. He as a matter of fact started the \"raison d'etat\"=\"state reasoning\". I have yet to see an article that uses \"ideological reasoning\" rather than the Realpolitik explanation. As far as i know all historians view Cardinal's decision through Realpolitik lenses and not ideological ones.", 
        "intTime": 20090304, 
        "postID": 10, 
        "quote": "", 
        "reply": "Thrust, i must agree with Sullivan. Richelieu aid to protestants was Realpolitik. He as a matter of fact started the \"raison d'etat\"=\"state reasoning\". I have yet to see an article that uses \"ideological reasoning\" rather than the Realpolitik explanation. As far as i know all historians view Cardinal's decision through Realpolitik lenses and not ideological ones.", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-04 06:59:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Gee guys and gals, as far as the last 60 + years of anti American feelings amongst the people of the Middle East, not to diminish the historical facts you related, couldn't our CURRENT support of oppressive monarchies and Israel possibly be related to the CURRENT retaliatory actions of the people of the Middle East? Right NOW, Israel is blockading millions of people into starvation, where the only way they can get FOOD is through tunnels they have been \"illegaly\" digging into Egypt. And after over a YEAR of this, America is just bringing up the concept that this is not so nice. “We have obviously expressed concern about the border crossing,” Mrs. Clinton said after a meeting with the president of the Palestinian Authority, Mahmoud Abbas. “We want humanitarian aid to get into Gaza in sufficient amounts to help alleviate the suffering of the people in Gaza.” Mrs. Clinton also spoke out against Israeli plans to demolish houses belonging to Palestinians in East Jerusalem. She said the orders, issued by the municipal authorities, were “unhelpful” to the peace process. Israelis claim the houses were built illegally, while the Palestinian owners said they were unable to obtain building permits. Israel ordered the demolition of 88 homes last week, and another 55 this week. The dispute has become a microcosm of the larger battle over Jerusalem between Israelis and Palestinians. “It is clearly a matter of deep concern to those who are directly affected,” Mrs. Clinton said. So, you don't have to look too far into the past to find very valid reasons for the people of the Middle East to hate us. You may see TODAY that we are supporting our \"allys\" who are murdering and starving and robbing these people, and only lightly \"expressing concern\". We Americans are being led by politicians being bought by Israeli lobbyists. And if anyone says differently, or starts a conversation AGAINST the Israeli acts of inhumanity to man, they are branded an anti-semite, and relegated to the garbage bin. And, as far as the monarchies in the Middle East, likewise committing atrocities to man, again America is only interested in keeping the flow of their oil constant; rather than do anything about those despots. So, the people of these countries are not very inspired to like us either.... We have acted like this for a LONG time. So we have made a LOT of enemies. The real solution is to STRONGLY SUPPORT justice for these people, instead of supporting their abuse. Until we make THAT sea change, we will continue to make more and more enemies.", 
        "intTime": 20090304, 
        "postID": 11, 
        "quote": "", 
        "reply": "Gee guys and gals, as far as the last 60 + years of anti American feelings amongst the people of the Middle East, not to diminish the historical facts you related, couldn't our CURRENT support of oppressive monarchies and Israel possibly be related to the CURRENT retaliatory actions of the people of the Middle East? Right NOW, Israel is blockading millions of people into starvation, where the only way they can get FOOD is through tunnels they have been \"illegaly\" digging into Egypt. And after over a YEAR of this, America is just bringing up the concept that this is not so nice. “We have obviously expressed concern about the border crossing,” Mrs. Clinton said after a meeting with the president of the Palestinian Authority, Mahmoud Abbas. “We want humanitarian aid to get into Gaza in sufficient amounts to help alleviate the suffering of the people in Gaza.” Mrs. Clinton also spoke out against Israeli plans to demolish houses belonging to Palestinians in East Jerusalem. She said the orders, issued by the municipal authorities, were “unhelpful” to the peace process. Israelis claim the houses were built illegally, while the Palestinian owners said they were unable to obtain building permits. Israel ordered the demolition of 88 homes last week, and another 55 this week. The dispute has become a microcosm of the larger battle over Jerusalem between Israelis and Palestinians. “It is clearly a matter of deep concern to those who are directly affected,” Mrs. Clinton said. So, you don't have to look too far into the past to find very valid reasons for the people of the Middle East to hate us. You may see TODAY that we are supporting our \"allys\" who are murdering and starving and robbing these people, and only lightly \"expressing concern\". We Americans are being led by politicians being bought by Israeli lobbyists. And if anyone says differently, or starts a conversation AGAINST the Israeli acts of inhumanity to man, they are branded an anti-semite, and relegated to the garbage bin. And, as far as the monarchies in the Middle East, likewise committing atrocities to man, again America is only interested in keeping the flow of their oil constant; rather than do anything about those despots. So, the people of these countries are not very inspired to like us either.... We have acted like this for a LONG time. So we have made a LOT of enemies. The real solution is to STRONGLY SUPPORT justice for these people, instead of supporting their abuse. Until we make THAT sea change, we will continue to make more and more enemies.", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-04 09:57:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "DougSabbag"
    }, 
    {
        "content": "quote: Before you color the Normans as 'French', and important distinction needs to be made. They were originally \"Norsemen\" - Danes, Swedes and Norwegians. Their nobles may have spoken the language, but their neither the French crown nor the Normans themselves up to and including Richard Coeur-de-Lion thought of themselves as 'French' for several centuries. It wasn't really until the end of the Hundred Year's War (1453) that the province of Normandy was considered part of France by any stretch of the imagination. I disagree entirely. The Normans may have come from a different genetic stock, but they were as French as anyone ever was. They adopted Christianity and became civilized under the French kings, intermarried, and practiced the style of war that had defined France for centuries at that point. When they conquered England, they changed it's culture permanently to resemble France. Richard I WAS French. His line came from the house of Anjou, he spoke the language, practiced the customs, worshipped the same, and spent most of his life in France. That he was the King of England only shows how dominant France was. quote: They never gave a rat about us and our cause. Neither did Napoleon, the Bourbon kings who followed him, Napoleon III nor any other French government up to and including the present day. I disagree. Napoleon III was nothing if not a man of ideals. He may have failed in the long run, but his actions were those of a statesman who wanted to take part in the affairs of the world and to support the rights of man. His interest in building the Suez canal were not merely to empower France, as they would obviously make Britain that much stronger. He put his hand out like a gentleman only to be treated with condescention time and time again. He actually wrote a book called \"The end of Pauperism\" where he explained how he planned to improve the lot of the common people. We now know that this is hardly ever effective, but it illustrates what kind of man he was. That was far more than his hypocritical critics, such as Victor Hugo, ever did. Certainly Napoleon III had more vision than the fat, lazy Karl Marx ever did.....even though Napoleon had a country to run and Marx was too busy getting sloshed, write ****ty atheist philosophy, and letting his kids at home starve to death. Napoleon III sent us more aid in our struggle against tyranny than any other country, and would have lent us the full might of his army and navy had the British not curtailed him. The Third Republic was right to side with the Czar if only because the new German Empire was twice as strong as France and very willing to use its strength to emphasize the point. I don't know where Nicholas II should carry on in sharing the onus of his predecessors. He was merely ineffectual. It doesn't belie the fact that France had given aid to all who resisted Russia before the end of the Second Empire. I would also add that the Third Republic should indeed be distinguished from all others. It was a radical creature - one which spied on its own officers and recorded how many times they attended Mass. Even Petain was called up on this when he was a young officer. I fear it is the same direction our country is going in now..... quote: Thrust, i must agree with Sullivan. Richelieu aid to protestants was Realpolitik. He as a matter of fact started the \"raison d'etat\"=\"state reasoning\". I have yet to see an article that uses \"ideological reasoning\" rather than the Realpolitik explanation. As far as i know all historians view Cardinal's decision through Realpolitik lenses and not ideological ones. I think it is most obviously as you say. However, Richelieu was a product of his culture, and that was one that know when to lay ideology aside FOR the sake of politics. Had it not been for the terrible French Civil War in the 16th century, the nature of the country may not have been the same. As it happened, France was the first country to move towards what we now call \"freedom of religion,\" because the pain that the country had gone through. That actually should go back to the Cathar Inquisition and even Joan of Arc, since they were the morning star of the reformation. quote: So, you don't have to look too far into the past to find very valid reasons for the people of the Middle East to hate us. You may see TODAY that we are supporting our \"allys\" who are murdering and starving and robbing these people, and only lightly \"expressing concern\". I think that we have been largely blinded by events relating to our relations with the Islamic world and have been unable to distinguish between our true foes and those who are not. I will say that I can't respect Arafat any more than I do any demagogue that rides on a wave of populism. At the same time, how much more terrible he seemed to be in league with the side that blew up our Marine Barracks in 1983. In those circumstances (and coming on the heel of the Iranian Revolution), it was easy to write him off and excuse what Israel (and its allies) had done in Lebanon. So Israel started to get a pass from us in the 1980's. We had been moving towards them since the 1967 war, but it really took off in the 80's. It was in the 80's that the Republican party started to change in character, and by the time of HW Bush, it was the creature that has led us poorly over these past several years. I think that the further we get away from our own roots, the more confused we will be in our foreign policy. The unilateral support for Israel (in its aggressive stature, not its mere existence) is a symptom of America's ills.", 
        "intTime": 20090304, 
        "postID": 12, 
        "quote": "Before you color the Normans as 'French', and important distinction needs to be made. They were originally \"Norsemen\" - Danes, Swedes and Norwegians. Their nobles may have spoken the language, but their neither the French crown nor the Normans themselves up to and including Richard Coeur-de-Lion thought of themselves as 'French' for several centuries. It wasn't really until the end of the Hundred Year's War (1453) that the province of Normandy was considered part of France by any stretch of the imagination.", 
        "reply": " I disagree entirely. The Normans may have come from a different genetic stock, but they were as French as anyone ever was. They adopted Christianity and became civilized under the French kings, intermarried, and practiced the style of war that had defined France for centuries at that point. When they conquered England, they changed it's culture permanently to resemble France. Richard I WAS French. His line came from the house of Anjou, he spoke the language, practiced the customs, worshipped the same, and spent most of his life in France. That he was the King of England only shows how dominant France was. quote: They never gave a rat about us and our cause. Neither did Napoleon, the Bourbon kings who followed him, Napoleon III nor any other French government up to and including the present day. I disagree. Napoleon III was nothing if not a man of ideals. He may have failed in the long run, but his actions were those of a statesman who wanted to take part in the affairs of the world and to support the rights of man. His interest in building the Suez canal were not merely to empower France, as they would obviously make Britain that much stronger. He put his hand out like a gentleman only to be treated with condescention time and time again. He actually wrote a book called \"The end of Pauperism\" where he explained how he planned to improve the lot of the common people. We now know that this is hardly ever effective, but it illustrates what kind of man he was. That was far more than his hypocritical critics, such as Victor Hugo, ever did. Certainly Napoleon III had more vision than the fat, lazy Karl Marx ever did.....even though Napoleon had a country to run and Marx was too busy getting sloshed, write ****ty atheist philosophy, and letting his kids at home starve to death. Napoleon III sent us more aid in our struggle against tyranny than any other country, and would have lent us the full might of his army and navy had the British not curtailed him. The Third Republic was right to side with the Czar if only because the new German Empire was twice as strong as France and very willing to use its strength to emphasize the point. I don't know where Nicholas II should carry on in sharing the onus of his predecessors. He was merely ineffectual. It doesn't belie the fact that France had given aid to all who resisted Russia before the end of the Second Empire. I would also add that the Third Republic should indeed be distinguished from all others. It was a radical creature - one which spied on its own officers and recorded how many times they attended Mass. Even Petain was called up on this when he was a young officer. I fear it is the same direction our country is going in now..... quote: Thrust, i must agree with Sullivan. Richelieu aid to protestants was Realpolitik. He as a matter of fact started the \"raison d'etat\"=\"state reasoning\". I have yet to see an article that uses \"ideological reasoning\" rather than the Realpolitik explanation. As far as i know all historians view Cardinal's decision through Realpolitik lenses and not ideological ones. I think it is most obviously as you say. However, Richelieu was a product of his culture, and that was one that know when to lay ideology aside FOR the sake of politics. Had it not been for the terrible French Civil War in the 16th century, the nature of the country may not have been the same. As it happened, France was the first country to move towards what we now call \"freedom of religion,\" because the pain that the country had gone through. That actually should go back to the Cathar Inquisition and even Joan of Arc, since they were the morning star of the reformation. quote: So, you don't have to look too far into the past to find very valid reasons for the people of the Middle East to hate us. You may see TODAY that we are supporting our \"allys\" who are murdering and starving and robbing these people, and only lightly \"expressing concern\". I think that we have been largely blinded by events relating to our relations with the Islamic world and have been unable to distinguish between our true foes and those who are not. I will say that I can't respect Arafat any more than I do any demagogue that rides on a wave of populism. At the same time, how much more terrible he seemed to be in league with the side that blew up our Marine Barracks in 1983. In those circumstances (and coming on the heel of the Iranian Revolution), it was easy to write him off and excuse what Israel (and its allies) had done in Lebanon. So Israel started to get a pass from us in the 1980's. We had been moving towards them since the 1967 war, but it really took off in the 80's. It was in the 80's that the Republican party started to change in character, and by the time of HW Bush, it was the creature that has led us poorly over these past several years. I think that the further we get away from our own roots, the more confused we will be in our foreign policy. The unilateral support for Israel (in its aggressive stature, not its mere existence) is a symptom of America's ills.", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-04 10:04:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "It is facinating to me that you mention Napoleon III as an idealistic humanist whose sole motivation was his high ideals and willingness to improve the lot of the common folk. Then you mention that his critics were hypocritical. Your logic is unbelievable. This is the man who declared that his Empire was peaceful (\"L'Empire, c'est la paix\"- 1852) and then went on to embroil his country fighting Russia (Crimea- 1854), invading Vietnam (1858-1862), Attacked Austria (1859), attacking China in order to force them to accept Opium (Second Opium War - 1860), attacking Korea (1866), commiting French troops in the intercene fighting in Japan (1867 - Boshin War), and commited French troops to quell a popular uprising of peasents (you know, the ones whose lives he pledged to improve) against a foreign monarchy he himself helped establish in Mexico (Maxmillian, his cousin - 1862-1867). He also dealt underhandedly with BOTH sides of the Italian unification, backstabbing both the Pope and the insurgents whenever it might gain him the slightest fleeting advantage. Then there was the entire Franco-Prussian War where Bismark proved just how idiotic Napoleon III actually was as a statesman. He manipulated elections, used press censorship with abandon, and even went so far as to prevent his own Parliment from even discussing his initiatives, thereby removing ANY opposition from the electorate! He was also one hell of a family man. Despite his professed love for his wife, his social secretary was little more than the man's pimp - arranging for women for his master at ever stop. He fathered several illegitimate children, two by a prison laundress! (Alexandrine Vergeot). How you claim this man was a model of enlightenment and his critics hypocrites is breathtaking in both Francophilia and denial. No wonder your view of France is so slanted. Sullivan013", 
        "intTime": 20090304, 
        "postID": 13, 
        "quote": "", 
        "reply": "It is facinating to me that you mention Napoleon III as an idealistic humanist whose sole motivation was his high ideals and willingness to improve the lot of the common folk. Then you mention that his critics were hypocritical. Your logic is unbelievable. This is the man who declared that his Empire was peaceful (\"L'Empire, c'est la paix\"- 1852) and then went on to embroil his country fighting Russia (Crimea- 1854), invading Vietnam (1858-1862), Attacked Austria (1859), attacking China in order to force them to accept Opium (Second Opium War - 1860), attacking Korea (1866), commiting French troops in the intercene fighting in Japan (1867 - Boshin War), and commited French troops to quell a popular uprising of peasents (you know, the ones whose lives he pledged to improve) against a foreign monarchy he himself helped establish in Mexico (Maxmillian, his cousin - 1862-1867). He also dealt underhandedly with BOTH sides of the Italian unification, backstabbing both the Pope and the insurgents whenever it might gain him the slightest fleeting advantage. Then there was the entire Franco-Prussian War where Bismark proved just how idiotic Napoleon III actually was as a statesman. He manipulated elections, used press censorship with abandon, and even went so far as to prevent his own Parliment from even discussing his initiatives, thereby removing ANY opposition from the electorate! He was also one hell of a family man. Despite his professed love for his wife, his social secretary was little more than the man's pimp - arranging for women for his master at ever stop. He fathered several illegitimate children, two by a prison laundress! (Alexandrine Vergeot). How you claim this man was a model of enlightenment and his critics hypocrites is breathtaking in both Francophilia and denial. No wonder your view of France is so slanted. Sullivan013", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-04 11:49:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "sullivan013"
    }, 
    {
        "content": "His assisting the secession of the Italians from their wretched Austrian overlords is not the same as attacking Austria. But if someone were to attack Austria-Hungary, it wouldn't have been wrong. Napoleon III had his faults but they paled in comparison to the good that he did. Yes he was lustful but so was FDR. Bismarck played him like a fiddle, it is true, but Bismarck's actions cost the world dearly. I don't think that the unification of Germany was a good thing. That is a harder question though. Was Bismarck a proper Machiavellian statesman, or was he a ruthless harbinger of death and suffering in a quest for worldly power (like Lincoln and Lenin, whose actions were similar)? A subject for another thread, perhaps. The Mexican adventure was probably the most moral of all colonial wars. It is sad that the ungrateful and ignorant peasants killed the one ruler they ever had who wanted to help them. \"Wicked barbarians\" indeed, as Winfield Scott put it (if I remember correctly).", 
        "intTime": 20090304, 
        "postID": 14, 
        "quote": "", 
        "reply": "His assisting the secession of the Italians from their wretched Austrian overlords is not the same as attacking Austria. But if someone were to attack Austria-Hungary, it wouldn't have been wrong. Napoleon III had his faults but they paled in comparison to the good that he did. Yes he was lustful but so was FDR. Bismarck played him like a fiddle, it is true, but Bismarck's actions cost the world dearly. I don't think that the unification of Germany was a good thing. That is a harder question though. Was Bismarck a proper Machiavellian statesman, or was he a ruthless harbinger of death and suffering in a quest for worldly power (like Lincoln and Lenin, whose actions were similar)? A subject for another thread, perhaps. The Mexican adventure was probably the most moral of all colonial wars. It is sad that the ungrateful and ignorant peasants killed the one ruler they ever had who wanted to help them. \"Wicked barbarians\" indeed, as Winfield Scott put it (if I remember correctly).", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-04 12:07:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "I spewed my coffee at the thought of 'most moral of all colonial wars.' I guess that's like the most virginal prostitute? Let's just leave it at 'Napoleon III had his faults' and have done. As for Bismark and Germany, Little Willie bears much of the blame for the problems of the Second Reich. He was the one who undid all the carefully managed alliances Otto constructed to balance the power of Europe surrounding Germany. Bismark recognized Frederick the Great's dilemma of a centralized position and engineered a solution to resolve it, only to have it wrecked in less than a decade after his death, all because Whilhelm I wanted to play the sailor and thumb his nose at his uncle and cousin (King Edward of England and Nicholas II of Russia). Sullivan013", 
        "intTime": 20090304, 
        "postID": 15, 
        "quote": "", 
        "reply": "I spewed my coffee at the thought of 'most moral of all colonial wars.' I guess that's like the most virginal prostitute? Let's just leave it at 'Napoleon III had his faults' and have done. As for Bismark and Germany, Little Willie bears much of the blame for the problems of the Second Reich. He was the one who undid all the carefully managed alliances Otto constructed to balance the power of Europe surrounding Germany. Bismark recognized Frederick the Great's dilemma of a centralized position and engineered a solution to resolve it, only to have it wrecked in less than a decade after his death, all because Whilhelm I wanted to play the sailor and thumb his nose at his uncle and cousin (King Edward of England and Nicholas II of Russia). Sullivan013", 
        "threadID": "2341971921_8360016612001", 
        "time": "2009-03-04 20:27:00", 
        "title": "Article - We've Never Been Islam's Enemy", 
        "userID": "sullivan013"
    }
]