[
    {
        "content": "And Israel demonstrates its belief in the adage: \"You can never be too prepared\", especially if war with Iran is a distinct possibility. From the Associated Press: quote: Israel begins its biggest civil defense drill 05/31/2009 | 07:32 PM JERUSALEM – Israel began the biggest civil defense drill in its history on Sunday, putting soldiers, emergency crews, and civilians through rehearsals for the possibility of war at a time of rising tensions with Iran. The five-day drill, code-named Turning Point III, will include simulated rocket and missile attacks on Israeli cities, including preparations for a nonconventional strike. Air-raid sirens are to sound across the country on Tuesday and for the first time, all Israeli civilians will be required to practice taking cover in shelters when the sirens go off. It's the third consecutive year that Israel is holding the exercise, a direct result of its inconclusive 2006 war against Hezbollah guerrillas in Lebanon. During the conflict, the Iranian-backed Hezbollah fired nearly 4,000 rockets into Israel, and civil defense authorities, bomb shelters and air raid alarms were found to be unprepared. Iran's development of long-range missiles, along with international concerns that Iran is developing nuclear weapons, have added to Israeli jitters. While the international community has been seeking a diplomatic solution... (...) \"Our enemies long ago showed they believe that the home front is our Achilles heel,\" he said. \"We are drilling there to prove that it is not.\" - AP", 
        "intTime": 20090531, 
        "postID": 1, 
        "quote": "Israel begins its biggest civil defense drill 05/31/2009 | 07:32 PM JERUSALEM – Israel began the biggest civil defense drill in its history on Sunday, putting soldiers, emergency crews, and civilians through rehearsals for the possibility of war at a time of rising tensions with Iran. The five-day drill, code-named Turning Point III, will include simulated rocket and missile attacks on Israeli cities, including preparations for a nonconventional strike. Air-raid sirens are to sound across the country on Tuesday and for the first time, all Israeli civilians will be required to practice taking cover in shelters when the sirens go off. It's the third consecutive year that Israel is holding the exercise, a direct result of its inconclusive 2006 war against Hezbollah guerrillas in Lebanon. During the conflict, the Iranian-backed Hezbollah fired nearly 4,000 rockets into Israel, and civil defense authorities, bomb shelters and air raid alarms were found to be unprepared. Iran's development of long-range missiles, along with international concerns that Iran is developing nuclear weapons, have added to Israeli jitters. While the international community has been seeking a diplomatic solution... (...) \"Our enemies long ago showed they believe that the home front is our Achilles heel,\" he said. \"We are drilling there to prove that it is not.\" - AP", 
        "reply": "And Israel demonstrates its belief in the adage: \"You can never be too prepared\", especially if war with Iran is a distinct possibility. From the Associated Press: ", 
        "threadID": "2341971921_5710047422001", 
        "time": "2009-05-31 10:15:00", 
        "title": "Israel holds largest ever civil defence drill", 
        "userID": "Canuck_Centaur"
    }
]