[
    {
        "content": "Israel Stance Was Undoing of Nominee for Intelligence Post WASHINGTON — When Dennis C. Blair, the director of national intelligence, announced that he would install Charles W. Freeman Jr. in a top intelligence post, the decision surprised some in the White House who worried that the selection could be controversial and an unnecessary distraction, according to administration officials. Just how controversial the choice would be became clear on Tuesday, when Mr. Freeman, a former ambassador to Saudi Arabia under the first President Bush, angrily withdrew his name from consideration and charged that he had been the victim of a concerted campaign by what he called “the Israel lobby.” Mr. Freeman had long been critical of Israel, with a bluntness that American officials rarely voice in public about a staunch American ally. In 2006, he warned that, “left to its own devices, the Israeli establishment will make decisions that harm Israelis, threaten all associated with them and enrage those who are not.” He did not soften his tone even on Wednesday, saying in an interview that “Israel is driving itself toward a cliff, and it is irresponsible not to question Israeli policy and to decide what is best for the American people.” The critics who led the effort to derail Mr. Freeman argued that such views reflected a bias that could not be tolerated in someone who, as chairman of the National Intelligence Council, would have overseen the production of what are supposed to be policy-neutral intelligence assessments destined for the president’s desk. Some of Mr. Freeman’s defenders say his views on Israel are extreme only when seen through the lens of American political life, and they asked whether it was possible to question American support for Israel without being either muzzled or marginalized. “The reality of Washington is that our political landscape finds it difficult to assimilate any criticism of any segment of the Israeli leadership,” said Robert W. Jordan, who was ambassador to Saudi Arabia from 2001 to 2003. The lobbying campaign against Mr. Freeman included telephone calls to the White House from prominent lawmakers, including Senator Charles E. Schumer, the New York Democrat. Is SENATOR SCHUMER acting as a JEW or an American Senator when he used his position against this person? Obviously he was acting as a Jew FIRST, NOT in the best interests of AMERICA first. It appears to have been kicked off three weeks ago in a blog post by Steven J. Rosen, a former top official of the American Israel Public Affairs Committee, a pro-Israel lobbying group. On the Middle East, Mr. Rosen wrote, Mr. Freeman’s views are “what you would expect in the Saudi Foreign Ministry,” rather than from someone who would become essentially the government’s top intelligence analyst. Because President Obama himself has been viewed with suspicion among many pro-Israel groups, the attacks on Mr. Freeman had the potential to touch a nerve. Many of these groups applauded his appointments of Hillary Rodham Clinton as secretary of state and Dennis B. Ross as a special adviser for Iran and Persian Gulf issues, but remain suspicious of other members of his administration who will be dealing with Arab-Israeli matters. After complaints from some pro-Israel groups during his presidential campaign, Mr. Obama distanced himself from Zbigniew Brzezinski, the national security adviser under President Jimmy Carter, who has sometimes been critical of Israel. So, PRESIDENT OBAMA is being controlled by Jews / Israelis about WHO he can talk with??? If anyone, EVEN an ex national security advisor, has said anything critical about Israel, the Israeli \"lobby\" uses it's over the top power and influence to stifle them!And EVEN the PRESIDENT OF THE UNITED STATES OF AMERICA falls right in line with whatever they say! Disgusting. Five days after Mr. Rosen’s blog item appeared, Senator Schumer telephoned Rahm Emanuel, the White House chief of staff, to ensure that the White House was aware of Mr. Freeman’s past comments about Israel. According to Senator Schumer, his staff then sent the White House copies of the statements. Mr. Schumer said that Mr. Freeman showed an “irrational hatred of Israel” and that his statements were “over the top.” Mr. Freeman said that nobody in the White House ever pressured him to withdraw. He said that he and Mr. Blair had agreed on Tuesday afternoon that he should step aside to avoid any perception of taint to the intelligence assessments he would have overseen at the National Intelligence Council. Hours earlier, Mr. Blair defended Mr. Freeman for his strong views and quick mind, and said he hoped he would challenge an intelligence community that for years had been criticized for group think. In the days after Senator Schumer’s first phone call, other lawmakers and pro-Israel groups began applying pressure on the White House. Representative Steve Israel, a New York Democrat, also called Mr. Emanuel about the pick, and pushed Mr. Blair’s inspector general to examine possible conflicts of interest surrounding Mr. Freeman’s relationships with the Chinese and Saudi governments. “I was prepared to present my case to anyone at the White House who would listen to it,” Representative Israel said. Pro-Israel groups weighed in with lower-ranking White House officials. The Zionist Organization of America sent out an “action alert” urging members to ask Congress for an investigation of Mr. Freeman’s “past and current activities on behalf of the Kingdom of Saudi Arabia.” With opposition to Mr. Freeman mounting, many in the White House were debating the wisdom of the selection, despite Mr. Blair’s public support for him. “In conversations with people associated with this administration, I never detected any enthusiasm for this pick,” said Ira N. Forman, executive director of the National Jewish Democratic Council. Robert Gibbs, the White House spokesman, declined to comment on Wednesday. Before his ambassadorship, Mr. Freeman held a variety of State Department posts. Since leaving government, he has worked with nonprofit groups and on the board of the state-owned China National Offshore Oil Corporation, a past position that his critics said could be a conflict of interest in his new job. As head of the Middle East Policy Council, he was a frequent critic of policy toward Israel. In a speech in 2005 he said that “as long as the United States continues unconditionally to provide the subsidies and political protection that make the Israeli occupation and the high-handed and self-defeating policies it engenders possible, there is little, if any, reason to hope that anything resembling the former peace process can be resurrected.” Critics also unearthed e-mail messages attributed to Mr. Freeman which seemed to support the Tiananmen Square crackdown in 1989, saying that it was not “acceptable for any country to allow the heart of its national capital to be occupied by dissidents intent on disrupting the normal functions of government, however appealing to foreigners their propaganda may be.” Mr. Freeman said Wednesday that the passage was taken out of context, and that he had been describing the dominant view in China after the crackdown. This is an example, which happened TODAY, showing how the Israelis are controlling what the American Government does. The AMERICAN GOVERNMENT! Up to and including even our BRAN NEW PRESIDENT, disgusting, don't YOU think? Israel does not want us to say or do anything which questions their occupation and abuse of the victims of their displacement of the millions of people who are STILL refugees from their own homes. They also don't want us calling them on the carpet for their inhumane treatment of Gaza, with their Gaza blockade pushing the people into starvation, then their military attacks of the CIVILIANS there. These are atrocities being done by the Israelis, with AMERICAN support, because any US politician who dares to question them, is immediately silenced. As an American, I do not like any foreign government controllng OUR GOVERNMENT. How much do you like that? This message has been edited. Last edited by: DougSabbag, Thu 12 March 2009 06:10 AM", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "Israel Stance Was Undoing of Nominee for Intelligence Post WASHINGTON — When Dennis C. Blair, the director of national intelligence, announced that he would install Charles W. Freeman Jr. in a top intelligence post, the decision surprised some in the White House who worried that the selection could be controversial and an unnecessary distraction, according to administration officials. Just how controversial the choice would be became clear on Tuesday, when Mr. Freeman, a former ambassador to Saudi Arabia under the first President Bush, angrily withdrew his name from consideration and charged that he had been the victim of a concerted campaign by what he called “the Israel lobby.” Mr. Freeman had long been critical of Israel, with a bluntness that American officials rarely voice in public about a staunch American ally. In 2006, he warned that, “left to its own devices, the Israeli establishment will make decisions that harm Israelis, threaten all associated with them and enrage those who are not.” He did not soften his tone even on Wednesday, saying in an interview that “Israel is driving itself toward a cliff, and it is irresponsible not to question Israeli policy and to decide what is best for the American people.” The critics who led the effort to derail Mr. Freeman argued that such views reflected a bias that could not be tolerated in someone who, as chairman of the National Intelligence Council, would have overseen the production of what are supposed to be policy-neutral intelligence assessments destined for the president’s desk. Some of Mr. Freeman’s defenders say his views on Israel are extreme only when seen through the lens of American political life, and they asked whether it was possible to question American support for Israel without being either muzzled or marginalized. “The reality of Washington is that our political landscape finds it difficult to assimilate any criticism of any segment of the Israeli leadership,” said Robert W. Jordan, who was ambassador to Saudi Arabia from 2001 to 2003. The lobbying campaign against Mr. Freeman included telephone calls to the White House from prominent lawmakers, including Senator Charles E. Schumer, the New York Democrat. Is SENATOR SCHUMER acting as a JEW or an American Senator when he used his position against this person? Obviously he was acting as a Jew FIRST, NOT in the best interests of AMERICA first. It appears to have been kicked off three weeks ago in a blog post by Steven J. Rosen, a former top official of the American Israel Public Affairs Committee, a pro-Israel lobbying group. On the Middle East, Mr. Rosen wrote, Mr. Freeman’s views are “what you would expect in the Saudi Foreign Ministry,” rather than from someone who would become essentially the government’s top intelligence analyst. Because President Obama himself has been viewed with suspicion among many pro-Israel groups, the attacks on Mr. Freeman had the potential to touch a nerve. Many of these groups applauded his appointments of Hillary Rodham Clinton as secretary of state and Dennis B. Ross as a special adviser for Iran and Persian Gulf issues, but remain suspicious of other members of his administration who will be dealing with Arab-Israeli matters. After complaints from some pro-Israel groups during his presidential campaign, Mr. Obama distanced himself from Zbigniew Brzezinski, the national security adviser under President Jimmy Carter, who has sometimes been critical of Israel. So, PRESIDENT OBAMA is being controlled by Jews / Israelis about WHO he can talk with??? If anyone, EVEN an ex national security advisor, has said anything critical about Israel, the Israeli \"lobby\" uses it's over the top power and influence to stifle them!And EVEN the PRESIDENT OF THE UNITED STATES OF AMERICA falls right in line with whatever they say! Disgusting. Five days after Mr. Rosen’s blog item appeared, Senator Schumer telephoned Rahm Emanuel, the White House chief of staff, to ensure that the White House was aware of Mr. Freeman’s past comments about Israel. According to Senator Schumer, his staff then sent the White House copies of the statements. Mr. Schumer said that Mr. Freeman showed an “irrational hatred of Israel” and that his statements were “over the top.” Mr. Freeman said that nobody in the White House ever pressured him to withdraw. He said that he and Mr. Blair had agreed on Tuesday afternoon that he should step aside to avoid any perception of taint to the intelligence assessments he would have overseen at the National Intelligence Council. Hours earlier, Mr. Blair defended Mr. Freeman for his strong views and quick mind, and said he hoped he would challenge an intelligence community that for years had been criticized for group think. In the days after Senator Schumer’s first phone call, other lawmakers and pro-Israel groups began applying pressure on the White House. Representative Steve Israel, a New York Democrat, also called Mr. Emanuel about the pick, and pushed Mr. Blair’s inspector general to examine possible conflicts of interest surrounding Mr. Freeman’s relationships with the Chinese and Saudi governments. “I was prepared to present my case to anyone at the White House who would listen to it,” Representative Israel said. Pro-Israel groups weighed in with lower-ranking White House officials. The Zionist Organization of America sent out an “action alert” urging members to ask Congress for an investigation of Mr. Freeman’s “past and current activities on behalf of the Kingdom of Saudi Arabia.” With opposition to Mr. Freeman mounting, many in the White House were debating the wisdom of the selection, despite Mr. Blair’s public support for him. “In conversations with people associated with this administration, I never detected any enthusiasm for this pick,” said Ira N. Forman, executive director of the National Jewish Democratic Council. Robert Gibbs, the White House spokesman, declined to comment on Wednesday. Before his ambassadorship, Mr. Freeman held a variety of State Department posts. Since leaving government, he has worked with nonprofit groups and on the board of the state-owned China National Offshore Oil Corporation, a past position that his critics said could be a conflict of interest in his new job. As head of the Middle East Policy Council, he was a frequent critic of policy toward Israel. In a speech in 2005 he said that “as long as the United States continues unconditionally to provide the subsidies and political protection that make the Israeli occupation and the high-handed and self-defeating policies it engenders possible, there is little, if any, reason to hope that anything resembling the former peace process can be resurrected.” Critics also unearthed e-mail messages attributed to Mr. Freeman which seemed to support the Tiananmen Square crackdown in 1989, saying that it was not “acceptable for any country to allow the heart of its national capital to be occupied by dissidents intent on disrupting the normal functions of government, however appealing to foreigners their propaganda may be.” Mr. Freeman said Wednesday that the passage was taken out of context, and that he had been describing the dominant view in China after the crackdown. This is an example, which happened TODAY, showing how the Israelis are controlling what the American Government does. The AMERICAN GOVERNMENT! Up to and including even our BRAN NEW PRESIDENT, disgusting, don't YOU think? Israel does not want us to say or do anything which questions their occupation and abuse of the victims of their displacement of the millions of people who are STILL refugees from their own homes. They also don't want us calling them on the carpet for their inhumane treatment of Gaza, with their Gaza blockade pushing the people into starvation, then their military attacks of the CIVILIANS there. These are atrocities being done by the Israelis, with AMERICAN support, because any US politician who dares to question them, is immediately silenced. As an American, I do not like any foreign government controllng OUR GOVERNMENT. How much do you like that? This message has been edited. Last edited by: DougSabbag, Thu 12 March 2009 06:10 AM", 
        "threadID": "2341971921_8880095712001", 
        "time": "2009-03-11 20:15:00", 
        "title": "Israeli Lobby TRUMPS American interests.", 
        "userID": "DougSabbag"
    }, 
    {
        "content": "You know, DGS, this may actually be one of the few posts that i will agree with you. However, before i will agree, can you post a link that describes Freeman words about Israel? If it was only legitimate critique of Israel, AIPAC stepped over the line.", 
        "intTime": 20090313, 
        "postID": 2, 
        "quote": "", 
        "reply": "You know, DGS, this may actually be one of the few posts that i will agree with you. However, before i will agree, can you post a link that describes Freeman words about Israel? If it was only legitimate critique of Israel, AIPAC stepped over the line.", 
        "threadID": "2341971921_8880095712001", 
        "time": "2009-03-13 12:50:00", 
        "title": "Israeli Lobby TRUMPS American interests.", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: You know, DGS, this may actually be one of the few posts that i will agree with you. However, before i will agree, can you post a link that describes Freeman words about Israel? If it was only legitimate critique of Israel, AIPAC stepped over the line. PZM! This is what I've been harping about for months! The Israeli / Jewish power over American Government, (can do no wrong), even when Israel deserves to be sanctioned. I posted that story from the NY Times. We can't post links here anymore; I thought you knew. As mentioned in this article, Freeman was our Ambassador to Saudi Arabia; so he HAS to be fairly reasonable, considering he is in our diplomatic corp. But the bigger issue is that Israel, or ANY country should be open to debate / review / and even an occasional critique, as EVERY OTHER country is, by America, and our government. We sometimes critique England, France, Germany, etc., etc., but NEVER Israel!? Obviously, this is unacceptable and VERY UNHEALTHY. And THIS IS what I have been pointing out, (or TRYING TO), to everyone willing to read my rhetoric. Then, of course, I point out how MUCH Israel DESERVES to be critiqued if you consider their creation of millions of refugees, etc. ,etc... especially by America the \"home\"? of equality and justice for all...?! But, nobody seems to give a damn. We just shrug, and look away; or people indicate how \"bad\" the \"terrorists\" are... as though that exonerates the displacement, extermination, blockading, bulldozing, etc... by the people of Israel, who should know better than to abuse people especially considering how much the Jews have been abused, historically. As an American, I keep coming back to how disgusting it is that our leaders and our policies are in the Israelis back pocket. WE are supposed to be the SUPER POWER, but this little Israel is leading us around by the nose. DISGUSTING. And it is even more disgusting that AMERICANS don't seem to care. So, what's new with you PZM? :-) My wife and I are doing a \"charter\" tomorrow with our sailboat. This is the FIRST one we've done. We're quite glad to have some business!", 
        "intTime": 20090313, 
        "postID": 3, 
        "quote": "Originally posted by PanzerMeister: You know, DGS, this may actually be one of the few posts that i will agree with you. However, before i will agree, can you post a link that describes Freeman words about Israel? If it was only legitimate critique of Israel, AIPAC stepped over the line.", 
        "reply": " PZM! This is what I've been harping about for months! The Israeli / Jewish power over American Government, (can do no wrong), even when Israel deserves to be sanctioned. I posted that story from the NY Times. We can't post links here anymore; I thought you knew. As mentioned in this article, Freeman was our Ambassador to Saudi Arabia; so he HAS to be fairly reasonable, considering he is in our diplomatic corp. But the bigger issue is that Israel, or ANY country should be open to debate / review / and even an occasional critique, as EVERY OTHER country is, by America, and our government. We sometimes critique England, France, Germany, etc., etc., but NEVER Israel!? Obviously, this is unacceptable and VERY UNHEALTHY. And THIS IS what I have been pointing out, (or TRYING TO), to everyone willing to read my rhetoric. Then, of course, I point out how MUCH Israel DESERVES to be critiqued if you consider their creation of millions of refugees, etc. ,etc... especially by America the \"home\"? of equality and justice for all...?! But, nobody seems to give a damn. We just shrug, and look away; or people indicate how \"bad\" the \"terrorists\" are... as though that exonerates the displacement, extermination, blockading, bulldozing, etc... by the people of Israel, who should know better than to abuse people especially considering how much the Jews have been abused, historically. As an American, I keep coming back to how disgusting it is that our leaders and our policies are in the Israelis back pocket. WE are supposed to be the SUPER POWER, but this little Israel is leading us around by the nose. DISGUSTING. And it is even more disgusting that AMERICANS don't seem to care. So, what's new with you PZM? :-) My wife and I are doing a \"charter\" tomorrow with our sailboat. This is the FIRST one we've done. We're quite glad to have some business!", 
        "threadID": "2341971921_8880095712001", 
        "time": "2009-03-13 22:13:00", 
        "title": "Israeli Lobby TRUMPS American interests.", 
        "userID": "DougSabbag"
    }, 
    {
        "content": "You can post links, just not direct links. I will simply copy paste it in my browser. For example \"http://www.yahoo.com/\". Such link is allowed. There is nothing new with me. Still in the university, and in my home doing Home work. Congratulations on your first charter sail.", 
        "intTime": 20090314, 
        "postID": 4, 
        "quote": "", 
        "reply": "You can post links, just not direct links. I will simply copy paste it in my browser. For example \"http://www.yahoo.com/\". Such link is allowed. There is nothing new with me. Still in the university, and in my home doing Home work. Congratulations on your first charter sail.", 
        "threadID": "2341971921_8880095712001", 
        "time": "2009-03-14 06:18:00", 
        "title": "Israeli Lobby TRUMPS American interests.", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: You can post links, just not direct links. I will simply copy paste it in my browser. For example \"http://www.yahoo.com/\". Such link is allowed. There is nothing new with me. Still in the university, and in my home doing Home work. Congratulations on your first charter sail. Thanks for the congrats... Right now, we are at anchor, after dinner, and so far the charter guests seem quite pleased with the sailing and the food.... luckily my wife is an excellent cook! We were also lucky with the wind we recieved today, a perfect amount, i.e., 10 - 15 knots. So the sailing was picture perfect. Tomorrow we will provide breakfast at anchor, then set sail for the day, and after lunch, return to our slip, where the guests charter will be over. Then we are doing a \"sunset cruise\" tomorrow, which is taking a couple to a pretty cove, drop anchor, provide a surf & turf dinner, then bring them back to the slip. So our new business is suddenly nicely busy. :-) I hope your schooling continues well.", 
        "intTime": 20090314, 
        "postID": 5, 
        "quote": "Originally posted by PanzerMeister: You can post links, just not direct links. I will simply copy paste it in my browser. For example \"http://www.yahoo.com/\". Such link is allowed. There is nothing new with me. Still in the university, and in my home doing Home work. Congratulations on your first charter sail.", 
        "reply": " Thanks for the congrats... Right now, we are at anchor, after dinner, and so far the charter guests seem quite pleased with the sailing and the food.... luckily my wife is an excellent cook! We were also lucky with the wind we recieved today, a perfect amount, i.e., 10 - 15 knots. So the sailing was picture perfect. Tomorrow we will provide breakfast at anchor, then set sail for the day, and after lunch, return to our slip, where the guests charter will be over. Then we are doing a \"sunset cruise\" tomorrow, which is taking a couple to a pretty cove, drop anchor, provide a surf & turf dinner, then bring them back to the slip. So our new business is suddenly nicely busy. :-) I hope your schooling continues well.", 
        "threadID": "2341971921_8880095712001", 
        "time": "2009-03-14 18:48:00", 
        "title": "Israeli Lobby TRUMPS American interests.", 
        "userID": "DougSabbag"
    }, 
    {
        "content": "How can AMERICA be blindly supportive of this: JERUSALEM — The Israeli military said on Thursday that it would investigate accounts by Israeli soldiers published in the newspaper Haaretz describing the killing of Palestinian civilians under “permissive rules of engagement” during the recent 22-day military offensive in Gaza. In one of the accounts, an infantry squad leader described an episode in which an army sharpshooter mistakenly shot a Palestinian mother and her two children. And this is just the tip of the iceburg! “There was a house with a family inside,” the squad leader said. Like others quoted in the Haaretz report, he was not identified by name. “We put them in a room. Later we left the house and another platoon entered it, and a few days after that, there was an order to release the family.” According to Haaretz, the soldier continued: “There was a sniper position on the roof. The platoon commander let the family go and told them to go to the right. One mother and her two children didn’t understand and went to the left, but they forgot to tell the sharpshooter on the roof they had let them go and it was O.K., and he should hold his fire and he... he did what he was supposed to, like he was following his orders.” How is it \"within his orders\" to EVER SHOOT A WOMAN AND HER CHILDREN???? The soldier was quoted as saying: “The sharpshooter saw a woman and children approaching him, closer than the lines he was told no one should pass. He shot them straight away. In any case, what happened is that in the end he killed them.” So, the rough tough Israeli Army was frightened by a woman and her children? I thought the mission was to stop missiles from being fired into Israel? Does killing women and children strike ANYONE as the way to accomplish that? Assuming the missiles are being fired into Israel because of years / decades of unfair treatment and occupation, would killing MORE civilians strike you as being a way to stop that hatred and retribution? Another squad leader from the same brigade told of an episode in which the company commander ordered that an elderly Palestinian woman be shot and killed; she was walking on a road about 100 yards from a house the company had commandeered, the newspaper said. Again, the Israeli Army just HAD to shoot an elderly woman to save itself from a possible attack from her??? The Israeli military said that the Criminal Investigation Division of the military police would investigate the assertions. Sure, and like the millions of other Israeli atrocities against their victims, NO changes will be made. Is it any surprise the people being slaughtered fight back anyway they can? Some 1,300 Palestinians were killed during the Israeli offensive in Gaza, which is ruled by the Islamic militant group Hamas. The Gaza-based Palestinian Center for Human Rights said that almost 900 were civilians and the rest combatants, but the Israeli military put the ratio of civilians killed at no more than a third. Is one third of the people killed being CIVILIANS acceptable??? The Haaretz article has caused a stir in Israel, where many people strongly supported the Gaza offensive, generally dismissing international criticism of the army’s conduct there and accepting repeated statements from the military that it was acting with great care to avoid harming Palestinian civilians. Haaretz said it would print more testimony by soldiers on Friday. \"GREAT CARE TO AVOID HARMING PALESTINIAN CIVILIANS\" ?? So, killing thousands of them is the result of that \"great care\"? Israel said its Gaza campaign was primarily aimed at preventing indiscriminate rocket fire from the area against southern Israeli towns and cities. Ten Israeli soldiers and three Israeli civilians were also killed during the campaign. And yet, after these atrocities and inhumane treatment of civilians, AMERICA is still being BOUGHT by the Israeli / Jewish lobbiests to blindly support Israel!? Where are our AMERICAN PRINCIPLES? Where is our belief in EQUAL justice for ALL? Where is our traditional support of oppressed people by a government? HOW CAN AMERICAN POLITICIANS SUPPORT THIS ??? And how can AMERICANS continue to support politicians who by supporting the murder of civilians cause millions of people to hate US? Thereby continuing the \"war on terrorism\"??", 
        "intTime": 20090319, 
        "postID": 6, 
        "quote": "", 
        "reply": "How can AMERICA be blindly supportive of this: JERUSALEM — The Israeli military said on Thursday that it would investigate accounts by Israeli soldiers published in the newspaper Haaretz describing the killing of Palestinian civilians under “permissive rules of engagement” during the recent 22-day military offensive in Gaza. In one of the accounts, an infantry squad leader described an episode in which an army sharpshooter mistakenly shot a Palestinian mother and her two children. And this is just the tip of the iceburg! “There was a house with a family inside,” the squad leader said. Like others quoted in the Haaretz report, he was not identified by name. “We put them in a room. Later we left the house and another platoon entered it, and a few days after that, there was an order to release the family.” According to Haaretz, the soldier continued: “There was a sniper position on the roof. The platoon commander let the family go and told them to go to the right. One mother and her two children didn’t understand and went to the left, but they forgot to tell the sharpshooter on the roof they had let them go and it was O.K., and he should hold his fire and he... he did what he was supposed to, like he was following his orders.” How is it \"within his orders\" to EVER SHOOT A WOMAN AND HER CHILDREN???? The soldier was quoted as saying: “The sharpshooter saw a woman and children approaching him, closer than the lines he was told no one should pass. He shot them straight away. In any case, what happened is that in the end he killed them.” So, the rough tough Israeli Army was frightened by a woman and her children? I thought the mission was to stop missiles from being fired into Israel? Does killing women and children strike ANYONE as the way to accomplish that? Assuming the missiles are being fired into Israel because of years / decades of unfair treatment and occupation, would killing MORE civilians strike you as being a way to stop that hatred and retribution? Another squad leader from the same brigade told of an episode in which the company commander ordered that an elderly Palestinian woman be shot and killed; she was walking on a road about 100 yards from a house the company had commandeered, the newspaper said. Again, the Israeli Army just HAD to shoot an elderly woman to save itself from a possible attack from her??? The Israeli military said that the Criminal Investigation Division of the military police would investigate the assertions. Sure, and like the millions of other Israeli atrocities against their victims, NO changes will be made. Is it any surprise the people being slaughtered fight back anyway they can? Some 1,300 Palestinians were killed during the Israeli offensive in Gaza, which is ruled by the Islamic militant group Hamas. The Gaza-based Palestinian Center for Human Rights said that almost 900 were civilians and the rest combatants, but the Israeli military put the ratio of civilians killed at no more than a third. Is one third of the people killed being CIVILIANS acceptable??? The Haaretz article has caused a stir in Israel, where many people strongly supported the Gaza offensive, generally dismissing international criticism of the army’s conduct there and accepting repeated statements from the military that it was acting with great care to avoid harming Palestinian civilians. Haaretz said it would print more testimony by soldiers on Friday. \"GREAT CARE TO AVOID HARMING PALESTINIAN CIVILIANS\" ?? So, killing thousands of them is the result of that \"great care\"? Israel said its Gaza campaign was primarily aimed at preventing indiscriminate rocket fire from the area against southern Israeli towns and cities. Ten Israeli soldiers and three Israeli civilians were also killed during the campaign. And yet, after these atrocities and inhumane treatment of civilians, AMERICA is still being BOUGHT by the Israeli / Jewish lobbiests to blindly support Israel!? Where are our AMERICAN PRINCIPLES? Where is our belief in EQUAL justice for ALL? Where is our traditional support of oppressed people by a government? HOW CAN AMERICAN POLITICIANS SUPPORT THIS ??? And how can AMERICANS continue to support politicians who by supporting the murder of civilians cause millions of people to hate US? Thereby continuing the \"war on terrorism\"??", 
        "threadID": "2341971921_8880095712001", 
        "time": "2009-03-19 12:10:00", 
        "title": "Israeli Lobby TRUMPS American interests.", 
        "userID": "DougSabbag"
    }
]