[
    {
        "content": "quote: Originally posted by DougSabbag: OK, so our founding fathers only wished the best for Jews in America. And coupled with the American principles and laws, Jews have enjoyed all the benefits and opportunities of our Justice for ALL laws and policies. Very good. So, assuming you agree that this has been a good thing, and has allowed jews to prosper very well in America, why won't the Jews pass these same principles, and laws on to ALL the citizens and REFUGEES of Israel? You enjoy it here, yet use the power and money from here to support your occupation and oppression of others in the Middle East. Do you ever, in your wildest dreams, think our founding fathers would support this misuse of American support? I am SURE our founding fathers would much rather that the American principles and laws enjoyed by Jews here, would be exported and shared elsewhere, as in Israel. You really should not have brought up our founding fathers in relation to Jews unless you plan to apologize for the misuse of the power and gains Jews have accomplished here within our society of justice for all, toward the non-Jews / refugees of their stolen land, called Israel. I am sure, if our founding fathers knew how Jews have applied what they have earned given our equality under the law, here, to the destruction of millions of people over there, they would be disgusted. All I know, Dougie, is our founding fathers were very worried that Arab Muslims may eventually move to America. Their worries were very legitimate. You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. It's something we should all be aware of, but I understand why the government kept it secret b/c we do have nuts here to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings.", 
        "intTime": 20090321, 
        "postID": 10, 
        "quote": "Originally posted by DougSabbag: OK, so our founding fathers only wished the best for Jews in America. And coupled with the American principles and laws, Jews have enjoyed all the benefits and opportunities of our Justice for ALL laws and policies. Very good. So, assuming you agree that this has been a good thing, and has allowed jews to prosper very well in America, why won't the Jews pass these same principles, and laws on to ALL the citizens and REFUGEES of Israel? You enjoy it here, yet use the power and money from here to support your occupation and oppression of others in the Middle East. Do you ever, in your wildest dreams, think our founding fathers would support this misuse of American support? I am SURE our founding fathers would much rather that the American principles and laws enjoyed by Jews here, would be exported and shared elsewhere, as in Israel. You really should not have brought up our founding fathers in relation to Jews unless you plan to apologize for the misuse of the power and gains Jews have accomplished here within our society of justice for all, toward the non-Jews / refugees of their stolen land, called Israel. I am sure, if our founding fathers knew how Jews have applied what they have earned given our equality under the law, here, to the destruction of millions of people over there, they would be disgusted.", 
        "reply": " All I know, Dougie, is our founding fathers were very worried that Arab Muslims may eventually move to America. Their worries were very legitimate. You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. It's something we should all be aware of, but I understand why the government kept it secret b/c we do have nuts here to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings.", 
        "threadID": "2341971921_5480063312001", 
        "time": "2009-03-21 09:42:00", 
        "title": "Examples of Muslims/Nazi Propaganda/lies", 
        "userID": "DStambaugh"
    }, 
    {
        "content": "quote: Originally posted by DStambaugh: All I know, Doug, is our founding fathers were very worried that Arab Muslims may eventually move to America. Is that so? Nevertheless, they did not abuse them in America, instead OUR founding fathers created a country where EVERYONE has to abide by the SAME LAWS and JUSTICE FOR ALL is the prime directive. Thus, American Arabs prosper and live in peace in America, very well. So, whoever amongst the \"founding fathers\" that you believe was so worried about Arabs has obviously been relieved of any concerns. You might note the MANY prosperous successful American Arabs, including US Senators, like George Mitchell. Their worries were very legitimate. Though they did not codify any of your supposed \"concerns\". Instead they created laws based upon FREEDOM AND JUSTICE FOR ALL. And thus we do not have any violence and conflict like in Israel where there is NOT Justice for ALL. Israel could learn a LOT from American policies.You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. No, you are NOT right about them. They are PEOPLE, and people should not be treated with bigotry and prejudice. Welcome to AMERICA. There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. Well, without any doubt, American civilians are the most armed people in the world.... remember the founding fathers(?), they gave Americans the right to arm themselves. And obviously those armed people were not using their weapons to kill people. Unlike the Israelis.It's something we should all be aware of, And do what ???? Would you suggest not allowing a specific ethnic group of Americans not to have the same rights as others??? THIS IS AMERICA, YOU CAN NOT DO THAT HERE.but I understand why the government kept it secret b/c we do have nuts here like who?to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. No, they didn't \"go public\" with that because: ALL AMERICANS have the right to bear arms. So it isn't just Arab Americans who have weapons. You are sounding like a paranoid bigoted right wing dangerous person, screaming that we should be worried because the people YOU most fear have weapons. Again, you can NOT do that HERE, this is AMERICA. Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side NO THEY WOULD NOT, because those gentlemen created the laws of JUSTICE FOR ALL, which apply to Arab Americans, African Americans, Jewish Americans, Russian Americans, German Americans, Japanese Americans, etc., etc., regardless of the fact that America has even had WARS with some of those countries. So STOP PUTTING WORDS IN OUR FORE FATHERS MOUTHS, that they did NOT codify into AMERICAN LAWS. in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings. There have been many groups fighting for world domination, i.e., Egyptians, Greeks, Romans, British, Germans, etc. So, stop the bigoted statements against an entire ethnic group because of some history unless you are going to also point your finger at ALL the groups who have fought for world domination; or had wars / battles with America. It is a LONG list. This message has been edited. Last edited by: DougSabbag, Sat 21 March 2009 03:47 PM", 
        "intTime": 20090321, 
        "postID": 11, 
        "quote": "Originally posted by DStambaugh: All I know, Doug, is our founding fathers were very worried that Arab Muslims may eventually move to America. Is that so? Nevertheless, they did not abuse them in America, instead OUR founding fathers created a country where EVERYONE has to abide by the SAME LAWS and JUSTICE FOR ALL is the prime directive. Thus, American Arabs prosper and live in peace in America, very well. So, whoever amongst the \"founding fathers\" that you believe was so worried about Arabs has obviously been relieved of any concerns. You might note the MANY prosperous successful American Arabs, including US Senators, like George Mitchell. Their worries were very legitimate. Though they did not codify any of your supposed \"concerns\". Instead they created laws based upon FREEDOM AND JUSTICE FOR ALL. And thus we do not have any violence and conflict like in Israel where there is NOT Justice for ALL. Israel could learn a LOT from American policies.You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. No, you are NOT right about them. They are PEOPLE, and people should not be treated with bigotry and prejudice. Welcome to AMERICA. There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. Well, without any doubt, American civilians are the most armed people in the world.... remember the founding fathers(?), they gave Americans the right to arm themselves. And obviously those armed people were not using their weapons to kill people. Unlike the Israelis.It's something we should all be aware of, And do what ???? Would you suggest not allowing a specific ethnic group of Americans not to have the same rights as others??? THIS IS AMERICA, YOU CAN NOT DO THAT HERE.but I understand why the government kept it secret b/c we do have nuts here like who?to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. No, they didn't \"go public\" with that because: ALL AMERICANS have the right to bear arms. So it isn't just Arab Americans who have weapons. You are sounding like a paranoid bigoted right wing dangerous person, screaming that we should be worried because the people YOU most fear have weapons. Again, you can NOT do that HERE, this is AMERICA. Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side NO THEY WOULD NOT, because those gentlemen created the laws of JUSTICE FOR ALL, which apply to Arab Americans, African Americans, Jewish Americans, Russian Americans, German Americans, Japanese Americans, etc., etc., regardless of the fact that America has even had WARS with some of those countries. So STOP PUTTING WORDS IN OUR FORE FATHERS MOUTHS, that they did NOT codify into AMERICAN LAWS. in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings. There have been many groups fighting for world domination, i.e., Egyptians, Greeks, Romans, British, Germans, etc. So, stop the bigoted statements against an entire ethnic group because of some history unless you are going to also point your finger at ALL the groups who have fought for world domination; or had wars / battles with America. It is a LONG list.", 
        "reply": " This message has been edited. Last edited by: DougSabbag, Sat 21 March 2009 03:47 PM", 
        "threadID": "2341971921_5480063312001", 
        "time": "2009-03-21 15:31:00", 
        "title": "Examples of Muslims/Nazi Propaganda/lies", 
        "userID": "DougSabbag"
    }, 
    {
        "content": "quote: Originally posted by DougSabbag: quote: Originally posted by DStambaugh: All I know, Doug, is our founding fathers were very worried that Arab Muslims may eventually move to America. Is that so? Nevertheless, they did not abuse them in America, instead OUR founding fathers created a country where EVERYONE has to abide by the SAME LAWS and JUSTICE FOR ALL is the prime directive. Thus, American Arabs prosper and live in peace in America, very well. So, whoever amongst the \"founding fathers\" that you believe was so worried about Arabs has obviously been relieved of any concerns. You might note the MANY prosperous successful American Arabs, including US Senators, like George Mitchell. Their worries were very legitimate. Though they did not codify any of your supposed \"concerns\". Instead they created laws based upon FREEDOM AND JUSTICE FOR ALL. And thus we do not have any violence and conflict like in Israel where there is NOT Justice for ALL. Israel could learn a LOT from American policies.You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. No, you are NOT right about them. They are PEOPLE, and people should not be treated with bigotry and prejudice. Welcome to AMERICA. There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. Well, without any doubt, American civilians are the most armed people in the world.... remember the founding fathers(?), they gave Americans the right to arm themselves. And obviously those armed people were not using their weapons to kill people. Unlike the Israelis.It's something we should all be aware of, And do what ???? Would you suggest not allowing a specific ethnic group of Americans not to have the same rights as others??? THIS IS AMERICA, YOU CAN NOT DO THAT HERE.but I understand why the government kept it secret b/c we do have nuts here like who?to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. No, they didn't \"go public\" with that because: ALL AMERICANS have the right to bear arms. So it isn't just Arab Americans who have weapons. You are sounding like a paranoid bigoted right wing dangerous person, screaming that we should be worried because the people YOU most fear have weapons. Again, you can NOT do that HERE, this is AMERICA. Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side NO THEY WOULD NOT, because those gentlemen created the laws of JUSTICE FOR ALL, which apply to Arab Americans, African Americans, Jewish Americans, Russian Americans, German Americans, Japanese Americans, etc., etc., regardless of the fact that America has even had WARS with some of those countries. So STOP PUTTING WORDS IN OUR FORE FATHERS MOUTHS, that they did NOT codify into AMERICAN LAWS. in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings. There have been many groups fighting for world domination, i.e., Egyptians, Greeks, Romans, British, Germans, etc. So, stop the bigoted statements against an entire ethnic group because of some history unless you are going to also point your finger at ALL the groups who have fought for world domination; or had wars / battles with America. It is a LONG list. Good comeback Doug. Very interesting read....", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "Originally posted by DougSabbag: quote: Originally posted by DStambaugh: All I know, Doug, is our founding fathers were very worried that Arab Muslims may eventually move to America. Is that so? Nevertheless, they did not abuse them in America, instead OUR founding fathers created a country where EVERYONE has to abide by the SAME LAWS and JUSTICE FOR ALL is the prime directive. Thus, American Arabs prosper and live in peace in America, very well. So, whoever amongst the \"founding fathers\" that you believe was so worried about Arabs has obviously been relieved of any concerns. You might note the MANY prosperous successful American Arabs, including US Senators, like George Mitchell. Their worries were very legitimate. Though they did not codify any of your supposed \"concerns\". Instead they created laws based upon FREEDOM AND JUSTICE FOR ALL. And thus we do not have any violence and conflict like in Israel where there is NOT Justice for ALL. Israel could learn a LOT from American policies.You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. No, you are NOT right about them. They are PEOPLE, and people should not be treated with bigotry and prejudice. Welcome to AMERICA. There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. Well, without any doubt, American civilians are the most armed people in the world.... remember the founding fathers(?), they gave Americans the right to arm themselves. And obviously those armed people were not using their weapons to kill people. Unlike the Israelis.It's something we should all be aware of, And do what ???? Would you suggest not allowing a specific ethnic group of Americans not to have the same rights as others??? THIS IS AMERICA, YOU CAN NOT DO THAT HERE.but I understand why the government kept it secret b/c we do have nuts here like who?to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. No, they didn't \"go public\" with that because: ALL AMERICANS have the right to bear arms. So it isn't just Arab Americans who have weapons. You are sounding like a paranoid bigoted right wing dangerous person, screaming that we should be worried because the people YOU most fear have weapons. Again, you can NOT do that HERE, this is AMERICA. Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side NO THEY WOULD NOT, because those gentlemen created the laws of JUSTICE FOR ALL, which apply to Arab Americans, African Americans, Jewish Americans, Russian Americans, German Americans, Japanese Americans, etc., etc., regardless of the fact that America has even had WARS with some of those countries. So STOP PUTTING WORDS IN OUR FORE FATHERS MOUTHS, that they did NOT codify into AMERICAN LAWS. in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings. There have been many groups fighting for world domination, i.e., Egyptians, Greeks, Romans, British, Germans, etc. So, stop the bigoted statements against an entire ethnic group because of some history unless you are going to also point your finger at ALL the groups who have fought for world domination; or had wars / battles with America. It is a LONG list.", 
        "reply": " Good comeback Doug. Very interesting read....", 
        "threadID": "2341971921_5480063312001", 
        "time": "2009-03-22 03:02:00", 
        "title": "Examples of Muslims/Nazi Propaganda/lies", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by DougSabbag: quote: Originally posted by DStambaugh: All I know, Doug, is our founding fathers were very worried that Arab Muslims may eventually move to America. Is that so? Nevertheless, they did not abuse them in America, instead OUR founding fathers created a country where EVERYONE has to abide by the SAME LAWS and JUSTICE FOR ALL is the prime directive. [COLOR:BLACK]Except the U.S. government when dealing with Native Americans. Thus, American Arabs prosper and live in peace in America, very well. But Not the Native American. So, whoever amongst the \"founding fathers\" that you believe was so worried about Arabs has obviously been relieved of any concerns. You might note the MANY prosperous successful American Arabs, including US Senators, like George Mitchell. [/color]Their worries were very legitimate. Though they did not codify any of your supposed \"concerns\". Instead they created laws based upon FREEDOM AND JUSTICE FOR ALL. [COLOR:BLACK]Except the Native American And thus we do not have any violence and conflict like in Israel where there is NOT Justice for ALL. Israel could learn a LOT from American policies.[/color]You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. No, you are NOT right about them. They are PEOPLE, and people should not be treated with bigotry and prejudice. [COLOR:BLACK]Yet people like You D.S. still treat people like that. Welcome to AMERICA.[/color] There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. Well, without any doubt, American civilians are the most armed people in the world.... remember the founding fathers(?), they gave Americans the right to arm themselves. And obviously those armed people were not using their weapons to kill people. [COLOR:BLACK]AT THE MOMENT Unlike the Israelis.[/color]It's something we should all be aware of, And do what ???? Would you suggest not allowing a specific ethnic group of Americans not to have the same rights as others??? THIS IS AMERICA, YOU CAN NOT DO THAT HERE.but I understand why the government kept it secret b/c we do have nuts here like who?[COLOR:BLACK]YOU [/color]to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. No, they didn't \"go public\" with that because: ALL AMERICANS have the right to bear arms. So it isn't just Arab Americans who have weapons. You are sounding like a paranoid bigoted right wing dangerous person, screaming that we should be worried because the people YOU most fear have weapons. Again, you can NOT do that HERE, this is AMERICA. Why not you blow your horn all the time Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side NO THEY WOULD NOT,[COLOR:BLACK]wrong again Doug because those gentlemen created the laws of JUSTICE FOR ALL, which apply to Arab Americans, African Americans, Jewish Americans, Russian Americans, German Americans, Japanese Americans, etc., etc., regardless of the fact that America has even had WARS with some of those countries. So STOP PUTTING WORDS IN OUR FORE FATHERS MOUTHS, that they did NOT codify into AMERICAN LAWS. [/color]in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings. There have been many groups fighting for world domination, i.e., Egyptians, Greeks, Romans, British, Germans, etc. So, stop the bigoted statements against an entire ethnic group because of some history unless you are going to also point your finger at ALL the groups who have fought for world domination; or had wars / battles with America. It is a LONG list.", 
        "intTime": 20090324, 
        "postID": 13, 
        "quote": "Originally posted by DougSabbag: quote: Originally posted by DStambaugh: All I know, Doug, is our founding fathers were very worried that Arab Muslims may eventually move to America. Is that so? Nevertheless, they did not abuse them in America, instead OUR founding fathers created a country where EVERYONE has to abide by the SAME LAWS and JUSTICE FOR ALL is the prime directive. [COLOR:BLACK]Except the U.S. government when dealing with Native Americans. Thus, American Arabs prosper and live in peace in America, very well. But Not the Native American. So, whoever amongst the \"founding fathers\" that you believe was so worried about Arabs has obviously been relieved of any concerns. You might note the MANY prosperous successful American Arabs, including US Senators, like George Mitchell. [/color]Their worries were very legitimate. Though they did not codify any of your supposed \"concerns\". Instead they created laws based upon FREEDOM AND JUSTICE FOR ALL. [COLOR:BLACK]Except the Native American And thus we do not have any violence and conflict like in Israel where there is NOT Justice for ALL. Israel could learn a LOT from American policies.[/color]You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. No, you are NOT right about them. They are PEOPLE, and people should not be treated with bigotry and prejudice. [COLOR:BLACK]Yet people like You D.S. still treat people like that. Welcome to AMERICA.[/color] There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. Well, without any doubt, American civilians are the most armed people in the world.... remember the founding fathers(?), they gave Americans the right to arm themselves. And obviously those armed people were not using their weapons to kill people. [COLOR:BLACK]AT THE MOMENT Unlike the Israelis.[/color]It's something we should all be aware of, And do what ???? Would you suggest not allowing a specific ethnic group of Americans not to have the same rights as others??? THIS IS AMERICA, YOU CAN NOT DO THAT HERE.but I understand why the government kept it secret b/c we do have nuts here like who?[COLOR:BLACK]YOU [/color]to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. No, they didn't \"go public\" with that because: ALL AMERICANS have the right to bear arms. So it isn't just Arab Americans who have weapons. You are sounding like a paranoid bigoted right wing dangerous person, screaming that we should be worried because the people YOU most fear have weapons. Again, you can NOT do that HERE, this is AMERICA. Why not you blow your horn all the time Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side NO THEY WOULD NOT,[COLOR:BLACK]wrong again Doug because those gentlemen created the laws of JUSTICE FOR ALL, which apply to Arab Americans, African Americans, Jewish Americans, Russian Americans, German Americans, Japanese Americans, etc., etc., regardless of the fact that America has even had WARS with some of those countries. So STOP PUTTING WORDS IN OUR FORE FATHERS MOUTHS, that they did NOT codify into AMERICAN LAWS. [/color]in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings. There have been many groups fighting for world domination, i.e., Egyptians, Greeks, Romans, British, Germans, etc. So, stop the bigoted statements against an entire ethnic group because of some history unless you are going to also point your finger at ALL the groups who have fought for world domination; or had wars / battles with America. It is a LONG list.", 
        "reply": "", 
        "threadID": "2341971921_5480063312001", 
        "time": "2009-03-24 09:56:00", 
        "title": "Examples of Muslims/Nazi Propaganda/lies", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: quote: Originally posted by DougSabbag: quote: Originally posted by DStambaugh: All I know, Doug, is our founding fathers were very worried that Arab Muslims may eventually move to America. Is that so? Nevertheless, they did not abuse them in America, instead OUR founding fathers created a country where EVERYONE has to abide by the SAME LAWS and JUSTICE FOR ALL is the prime directive. [COLOR:BLACK]Except the U.S. government when dealing with Native Americans. Thus, American Arabs prosper and live in peace in America, very well. But Not the Native American. You're right Donnie, the native Americans were screwed. So let's not support that happening to ANYONE! Or don't you agree Donnie?So, whoever amongst the \"founding fathers\" that you believe was so worried about Arabs has obviously been relieved of any concerns. You might note the MANY prosperous successful American Arabs, including US Senators, like George Mitchell. Their worries were very legitimate. Though they did not codify any of your supposed \"concerns\". Instead they created laws based upon FREEDOM AND JUSTICE FOR ALL. [COLOR:BLACK]Except the Native American And thus we do not have any violence and conflict like in Israel where there is NOT Justice for ALL. Israel could learn a LOT from American policies.You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. No, you are NOT right about them. They are PEOPLE, and people should not be treated with bigotry and prejudice. Yet people like You D.S. still treat people like that.No I don't Donnie. What are YOU talking about anyway? By my defending people from prejudicial comments, you think I am exhibiting prejudial behavior? How screwed up is that? Have another beer, and go away. Welcome to AMERICA.[/color:BLACK] There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. [color:RED]Well, without any doubt, American civilians are the most armed people in the world.... remember the founding fathers(?), they gave Americans the right to arm themselves. And obviously those armed people were not using their weapons to kill people. [COLOR:BLACK]AT THE MOMENT Unlike the Israelis.[/color]It's something we should all be aware of, And do what ???? Would you suggest not allowing a specific ethnic group of Americans not to have the same rights as others??? THIS IS AMERICA, YOU CAN NOT DO THAT HERE.but I understand why the government kept it secret b/c we do have nuts here like who?[COLOR:BLACK]YOUAgain Donnie you throw a meaningless accusation against the person DEFENDING the abused! Are you really a sentient being Donnie? Hello? [/color]to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. No, they didn't \"go public\" with that because: ALL AMERICANS have the right to bear arms. So it isn't just Arab Americans who have weapons. You are sounding like a paranoid bigoted right wing dangerous person, screaming that we should be worried because the people YOU most fear have weapons. Again, you can NOT do that HERE, this is AMERICA. Why not you blow your horn all the timeI am not \"blowing my own horn\" for whatever mindless / baseless meaning that has to this debate. WAKE UP and realize what you are arguing!? You are not making ANY sense at all. Which basically devalues whatever you're trying to say. Try saying something with a concept of validity instead of just calling people names. Otherwise, go have another beer and bother some other people. Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side NO THEY WOULD NOT; because those gentlemen created the laws of JUSTICE FOR ALL, which apply to Arab Americans, African Americans, Jewish Americans, Russian Americans, German Americans, Japanese Americans, etc., etc., regardless of the fact that America has even had WARS with some of those countries. So STOP PUTTING WORDS IN OUR FORE FATHERS MOUTHS, that they did NOT codify into AMERICAN LAWS. in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings. There have been many groups fighting for world domination, i.e., Egyptians, Greeks, Romans, British, Germans, etc. So, stop the bigoted statements against an entire ethnic group because of some history unless you are going to also point your finger at ALL the groups who have fought for world domination; or had wars / battles with America. It is a LONG list.", 
        "intTime": 20090324, 
        "postID": 14, 
        "quote": "Originally posted by donniejanuarysr: quote: Originally posted by DougSabbag: quote: Originally posted by DStambaugh: All I know, Doug, is our founding fathers were very worried that Arab Muslims may eventually move to America. Is that so? Nevertheless, they did not abuse them in America, instead OUR founding fathers created a country where EVERYONE has to abide by the SAME LAWS and JUSTICE FOR ALL is the prime directive. [COLOR:BLACK]Except the U.S. government when dealing with Native Americans. Thus, American Arabs prosper and live in peace in America, very well. But Not the Native American. You're right Donnie, the native Americans were screwed. So let's not support that happening to ANYONE! Or don't you agree Donnie?So, whoever amongst the \"founding fathers\" that you believe was so worried about Arabs has obviously been relieved of any concerns. You might note the MANY prosperous successful American Arabs, including US Senators, like George Mitchell. Their worries were very legitimate. Though they did not codify any of your supposed \"concerns\". Instead they created laws based upon FREEDOM AND JUSTICE FOR ALL. [COLOR:BLACK]Except the Native American And thus we do not have any violence and conflict like in Israel where there is NOT Justice for ALL. Israel could learn a LOT from American policies.You know, our government, of course, doesn't tell us everything. A friend of mine that lives in the midst of where Katrina hit and her husband works for the government called me not long ago to tell me how right I am about Arab Muslims. No, you are NOT right about them. They are PEOPLE, and people should not be treated with bigotry and prejudice. Yet people like You D.S. still treat people like that.No I don't Donnie. What are YOU talking about anyway? By my defending people from prejudicial comments, you think I am exhibiting prejudial behavior? How screwed up is that? Have another beer, and go away. Welcome to AMERICA.[/color:BLACK] There's a town where mostly Arab Muslims live that had to leave their homes in a hurry when Katrina hit. The police found tons of bombs/weapons in many of the Arab Muslim homes there. [color:RED]Well, without any doubt, American civilians are the most armed people in the world.... remember the founding fathers(?), they gave Americans the right to arm themselves. And obviously those armed people were not using their weapons to kill people. [COLOR:BLACK]AT THE MOMENT Unlike the Israelis.[/color]It's something we should all be aware of, And do what ???? Would you suggest not allowing a specific ethnic group of Americans not to have the same rights as others??? THIS IS AMERICA, YOU CAN NOT DO THAT HERE.but I understand why the government kept it secret b/c we do have nuts here like who?[COLOR:BLACK]YOUAgain Donnie you throw a meaningless accusation against the person DEFENDING the abused! Are you really a sentient being Donnie? Hello? [/color]to that would just go out and start killing all Arab Muslims who live in the US if they went public with this. No, they didn't \"go public\" with that because: ALL AMERICANS have the right to bear arms. So it isn't just Arab Americans who have weapons. You are sounding like a paranoid bigoted right wing dangerous person, screaming that we should be worried because the people YOU most fear have weapons. Again, you can NOT do that HERE, this is AMERICA. Why not you blow your horn all the timeI am not \"blowing my own horn\" for whatever mindless / baseless meaning that has to this debate. WAKE UP and realize what you are arguing!? You are not making ANY sense at all. Which basically devalues whatever you're trying to say. Try saying something with a concept of validity instead of just calling people names. Otherwise, go have another beer and bother some other people. Anyway, do I really need to repeat what Adams and Jefferson said about Arab Muslims again? I am certain they would have been on Israel's side NO THEY WOULD NOT; because those gentlemen created the laws of JUSTICE FOR ALL, which apply to Arab Americans, African Americans, Jewish Americans, Russian Americans, German Americans, Japanese Americans, etc., etc., regardless of the fact that America has even had WARS with some of those countries. So STOP PUTTING WORDS IN OUR FORE FATHERS MOUTHS, that they did NOT codify into AMERICAN LAWS. in this mess b/c they wrote that Muslims actually felt they had a right to fight & kill all infidels till they rule over the world with Islam when Muslims were attacking American/ western ships & taking the crews as slaves in America's very beginnings. There have been many groups fighting for world domination, i.e., Egyptians, Greeks, Romans, British, Germans, etc. So, stop the bigoted statements against an entire ethnic group because of some history unless you are going to also point your finger at ALL the groups who have fought for world domination; or had wars / battles with America. It is a LONG list.", 
        "reply": "", 
        "threadID": "2341971921_5480063312001", 
        "time": "2009-03-24 15:35:00", 
        "title": "Examples of Muslims/Nazi Propaganda/lies", 
        "userID": "DougSabbag"
    }
]