[
    {
        "content": "Over on the “Religion in the Military” is a related thread dealing with quote: [….if the DA/DT] …ban is lifted. In the years since Don't Ask, Don't Tell was adopted in 1993, there has been a rigorous effort to force religion into the barracks. Fundamentalist Christian groups have infiltrated some of our leading military bases and have made life uncomfortable for anyone who does not conform. Sadly, the proselytizing continues with powerful military leaders behaving more like missionaries, than soldiers entrusted with fulfilling military missions. ….the purpose of these groups is to turn religion from a private, individual matter into a coercive team sport. As we contemplate the battle over allowing openly gay people in the military, we should also consider what type of military they would serve in. As a nation, we must ensure that the military's number one priority is preparing for war, not worship. If we don't grapple with this issue, Don't Ask, Don't Tell may become, Do Tell, Live In Hell for gay and lesbian service members brave enough to come out. http://forums.military.com/eve/forums/a/tpc/f/127003199...812001#9370090812001", 
        "intTime": 20090317, 
        "postID": 1, 
        "quote": "[….if the DA/DT] …ban is lifted. In the years since Don't Ask, Don't Tell was adopted in 1993, there has been a rigorous effort to force religion into the barracks. Fundamentalist Christian groups have infiltrated some of our leading military bases and have made life uncomfortable for anyone who does not conform. Sadly, the proselytizing continues with powerful military leaders behaving more like missionaries, than soldiers entrusted with fulfilling military missions. ….the purpose of these groups is to turn religion from a private, individual matter into a coercive team sport. As we contemplate the battle over allowing openly gay people in the military, we should also consider what type of military they would serve in. As a nation, we must ensure that the military's number one priority is preparing for war, not worship. If we don't grapple with this issue, Don't Ask, Don't Tell may become, Do Tell, Live In Hell for gay and lesbian service members brave enough to come out.", 
        "reply": "Over on the “Religion in the Military” is a related thread dealing with  http://forums.military.com/eve/forums/a/tpc/f/127003199...812001#9370090812001", 
        "threadID": "27819558_3180001812001", 
        "time": "2009-03-17 11:39:00", 
        "title": "Religion in the military and gay service members issue.", 
        "userID": "reducetension"
    }, 
    {
        "content": "I posted this in \"point counterpoint\" and I think it relates to what you have posted. You have to go to the link and read the full article to understand what he is saying. I think it is one of the best Op-Ed articles I have read in a long time. The Culture Warriors Get Laid Off SOMEDAY we’ll learn the whole story of why George W. Bush brushed off that intelligence briefing of Aug. 6, 2001, “Bin Laden Determined to Strike in U.S.” But surely a big distraction was the major speech he was readying for delivery on Aug. 9, his first prime-time address to the nation. The subject — which Bush hyped as “one of the most profound of our time” — was stem cells. For a presidency in thrall to a thriving religious right (and a presidency incapable of multi-tasking), nothing, not even terrorism, could be more urgent. When Barack Obama ended the Bush stem-cell policy last week, there were no such overheated theatrics. No oversold prime-time address. No hysteria from politicians, the news media or the public. The family-values dinosaurs that once stalked the earth — Falwell, Robertson, Dobson and Reed — are now either dead, retired or disgraced. Their less-famous successors pumped out their pro forma e-mail blasts, but to little avail. The Republican National Committee said nothing whatsoever about Obama’s reversal of Bush stem-cell policy. That’s quite a contrast to 2006, when the party’s wild and crazy (and perhaps transitory) new chairman, Michael Steele, likened embryonic stem-cell research to Nazi medical experiments during his failed Senate campaign. Read the full article here > >http://www.nytimes.com/2009/03/15/opinion/15rich.html?_r=2&ref=opinion", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "I posted this in \"point counterpoint\" and I think it relates to what you have posted. You have to go to the link and read the full article to understand what he is saying. I think it is one of the best Op-Ed articles I have read in a long time. The Culture Warriors Get Laid Off SOMEDAY we’ll learn the whole story of why George W. Bush brushed off that intelligence briefing of Aug. 6, 2001, “Bin Laden Determined to Strike in U.S.” But surely a big distraction was the major speech he was readying for delivery on Aug. 9, his first prime-time address to the nation. The subject — which Bush hyped as “one of the most profound of our time” — was stem cells. For a presidency in thrall to a thriving religious right (and a presidency incapable of multi-tasking), nothing, not even terrorism, could be more urgent. When Barack Obama ended the Bush stem-cell policy last week, there were no such overheated theatrics. No oversold prime-time address. No hysteria from politicians, the news media or the public. The family-values dinosaurs that once stalked the earth — Falwell, Robertson, Dobson and Reed — are now either dead, retired or disgraced. Their less-famous successors pumped out their pro forma e-mail blasts, but to little avail. The Republican National Committee said nothing whatsoever about Obama’s reversal of Bush stem-cell policy. That’s quite a contrast to 2006, when the party’s wild and crazy (and perhaps transitory) new chairman, Michael Steele, likened embryonic stem-cell research to Nazi medical experiments during his failed Senate campaign. Read the full article here > >http://www.nytimes.com/2009/03/15/opinion/15rich.html?_r=2&ref=opinion", 
        "threadID": "27819558_3180001812001", 
        "time": "2009-03-17 13:31:00", 
        "title": "Religion in the military and gay service members issue.", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Huffington Post is one of those places where it's all opinion and very little fact. But, this piece did actually pull in some \"religion in the Military\" type news and I thought it would be useful on a group so named. Let's make sure to add the poster's opinion of the source he took it from. I read the article over in the \"Religion Atheism in the Military\" forum, and found it to be the biggest load of hypocritical crap I have ever seen, and I am being nice when I say that. I don't know whether to be amused, ****ed off, or just dumbfounded at the idiotic, misleading \"facts\" that this article tries to represent, or the agenda that the people that reiterate such garbage attend to push with it. Homosexuals want to take some of the extreme Christians in the military and try to compare it to the group as a whole. Hmm, this seems very familiar. Oh yeah, it's the same kind of crap that gays say straights do to them. Homosexuals have their special \"homosexuals in the military\" groups that proselytize everyone and calls people that don't convert to their way of thinking things like homophobe, and the like, yet apparently in their eyes they are the only ones who should be afforded the rights to do this. So first they want to repeal DADT, then destroy spiritual moral and readiness which is sometimes the only thing that helps these soldiers to go into battle. Should we get rid of the church services in the chapel that take place on base too? Let's destroy the way of living for millions in order to appease thousands. The people who wrote that article are hypocrites that care only for themselves with no perception of service before self.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "Huffington Post is one of those places where it's all opinion and very little fact. But, this piece did actually pull in some \"religion in the Military\" type news and I thought it would be useful on a group so named.", 
        "reply": " Let's make sure to add the poster's opinion of the source he took it from. I read the article over in the \"Religion Atheism in the Military\" forum, and found it to be the biggest load of hypocritical crap I have ever seen, and I am being nice when I say that. I don't know whether to be amused, ****ed off, or just dumbfounded at the idiotic, misleading \"facts\" that this article tries to represent, or the agenda that the people that reiterate such garbage attend to push with it. Homosexuals want to take some of the extreme Christians in the military and try to compare it to the group as a whole. Hmm, this seems very familiar. Oh yeah, it's the same kind of crap that gays say straights do to them. Homosexuals have their special \"homosexuals in the military\" groups that proselytize everyone and calls people that don't convert to their way of thinking things like homophobe, and the like, yet apparently in their eyes they are the only ones who should be afforded the rights to do this. So first they want to repeal DADT, then destroy spiritual moral and readiness which is sometimes the only thing that helps these soldiers to go into battle. Should we get rid of the church services in the chapel that take place on base too? Let's destroy the way of living for millions in order to appease thousands. The people who wrote that article are hypocrites that care only for themselves with no perception of service before self.", 
        "threadID": "27819558_3180001812001", 
        "time": "2009-03-18 00:37:00", 
        "title": "Religion in the military and gay service members issue.", 
        "userID": "JimmieJam007"
    }, 
    {
        "content": "quote: Originally posted by JimmieJam007: quote: Huffington Post is one of those places where it's all opinion and very little fact. But, this piece did actually pull in some \"religion in the Military\" type news and I thought it would be useful on a group so named. Let's make sure to add the poster's opinion of the source he took it from. Did you have trouble finding it? I read the article over in the \"Religion Atheism in the Military\" forum, and found it to be the biggest load of hypocritical crap I have ever seen, and I am being nice when I say that. I don't know whether to be amused, ****ed off, or just dumbfounded at the idiotic, misleading \"facts\" that this article tries to represent, or the agenda that the people that reiterate such garbage attend to push with it. Some people feel that way about the whole idea behind religion. Homosexuals want to take some of the extreme Christians in the military and try to compare it to the group as a whole. It's the \"extreme\" Christians who create the extreme issues based on morals from their make-believe gods. Hmm, this seems very familiar. Oh yeah, it's the same kind of crap that gays say straights do to them. Homosexuals have their special \"homosexuals in the military\" groups that proselytize (Sure you want to use that word?) everyone and calls people that don't convert to their way of thinking things like homophobe, and the like, yet apparently in their eyes they are the only ones who should be afforded the rights to do this. So, are you saying the Christians should have a right to do the same to gays? There are those Christians already that apparently gain pleasure and thrills from terrorizing others with damnation and getting 'left behind'. Much more serious of a threat than getting called a 'homophobe' You think maybe the gays will go to hell? So first they want to repeal DADT, then destroy spiritual moral and readiness which is sometimes the only thing that helps these soldiers to go into battle. You mean a belief in a God gets them to fight? Where have I heard that 'motivation'? Oh yes, the enemy use the same talk to motivate terrorism, right?) Should we get rid of the church services in the chapel that take place on base too? It's been suggested for a long time, often by other Christians who object to tax dollars propping up 'official' religion in the military. Why can't the chaplaincy rely on donations like churches and missionaries do? If it so important, why can't the believers support it themselves? Is their god unable to do so and now needs Caesar to do it for him? Let's destroy the way of living for millions in order to appease thousands. Sounds familiar. Oh yes, it is the same logic some countries use to oppress minority groups including religions. I suppose when religion leaves people alone (free) then people will leave religions alone to be free. The people who wrote that article are hypocrites that care only for themselves with no perception of service before self. Not at all like those who want to enforce their view of morality on others because they don't like what they do?", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "Originally posted by JimmieJam007: quote: Huffington Post is one of those places where it's all opinion and very little fact. But, this piece did actually pull in some \"religion in the Military\" type news and I thought it would be useful on a group so named. Let's make sure to add the poster's opinion of the source he took it from. Did you have trouble finding it? I read the article over in the \"Religion Atheism in the Military\" forum, and found it to be the biggest load of hypocritical crap I have ever seen, and I am being nice when I say that. I don't know whether to be amused, ****ed off, or just dumbfounded at the idiotic, misleading \"facts\" that this article tries to represent, or the agenda that the people that reiterate such garbage attend to push with it. Some people feel that way about the whole idea behind religion. Homosexuals want to take some of the extreme Christians in the military and try to compare it to the group as a whole. It's the \"extreme\" Christians who create the extreme issues based on morals from their make-believe gods. Hmm, this seems very familiar. Oh yeah, it's the same kind of crap that gays say straights do to them. Homosexuals have their special \"homosexuals in the military\" groups that proselytize (Sure you want to use that word?) everyone and calls people that don't convert to their way of thinking things like homophobe, and the like, yet apparently in their eyes they are the only ones who should be afforded the rights to do this. So, are you saying the Christians should have a right to do the same to gays? There are those Christians already that apparently gain pleasure and thrills from terrorizing others with damnation and getting 'left behind'. Much more serious of a threat than getting called a 'homophobe' You think maybe the gays will go to hell? So first they want to repeal DADT, then destroy spiritual moral and readiness which is sometimes the only thing that helps these soldiers to go into battle. You mean a belief in a God gets them to fight? Where have I heard that 'motivation'? Oh yes, the enemy use the same talk to motivate terrorism, right?) Should we get rid of the church services in the chapel that take place on base too? It's been suggested for a long time, often by other Christians who object to tax dollars propping up 'official' religion in the military. Why can't the chaplaincy rely on donations like churches and missionaries do? If it so important, why can't the believers support it themselves? Is their god unable to do so and now needs Caesar to do it for him? Let's destroy the way of living for millions in order to appease thousands. Sounds familiar. Oh yes, it is the same logic some countries use to oppress minority groups including religions. I suppose when religion leaves people alone (free) then people will leave religions alone to be free. The people who wrote that article are hypocrites that care only for themselves with no perception of service before self. Not at all like those who want to enforce their view of morality on others because they don't like what they do?", 
        "reply": "", 
        "threadID": "27819558_3180001812001", 
        "time": "2009-03-18 18:21:00", 
        "title": "Religion in the military and gay service members issue.", 
        "userID": "reducetension"
    }, 
    {
        "content": "\"JimmieJam007,\" My advice to you, don't get caught in this kind of posting. *** Think about it. This poster got his arse kicked nine ways to Sunday in several other threads. Has been unable to form a legitimate, relevant point on ... anything(?). Has been banging the, \"fundamentalist,\" drum to deaf ears. So in failure, and facing sudden thread-credibility retirement, launches the, \"fundamentalist,\" argument on its own non-merit. What a bunch of hype. *** Hint: The language, \"some,\" learn, is the blood, \"some,\" bleed, and in that bleeding, don't believe in Christianity, therefore banging the, \"fundamentalist,\" drum is a form of entertainment. *** Again, the poster has intellectually failed on every other thread. This is a grasp for straws, an egocentric attempt to validate, \"Self,\" a.k.a., \"increaseyourownhormonaltension.\" The surgery failed ... uterus still in place. At this point, emotions are like random gunfire. *** \"JimmieJam007,\" Proceed with caution, or just abstain, the hole thread is an ego-trap, and you're allowing yourself to fall into it.", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "", 
        "reply": "\"JimmieJam007,\" My advice to you, don't get caught in this kind of posting. *** Think about it. This poster got his arse kicked nine ways to Sunday in several other threads. Has been unable to form a legitimate, relevant point on ... anything(?). Has been banging the, \"fundamentalist,\" drum to deaf ears. So in failure, and facing sudden thread-credibility retirement, launches the, \"fundamentalist,\" argument on its own non-merit. What a bunch of hype. *** Hint: The language, \"some,\" learn, is the blood, \"some,\" bleed, and in that bleeding, don't believe in Christianity, therefore banging the, \"fundamentalist,\" drum is a form of entertainment. *** Again, the poster has intellectually failed on every other thread. This is a grasp for straws, an egocentric attempt to validate, \"Self,\" a.k.a., \"increaseyourownhormonaltension.\" The surgery failed ... uterus still in place. At this point, emotions are like random gunfire. *** \"JimmieJam007,\" Proceed with caution, or just abstain, the hole thread is an ego-trap, and you're allowing yourself to fall into it.", 
        "threadID": "27819558_3180001812001", 
        "time": "2009-03-18 21:38:00", 
        "title": "Religion in the military and gay service members issue.", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "Let us prey then. Lawd knows Equal wouldn't fall into an ego trap! You listen to your Master now, JJ. He's a good father figure for the fanatically inclined.", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "", 
        "reply": "Let us prey then. Lawd knows Equal wouldn't fall into an ego trap! You listen to your Master now, JJ. He's a good father figure for the fanatically inclined.", 
        "threadID": "27819558_3180001812001", 
        "time": "2009-03-18 23:11:00", 
        "title": "Religion in the military and gay service members issue.", 
        "userID": "reducetension"
    }, 
    {
        "content": "See, if we leave the zit alone, it goes away faster ...", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "", 
        "reply": "See, if we leave the zit alone, it goes away faster ...", 
        "threadID": "27819558_3180001812001", 
        "time": "2009-03-18 23:50:00", 
        "title": "Religion in the military and gay service members issue.", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "lol", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "", 
        "reply": "lol", 
        "threadID": "27819558_3180001812001", 
        "time": "2009-03-18 23:51:00", 
        "title": "Religion in the military and gay service members issue.", 
        "userID": "JimmieJam007"
    }
]