[
    {
        "content": "OK, If you bat for the same team that is up to you. Do not think for one minute that I or anybody else wants to shower with a potential pedophile. Here is the deal if the law is passed then the soldiers should have the \"right\" to not serve. (let them out no bust on there part) Please bring your child stick him/her in a box with a gay person are you retarded. Pull your head out. Why should you make the mass feel that they cannot even shower or heck just go to the gym? (Shut the fffffff up) It was there choice to be that way (don’t ask don’t tell) leave it alone its there for a reason. There are plenty of (same team hitters) in the military. Don’t ask don’t tell. that is accepted.", 
        "intTime": 20090524, 
        "postID": 1, 
        "quote": "", 
        "reply": "OK, If you bat for the same team that is up to you. Do not think for one minute that I or anybody else wants to shower with a potential pedophile. Here is the deal if the law is passed then the soldiers should have the \"right\" to not serve. (let them out no bust on there part) Please bring your child stick him/her in a box with a gay person are you retarded. Pull your head out. Why should you make the mass feel that they cannot even shower or heck just go to the gym? (Shut the fffffff up) It was there choice to be that way (don’t ask don’t tell) leave it alone its there for a reason. There are plenty of (same team hitters) in the military. Don’t ask don’t tell. that is accepted.", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-24 05:57:00", 
        "title": "can i join", 
        "userID": "tinker2002"
    }, 
    {
        "content": "quote: Originally posted by tinker2002: OK, If you bat for the same team that is up to you. Do not think for one minute that I or anybody else wants to shower with a potential pedophile. Here is the deal if the law is passed then the soldiers should have the \"right\" to not serve. (let them out no bust on there part) Please bring your child stick him/her in a box with a gay person are you retarded. Pull your head out. Why should you make the mass feel that they cannot even shower or heck just go to the gym? (Shut the fffffff up) It was there choice to be that way (don’t ask don’t tell) leave it alone its there for a reason. There are plenty of (same team hitters) in the military. Don’t ask don’t tell. that is accepted. Oh my! If you truly don't wish to shower with a \"potential pedophile\" then I suggest that you stop showering with straight males. They are by far the largest group of pedophiles on the planet! Scary straight men! I suppose we should kick them all out since they could be potential pedophiles, eh? I certainly wouldn't want you to have to shower with any! Oh wait, that would mean we would have to kick YOU out too huh? Guess you're stuck with the potential pedophiles. Sorry. You don't wish to serve with homosexuals, then by all means, feel free to leave! It is YOUR problem. I can tell you that the vast majority of homosexuals do NOT look at other people in the shower, and it is the epitomy of arrogance on your part to assume that you are soooo gorgeous that they would bother to look at your little wankie. Truth is, we have been showering with the same sex for all of our lives. It isn't a thrill. Sorry to break it to ya, but it really isn't. <yawn>. Why on earth would you be afraid to stick your child in a box with a homosexual? It doesn't rub off, and statistically speaking, they would be much safer since the vast majority of pedophiles are straight men. That is just a stupid unfounded fear on your part. Once again, if you are afraid of going to the gym, that is YOUR problem. Homosexuals have been around you your whole life, and oooh look...you are still unmolested. Wonder what that means? It means that homosexuals are just like the rest of society. We control our emotions and sexual drive just like everyone else, and in some cases, much better than heterosexuals since you seem to think that you guys would have a problem showering with females. As for it being a choice, it NEVER was. You are born the way you are born, and nothing is going to change that! If you had to serve by the same standards as DA/DT, you'd be the first to stamp your feet and scream \"Its not fair! I want my gf, or wife, etc. to be able to see me off, kiss me when I get back from deployment, I want to have a picture of her with me, I want to be able to have sex in the privacy of my own home without being discharged for it, etc.\" DA/DT is nothing but forced lying. You don't mind serving with homosexuals as long as they are forced to lie to you. You want to live in a little pretend world. There are people who can help you with this problem of yours. Seek them out in the mental health area...really, you will feel much better. Good luck with your problems. I hope you are able to overcome your fears of homosexuals. It is sad that your worst fear isn't being killed by the enemy, but of serving along side a homosexual. Really sad.", 
        "intTime": 20090524, 
        "postID": 2, 
        "quote": "Originally posted by tinker2002: OK, If you bat for the same team that is up to you. Do not think for one minute that I or anybody else wants to shower with a potential pedophile. Here is the deal if the law is passed then the soldiers should have the \"right\" to not serve. (let them out no bust on there part) Please bring your child stick him/her in a box with a gay person are you retarded. Pull your head out. Why should you make the mass feel that they cannot even shower or heck just go to the gym? (Shut the fffffff up) It was there choice to be that way (don’t ask don’t tell) leave it alone its there for a reason. There are plenty of (same team hitters) in the military. Don’t ask don’t tell. that is accepted.", 
        "reply": " Oh my! If you truly don't wish to shower with a \"potential pedophile\" then I suggest that you stop showering with straight males. They are by far the largest group of pedophiles on the planet! Scary straight men! I suppose we should kick them all out since they could be potential pedophiles, eh? I certainly wouldn't want you to have to shower with any! Oh wait, that would mean we would have to kick YOU out too huh? Guess you're stuck with the potential pedophiles. Sorry. You don't wish to serve with homosexuals, then by all means, feel free to leave! It is YOUR problem. I can tell you that the vast majority of homosexuals do NOT look at other people in the shower, and it is the epitomy of arrogance on your part to assume that you are soooo gorgeous that they would bother to look at your little wankie. Truth is, we have been showering with the same sex for all of our lives. It isn't a thrill. Sorry to break it to ya, but it really isn't. <yawn>. Why on earth would you be afraid to stick your child in a box with a homosexual? It doesn't rub off, and statistically speaking, they would be much safer since the vast majority of pedophiles are straight men. That is just a stupid unfounded fear on your part. Once again, if you are afraid of going to the gym, that is YOUR problem. Homosexuals have been around you your whole life, and oooh look...you are still unmolested. Wonder what that means? It means that homosexuals are just like the rest of society. We control our emotions and sexual drive just like everyone else, and in some cases, much better than heterosexuals since you seem to think that you guys would have a problem showering with females. As for it being a choice, it NEVER was. You are born the way you are born, and nothing is going to change that! If you had to serve by the same standards as DA/DT, you'd be the first to stamp your feet and scream \"Its not fair! I want my gf, or wife, etc. to be able to see me off, kiss me when I get back from deployment, I want to have a picture of her with me, I want to be able to have sex in the privacy of my own home without being discharged for it, etc.\" DA/DT is nothing but forced lying. You don't mind serving with homosexuals as long as they are forced to lie to you. You want to live in a little pretend world. There are people who can help you with this problem of yours. Seek them out in the mental health area...really, you will feel much better. Good luck with your problems. I hope you are able to overcome your fears of homosexuals. It is sad that your worst fear isn't being killed by the enemy, but of serving along side a homosexual. Really sad.", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-24 10:00:00", 
        "title": "can i join", 
        "userID": "badbard"
    }, 
    {
        "content": "quote: Originally posted by tinker2002: OK, If you bat for the same team that is up to you. Do not think for one minute that I or anybody else wants to shower with a potential pedophile. Here is the deal if the law is passed then the soldiers should have the \"right\" to not serve. (let them out no bust on there part) Please bring your child stick him/her in a box with a gay person are you retarded. Pull your head out. Why should you make the mass feel that they cannot even shower or heck just go to the gym? (Shut the fffffff up) It was there choice to be that way (don’t ask don’t tell) leave it alone its there for a reason. There are plenty of (same team hitters) in the military. Don’t ask don’t tell. that is accepted. I did some of your homework for you: In 1978 psychologist Nicholas Groth screened 175 men who had been convicted in Massachusetts of sexual molestation of children and referred by a court for psychological evaluation. He found not a single gay man in this sample. Every one of the perpetrators was either an exclusive heterosexual, a bisexual with a predominantly heterosexual orientation, or a fixated pedophile with no sexual interest in adults.<4> His conclusion? That \"the adult heterosexual male constitutes a greater risk to the underage child than does the adult homosexual male.\" In the same year, researcher David Newton reviewed the scientific literature and found no reason to believe that anything other than a \"random connection\" existed between homosexual orientation and child molestation.<5> In 1988, renowned sex researcher Kurt Freund at the Clarke Institute of Psychiatry in Toronto studied two groups of paid volunteers and found that gay men responded no more to male child stimuli than heterosexual men responded to female child stimuli.<6> He later described as a \"myth\" the notion that gay men are more likely than straight men to be child molesters.<7> The key to understanding research on this issue is to recognize three things. First, a person's sexual attraction to adults, whether homosexual, heterosexual, or bisexual, is wholly distinct from an attraction to children. A person can be attracted only to adults, only to children, or occasionally to both, but these attractions are independent facets of a person's psychology. Myth #2 - Most sexual abuse of boys is perpetrated by homosexual males.Pedophiles who molest boys are not expressing a homosexual orientation any more than pedophiles who molest girls are practicing heterosexual behaviors. While many child molesters have gender and/or age preferences, of those who seek out boys, the vast majority are not homosexual. They are pedophiles. Ok, now you have the facts so you can feel at ease. 99% of pedophiles are self identifying heterosexual white males. Feel better? I do.", 
        "intTime": 20090524, 
        "postID": 3, 
        "quote": "Originally posted by tinker2002: OK, If you bat for the same team that is up to you. Do not think for one minute that I or anybody else wants to shower with a potential pedophile. Here is the deal if the law is passed then the soldiers should have the \"right\" to not serve. (let them out no bust on there part) Please bring your child stick him/her in a box with a gay person are you retarded. Pull your head out. Why should you make the mass feel that they cannot even shower or heck just go to the gym? (Shut the fffffff up) It was there choice to be that way (don’t ask don’t tell) leave it alone its there for a reason. There are plenty of (same team hitters) in the military. Don’t ask don’t tell. that is accepted.", 
        "reply": " I did some of your homework for you: In 1978 psychologist Nicholas Groth screened 175 men who had been convicted in Massachusetts of sexual molestation of children and referred by a court for psychological evaluation. He found not a single gay man in this sample. Every one of the perpetrators was either an exclusive heterosexual, a bisexual with a predominantly heterosexual orientation, or a fixated pedophile with no sexual interest in adults.<4> His conclusion? That \"the adult heterosexual male constitutes a greater risk to the underage child than does the adult homosexual male.\" In the same year, researcher David Newton reviewed the scientific literature and found no reason to believe that anything other than a \"random connection\" existed between homosexual orientation and child molestation.<5> In 1988, renowned sex researcher Kurt Freund at the Clarke Institute of Psychiatry in Toronto studied two groups of paid volunteers and found that gay men responded no more to male child stimuli than heterosexual men responded to female child stimuli.<6> He later described as a \"myth\" the notion that gay men are more likely than straight men to be child molesters.<7> The key to understanding research on this issue is to recognize three things. First, a person's sexual attraction to adults, whether homosexual, heterosexual, or bisexual, is wholly distinct from an attraction to children. A person can be attracted only to adults, only to children, or occasionally to both, but these attractions are independent facets of a person's psychology. Myth #2 - Most sexual abuse of boys is perpetrated by homosexual males.Pedophiles who molest boys are not expressing a homosexual orientation any more than pedophiles who molest girls are practicing heterosexual behaviors. While many child molesters have gender and/or age preferences, of those who seek out boys, the vast majority are not homosexual. They are pedophiles. Ok, now you have the facts so you can feel at ease. 99% of pedophiles are self identifying heterosexual white males. Feel better? I do.", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-24 10:38:00", 
        "title": "can i join", 
        "userID": "badbard"
    }, 
    {
        "content": "Why dignify this with a reply?", 
        "intTime": 20090524, 
        "postID": 4, 
        "quote": "", 
        "reply": "Why dignify this with a reply?", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-24 11:59:00", 
        "title": "can i join", 
        "userID": "Bleah"
    }, 
    {
        "content": "Its an education opportunity. Not for this poster mind you, but for the people who just lurk and read all of the posts. This kind of \"misinformation\" and \"myths\" need to be addressed so that others may learn the truth. I hope you are having a wonderful weekend Bleah.", 
        "intTime": 20090524, 
        "postID": 5, 
        "quote": "", 
        "reply": "Its an education opportunity. Not for this poster mind you, but for the people who just lurk and read all of the posts. This kind of \"misinformation\" and \"myths\" need to be addressed so that others may learn the truth. I hope you are having a wonderful weekend Bleah.", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-24 13:35:00", 
        "title": "can i join", 
        "userID": "badbard"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Why dignify this with a reply? I too was going to reply but it's all been said. Well not really but if I said what I think of Tinker's post I'd be violating about half of the TOSs. I can say that I think his posts are stupid, uninformed, homophobic and ridicules. What I can say about him is I think he's nothing but your garden variety Troll.", 
        "intTime": 20090525, 
        "postID": 6, 
        "quote": "Originally posted by Bleah: Why dignify this with a reply?", 
        "reply": " I too was going to reply but it's all been said. Well not really but if I said what I think of Tinker's post I'd be violating about half of the TOSs. I can say that I think his posts are stupid, uninformed, homophobic and ridicules. What I can say about him is I think he's nothing but your garden variety Troll.", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-25 11:55:00", 
        "title": "can i join", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: What I can say about him is I think he's nothing but your garden variety Troll. Yep. That's why I left him to stew in his own mess.", 
        "intTime": 20090525, 
        "postID": 7, 
        "quote": "What I can say about him is I think he's nothing but your garden variety Troll.", 
        "reply": " Yep. That's why I left him to stew in his own mess.", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-25 12:47:00", 
        "title": "can i join", 
        "userID": "Bleah"
    }, 
    {
        "content": "LOL, just like always. Why join and open your mouth. Just keep your trap closed. The military is a team (not im straight or im gay) so it would benifit you all if you learn to play as a team. It has never been about you it has always been about the mass", 
        "intTime": 20090525, 
        "postID": 8, 
        "quote": "", 
        "reply": "LOL, just like always. Why join and open your mouth. Just keep your trap closed. The military is a team (not im straight or im gay) so it would benifit you all if you learn to play as a team. It has never been about you it has always been about the mass", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-25 21:16:00", 
        "title": "can i join", 
        "userID": "tinker2002"
    }, 
    {
        "content": "quote: Originally posted by badbard: quote: Originally posted by tinker2002: LOL, just like always. Why join and open your mouth. Just keep your trap closed. The military is a team (not im straight or im gay) so it would benifit you all if you learn to play as a team. It has never been about you it has always been about the mass Of course its a team. I don't want to shout \"I'm gay\" to everyone in the unit, I just don't want to be forced to lie about what I did over the weekend, or lose my career for making love in the privacy of my own home to the person that I intend to spend the rest of my life with. Its as simple as that. If strights had to live by the same standards as DA/DT, they would be the first ones to throw a hissy fit about the restrictions! I know, I've had to listen to the young males bragging about this awesome BJ I got in my car behind the club, and that \"ho\" I drilled, etc ad naseum. They were unmarried, yet indulging in pleasures of the flesh. They didn't have to worry that they were going to be kicked out for it. If we are a team, then act like it and make it a level playing field, get it?!", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "Originally posted by badbard: quote: Originally posted by tinker2002: LOL, just like always. Why join and open your mouth. Just keep your trap closed. The military is a team (not im straight or im gay) so it would benifit you all if you learn to play as a team. It has never been about you it has always been about the mass Of course its a team. I don't want to shout \"I'm gay\" to everyone in the unit, I just don't want to be forced to lie about what I did over the weekend, or lose my career for making love in the privacy of my own home to the person that I intend to spend the rest of my life with. Its as simple as that. If strights had to live by the same standards as DA/DT, they would be the first ones to throw a hissy fit about the restrictions! I know, I've had to listen to the young males bragging about this awesome BJ I got in my car behind the club, and that \"ho\" I drilled, etc ad naseum. They were unmarried, yet indulging in pleasures of the flesh. They didn't have to worry that they were going to be kicked out for it. If we are a team, then act like it and make it a level playing field, get it?!", 
        "reply": "", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-26 05:17:00", 
        "title": "can i join", 
        "userID": "badbard"
    }, 
    {
        "content": "quote: Originally posted by badbard: Its an education opportunity. Not for this poster mind you, but for the people who just lurk and read all of the posts. This kind of \"misinformation\" and \"myths\" need to be addressed so that others may learn the truth. I hope you are having a wonderful weekend Bleah. Yeah, that tends to be the reason I often reply to ridiculous posts and comments. While I don't typically believe that some people will ever change their minds, I can at least try to let the people reading the thread see that the information in the post is false. If I don't reply, I may not be responsible for the lie in the original post, but I am responsible for allowing that lie to spread unchecked. Unfortunately, certain uninformed people CHOOSE to remain willfully ignorant about pedophiles, and automatically associate them with homosexuals even though there is NO EVIDENCE to support that. You can give them all the factual information available, but they will still stubbornly believe that gays are latent pedophiles because that's what they've learned from their preferred propaganda machines. It's sad, really.", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "Originally posted by badbard: Its an education opportunity. Not for this poster mind you, but for the people who just lurk and read all of the posts. This kind of \"misinformation\" and \"myths\" need to be addressed so that others may learn the truth. I hope you are having a wonderful weekend Bleah.", 
        "reply": " Yeah, that tends to be the reason I often reply to ridiculous posts and comments. While I don't typically believe that some people will ever change their minds, I can at least try to let the people reading the thread see that the information in the post is false. If I don't reply, I may not be responsible for the lie in the original post, but I am responsible for allowing that lie to spread unchecked. Unfortunately, certain uninformed people CHOOSE to remain willfully ignorant about pedophiles, and automatically associate them with homosexuals even though there is NO EVIDENCE to support that. You can give them all the factual information available, but they will still stubbornly believe that gays are latent pedophiles because that's what they've learned from their preferred propaganda machines. It's sad, really.", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-26 06:36:00", 
        "title": "can i join", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Somehow I think Tinker will be short lived here.", 
        "intTime": 20090526, 
        "postID": 11, 
        "quote": "", 
        "reply": "Somehow I think Tinker will be short lived here.", 
        "threadID": "27819558_2300041422001", 
        "time": "2009-05-26 08:07:00", 
        "title": "can i join", 
        "userID": "Vicdude"
    }
]