[
    {
        "content": "Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either", 
        "intTime": 20090514, 
        "postID": 1, 
        "quote": "", 
        "reply": "Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-14 13:20:00", 
        "title": "Morale", 
        "userID": "16934819"
    }, 
    {
        "content": "And you never once experience a time when a straight person was \"disrupting good order and discipline \"? Sarcasm on: A straight military man has never raped anyone. A straight military woman never cheated on her husband with another soldier in her unit. A straight officer never slept with on of his enlisted subordinates. Sarcasm off.", 
        "intTime": 20090514, 
        "postID": 2, 
        "quote": "", 
        "reply": "And you never once experience a time when a straight person was \"disrupting good order and discipline \"? Sarcasm on: A straight military man has never raped anyone. A straight military woman never cheated on her husband with another soldier in her unit. A straight officer never slept with on of his enlisted subordinates. Sarcasm off.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-14 13:49:00", 
        "title": "Morale", 
        "userID": "SSgt_Gemini"
    }, 
    {
        "content": "quote: Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn’t be allowed to marry either I’ll bet you ran across a few episodes of str8s “disrupting good order and discipline”, too. In my 24 years I bet I could count on one hand the number of times gays & lesbians were brought up on charges. And probably that many str8’s per month when I was at battalion level. Since no one else seems eager to look into it, perhaps you can provide us with some hard data as to the effect of gays & lesbians serving openly & honestly in any of the other militaries in the world, or, perhaps in our own nation; maybe in police & fire departments? Secret Service, CIA, FBI, NSA? We await your report.", 
        "intTime": 20090514, 
        "postID": 3, 
        "quote": "Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn’t be allowed to marry either", 
        "reply": " I’ll bet you ran across a few episodes of str8s “disrupting good order and discipline”, too. In my 24 years I bet I could count on one hand the number of times gays & lesbians were brought up on charges. And probably that many str8’s per month when I was at battalion level. Since no one else seems eager to look into it, perhaps you can provide us with some hard data as to the effect of gays & lesbians serving openly & honestly in any of the other militaries in the world, or, perhaps in our own nation; maybe in police & fire departments? Secret Service, CIA, FBI, NSA? We await your report.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-14 13:54:00", 
        "title": "Morale", 
        "userID": "DaleU"
    }, 
    {
        "content": "I'm sure that a man of your experience will be able to explain to me how forcing a large percentage of the men and women of the armed services to guard their words and pull away from befriending their co-workers actually serves to help morale, rather than hurting it.", 
        "intTime": 20090514, 
        "postID": 4, 
        "quote": "", 
        "reply": "I'm sure that a man of your experience will be able to explain to me how forcing a large percentage of the men and women of the armed services to guard their words and pull away from befriending their co-workers actually serves to help morale, rather than hurting it.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-14 15:23:00", 
        "title": "Morale", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either Thanks for your insight based on your 26 years of service in the USAF. Now if you will come down from the clouds for a moment and explain how none of the other countries (Great Britain, Israel, The Netherlands, etc.) that allow gays to serve openly have not experienced any significant disruption of service and order or caused morale problems, then you may have something creditable to discuss. Until you can do that then you only have your personal opinion to speak on and that does not reflect the facts. Or perhaps you do not have the faith and confidence in our military to do as good a job in handling this issue as a dozen other countries have done. Personally, I feel our military is superior and will do even a better job than our allies when the time comes.", 
        "intTime": 20090514, 
        "postID": 5, 
        "quote": "Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either", 
        "reply": " Thanks for your insight based on your 26 years of service in the USAF. Now if you will come down from the clouds for a moment and explain how none of the other countries (Great Britain, Israel, The Netherlands, etc.) that allow gays to serve openly have not experienced any significant disruption of service and order or caused morale problems, then you may have something creditable to discuss. Until you can do that then you only have your personal opinion to speak on and that does not reflect the facts. Or perhaps you do not have the faith and confidence in our military to do as good a job in handling this issue as a dozen other countries have done. Personally, I feel our military is superior and will do even a better job than our allies when the time comes.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-14 19:07:00", 
        "title": "Morale", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either How nice of you to pop in and enlighten us. As a breath of fresh air is blowing across our country and hopefully through the military it's nice to have someone come in and remind us just what it is we're fighting against. I for one can't wait for your second post.", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either", 
        "reply": " How nice of you to pop in and enlighten us. As a breath of fresh air is blowing across our country and hopefully through the military it's nice to have someone come in and remind us just what it is we're fighting against. I for one can't wait for your second post.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-15 05:56:00", 
        "title": "Morale", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either 26 years of service? Good for you. Have a cookie. You're a newbie here, though, and we don't know you well enough to even know if you're being honest about all your years of service or anything else. What it SEEMS is that you've showed up just to make one nasty, hateful post and leave. We call that sort of thing TROLLING. I've seen misbehavior, including plenty of violations by straight individuals that cause disruption of good order and discipline. In fact, the most times I've seen/heard of a disruptive incident involving a gay or suspected gay service member, the incident is usually CAUSED by a straight homophobic person attacking or harassing the gay person. From what I can tell, we should weed out the people who actually CAUSE the problems, and make sure that homophobes don't enlist.", 
        "intTime": 20090515, 
        "postID": 7, 
        "quote": "Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either", 
        "reply": " 26 years of service? Good for you. Have a cookie. You're a newbie here, though, and we don't know you well enough to even know if you're being honest about all your years of service or anything else. What it SEEMS is that you've showed up just to make one nasty, hateful post and leave. We call that sort of thing TROLLING. I've seen misbehavior, including plenty of violations by straight individuals that cause disruption of good order and discipline. In fact, the most times I've seen/heard of a disruptive incident involving a gay or suspected gay service member, the incident is usually CAUSED by a straight homophobic person attacking or harassing the gay person. From what I can tell, we should weed out the people who actually CAUSE the problems, and make sure that homophobes don't enlist.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-15 08:35:00", 
        "title": "Morale", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "I suppose I may be mistaken but it seems to me that newbies who have only numbers in their screen names are often trolls? This message has been edited. Last edited by: Vicdude, Sun 17 May 2009 06:11 AM", 
        "intTime": 20090516, 
        "postID": 8, 
        "quote": "", 
        "reply": "I suppose I may be mistaken but it seems to me that newbies who have only numbers in their screen names are often trolls? This message has been edited. Last edited by: Vicdude, Sun 17 May 2009 06:11 AM", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-16 05:20:00", 
        "title": "Morale", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I suppose I may be mistaken but it seems to me that newbies who have only nombers in their screen names are often trolls? No one here is any more suspect than anyone else with respect to veteran status.", 
        "intTime": 20090516, 
        "postID": 9, 
        "quote": "Originally posted by Vicdude: I suppose I may be mistaken but it seems to me that newbies who have only nombers in their screen names are often trolls?", 
        "reply": " No one here is any more suspect than anyone else with respect to veteran status.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-16 09:51:00", 
        "title": "Morale", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by 21194237: quote: Originally posted by Vicdude: I suppose I may be mistaken but it seems to me that newbies who have only nombers in their screen names are often trolls? No one here is any more suspect than anyone else with respect to veteran status. You are right Numbers dude/chick. It simply shows a lack of creativity. Rock on all you Numbers dudes/chicks/its....we can't wait to read your words of wisdom written in complete anonymity.", 
        "intTime": 20090516, 
        "postID": 10, 
        "quote": "Originally posted by 21194237: quote: Originally posted by Vicdude: I suppose I may be mistaken but it seems to me that newbies who have only nombers in their screen names are often trolls? No one here is any more suspect than anyone else with respect to veteran status.", 
        "reply": " You are right Numbers dude/chick. It simply shows a lack of creativity. Rock on all you Numbers dudes/chicks/its....we can't wait to read your words of wisdom written in complete anonymity.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-16 18:27:00", 
        "title": "Morale", 
        "userID": "badbard"
    }, 
    {
        "content": "quote: Originally posted by badbard: quote: Originally posted by 21194237: quote: Originally posted by Vicdude: I suppose I may be mistaken but it seems to me that newbies who have only nombers in their screen names are often trolls? No one here is any more suspect than anyone else with respect to veteran status. You are right Numbers dude/chick. It simply shows a lack of creativity. Rock on all you Numbers dudes/chicks/its....we can't wait to read your words of wisdom written in complete anonymity. It's perfectly possible to be a Numbers dude and a new member and NOT be a troll. The key is that if a new member has no personalized identifying information and IMMEDIATELY begins posting nasty, hateful, judgmental, bigoted, idiotic, hysterical, misinformed, or other ridiculous things, then that person is likely a troll. That DOES NOT mean that the person merely disagrees with my perspective. There are plenty of people on these boards (new and old) who disagree with me but are NOT trolls. A troll is someone who comes on board JUST to say something nasty and get people riled up. The OP for this thread made the thread as his very first post. The pattern seems trollish to me.", 
        "intTime": 20090516, 
        "postID": 11, 
        "quote": "Originally posted by badbard: quote: Originally posted by 21194237: quote: Originally posted by Vicdude: I suppose I may be mistaken but it seems to me that newbies who have only nombers in their screen names are often trolls? No one here is any more suspect than anyone else with respect to veteran status. You are right Numbers dude/chick. It simply shows a lack of creativity. Rock on all you Numbers dudes/chicks/its....we can't wait to read your words of wisdom written in complete anonymity.", 
        "reply": " It's perfectly possible to be a Numbers dude and a new member and NOT be a troll. The key is that if a new member has no personalized identifying information and IMMEDIATELY begins posting nasty, hateful, judgmental, bigoted, idiotic, hysterical, misinformed, or other ridiculous things, then that person is likely a troll. That DOES NOT mean that the person merely disagrees with my perspective. There are plenty of people on these boards (new and old) who disagree with me but are NOT trolls. A troll is someone who comes on board JUST to say something nasty and get people riled up. The OP for this thread made the thread as his very first post. The pattern seems trollish to me.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-16 22:28:00", 
        "title": "Morale", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: It's perfectly possible to be a Numbers dude and a new member and NOT be a troll. The key is that if a new member has no personalized identifying information and IMMEDIATELY begins posting nasty, hateful, judgmental, bigoted, idiotic, hysterical, misinformed, or other ridiculous things, then that person is likely a troll. That DOES NOT mean that the person merely disagrees with my perspective. There are plenty of people on these boards (new and old) who disagree with me but are NOT trolls. A troll is someone who comes on board JUST to say something nasty and get people riled up. The OP for this thread made the thread as his very first post. The pattern seems trollish to me. quote: It's perfectly possible to be a Numbers dude and a new member and NOT be a troll. The key is that if a new member has no personalized identifying information and IMMEDIATELY begins posting nasty, hateful, judgmental, bigoted, idiotic, hysterical, misinformed, or other ridiculous things, then that person is likely a troll. That DOES NOT mean that the person merely disagrees with my perspective. There are plenty of people on these boards (new and old) who disagree with me but are NOT trolls. A troll is someone who comes on board JUST to say something nasty and get people riled up. The OP for this thread made the thread as his very first post. The pattern seems trollish to me. It's perfectly possible to be a Numbers dude and a new member and NOT be a troll. The key is that if a new member has no personalized identifying information and IMMEDIATELY begins posting nasty, hateful, judgmental, bigoted, idiotic, hysterical, misinformed, or other ridiculous things, then that person is likely a troll. That DOES NOT mean that the person merely disagrees with my perspective. There are plenty of people on these boards (new and old) who disagree with me but are NOT trolls. A troll is someone who comes on board JUST to say something nasty and get people riled up. The OP for this thread made the thread as his very first post. The pattern seems trollish to me. A typical \"hit and run.\" troll. He/she made one nasty post here, nothing else on any other topic and appears to have left.", 
        "intTime": 20090517, 
        "postID": 12, 
        "quote": "It's perfectly possible to be a Numbers dude and a new member and NOT be a troll. The key is that if a new member has no personalized identifying information and IMMEDIATELY begins posting nasty, hateful, judgmental, bigoted, idiotic, hysterical, misinformed, or other ridiculous things, then that person is likely a troll. That DOES NOT mean that the person merely disagrees with my perspective. There are plenty of people on these boards (new and old) who disagree with me but are NOT trolls. A troll is someone who comes on board JUST to say something nasty and get people riled up. The OP for this thread made the thread as his very first post. The pattern seems trollish to me.", 
        "reply": "  It's perfectly possible to be a Numbers dude and a new member and NOT be a troll. The key is that if a new member has no personalized identifying information and IMMEDIATELY begins posting nasty, hateful, judgmental, bigoted, idiotic, hysterical, misinformed, or other ridiculous things, then that person is likely a troll. That DOES NOT mean that the person merely disagrees with my perspective. There are plenty of people on these boards (new and old) who disagree with me but are NOT trolls. A troll is someone who comes on board JUST to say something nasty and get people riled up. The OP for this thread made the thread as his very first post. The pattern seems trollish to me. A typical \"hit and run.\" troll. He/she made one nasty post here, nothing else on any other topic and appears to have left.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-17 06:24:00", 
        "title": "Morale", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either did you ever see straights \"disrupting good order and discipline\"? I bet you did and I bet it was even more common than the percentage of each in the military at the time.", 
        "intTime": 20090520, 
        "postID": 13, 
        "quote": "Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either", 
        "reply": " did you ever see straights \"disrupting good order and discipline\"? I bet you did and I bet it was even more common than the percentage of each in the military at the time.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-20 10:47:00", 
        "title": "Morale", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either Not even to heterosexuals? And just who is the present policy of DA/DT working fine for? DaleU. When I was with Army Family Advocacy dealing with misbehaving heterosexuals, the usual incidents we got assigned to deal with was 1,500 a year at Ft. Lewis. And that's just the ones who got 'caught'. Heterosexual parents murdered 7 of their own children in that time, too. I retired from that in 2005 but I hear it is even worse. Heterosexuals who can't control their emotions and sex drives are a huge problem! In the RCF (military prison) I worked in (mental health) for 13 years every month there would be a dozen or so heterosexual offenders (rapes, child rape, adultery, etc) yet in all that time I encountered on 3 homosexuals out of approximately 250 prisoners per year - and those men we caught in consensual relationships. I have no personal interest in homosexuality (I've had the 'same sex' for 35 years with just my first wife!) but I have a strong interest in rights, justice and facts... and debunking stereotypes. I only became interested in this DA/DT issue three years ago. I was amazed at what was going on to discriminate and humiliate the gays! ....and I was outraged! Keep up the good work on these threads - all of you, gay or straight - they are most informative.", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "Originally posted by 16934819: Spent 26 years in the USAF. Those years I came across a few episodes of gays disrupting good order and discipline and I feel the current system is working fine. No change is neccesary or needed. Far as that goes Gays shouldn't be allowed to marry either", 
        "reply": " Not even to heterosexuals? And just who is the present policy of DA/DT working fine for? DaleU. When I was with Army Family Advocacy dealing with misbehaving heterosexuals, the usual incidents we got assigned to deal with was 1,500 a year at Ft. Lewis. And that's just the ones who got 'caught'. Heterosexual parents murdered 7 of their own children in that time, too. I retired from that in 2005 but I hear it is even worse. Heterosexuals who can't control their emotions and sex drives are a huge problem! In the RCF (military prison) I worked in (mental health) for 13 years every month there would be a dozen or so heterosexual offenders (rapes, child rape, adultery, etc) yet in all that time I encountered on 3 homosexuals out of approximately 250 prisoners per year - and those men we caught in consensual relationships. I have no personal interest in homosexuality (I've had the 'same sex' for 35 years with just my first wife!) but I have a strong interest in rights, justice and facts... and debunking stereotypes. I only became interested in this DA/DT issue three years ago. I was amazed at what was going on to discriminate and humiliate the gays! ....and I was outraged! Keep up the good work on these threads - all of you, gay or straight - they are most informative.", 
        "threadID": "27819558_9950013322001", 
        "time": "2009-05-20 11:41:00", 
        "title": "Morale", 
        "userID": "reducetension"
    }
]