[
    {
        "content": "See EqualRightsToPrivacy's proposal for a bipartisan progression here. >http://forums.military.com/eve/forums/a/tpc/f/27819558/m/4200021451001 Question: Is this proposal a good start? Choices: Yes, but I think it may need work. No, it is completely unworkable and I have a better bipartisan proposal.  ", 
        "intTime": 20090331, 
        "postID": 1, 
        "quote": "", 
        "reply": "See EqualRightsToPrivacy's proposal for a bipartisan progression here. >http://forums.military.com/eve/forums/a/tpc/f/27819558/m/4200021451001 Question: Is this proposal a good start? Choices: Yes, but I think it may need work. No, it is completely unworkable and I have a better bipartisan proposal.  ", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-03-31 17:25:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "cutterx2202"
    }, 
    {
        "content": "The best place to post this is here: http://forums.military.com/eve/forums/a/cfrm/f/1510084981001 You get a better cross over of all people on Military.com MD", 
        "intTime": 20090331, 
        "postID": 2, 
        "quote": "", 
        "reply": "The best place to post this is here: http://forums.military.com/eve/forums/a/cfrm/f/1510084981001 You get a better cross over of all people on Military.com MD", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-03-31 18:04:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "Interesting word, \"bipartisan.\" By \"bipartisan,\" do you mean fair, or do you mean one that you would be willing to agree with because it sufficiently limits the ability of gays to serve? All evidence in your posts points to the fact that you will throw up any roadblock you can think of to full and honest service by gays, full or partial. You spend so much time dreaming up objections and reasons that it shouldn't be so that you miss how simple the process has been in practice i other militaries that we base our own military traditions upon. The proposal you refer to is not just unworkable, it is chilling in its scope and based on a premise of pure fantasy. It has a juvenile understanding of sexuality, and a basis in fear. Here is a counter-proposal for you, and I don't even need 14 pages to explain it (oh, wait, but I'm \"on ignore\" for failure to agree with you): 1. Afford gays and bisexuals the same opportunities, rights, and responsibilities in their private lives as straights. 2. Kick gays, bisexuals and straights out of the military when their attitude towards sexuality of any kind becomes a problem. In explanation, if a gay person sexually harasses any other person, gay or straight, kick them out. Ditto for straight people. If a servicemember uses sexual favors, gay or straight, to procure favorable treatment, kick them out. If a gay, bisexual or straight person physically theatens or bullies another member due to sexual preference, kick the bully out. Make the rules zero tolerance, and make them apply equally across the board. 3. Bring UCMJ articles on sexual behavior in line with the standard the US Supreme Court has set for civilian governments. It really is that simple. It is interesting that you advocate a proposal with oodles of restrictions and tracking for gays, but none for straights. It seems that you still feel that gays are predatory, and that straights need to be somehow protected from this minority class. That is a prejudicial attitude at heart, whether you recognizer it or not.", 
        "intTime": 20090331, 
        "postID": 3, 
        "quote": "", 
        "reply": "Interesting word, \"bipartisan.\" By \"bipartisan,\" do you mean fair, or do you mean one that you would be willing to agree with because it sufficiently limits the ability of gays to serve? All evidence in your posts points to the fact that you will throw up any roadblock you can think of to full and honest service by gays, full or partial. You spend so much time dreaming up objections and reasons that it shouldn't be so that you miss how simple the process has been in practice i other militaries that we base our own military traditions upon. The proposal you refer to is not just unworkable, it is chilling in its scope and based on a premise of pure fantasy. It has a juvenile understanding of sexuality, and a basis in fear. Here is a counter-proposal for you, and I don't even need 14 pages to explain it (oh, wait, but I'm \"on ignore\" for failure to agree with you): 1. Afford gays and bisexuals the same opportunities, rights, and responsibilities in their private lives as straights. 2. Kick gays, bisexuals and straights out of the military when their attitude towards sexuality of any kind becomes a problem. In explanation, if a gay person sexually harasses any other person, gay or straight, kick them out. Ditto for straight people. If a servicemember uses sexual favors, gay or straight, to procure favorable treatment, kick them out. If a gay, bisexual or straight person physically theatens or bullies another member due to sexual preference, kick the bully out. Make the rules zero tolerance, and make them apply equally across the board. 3. Bring UCMJ articles on sexual behavior in line with the standard the US Supreme Court has set for civilian governments. It really is that simple. It is interesting that you advocate a proposal with oodles of restrictions and tracking for gays, but none for straights. It seems that you still feel that gays are predatory, and that straights need to be somehow protected from this minority class. That is a prejudicial attitude at heart, whether you recognizer it or not.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-03-31 19:02:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "Bleah"
    }, 
    {
        "content": "Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue.", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "", 
        "reply": "Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-01 21:56:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "reducetension"
    }, 
    {
        "content": "Thanks, mainedawg.", 
        "intTime": 20090408, 
        "postID": 5, 
        "quote": "", 
        "reply": "Thanks, mainedawg.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-08 19:07:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "cutterx2202"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue. He's pretending to have me on \"ignore\" so that he is unconstrained to respond. Perhaps if the idea came from you he could pretend that he never saw it from me and respond without losing face.", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "Originally posted by reducetension: Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue.", 
        "reply": " He's pretending to have me on \"ignore\" so that he is unconstrained to respond. Perhaps if the idea came from you he could pretend that he never saw it from me and respond without losing face.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-08 21:23:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: Originally posted by reducetension: Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue. He's pretending to have me on \"ignore\" so that he is unconstrained to respond. Perhaps if the idea came from you he could pretend that he never saw it from me and respond without losing face. Looks like cutter has been cut. I have asked the question before but as far as I know, none of the 'compromise' advocates have asked any of the gay poster what they think would be a 'compromise' worth supporting. I think they think they know what best for the gays. Nice of them. I personally think the wider culture is tired of \"picking on gays\" and would like to see this whole issue become history and let the gay community get on with life, including in the military. But, as we all know, it won't be 100% approval or tolerance. There will always be opposition and a desire to control.", 
        "intTime": 20090408, 
        "postID": 7, 
        "quote": "Originally posted by Bleah: quote: Originally posted by reducetension: Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue. He's pretending to have me on \"ignore\" so that he is unconstrained to respond. Perhaps if the idea came from you he could pretend that he never saw it from me and respond without losing face.", 
        "reply": " Looks like cutter has been cut. I have asked the question before but as far as I know, none of the 'compromise' advocates have asked any of the gay poster what they think would be a 'compromise' worth supporting. I think they think they know what best for the gays. Nice of them. I personally think the wider culture is tired of \"picking on gays\" and would like to see this whole issue become history and let the gay community get on with life, including in the military. But, as we all know, it won't be 100% approval or tolerance. There will always be opposition and a desire to control.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-08 21:42:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "reducetension"
    }, 
    {
        "content": "Sorry, but DADT was your \"start\". THAT was the interim policy until DADT and all restrictions on gays serving honestly in the military could be done away with.", 
        "intTime": 20090409, 
        "postID": 8, 
        "quote": "", 
        "reply": "Sorry, but DADT was your \"start\". THAT was the interim policy until DADT and all restrictions on gays serving honestly in the military could be done away with.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 06:12:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "We left him here for you as long as we could. Only a few more to go. MD", 
        "intTime": 20090409, 
        "postID": 9, 
        "quote": "", 
        "reply": "We left him here for you as long as we could. Only a few more to go. MD", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 06:44:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Interesting word, \"bipartisan.\" By \"bipartisan,\" do you mean fair, or do you mean one that you would be willing to agree with because it sufficiently limits the ability of gays to serve? All evidence in your posts points to the fact that you will throw up any roadblock you can think of to full and honest service by gays, full or partial. You spend so much time dreaming up objections and reasons that it shouldn't be so that you miss how simple the process has been in practice i other militaries that we base our own military traditions upon. The proposal you refer to is not just unworkable, it is chilling in its scope and based on a premise of pure fantasy. It has a juvenile understanding of sexuality, and a basis in fear. Here is a counter-proposal for you, and I don't even need 14 pages to explain it (oh, wait, but I'm \"on ignore\" for failure to agree with you): 1. Afford gays and bisexuals the same opportunities, rights, and responsibilities in their private lives as straights. 2. Kick gays, bisexuals and straights out of the military when their attitude towards sexuality of any kind becomes a problem. In explanation, if a gay person sexually harasses any other person, gay or straight, kick them out. Ditto for straight people. If a servicemember uses sexual favors, gay or straight, to procure favorable treatment, kick them out. If a gay, bisexual or straight person physically theatens or bullies another member due to sexual preference, kick the bully out. Make the rules zero tolerance, and make them apply equally across the board. 3. Bring UCMJ articles on sexual behavior in line with the standard the US Supreme Court has set for civilian governments. It really is that simple. It is interesting that you advocate a proposal with oodles of restrictions and tracking for gays, but none for straights. It seems that you still feel that gays are predatory, and that straights need to be somehow protected from this minority class. That is a prejudicial attitude at heart, whether you recognizer it or not. I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy?", 
        "intTime": 20090409, 
        "postID": 10, 
        "quote": "Originally posted by Bleah: Interesting word, \"bipartisan.\" By \"bipartisan,\" do you mean fair, or do you mean one that you would be willing to agree with because it sufficiently limits the ability of gays to serve? All evidence in your posts points to the fact that you will throw up any roadblock you can think of to full and honest service by gays, full or partial. You spend so much time dreaming up objections and reasons that it shouldn't be so that you miss how simple the process has been in practice i other militaries that we base our own military traditions upon. The proposal you refer to is not just unworkable, it is chilling in its scope and based on a premise of pure fantasy. It has a juvenile understanding of sexuality, and a basis in fear. Here is a counter-proposal for you, and I don't even need 14 pages to explain it (oh, wait, but I'm \"on ignore\" for failure to agree with you): 1. Afford gays and bisexuals the same opportunities, rights, and responsibilities in their private lives as straights. 2. Kick gays, bisexuals and straights out of the military when their attitude towards sexuality of any kind becomes a problem. In explanation, if a gay person sexually harasses any other person, gay or straight, kick them out. Ditto for straight people. If a servicemember uses sexual favors, gay or straight, to procure favorable treatment, kick them out. If a gay, bisexual or straight person physically theatens or bullies another member due to sexual preference, kick the bully out. Make the rules zero tolerance, and make them apply equally across the board. 3. Bring UCMJ articles on sexual behavior in line with the standard the US Supreme Court has set for civilian governments. It really is that simple. It is interesting that you advocate a proposal with oodles of restrictions and tracking for gays, but none for straights. It seems that you still feel that gays are predatory, and that straights need to be somehow protected from this minority class. That is a prejudicial attitude at heart, whether you recognizer it or not.", 
        "reply": " I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy?", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 07:28:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: SORRY GUYS, YOUR CHEW TOY HAS BEEN SENT PACKING, I AM SURE ANOTHER WILL SHOW TO TAKE HIS PLACE. This remark is VERY....revealing.", 
        "intTime": 20090409, 
        "postID": 11, 
        "quote": "Originally posted by NEMESIS1960: SORRY GUYS, YOUR CHEW TOY HAS BEEN SENT PACKING, I AM SURE ANOTHER WILL SHOW TO TAKE HIS PLACE.", 
        "reply": " This remark is VERY....revealing.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 07:29:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: We left him here for you as long as we could. Only a few more to go. MD This one, too!", 
        "intTime": 20090409, 
        "postID": 12, 
        "quote": "Originally posted by mainedawg: We left him here for you as long as we could. Only a few more to go. MD", 
        "reply": " This one, too!", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 07:30:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: i.e. modification of the existing DADT policy? DA (don't ask), yes, that part could/should remain. Modify DT (don't tell) to say only on a voluntary basis. No punishment for being free and honest. Otherwise, drop the entire silly rule and let people of minority sexual orientation who qualify to serve in the military do so with the same level of freedom and opportunity the major orientation enjoys. Everything else to deal with any problems that might arise are already in place in the military. Nothing more need to be done.... ...oh, maybe a briefing or two for those who \"don't get it\" with the usual warnings of consequences for harassment, etc. That's the only reasonable \"modification\".", 
        "intTime": 20090409, 
        "postID": 13, 
        "quote": "i.e. modification of the existing DADT policy?", 
        "reply": " DA (don't ask), yes, that part could/should remain. Modify DT (don't tell) to say only on a voluntary basis. No punishment for being free and honest. Otherwise, drop the entire silly rule and let people of minority sexual orientation who qualify to serve in the military do so with the same level of freedom and opportunity the major orientation enjoys. Everything else to deal with any problems that might arise are already in place in the military. Nothing more need to be done.... ...oh, maybe a briefing or two for those who \"don't get it\" with the usual warnings of consequences for harassment, etc. That's the only reasonable \"modification\".", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 09:58:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by 19022583: I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy? Nope, no \"modification\". We have had over ten years of the \"compromise\" that is known as DADT. It was NOT a compromise for gay and lesbians in the service, only the straight ones that want to pretend the gays aren't really there. (While we still get discharged at a rate of 2 per day) The only modification will be doing away with it entirely and allowing gays and lesbians to serve honestly.", 
        "intTime": 20090410, 
        "postID": 14, 
        "quote": "Originally posted by 19022583: I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy?", 
        "reply": " Nope, no \"modification\". We have had over ten years of the \"compromise\" that is known as DADT. It was NOT a compromise for gay and lesbians in the service, only the straight ones that want to pretend the gays aren't really there. (While we still get discharged at a rate of 2 per day) The only modification will be doing away with it entirely and allowing gays and lesbians to serve honestly.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-10 05:34:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 19022583: I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy? Nope, no \"modification\". We have had over ten years of the \"compromise\" that is known as DADT. It was NOT a compromise for gay and lesbians in the service, only the straight ones that want to pretend the gays aren't really there. (While we still get discharged at a rate of 2 per day) The only modification will be doing away with it entirely and allowing gays and lesbians to serve honestly. As I was responding to Bleah, reckon I'll wait for his/her answer.", 
        "intTime": 20090410, 
        "postID": 15, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 19022583: I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy? Nope, no \"modification\". We have had over ten years of the \"compromise\" that is known as DADT. It was NOT a compromise for gay and lesbians in the service, only the straight ones that want to pretend the gays aren't really there. (While we still get discharged at a rate of 2 per day) The only modification will be doing away with it entirely and allowing gays and lesbians to serve honestly.", 
        "reply": " As I was responding to Bleah, reckon I'll wait for his/her answer.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-10 09:59:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "19022583"
    }, 
    {
        "content": "", 
        "intTime": 20090410, 
        "postID": 16, 
        "quote": "", 
        "reply": "", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-10 12:23:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now.", 
        "intTime": 20090412, 
        "postID": 17, 
        "quote": "Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer.", 
        "reply": " Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-12 09:47:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now. I have permanently suspended him ... MD", 
        "intTime": 20090412, 
        "postID": 18, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now.", 
        "reply": " I have permanently suspended him ... MD", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-12 11:34:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: Originally posted by SeaWitch1220: quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now. I have permanently suspended him ... MD I'm a little confused I guess. Is it appropriate for me to ask why? He must have posted somethnig I didn't see.", 
        "intTime": 20090414, 
        "postID": 19, 
        "quote": "Originally posted by mainedawg: quote: Originally posted by SeaWitch1220: quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now. I have permanently suspended him ... MD", 
        "reply": " I'm a little confused I guess. Is it appropriate for me to ask why? He must have posted somethnig I didn't see.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-14 08:30:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "Bleah"
    }, 
    {
        "content": "See EqualRightsToPrivacy's proposal for a bipartisan progression here. >http://forums.military.com/eve/forums/a/tpc/f/27819558/m/4200021451001 Question: Is this proposal a good start? Choices: Yes, but I think it may need work. No, it is completely unworkable and I have a better bipartisan proposal.  ", 
        "intTime": 20090331, 
        "postID": 20, 
        "quote": "", 
        "reply": "See EqualRightsToPrivacy's proposal for a bipartisan progression here. >http://forums.military.com/eve/forums/a/tpc/f/27819558/m/4200021451001 Question: Is this proposal a good start? Choices: Yes, but I think it may need work. No, it is completely unworkable and I have a better bipartisan proposal.  ", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-03-31 17:25:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "cutterx2202"
    }, 
    {
        "content": "The best place to post this is here: http://forums.military.com/eve/forums/a/cfrm/f/1510084981001 You get a better cross over of all people on Military.com MD", 
        "intTime": 20090331, 
        "postID": 21, 
        "quote": "", 
        "reply": "The best place to post this is here: http://forums.military.com/eve/forums/a/cfrm/f/1510084981001 You get a better cross over of all people on Military.com MD", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-03-31 18:04:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "Interesting word, \"bipartisan.\" By \"bipartisan,\" do you mean fair, or do you mean one that you would be willing to agree with because it sufficiently limits the ability of gays to serve? All evidence in your posts points to the fact that you will throw up any roadblock you can think of to full and honest service by gays, full or partial. You spend so much time dreaming up objections and reasons that it shouldn't be so that you miss how simple the process has been in practice i other militaries that we base our own military traditions upon. The proposal you refer to is not just unworkable, it is chilling in its scope and based on a premise of pure fantasy. It has a juvenile understanding of sexuality, and a basis in fear. Here is a counter-proposal for you, and I don't even need 14 pages to explain it (oh, wait, but I'm \"on ignore\" for failure to agree with you): 1. Afford gays and bisexuals the same opportunities, rights, and responsibilities in their private lives as straights. 2. Kick gays, bisexuals and straights out of the military when their attitude towards sexuality of any kind becomes a problem. In explanation, if a gay person sexually harasses any other person, gay or straight, kick them out. Ditto for straight people. If a servicemember uses sexual favors, gay or straight, to procure favorable treatment, kick them out. If a gay, bisexual or straight person physically theatens or bullies another member due to sexual preference, kick the bully out. Make the rules zero tolerance, and make them apply equally across the board. 3. Bring UCMJ articles on sexual behavior in line with the standard the US Supreme Court has set for civilian governments. It really is that simple. It is interesting that you advocate a proposal with oodles of restrictions and tracking for gays, but none for straights. It seems that you still feel that gays are predatory, and that straights need to be somehow protected from this minority class. That is a prejudicial attitude at heart, whether you recognizer it or not.", 
        "intTime": 20090331, 
        "postID": 22, 
        "quote": "", 
        "reply": "Interesting word, \"bipartisan.\" By \"bipartisan,\" do you mean fair, or do you mean one that you would be willing to agree with because it sufficiently limits the ability of gays to serve? All evidence in your posts points to the fact that you will throw up any roadblock you can think of to full and honest service by gays, full or partial. You spend so much time dreaming up objections and reasons that it shouldn't be so that you miss how simple the process has been in practice i other militaries that we base our own military traditions upon. The proposal you refer to is not just unworkable, it is chilling in its scope and based on a premise of pure fantasy. It has a juvenile understanding of sexuality, and a basis in fear. Here is a counter-proposal for you, and I don't even need 14 pages to explain it (oh, wait, but I'm \"on ignore\" for failure to agree with you): 1. Afford gays and bisexuals the same opportunities, rights, and responsibilities in their private lives as straights. 2. Kick gays, bisexuals and straights out of the military when their attitude towards sexuality of any kind becomes a problem. In explanation, if a gay person sexually harasses any other person, gay or straight, kick them out. Ditto for straight people. If a servicemember uses sexual favors, gay or straight, to procure favorable treatment, kick them out. If a gay, bisexual or straight person physically theatens or bullies another member due to sexual preference, kick the bully out. Make the rules zero tolerance, and make them apply equally across the board. 3. Bring UCMJ articles on sexual behavior in line with the standard the US Supreme Court has set for civilian governments. It really is that simple. It is interesting that you advocate a proposal with oodles of restrictions and tracking for gays, but none for straights. It seems that you still feel that gays are predatory, and that straights need to be somehow protected from this minority class. That is a prejudicial attitude at heart, whether you recognizer it or not.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-03-31 19:02:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "Bleah"
    }, 
    {
        "content": "Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue.", 
        "intTime": 20090401, 
        "postID": 23, 
        "quote": "", 
        "reply": "Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-01 21:56:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "reducetension"
    }, 
    {
        "content": "Thanks, mainedawg.", 
        "intTime": 20090408, 
        "postID": 24, 
        "quote": "", 
        "reply": "Thanks, mainedawg.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-08 19:07:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "cutterx2202"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue. He's pretending to have me on \"ignore\" so that he is unconstrained to respond. Perhaps if the idea came from you he could pretend that he never saw it from me and respond without losing face.", 
        "intTime": 20090408, 
        "postID": 25, 
        "quote": "Originally posted by reducetension: Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue.", 
        "reply": " He's pretending to have me on \"ignore\" so that he is unconstrained to respond. Perhaps if the idea came from you he could pretend that he never saw it from me and respond without losing face.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-08 21:23:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: Originally posted by reducetension: Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue. He's pretending to have me on \"ignore\" so that he is unconstrained to respond. Perhaps if the idea came from you he could pretend that he never saw it from me and respond without losing face. Looks like cutter has been cut. I have asked the question before but as far as I know, none of the 'compromise' advocates have asked any of the gay poster what they think would be a 'compromise' worth supporting. I think they think they know what best for the gays. Nice of them. I personally think the wider culture is tired of \"picking on gays\" and would like to see this whole issue become history and let the gay community get on with life, including in the military. But, as we all know, it won't be 100% approval or tolerance. There will always be opposition and a desire to control.", 
        "intTime": 20090408, 
        "postID": 26, 
        "quote": "Originally posted by Bleah: quote: Originally posted by reducetension: Thank you, Bleah! I have asked the advocates of the \"Equal\" treatment to ask the gays what they would propose but they have not. Enough of their proposals for micro-managing the sexual orientation of people they are opposed to. I concur completely with what you propose. That's the best 'common sense' approach to this issue. He's pretending to have me on \"ignore\" so that he is unconstrained to respond. Perhaps if the idea came from you he could pretend that he never saw it from me and respond without losing face.", 
        "reply": " Looks like cutter has been cut. I have asked the question before but as far as I know, none of the 'compromise' advocates have asked any of the gay poster what they think would be a 'compromise' worth supporting. I think they think they know what best for the gays. Nice of them. I personally think the wider culture is tired of \"picking on gays\" and would like to see this whole issue become history and let the gay community get on with life, including in the military. But, as we all know, it won't be 100% approval or tolerance. There will always be opposition and a desire to control.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-08 21:42:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "reducetension"
    }, 
    {
        "content": "Sorry, but DADT was your \"start\". THAT was the interim policy until DADT and all restrictions on gays serving honestly in the military could be done away with.", 
        "intTime": 20090409, 
        "postID": 27, 
        "quote": "", 
        "reply": "Sorry, but DADT was your \"start\". THAT was the interim policy until DADT and all restrictions on gays serving honestly in the military could be done away with.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 06:12:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "We left him here for you as long as we could. Only a few more to go. MD", 
        "intTime": 20090409, 
        "postID": 28, 
        "quote": "", 
        "reply": "We left him here for you as long as we could. Only a few more to go. MD", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 06:44:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Interesting word, \"bipartisan.\" By \"bipartisan,\" do you mean fair, or do you mean one that you would be willing to agree with because it sufficiently limits the ability of gays to serve? All evidence in your posts points to the fact that you will throw up any roadblock you can think of to full and honest service by gays, full or partial. You spend so much time dreaming up objections and reasons that it shouldn't be so that you miss how simple the process has been in practice i other militaries that we base our own military traditions upon. The proposal you refer to is not just unworkable, it is chilling in its scope and based on a premise of pure fantasy. It has a juvenile understanding of sexuality, and a basis in fear. Here is a counter-proposal for you, and I don't even need 14 pages to explain it (oh, wait, but I'm \"on ignore\" for failure to agree with you): 1. Afford gays and bisexuals the same opportunities, rights, and responsibilities in their private lives as straights. 2. Kick gays, bisexuals and straights out of the military when their attitude towards sexuality of any kind becomes a problem. In explanation, if a gay person sexually harasses any other person, gay or straight, kick them out. Ditto for straight people. If a servicemember uses sexual favors, gay or straight, to procure favorable treatment, kick them out. If a gay, bisexual or straight person physically theatens or bullies another member due to sexual preference, kick the bully out. Make the rules zero tolerance, and make them apply equally across the board. 3. Bring UCMJ articles on sexual behavior in line with the standard the US Supreme Court has set for civilian governments. It really is that simple. It is interesting that you advocate a proposal with oodles of restrictions and tracking for gays, but none for straights. It seems that you still feel that gays are predatory, and that straights need to be somehow protected from this minority class. That is a prejudicial attitude at heart, whether you recognizer it or not. I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy?", 
        "intTime": 20090409, 
        "postID": 29, 
        "quote": "Originally posted by Bleah: Interesting word, \"bipartisan.\" By \"bipartisan,\" do you mean fair, or do you mean one that you would be willing to agree with because it sufficiently limits the ability of gays to serve? All evidence in your posts points to the fact that you will throw up any roadblock you can think of to full and honest service by gays, full or partial. You spend so much time dreaming up objections and reasons that it shouldn't be so that you miss how simple the process has been in practice i other militaries that we base our own military traditions upon. The proposal you refer to is not just unworkable, it is chilling in its scope and based on a premise of pure fantasy. It has a juvenile understanding of sexuality, and a basis in fear. Here is a counter-proposal for you, and I don't even need 14 pages to explain it (oh, wait, but I'm \"on ignore\" for failure to agree with you): 1. Afford gays and bisexuals the same opportunities, rights, and responsibilities in their private lives as straights. 2. Kick gays, bisexuals and straights out of the military when their attitude towards sexuality of any kind becomes a problem. In explanation, if a gay person sexually harasses any other person, gay or straight, kick them out. Ditto for straight people. If a servicemember uses sexual favors, gay or straight, to procure favorable treatment, kick them out. If a gay, bisexual or straight person physically theatens or bullies another member due to sexual preference, kick the bully out. Make the rules zero tolerance, and make them apply equally across the board. 3. Bring UCMJ articles on sexual behavior in line with the standard the US Supreme Court has set for civilian governments. It really is that simple. It is interesting that you advocate a proposal with oodles of restrictions and tracking for gays, but none for straights. It seems that you still feel that gays are predatory, and that straights need to be somehow protected from this minority class. That is a prejudicial attitude at heart, whether you recognizer it or not.", 
        "reply": " I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy?", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 07:28:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: SORRY GUYS, YOUR CHEW TOY HAS BEEN SENT PACKING, I AM SURE ANOTHER WILL SHOW TO TAKE HIS PLACE. This remark is VERY....revealing.", 
        "intTime": 20090409, 
        "postID": 30, 
        "quote": "Originally posted by NEMESIS1960: SORRY GUYS, YOUR CHEW TOY HAS BEEN SENT PACKING, I AM SURE ANOTHER WILL SHOW TO TAKE HIS PLACE.", 
        "reply": " This remark is VERY....revealing.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 07:29:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: We left him here for you as long as we could. Only a few more to go. MD This one, too!", 
        "intTime": 20090409, 
        "postID": 31, 
        "quote": "Originally posted by mainedawg: We left him here for you as long as we could. Only a few more to go. MD", 
        "reply": " This one, too!", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 07:30:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: i.e. modification of the existing DADT policy? DA (don't ask), yes, that part could/should remain. Modify DT (don't tell) to say only on a voluntary basis. No punishment for being free and honest. Otherwise, drop the entire silly rule and let people of minority sexual orientation who qualify to serve in the military do so with the same level of freedom and opportunity the major orientation enjoys. Everything else to deal with any problems that might arise are already in place in the military. Nothing more need to be done.... ...oh, maybe a briefing or two for those who \"don't get it\" with the usual warnings of consequences for harassment, etc. That's the only reasonable \"modification\".", 
        "intTime": 20090409, 
        "postID": 32, 
        "quote": "i.e. modification of the existing DADT policy?", 
        "reply": " DA (don't ask), yes, that part could/should remain. Modify DT (don't tell) to say only on a voluntary basis. No punishment for being free and honest. Otherwise, drop the entire silly rule and let people of minority sexual orientation who qualify to serve in the military do so with the same level of freedom and opportunity the major orientation enjoys. Everything else to deal with any problems that might arise are already in place in the military. Nothing more need to be done.... ...oh, maybe a briefing or two for those who \"don't get it\" with the usual warnings of consequences for harassment, etc. That's the only reasonable \"modification\".", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-09 09:58:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by 19022583: I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy? Nope, no \"modification\". We have had over ten years of the \"compromise\" that is known as DADT. It was NOT a compromise for gay and lesbians in the service, only the straight ones that want to pretend the gays aren't really there. (While we still get discharged at a rate of 2 per day) The only modification will be doing away with it entirely and allowing gays and lesbians to serve honestly.", 
        "intTime": 20090410, 
        "postID": 33, 
        "quote": "Originally posted by 19022583: I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy?", 
        "reply": " Nope, no \"modification\". We have had over ten years of the \"compromise\" that is known as DADT. It was NOT a compromise for gay and lesbians in the service, only the straight ones that want to pretend the gays aren't really there. (While we still get discharged at a rate of 2 per day) The only modification will be doing away with it entirely and allowing gays and lesbians to serve honestly.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-10 05:34:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 19022583: I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy? Nope, no \"modification\". We have had over ten years of the \"compromise\" that is known as DADT. It was NOT a compromise for gay and lesbians in the service, only the straight ones that want to pretend the gays aren't really there. (While we still get discharged at a rate of 2 per day) The only modification will be doing away with it entirely and allowing gays and lesbians to serve honestly. As I was responding to Bleah, reckon I'll wait for his/her answer.", 
        "intTime": 20090410, 
        "postID": 34, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 19022583: I notice that this counterproposal doesn't include the repeal of DADT, so perhaps there is room to discuss what I've advocated, i.e. modification of the existing DADT policy? Nope, no \"modification\". We have had over ten years of the \"compromise\" that is known as DADT. It was NOT a compromise for gay and lesbians in the service, only the straight ones that want to pretend the gays aren't really there. (While we still get discharged at a rate of 2 per day) The only modification will be doing away with it entirely and allowing gays and lesbians to serve honestly.", 
        "reply": " As I was responding to Bleah, reckon I'll wait for his/her answer.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-10 09:59:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "19022583"
    }, 
    {
        "content": "", 
        "intTime": 20090410, 
        "postID": 35, 
        "quote": "", 
        "reply": "", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-10 12:23:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now.", 
        "intTime": 20090412, 
        "postID": 36, 
        "quote": "Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer.", 
        "reply": " Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-12 09:47:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now. I have permanently suspended him ... MD", 
        "intTime": 20090412, 
        "postID": 37, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now.", 
        "reply": " I have permanently suspended him ... MD", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-12 11:34:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: Originally posted by SeaWitch1220: quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now. I have permanently suspended him ... MD I'm a little confused I guess. Is it appropriate for me to ask why? He must have posted somethnig I didn't see.", 
        "intTime": 20090414, 
        "postID": 38, 
        "quote": "Originally posted by mainedawg: quote: Originally posted by SeaWitch1220: quote: Originally posted by 19022583: As I was responding to Bleah, reckon I'll wait for his/her answer. Since this is an internet forum and not your private email, I am surprised you would get so huffy about my replying to it. If Bleah DOES decide to answer you, I guess you will just have to read his response. Should have responded to me while you still had the chance. Bye now. I have permanently suspended him ... MD", 
        "reply": " I'm a little confused I guess. Is it appropriate for me to ask why? He must have posted somethnig I didn't see.", 
        "threadID": "27819558_5940084912001", 
        "time": "2009-04-14 08:30:00", 
        "title": "Is This Proposal A Good Start?", 
        "userID": "Bleah"
    }
]