[
    {
        "content": "WASHINGTON, DC 3-02-09 -- Today Rep. Ellen Tauscher (D-CA) announced at the Center for American Progress that she will introduce a bill to repeal the \"Don't Ask, Don't Tell\" law that bans gays and lesbians from serving openly. \"Rep. Tauscher's bill will significantly improve our military readiness by allowing highly qualified linguists, medics, and intelligence analysts to serve openly in the armed forces,\" said Aubrey Sarvis, executive director of the Servicemembers Legal Defense Network. \"SLDN, as well as the 12,500 people who have been discharged under the law and the 3,000 men and women each year who choose not to enlist or re-enlist because of the law, owe the congresswoman our sincere gratitude.\" The Military Enhancement Readiness Act (MREA) repeals the current ban on military service by openly lesbian, gay and bisexual Americans, commonly referred to as \"Don't Ask, Don't Tell.\" It would replace the current law with new provisions prohibiting discrimination based on sexual orientation in the Armed Forces. Last year, the MREA had 149 bipartisan cosponsors. \"This law has failed our country and our military for 15 years,\" said Rep. Tauscher. \"It harms military readiness and discriminates against patriotic young men and women who want to serve their country. It's time for Congress to right this wrong.\" Rep. Tauscher will be announcing her legislation at the Center for American Progress, 1333 H Street NW, 10th Floor, Washington, D.C. \"There is a window of opportunity to get repeal done this year,\" said Sarvis. \"We urge the Commander-in-Chief to lead on this issue, particularly at a time, as reported last week by the Associated Press, when the Pentagon itself concluded the U.S. military is stressed, stretched, and strained.\" Today's bill announcement prompted this statement from WH. “The President supports changing Don’t Ask Don’t Tell. As part of a long standing pledge, he has also begun consulting closely with Secretary Gates and Chairman Mullen so that this change is done in a sensible way that strengthens our armed forces and our national security.”", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "WASHINGTON, DC 3-02-09 -- Today Rep. Ellen Tauscher (D-CA) announced at the Center for American Progress that she will introduce a bill to repeal the \"Don't Ask, Don't Tell\" law that bans gays and lesbians from serving openly. \"Rep. Tauscher's bill will significantly improve our military readiness by allowing highly qualified linguists, medics, and intelligence analysts to serve openly in the armed forces,\" said Aubrey Sarvis, executive director of the Servicemembers Legal Defense Network. \"SLDN, as well as the 12,500 people who have been discharged under the law and the 3,000 men and women each year who choose not to enlist or re-enlist because of the law, owe the congresswoman our sincere gratitude.\" The Military Enhancement Readiness Act (MREA) repeals the current ban on military service by openly lesbian, gay and bisexual Americans, commonly referred to as \"Don't Ask, Don't Tell.\" It would replace the current law with new provisions prohibiting discrimination based on sexual orientation in the Armed Forces. Last year, the MREA had 149 bipartisan cosponsors. \"This law has failed our country and our military for 15 years,\" said Rep. Tauscher. \"It harms military readiness and discriminates against patriotic young men and women who want to serve their country. It's time for Congress to right this wrong.\" Rep. Tauscher will be announcing her legislation at the Center for American Progress, 1333 H Street NW, 10th Floor, Washington, D.C. \"There is a window of opportunity to get repeal done this year,\" said Sarvis. \"We urge the Commander-in-Chief to lead on this issue, particularly at a time, as reported last week by the Associated Press, when the Pentagon itself concluded the U.S. military is stressed, stretched, and strained.\" Today's bill announcement prompted this statement from WH. “The President supports changing Don’t Ask Don’t Tell. As part of a long standing pledge, he has also begun consulting closely with Secretary Gates and Chairman Mullen so that this change is done in a sensible way that strengthens our armed forces and our national security.”", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-02 20:34:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "\"IHAWKERS'\" Thread: \"Change [...] Put on hold.\" appeared to tell a different story regarding the, \"timing,\" of such a Bill. This should be a real test of where the Administration stands. Surprising the Decromats' argument will be, \"recruiting.\" Democrats have a history of being spineless on real issues. The real issue is of, \"Equal Rights,\" of what will become a protected minority class under Federal Law, when this thing passess, or one like it. Again, sad the Democrats will attempt to hide behind, \"recruiting,\" verses the human rights of American citizens. Not to mention, in my opinion, \"Military Readiness,\" is also a weak argument in relation to this social issue relative to the necessary social change it implies. *** That said, it really becomes necessary to take a real close look at, \"H.R. 1246,\" if that is the Bill they will present, or if there are modifications, what are they, etc. (?): 1.) Unless something has changed, the subject Bill does not include the, \"T,\" in GLBT. This is an absolute human rights violation and the Democrats should be ashamed. Again, a spineless move if, \"T,\" are kicked to the political curb. 2.) The language I've highlighted in Red Bold is what I think is the other major flaw with, \"H.R. 1246.\" Probably even more sinister. Please excuse if this below reference is way different than the Bill-form Rep. Tauscher is suggesting. Perhaps someone could post her Bill-form if it's available? *** 110TH CONGRESS 1ST SESSION H. R. 1246 To amend title 10, United States Code, to enhance the readiness of the Armed Forces by replacing the current policy concerning homosexuality in the Armed Forces, referred to as ‘‘Don’t Ask, Don’t Tell’’, with a policy of nondiscrimination on the basis of sexual orientation. IN THE HOUSE OF REPRESENTATIVES FEBRUARY 28, 2007 Mr. MEEHAN (for himself, Mr. SMITH of Washington, Mr. WYNN, Mr. HASTINGS of Florida, Ms. SCHWARTZ, Mr. WEINER, Ms. LEE, Mr. FRANK of Massachusetts, Ms. MCCOLLUM of Minnesota, Mr. PASCRELL, Mr. FILNER, Mrs. MALONEY of New York, Mr. FATTAH, Mr. RANGEL, Mr. SHAYS, Mr. VAN HOLLEN, Ms. CORRINE BROWN of Florida, Mr. DAVIS of Illinois, Mr. WU, Ms. WASSERMAN SCHULTZ, Mr. KUCINICH, Ms. WATSON, Mr. PAYNE, Ms. MATSUI, Mr. BLUMENAUER, Mr. PASTOR, Ms. EDDIE BERNICE JOHNSON of Texas, Mr. TOWNS, Mr. MARKEY, Ms. NORTON, Mr. CUMMINGS, Mr. ENGEL, Mrs. TAUSCHER, Mr. CLEAVER, Mr. PALLONE, Mr. ACKERMAN, Mr. GEORGE MILLER of California, Mrs. NAPOLITANO, Mr. MEEKS of New York, Ms. MOORE of Wisconsin, Mr. JOHNSON of Georgia, Mr. WAXMAN, Ms. SOLIS, Mr. BERMAN, Ms. ROSLEHTINEN, Mr. LANGEVIN, Mr. MORAN of Virginia, Mr. OBERSTAR, Ms. SCHAKOWSKY, Ms. HARMAN, Mr. INSLEE, Mr. NADLER, Mr. MCDERMOTT, Mr. MCGOVERN, Mr. DINGELL, Mr. LARSON of Connecticut, Mr. LEWIS of Georgia, Mr. OLVER, Mr. TIERNEY, Mr. SERRANO, Mr. CROWLEY, Ms. CARSON, Ms. CASTOR, Mr. ELLISON, Ms. LINDA T. SA ´NCHEZ of California, Mrs. CAPPS, Ms. SLAUGHTER, Ms. ROYBAL-ALLARD, Mr. GUTIERREZ, Ms. WOOLSEY, Mr. UDALL of Colorado, Mr. HINCHEY, Ms. WATERS, Ms. HIRONO, Mr. CAPUANO, Mr. DOYLE, Mr. HONDA, Mr. MICHAUD, Mr. ABERCROMBIE, Mrs. LOWEY, Ms. VELA´ZQUEZ, Mr. KENNEDY, Mr. STARK, Mr. DEFAZIO, Mr. WELCH of Vermont, Mr. HARE, Mr. EMANUEL, Mr. GRIJALVA, Mr. NEAL of Massachusetts, Mr. BRADY of Pennsylvania, Mr. WEXLER, Ms. DELAURO, Mr. HOLT, Mr. FARR, Ms. JACKSON-LEE of Texas, Ms. BERKLEY, Mrs. JONES of Ohio, Mr. LYNCH, Mr. COHEN, Mr. ISRAEL, Mr. ROTHMAN, Mrs. DAVIS of California, Ms. BALDWIN, Mr. ALLEN, Mr. LANTOS, Mr. GILCHREST, Mr. DELAHUNT, Mr. CLAY, Mr. BECERRA, and Ms. ZOE LOFGREN of California) introduced the following bill; which was referred to the Committee on Armed Services VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00001 Fmt 6652 Sfmt 6652 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 2 •HR 1246 IH A BILL To amend title 10, United States Code, to enhance the readiness of the Armed Forces by replacing the current policy concerning homosexuality in the Armed Forces, referred to as ‘‘Don’t Ask, Don’t Tell’’, with a policy of nondiscrimination on the basis of sexual orientation. 1 Be it enacted by the Senate and House of Representa2 tives of the United States of America in Congress assembled, 3 SECTION 1. SHORT TITLE. 4 This Act may be cited as the ‘‘Military Readiness En5 hancement Act of 2007’’. 6 SEC. 2. PURPOSE. 7 The purpose of this Act is to institute in the Armed 8 Forces a policy of nondiscrimination based on sexual ori9 entation. 10 SEC. 3. REPEAL OF 1993 POLICY CONCERNING HOMOSEX11 UALITY IN THE ARMED FORCES. 12 The following provisions of law are repealed: 13 (1) Section 654 of title 10, United States Code. 14 (2) Subsections (b), (c), and (d) of section 571 15 of the National Defense Authorization Act for Fiscal 16 Year 1994 (10 U.S.C. 654 note). VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00002 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 3 •HR 1246 IH 1 SEC. 4. ESTABLISHMENT OF POLICY OF NONDISCRIMINA2 TION BASED ON SEXUAL ORIENTATION IN 3 THE ARMED FORCES. 4 (a) ESTABLISHMENT OF POLICY.—(1) Chapter 37 of 5 title 10, United States Code, is amended by adding at the 6 end the following new section: 7 ‘‘§ 656. Policy of nondiscrimination based on sexual 8 orientation 9 ‘‘(a) POLICY.—The Secretary of Defense, and the 10 Secretary of Homeland Security with respect to the Coast 11 Guard when it is not operating as a service in the Navy, 12 may not discriminate on the basis of sexual orientation 13 against any member of the armed forces or against any 14 person seeking to become a member of the armed forces. 15 ‘‘(b) DISCRIMINATION ON BASIS OF SEXUAL ORI16 ENTATION.—For purposes of this section, discrimination 17 on the basis of sexual orientation is— 18 ‘‘(1) in the case of a member of the armed 19 forces, the taking of any personnel or administrative 20 action (including any action relating to promotion, 21 demotion, evaluation, selection for an award, selec22 tion for a duty assignment, transfer, or separation) 23 in whole or in part on the basis of sexual orienta24 tion; and 25 ‘‘(2) in the case of a person seeking to become 26 a member of the armed forces, denial of accession VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00003 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 4 •HR 1246 IH 1 into the armed forces in whole or in part on the 2 basis of sexual orientation. 3 ‘‘(c) PERSONNEL AND ADMINISTRATIVE POLICIES 4 AND ACTION.—The Secretary of Defense, and the Sec5 retary of Homeland Security with respect to the Coast 6 Guard when it is not operating as a service in the Navy, 7 may not establish, implement, or apply any personnel or 8 administrative policy, or take any personnel or administra9 tive action (including any policy or action relating to pro10 motions, demotions, evaluations, selections for awards, se11 lections for duty assignments, transfers, or separations) 12 in whole or in part on the basis of sexual orientation. 13 ‘‘(d) RULES AND POLICIES REGARDING CONDUCT.— 14 Nothing in this section prohibits the Secretary of Defense, 15 and the Secretary of Homeland Security with respect to 16 the Coast Guard when it is not operating as a service in 17 the Navy, from prescribing or enforcing regulations gov18 erning the conduct of members of the armed forces if the 19 regulations are designed and applied without regard to 20 sexual orientation. 21 ‘‘(e) RE-ACCESSION OF OTHERWISE QUALIFIED 22 PERSONS PERMITTED.—Any person separated from the 23 armed forces for homosexuality, bisexuality, or homo24 sexual conduct in accordance with laws and regulations 25 in effect before the date of the enactment of this section, VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00004 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 5 •HR 1246 IH 1 if otherwise qualified for re-accession into the armed 2 forces, shall not be prohibited from re-accession into the 3 armed forces on the sole basis of such separation. 4 ‘‘(f) SEXUAL ORIENTATION.—In this section, the 5 term ‘sexual orientation’ means heterosexuality, homosex6 uality, or bisexuality, whether the orientation is real or 7 perceived, and includes statements and consensual sexual 8 conduct manifesting heterosexuality, homosexuality, or bi9 sexuality.’’. 10 (2) The table of sections at the beginning of such 11 chapter is amended— 12 (A) by striking the item relating to section 654; 13 and 14 (B) by adding at the end the following new 15 item: ‘‘656. Policy of nondiscrimination based on sexual orientation in the armed forces.’’. 16 (b) CONFORMING AMENDMENTS.—Title 10, United 17 States Code, is amended as follows: 18 (1) Section 481 is amended— 19 (A) In subsection (a)(2), by inserting ‘‘, in20 cluding sexual orientation discrimination,’’ after 21 ‘‘discrimination’’ in subparagraphs (C) and (D); 22 and VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00005 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 6 •HR 1246 IH 1 (B) in subsection (c), by inserting ‘‘and 2 sexual orientation-based’’ after ‘‘gender-based’’ 3 both places it appears. 4 (2) Section 983(a)(1) is amended by striking 5 ‘‘(in accordance with section 654 of this title and 6 other applicable Federal laws)’’. 7 (3) Section 1034(i)(3) is amended by inserting 8 ‘‘sexual orientation,’’ after ‘‘sex,’’. 9 SEC. 5. BENEFITS. 10 Nothing in this Act, or the amendments made by this 11 Act, shall be construed to require the furnishing of de12 pendent benefits in violation of section 7 of title 1, United 13 States Code (relating to the definitions of ‘‘marriage’’ and 14 ‘‘spouse’’ and referred to as the ‘‘Defense of Marriage 15 Act’’). 16 SEC. 6. NO PRIVATE CAUSE OF ACTION FOR DAMAGES. 17 Nothing in this Act, or the amendments made by this 18 Act, shall be construed to create a private cause of action 19 for damages. 20 SEC. 7. REGULATIONS. 21 (a) IN GENERAL.—Not later than 90 days after the 22 date of the enactment of this Act, the Secretary of Defense 23 shall revise Department of Defense regulations, and shall 24 issue such new regulations as may be necessary, to imple25 ment section 656 of title 10, United States Code, as added VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00006 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 7 •HR 1246 IH 1 by section 4(a). The Secretary of Defense shall further 2 direct the Secretary of each military department to revise 3 regulations of that military department in accordance with 4 section 656 of title 10, United States Code, as added by 5 section 4(a), not later than 180 days after the date of the 6 enactment of this Act. Such revisions shall include the fol7 lowing: 8 (1) Revision of all equal opportunity and 9 human relations regulations, directives, and instruc10 tions to add sexual orientation nondiscrimination to 11 the Department of Defense Equal Opportunity pol12 icy and to related human relations training pro13 grams. 14 (2) Revision of Department of Defense and 15 military department personnel regulations to elimi16 nate procedures for involuntary discharges based on 17 sexual orientation. 18 (3) Revision of Department of Defense and 19 military department regulations governing victims’ 20 advocacy programs to include sexual orientation dis21 crimination among the forms of discrimination for 22 which members of the Armed Forces and their fami23 lies may seek assistance. 24 (b) REGULATION OF CONDUCT.—The Secretary of 25 Defense, and the Secretary of Homeland Security with re- VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00007 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 8 •HR 1246 IH 1 spect to the Coast Guard when it is not operating as a 2 service in the Navy, shall ensure that regulations gov3 erning the personal conduct of members of the Armed 4 Forces shall be written and enforced without regard to 5 sexual orientation. 6 (c) DEFINITION.—In this section, the term ‘‘sexual 7 orientation’’ has the meaning given that term in section 8 656(f) of title 10, United States Code, as added by section 9 4(a). *** It is my opinion that the line items I highlighted in Red Bold: - fail to address, \"T,\" which is a solitification in itself of the fact that this is not a Bill for, \"Equal Rights,\" it's a Bill that writes into Federal Law legally putting a special interest agenda on the books, that specifically and willing excludes members of essentially the same minority group. - appears to shut the discussion down - in Federal Law - addressing dependent benefits for GLB members, which is a solitification in itself of the fact that this is not a Bill for, \"Equal Rights,\" it's a Bill that writes into Federal Law legally putting GLB into for-now permanent box of second-class citizen. - does not account for, \"berthing, bathing, and bowls,\" and actually Federalizes in Law the disregard for all service members' Right to Privacy. - allows for Partner Enlisted Quarters (PEQs). - vaguely references litigation in an exclusive way, not inclusive way. - and makes it difficult - if not impossible - to write policies and or regulations addressing: \"As for [a] DIRECT answer to this question, \"[...] are [you] trying to protect gays by making sure they are identified for 'special treatment'?\" is: If I had a say in the resulting repealing of DA/DT, and writing of inclusive policy: - it would include, \"T.\" - it would protect GLBT within the spirit of existing protected minority classes with existing EEOC and AA, recruiting, analysis, etc., initiatives. - In my opinion, \"disclosure,\" would serve a number of purposes including; a.) protecting GLBT, b.) allowing for the most effective EEOC [referencing the Constitutional premise as it applies to EO] and AA initiatives, c.) protect the DoD/Federal Government from liability (much the same way, \"disclosure,\" has been addressed with, ENDA, as I have clearly pointed out on several posts.), d.) protect all service members' common right to privacy - including that of GLBT, and e.) set the stage for an extremely effective organizational theory, e.g., \"disclosure,\" from research I've done on both sides is that it is a short and long-term win-win for numerous reasons, and f.) set the obvious stage for dependent benefits, which inherently requires disclosure, and g.) allow leaders - at every echelon - the opportunity to know who they are leading, and give the training necessary to deal appropriately - we roled played sensitivity training while I was on active duty (again, I am not outling a full-disclosure policy, and never have. I'm talking about [...] a narrow and limited disclosure policy. I am only advocating that relevant professionals address, \"disclosure,\" in terms, of the real and perceived hostile environment(s) that exist in organizations [...]. [This is not v]iolating privacy rights[] - it's an all-voluteer force [...] They're the real professionals [...]. [...] To me, this fact infers the obvious, it is secondary to the greater good in social/organizational theory. GLBT, \"fear,\" that [...] is real, but not something from which to write Federal Policy on. It is a type of, \"fear,\" that you write Federal Policy in a way that enforces specifically, and strategically, the healthy environment to allow GLBT to overcome it.\" - The, \"EO,\" references may supersede the general language in the Bill, but I don't know for sure. It doesn't look like it. It actually looks like it prevents EO from doing its' job, \"How can you address, \"sexual orientation,\" if you're not allowed to intitiate any policies or regulations with, \"sexual orientation,\" as the basis? What it appears to do is tie the hands of EO officers by only allowing them to respond to issues. If that is the case, that is a poor knot to tie. - At a minimum, it deserves clarification. *** For further clarity. Red Bold mine: From SLDN regarding the original H.R. 1246: MILITARY READINESS ENHANCEMENT ACT (H.R. 1246) SECTION BY SECTION ANALYSIS Section 1. Short Title. Section 1 provides the short title for the legislation. The “Military Readiness Enhancement Act” is the title of this legislation. Section 2. Purpose. Section 2 identifies the purpose of the legislation, which is to repeal 10 U.S.C. 654 and replace it with a new policy of non-discrimination based on sexual orientation in the Armed Forces. Section 3. Repeal of 1994 Policy Concerning Homosexuality in the Armed Forces. This section repeals the current law, 10 U.S.C. 654. Section 4. Policy of Non-Discrimination Based on Sexual Orientation in the Armed Forces. (a). Establishment of Policy. This section establishes a new law prohibiting sexual orientation discrimination in the Armed Forces. This section provides for a policy of non-discrimination based on sexual orientation in the Armed Forces, to be titled 10 U.S.C. 656. (a) Policy. Subsection (a) provides the new policy statement, prohibiting sexual orientation discrimination within the Armed Forces and among people seeking entry into the Armed Forces. (b) Discrimination on the Basis of Sexual Orientation. This subsection provides a non-exclusive list of what constitutes discrimination on the basis of sexual orientation in the Armed Forces. For current members of the Armed Forces, this section includes within the definition of sexual orientation discrimination any personnel or administrative action taken in whole or in part on the basis of sexual orientation. For applicants for military service, denial of accession made in whole or in part on the basis of sexual orientation constitutes sexual orientation discrimination. (c) Personnel and Administrative Policies and Action. This section prohibits the Secretary of Defense, and the Secretary of Homeland Security with respect to the Coast Guard when it is not operating under the Navy, from establishing, implementing or applying any personnel or administrative policies, or taking an personnel or administrative action, in whole or in part on the basis of sexual orientation. It is designed to prevent the military from re-instituting discriminatory policies once “Don’t Ask, Don’t Tell” is repealed. (d) Rules and Policies Regarding Conduct. This language is modeled on ENDA’s Section 11 (a), “Construction: Employer Rules and Policies.” It is intended to clarify that nothing in the legislation will prevent the military from continuing to regulate the conduct of its members, as long as any such regulation is written and enforced in a sexual orientation-neutral manner. (e) Re-accession of Otherwise Qualified Persons Permitted. This language provides the opportunity for persons discharged for homosexuality or homosexual conduct under “Don’t Ask, Don’t Tell” or its predecessor regulations to re-apply for entry into the Armed Forces. The “otherwise qualified” language makes clear that there is no absolute right of re-entry for anyone discharged under “Don’t Ask, Don’t Tell” or the predecessor regulations. For example, age and physical requirements to re-enter the military would still be applied to persons who wished to re-enter the Armed Forces under this provision. (f) Sexual Orientation. Sexual orientation is defined as “heterosexuality, bisexuality, or homosexuality, whether the orientation is real or perceived, and includes statements and consensual sexual conduct manifesting heterosexuality, homosexuality, or bisexuality.” This first part of this definition is fairly standard, and consistent with most state law definitions of sexual orientation. It is consistent with although broader than the only current federal statutory definition of sexual orientation, which appears in 28 U.S.C. 534, the federal hate crimes Continued on next page…. reporting statute. This definition is “consensual homosexuality or heterosexuality.” The second part of the definition is meant to ensure that the gap created between status and conduct through the “Don’t Ask, Don’t Tell” policy will not persist beyond the policy’s repeal. Military discharges based on statements of sexual orientation or conduct manifesting homosexual or bisexual orientation form the basis of “Don’t Ask, Don’t Tell.” The distinction is cemented in case law challenging the ban on constitutional grounds. Without the second part of this definition, it is possible Defense Department officials could effectively continue a policy of discriminating based on statements or conduct, versus sexual orientation per se. (2). Section 4 subsection (a)(2) provides the necessary changes to the table of contents to reflect the deletion of 10 U.S.C. 654 and the addition of 10 U.S.C. 656. (b). Conforming Amendments. Section 4 subsection (b) provides the conforming amendments required by the new legislation. (1). Subsection (b)(1) adds sexual orientation discrimination to a list of issues statutorily mandated for quadrennial surveys by the Department of Defense. (2). Subsection (b)(2) modifies the Solomon Amendment to remove the reference to 10 U.S.C. 654 and related laws. It is unclear whether the Solomon Amendment will have any relevance once the current Section 654 is repealed. However, the consequence of leaving 10 U.S.C. 983 as it is would be the possibility that certain schools might prohibit military recruiters from their campuses because of the military’s new policy of non-discrimination based on sexual orientation. (3). Subsection (b)(3) adds sexual orientation to the definition of “unlawful discrimination” in the code provision prohibiting retaliatory personnel actions. Section 5. Benefits. This provision makes clear that this legislation does not require the military to provide dependent benefits in violation of the Defense of Marriage Act. Section 6. No Private Cause of Action for Damages. This section makes clear that this legislation does not create a private cause of action for damages. Section 7. Regulations. This section provides the authority to issue regulations implementing this legislation and gives guidance as to the content of those regulations. (a). In General. The Secretary of Defense has 90 days following enactment of the legislation to issue Department of Defense regulations implementing the legislation, and must direct each service to revise its regulations no later than 180 days after the enactment of the legislation. Regulations which must be amended include but are not limited to: (1). All Equal Opportunity and Human Relations regulations, directives, and instructions and training guidance; (2). Personnel regulations governing involuntary discharges; (3). Victim’s advocacy regulations to include sexual orientation discrimination among the forms of discrimination for which members of the Armed Forces and their families may seek assistance. This provision is intended to ensure that victims of sexual orientation-based hate violence and sexual orientation discrimination can access Victims’ Advocacy programs to the same extent that other victims of prohibited discrimination and hate violence can. (b). Regulation of Conduct. This provision mandates the regulations governing service members’ conduct be written and enforced without regard to sexual orientation. It is essentially a reiteration of Section 3 (c), but we think it is important that this concept appear in both the policy section and the regulation section of the legislation as a political matter. (c). Definition. This section provides reference to the new 10 USC 656(f) for the definition of sexual orientation. *** Again the highlighted line items are grey - as I explained above - to say the least and need to be clearly addressed. *** Either way, \"H.R. 1246,\" - if that is what is about to be on the table - is clearly suspect for a large number of reasons. Americans can do a lot better than that ... the GLBT community deserve better. Under Section 8 of the US Constitution, Congress can do much, much better. This message has been edited. Last edited by: EqualRightstoPrivacy, Mon 02 March 2009 11:48 PM", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"IHAWKERS'\" Thread: \"Change [...] Put on hold.\" appeared to tell a different story regarding the, \"timing,\" of such a Bill. This should be a real test of where the Administration stands. Surprising the Decromats' argument will be, \"recruiting.\" Democrats have a history of being spineless on real issues. The real issue is of, \"Equal Rights,\" of what will become a protected minority class under Federal Law, when this thing passess, or one like it. Again, sad the Democrats will attempt to hide behind, \"recruiting,\" verses the human rights of American citizens. Not to mention, in my opinion, \"Military Readiness,\" is also a weak argument in relation to this social issue relative to the necessary social change it implies. *** That said, it really becomes necessary to take a real close look at, \"H.R. 1246,\" if that is the Bill they will present, or if there are modifications, what are they, etc. (?): 1.) Unless something has changed, the subject Bill does not include the, \"T,\" in GLBT. This is an absolute human rights violation and the Democrats should be ashamed. Again, a spineless move if, \"T,\" are kicked to the political curb. 2.) The language I've highlighted in Red Bold is what I think is the other major flaw with, \"H.R. 1246.\" Probably even more sinister. Please excuse if this below reference is way different than the Bill-form Rep. Tauscher is suggesting. Perhaps someone could post her Bill-form if it's available? *** 110TH CONGRESS 1ST SESSION H. R. 1246 To amend title 10, United States Code, to enhance the readiness of the Armed Forces by replacing the current policy concerning homosexuality in the Armed Forces, referred to as ‘‘Don’t Ask, Don’t Tell’’, with a policy of nondiscrimination on the basis of sexual orientation. IN THE HOUSE OF REPRESENTATIVES FEBRUARY 28, 2007 Mr. MEEHAN (for himself, Mr. SMITH of Washington, Mr. WYNN, Mr. HASTINGS of Florida, Ms. SCHWARTZ, Mr. WEINER, Ms. LEE, Mr. FRANK of Massachusetts, Ms. MCCOLLUM of Minnesota, Mr. PASCRELL, Mr. FILNER, Mrs. MALONEY of New York, Mr. FATTAH, Mr. RANGEL, Mr. SHAYS, Mr. VAN HOLLEN, Ms. CORRINE BROWN of Florida, Mr. DAVIS of Illinois, Mr. WU, Ms. WASSERMAN SCHULTZ, Mr. KUCINICH, Ms. WATSON, Mr. PAYNE, Ms. MATSUI, Mr. BLUMENAUER, Mr. PASTOR, Ms. EDDIE BERNICE JOHNSON of Texas, Mr. TOWNS, Mr. MARKEY, Ms. NORTON, Mr. CUMMINGS, Mr. ENGEL, Mrs. TAUSCHER, Mr. CLEAVER, Mr. PALLONE, Mr. ACKERMAN, Mr. GEORGE MILLER of California, Mrs. NAPOLITANO, Mr. MEEKS of New York, Ms. MOORE of Wisconsin, Mr. JOHNSON of Georgia, Mr. WAXMAN, Ms. SOLIS, Mr. BERMAN, Ms. ROSLEHTINEN, Mr. LANGEVIN, Mr. MORAN of Virginia, Mr. OBERSTAR, Ms. SCHAKOWSKY, Ms. HARMAN, Mr. INSLEE, Mr. NADLER, Mr. MCDERMOTT, Mr. MCGOVERN, Mr. DINGELL, Mr. LARSON of Connecticut, Mr. LEWIS of Georgia, Mr. OLVER, Mr. TIERNEY, Mr. SERRANO, Mr. CROWLEY, Ms. CARSON, Ms. CASTOR, Mr. ELLISON, Ms. LINDA T. SA ´NCHEZ of California, Mrs. CAPPS, Ms. SLAUGHTER, Ms. ROYBAL-ALLARD, Mr. GUTIERREZ, Ms. WOOLSEY, Mr. UDALL of Colorado, Mr. HINCHEY, Ms. WATERS, Ms. HIRONO, Mr. CAPUANO, Mr. DOYLE, Mr. HONDA, Mr. MICHAUD, Mr. ABERCROMBIE, Mrs. LOWEY, Ms. VELA´ZQUEZ, Mr. KENNEDY, Mr. STARK, Mr. DEFAZIO, Mr. WELCH of Vermont, Mr. HARE, Mr. EMANUEL, Mr. GRIJALVA, Mr. NEAL of Massachusetts, Mr. BRADY of Pennsylvania, Mr. WEXLER, Ms. DELAURO, Mr. HOLT, Mr. FARR, Ms. JACKSON-LEE of Texas, Ms. BERKLEY, Mrs. JONES of Ohio, Mr. LYNCH, Mr. COHEN, Mr. ISRAEL, Mr. ROTHMAN, Mrs. DAVIS of California, Ms. BALDWIN, Mr. ALLEN, Mr. LANTOS, Mr. GILCHREST, Mr. DELAHUNT, Mr. CLAY, Mr. BECERRA, and Ms. ZOE LOFGREN of California) introduced the following bill; which was referred to the Committee on Armed Services VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00001 Fmt 6652 Sfmt 6652 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 2 •HR 1246 IH A BILL To amend title 10, United States Code, to enhance the readiness of the Armed Forces by replacing the current policy concerning homosexuality in the Armed Forces, referred to as ‘‘Don’t Ask, Don’t Tell’’, with a policy of nondiscrimination on the basis of sexual orientation. 1 Be it enacted by the Senate and House of Representa2 tives of the United States of America in Congress assembled, 3 SECTION 1. SHORT TITLE. 4 This Act may be cited as the ‘‘Military Readiness En5 hancement Act of 2007’’. 6 SEC. 2. PURPOSE. 7 The purpose of this Act is to institute in the Armed 8 Forces a policy of nondiscrimination based on sexual ori9 entation. 10 SEC. 3. REPEAL OF 1993 POLICY CONCERNING HOMOSEX11 UALITY IN THE ARMED FORCES. 12 The following provisions of law are repealed: 13 (1) Section 654 of title 10, United States Code. 14 (2) Subsections (b), (c), and (d) of section 571 15 of the National Defense Authorization Act for Fiscal 16 Year 1994 (10 U.S.C. 654 note). VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00002 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 3 •HR 1246 IH 1 SEC. 4. ESTABLISHMENT OF POLICY OF NONDISCRIMINA2 TION BASED ON SEXUAL ORIENTATION IN 3 THE ARMED FORCES. 4 (a) ESTABLISHMENT OF POLICY.—(1) Chapter 37 of 5 title 10, United States Code, is amended by adding at the 6 end the following new section: 7 ‘‘§ 656. Policy of nondiscrimination based on sexual 8 orientation 9 ‘‘(a) POLICY.—The Secretary of Defense, and the 10 Secretary of Homeland Security with respect to the Coast 11 Guard when it is not operating as a service in the Navy, 12 may not discriminate on the basis of sexual orientation 13 against any member of the armed forces or against any 14 person seeking to become a member of the armed forces. 15 ‘‘(b) DISCRIMINATION ON BASIS OF SEXUAL ORI16 ENTATION.—For purposes of this section, discrimination 17 on the basis of sexual orientation is— 18 ‘‘(1) in the case of a member of the armed 19 forces, the taking of any personnel or administrative 20 action (including any action relating to promotion, 21 demotion, evaluation, selection for an award, selec22 tion for a duty assignment, transfer, or separation) 23 in whole or in part on the basis of sexual orienta24 tion; and 25 ‘‘(2) in the case of a person seeking to become 26 a member of the armed forces, denial of accession VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00003 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 4 •HR 1246 IH 1 into the armed forces in whole or in part on the 2 basis of sexual orientation. 3 ‘‘(c) PERSONNEL AND ADMINISTRATIVE POLICIES 4 AND ACTION.—The Secretary of Defense, and the Sec5 retary of Homeland Security with respect to the Coast 6 Guard when it is not operating as a service in the Navy, 7 may not establish, implement, or apply any personnel or 8 administrative policy, or take any personnel or administra9 tive action (including any policy or action relating to pro10 motions, demotions, evaluations, selections for awards, se11 lections for duty assignments, transfers, or separations) 12 in whole or in part on the basis of sexual orientation. 13 ‘‘(d) RULES AND POLICIES REGARDING CONDUCT.— 14 Nothing in this section prohibits the Secretary of Defense, 15 and the Secretary of Homeland Security with respect to 16 the Coast Guard when it is not operating as a service in 17 the Navy, from prescribing or enforcing regulations gov18 erning the conduct of members of the armed forces if the 19 regulations are designed and applied without regard to 20 sexual orientation. 21 ‘‘(e) RE-ACCESSION OF OTHERWISE QUALIFIED 22 PERSONS PERMITTED.—Any person separated from the 23 armed forces for homosexuality, bisexuality, or homo24 sexual conduct in accordance with laws and regulations 25 in effect before the date of the enactment of this section, VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00004 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 5 •HR 1246 IH 1 if otherwise qualified for re-accession into the armed 2 forces, shall not be prohibited from re-accession into the 3 armed forces on the sole basis of such separation. 4 ‘‘(f) SEXUAL ORIENTATION.—In this section, the 5 term ‘sexual orientation’ means heterosexuality, homosex6 uality, or bisexuality, whether the orientation is real or 7 perceived, and includes statements and consensual sexual 8 conduct manifesting heterosexuality, homosexuality, or bi9 sexuality.’’. 10 (2) The table of sections at the beginning of such 11 chapter is amended— 12 (A) by striking the item relating to section 654; 13 and 14 (B) by adding at the end the following new 15 item: ‘‘656. Policy of nondiscrimination based on sexual orientation in the armed forces.’’. 16 (b) CONFORMING AMENDMENTS.—Title 10, United 17 States Code, is amended as follows: 18 (1) Section 481 is amended— 19 (A) In subsection (a)(2), by inserting ‘‘, in20 cluding sexual orientation discrimination,’’ after 21 ‘‘discrimination’’ in subparagraphs (C) and (D); 22 and VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00005 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 6 •HR 1246 IH 1 (B) in subsection (c), by inserting ‘‘and 2 sexual orientation-based’’ after ‘‘gender-based’’ 3 both places it appears. 4 (2) Section 983(a)(1) is amended by striking 5 ‘‘(in accordance with section 654 of this title and 6 other applicable Federal laws)’’. 7 (3) Section 1034(i)(3) is amended by inserting 8 ‘‘sexual orientation,’’ after ‘‘sex,’’. 9 SEC. 5. BENEFITS. 10 Nothing in this Act, or the amendments made by this 11 Act, shall be construed to require the furnishing of de12 pendent benefits in violation of section 7 of title 1, United 13 States Code (relating to the definitions of ‘‘marriage’’ and 14 ‘‘spouse’’ and referred to as the ‘‘Defense of Marriage 15 Act’’). 16 SEC. 6. NO PRIVATE CAUSE OF ACTION FOR DAMAGES. 17 Nothing in this Act, or the amendments made by this 18 Act, shall be construed to create a private cause of action 19 for damages. 20 SEC. 7. REGULATIONS. 21 (a) IN GENERAL.—Not later than 90 days after the 22 date of the enactment of this Act, the Secretary of Defense 23 shall revise Department of Defense regulations, and shall 24 issue such new regulations as may be necessary, to imple25 ment section 656 of title 10, United States Code, as added VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00006 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 7 •HR 1246 IH 1 by section 4(a). The Secretary of Defense shall further 2 direct the Secretary of each military department to revise 3 regulations of that military department in accordance with 4 section 656 of title 10, United States Code, as added by 5 section 4(a), not later than 180 days after the date of the 6 enactment of this Act. Such revisions shall include the fol7 lowing: 8 (1) Revision of all equal opportunity and 9 human relations regulations, directives, and instruc10 tions to add sexual orientation nondiscrimination to 11 the Department of Defense Equal Opportunity pol12 icy and to related human relations training pro13 grams. 14 (2) Revision of Department of Defense and 15 military department personnel regulations to elimi16 nate procedures for involuntary discharges based on 17 sexual orientation. 18 (3) Revision of Department of Defense and 19 military department regulations governing victims’ 20 advocacy programs to include sexual orientation dis21 crimination among the forms of discrimination for 22 which members of the Armed Forces and their fami23 lies may seek assistance. 24 (b) REGULATION OF CONDUCT.—The Secretary of 25 Defense, and the Secretary of Homeland Security with re- VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00007 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 8 •HR 1246 IH 1 spect to the Coast Guard when it is not operating as a 2 service in the Navy, shall ensure that regulations gov3 erning the personal conduct of members of the Armed 4 Forces shall be written and enforced without regard to 5 sexual orientation. 6 (c) DEFINITION.—In this section, the term ‘‘sexual 7 orientation’’ has the meaning given that term in section 8 656(f) of title 10, United States Code, as added by section 9 4(a). *** It is my opinion that the line items I highlighted in Red Bold: - fail to address, \"T,\" which is a solitification in itself of the fact that this is not a Bill for, \"Equal Rights,\" it's a Bill that writes into Federal Law legally putting a special interest agenda on the books, that specifically and willing excludes members of essentially the same minority group. - appears to shut the discussion down - in Federal Law - addressing dependent benefits for GLB members, which is a solitification in itself of the fact that this is not a Bill for, \"Equal Rights,\" it's a Bill that writes into Federal Law legally putting GLB into for-now permanent box of second-class citizen. - does not account for, \"berthing, bathing, and bowls,\" and actually Federalizes in Law the disregard for all service members' Right to Privacy. - allows for Partner Enlisted Quarters (PEQs). - vaguely references litigation in an exclusive way, not inclusive way. - and makes it difficult - if not impossible - to write policies and or regulations addressing: \"As for [a] DIRECT answer to this question, \"[...] are [you] trying to protect gays by making sure they are identified for 'special treatment'?\" is: If I had a say in the resulting repealing of DA/DT, and writing of inclusive policy: - it would include, \"T.\" - it would protect GLBT within the spirit of existing protected minority classes with existing EEOC and AA, recruiting, analysis, etc., initiatives. - In my opinion, \"disclosure,\" would serve a number of purposes including; a.) protecting GLBT, b.) allowing for the most effective EEOC [referencing the Constitutional premise as it applies to EO] and AA initiatives, c.) protect the DoD/Federal Government from liability (much the same way, \"disclosure,\" has been addressed with, ENDA, as I have clearly pointed out on several posts.), d.) protect all service members' common right to privacy - including that of GLBT, and e.) set the stage for an extremely effective organizational theory, e.g., \"disclosure,\" from research I've done on both sides is that it is a short and long-term win-win for numerous reasons, and f.) set the obvious stage for dependent benefits, which inherently requires disclosure, and g.) allow leaders - at every echelon - the opportunity to know who they are leading, and give the training necessary to deal appropriately - we roled played sensitivity training while I was on active duty (again, I am not outling a full-disclosure policy, and never have. I'm talking about [...] a narrow and limited disclosure policy. I am only advocating that relevant professionals address, \"disclosure,\" in terms, of the real and perceived hostile environment(s) that exist in organizations [...]. [This is not v]iolating privacy rights[] - it's an all-voluteer force [...] They're the real professionals [...]. [...] To me, this fact infers the obvious, it is secondary to the greater good in social/organizational theory. GLBT, \"fear,\" that [...] is real, but not something from which to write Federal Policy on. It is a type of, \"fear,\" that you write Federal Policy in a way that enforces specifically, and strategically, the healthy environment to allow GLBT to overcome it.\" - The, \"EO,\" references may supersede the general language in the Bill, but I don't know for sure. It doesn't look like it. It actually looks like it prevents EO from doing its' job, \"How can you address, \"sexual orientation,\" if you're not allowed to intitiate any policies or regulations with, \"sexual orientation,\" as the basis? What it appears to do is tie the hands of EO officers by only allowing them to respond to issues. If that is the case, that is a poor knot to tie. - At a minimum, it deserves clarification. *** For further clarity. Red Bold mine: From SLDN regarding the original H.R. 1246: MILITARY READINESS ENHANCEMENT ACT (H.R. 1246) SECTION BY SECTION ANALYSIS Section 1. Short Title. Section 1 provides the short title for the legislation. The “Military Readiness Enhancement Act” is the title of this legislation. Section 2. Purpose. Section 2 identifies the purpose of the legislation, which is to repeal 10 U.S.C. 654 and replace it with a new policy of non-discrimination based on sexual orientation in the Armed Forces. Section 3. Repeal of 1994 Policy Concerning Homosexuality in the Armed Forces. This section repeals the current law, 10 U.S.C. 654. Section 4. Policy of Non-Discrimination Based on Sexual Orientation in the Armed Forces. (a). Establishment of Policy. This section establishes a new law prohibiting sexual orientation discrimination in the Armed Forces. This section provides for a policy of non-discrimination based on sexual orientation in the Armed Forces, to be titled 10 U.S.C. 656. (a) Policy. Subsection (a) provides the new policy statement, prohibiting sexual orientation discrimination within the Armed Forces and among people seeking entry into the Armed Forces. (b) Discrimination on the Basis of Sexual Orientation. This subsection provides a non-exclusive list of what constitutes discrimination on the basis of sexual orientation in the Armed Forces. For current members of the Armed Forces, this section includes within the definition of sexual orientation discrimination any personnel or administrative action taken in whole or in part on the basis of sexual orientation. For applicants for military service, denial of accession made in whole or in part on the basis of sexual orientation constitutes sexual orientation discrimination. (c) Personnel and Administrative Policies and Action. This section prohibits the Secretary of Defense, and the Secretary of Homeland Security with respect to the Coast Guard when it is not operating under the Navy, from establishing, implementing or applying any personnel or administrative policies, or taking an personnel or administrative action, in whole or in part on the basis of sexual orientation. It is designed to prevent the military from re-instituting discriminatory policies once “Don’t Ask, Don’t Tell” is repealed. (d) Rules and Policies Regarding Conduct. This language is modeled on ENDA’s Section 11 (a), “Construction: Employer Rules and Policies.” It is intended to clarify that nothing in the legislation will prevent the military from continuing to regulate the conduct of its members, as long as any such regulation is written and enforced in a sexual orientation-neutral manner. (e) Re-accession of Otherwise Qualified Persons Permitted. This language provides the opportunity for persons discharged for homosexuality or homosexual conduct under “Don’t Ask, Don’t Tell” or its predecessor regulations to re-apply for entry into the Armed Forces. The “otherwise qualified” language makes clear that there is no absolute right of re-entry for anyone discharged under “Don’t Ask, Don’t Tell” or the predecessor regulations. For example, age and physical requirements to re-enter the military would still be applied to persons who wished to re-enter the Armed Forces under this provision. (f) Sexual Orientation. Sexual orientation is defined as “heterosexuality, bisexuality, or homosexuality, whether the orientation is real or perceived, and includes statements and consensual sexual conduct manifesting heterosexuality, homosexuality, or bisexuality.” This first part of this definition is fairly standard, and consistent with most state law definitions of sexual orientation. It is consistent with although broader than the only current federal statutory definition of sexual orientation, which appears in 28 U.S.C. 534, the federal hate crimes Continued on next page…. reporting statute. This definition is “consensual homosexuality or heterosexuality.” The second part of the definition is meant to ensure that the gap created between status and conduct through the “Don’t Ask, Don’t Tell” policy will not persist beyond the policy’s repeal. Military discharges based on statements of sexual orientation or conduct manifesting homosexual or bisexual orientation form the basis of “Don’t Ask, Don’t Tell.” The distinction is cemented in case law challenging the ban on constitutional grounds. Without the second part of this definition, it is possible Defense Department officials could effectively continue a policy of discriminating based on statements or conduct, versus sexual orientation per se. (2). Section 4 subsection (a)(2) provides the necessary changes to the table of contents to reflect the deletion of 10 U.S.C. 654 and the addition of 10 U.S.C. 656. (b). Conforming Amendments. Section 4 subsection (b) provides the conforming amendments required by the new legislation. (1). Subsection (b)(1) adds sexual orientation discrimination to a list of issues statutorily mandated for quadrennial surveys by the Department of Defense. (2). Subsection (b)(2) modifies the Solomon Amendment to remove the reference to 10 U.S.C. 654 and related laws. It is unclear whether the Solomon Amendment will have any relevance once the current Section 654 is repealed. However, the consequence of leaving 10 U.S.C. 983 as it is would be the possibility that certain schools might prohibit military recruiters from their campuses because of the military’s new policy of non-discrimination based on sexual orientation. (3). Subsection (b)(3) adds sexual orientation to the definition of “unlawful discrimination” in the code provision prohibiting retaliatory personnel actions. Section 5. Benefits. This provision makes clear that this legislation does not require the military to provide dependent benefits in violation of the Defense of Marriage Act. Section 6. No Private Cause of Action for Damages. This section makes clear that this legislation does not create a private cause of action for damages. Section 7. Regulations. This section provides the authority to issue regulations implementing this legislation and gives guidance as to the content of those regulations. (a). In General. The Secretary of Defense has 90 days following enactment of the legislation to issue Department of Defense regulations implementing the legislation, and must direct each service to revise its regulations no later than 180 days after the enactment of the legislation. Regulations which must be amended include but are not limited to: (1). All Equal Opportunity and Human Relations regulations, directives, and instructions and training guidance; (2). Personnel regulations governing involuntary discharges; (3). Victim’s advocacy regulations to include sexual orientation discrimination among the forms of discrimination for which members of the Armed Forces and their families may seek assistance. This provision is intended to ensure that victims of sexual orientation-based hate violence and sexual orientation discrimination can access Victims’ Advocacy programs to the same extent that other victims of prohibited discrimination and hate violence can. (b). Regulation of Conduct. This provision mandates the regulations governing service members’ conduct be written and enforced without regard to sexual orientation. It is essentially a reiteration of Section 3 (c), but we think it is important that this concept appear in both the policy section and the regulation section of the legislation as a political matter. (c). Definition. This section provides reference to the new 10 USC 656(f) for the definition of sexual orientation. *** Again the highlighted line items are grey - as I explained above - to say the least and need to be clearly addressed. *** Either way, \"H.R. 1246,\" - if that is what is about to be on the table - is clearly suspect for a large number of reasons. Americans can do a lot better than that ... the GLBT community deserve better. Under Section 8 of the US Constitution, Congress can do much, much better. This message has been edited. Last edited by: EqualRightstoPrivacy, Mon 02 March 2009 11:48 PM", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-02 23:18:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "Got GLBT folks on your band wagon yet, Equal? Any of you GLBT folks out there signing on to his scheme to get 'special treatment' at shower time? I realize, Equal, you just want to see this scheme of 'forced to divulge' ones sexual orientation fulfilled by law in order to \"protect\" GLBT folks and establish their rights to privacy at the same time. But, it's just more of BIG government herding minority members of society around. Sexual Apartheid monitoring of American citizens in uniform to avoid the possibility of someone in uniform being offended. The objective of removing DA/DT is so that patriotic qualified American's can serve their country without fear of 'special treatment' (like getting 'fired') should they reveal their sexual orientation or should they be 'found out'. They want to serve as freely as the others who have, of their own volition, also chosen to make themselves expendable so others can live in peace and safety, pursuing life, liberty and happiness. Let Congress debate it... and they will. Who was signed on or off the issue before is past. It's a new day. Let's get on with it in a democratic reasonable manner that will not intentionally stigmatize a group of patriots. What's wrong with that? Why should they have to tell anyone what their sexual preferences are in some public forum? Weird!", 
        "intTime": 20090303, 
        "postID": 3, 
        "quote": "", 
        "reply": "Got GLBT folks on your band wagon yet, Equal? Any of you GLBT folks out there signing on to his scheme to get 'special treatment' at shower time? I realize, Equal, you just want to see this scheme of 'forced to divulge' ones sexual orientation fulfilled by law in order to \"protect\" GLBT folks and establish their rights to privacy at the same time. But, it's just more of BIG government herding minority members of society around. Sexual Apartheid monitoring of American citizens in uniform to avoid the possibility of someone in uniform being offended. The objective of removing DA/DT is so that patriotic qualified American's can serve their country without fear of 'special treatment' (like getting 'fired') should they reveal their sexual orientation or should they be 'found out'. They want to serve as freely as the others who have, of their own volition, also chosen to make themselves expendable so others can live in peace and safety, pursuing life, liberty and happiness. Let Congress debate it... and they will. Who was signed on or off the issue before is past. It's a new day. Let's get on with it in a democratic reasonable manner that will not intentionally stigmatize a group of patriots. What's wrong with that? Why should they have to tell anyone what their sexual preferences are in some public forum? Weird!", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-03 09:26:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "\"reducetension,\" Please quote me on the following often: Mat: \"[R]educetension,\" you make a great and passionate micro-argument for minority Equal Rights. I have made the same micro-argument for quite some time now, and also feel passionate about it on a micro-level. That said, micro-arguments supporting specific minority Equal Rights, while distorting, ignoring, disregarding, or denying, the common macro-Equal Rights of all service members, fails in any logical arena except that of the subject minority group - which hasn't even happened on these boards, as I've had several GLBT members publicly acknowledge a universal and necessary, \"Right to Privacy\" - even in the US military, including a very specific submariner who posted with me on the very subject here, about a year and a half ago.\" *** Seperately, it appears to me, you keep harping on my suggested solutions within AAVPIPS as if those mere suggestions are my main arguments (?). This is a totally false inference you make as it appears to me. *** My base argument is two-fold: 1.) Validate the thesis, \"'Privacy,' is a Natural Right.\" 2.) If 1.) is true, then thesis two is consequently also true, \"'Privacy,' is a Legal Right.\" It does not get any more complicated than those two (2) thesis. *** If they are true, which I'm already confident as I've already done most of it according to the Modern form of philosophical dialectics, in terms of Natural Law. At that point, Physical Law becomes self-evident, in my opinion. Much existing Case Law is already on the books to further validate an underlying universal premise as such. *** May sound like heavy stuff to some but for a layman - myself included - it's really just a fancy way of respecting a common, human right to privacy. Everyone gets the basic premise, even you when you conveniently, \"use,\" it to fight for, \"privacy rights,\" regarding, \"disclosure.\" The rest falls very neatly in place under the US Constitution, the Civil Rights Act of 1964, and existing EEOC regulations from which DoD EEO, and military EO, are already written ... to soon include, \"sexual orientation,\" as a protected minority. *** Even IBM Corporations included, \"White men,\" as a, \"usual suspects,\" group common to be on the receiving end of discrimination, when writing their order for a Work Force Diversity Executive Task Forces (Stockdale/Crosby, 218). The difference with some, and real professionals is, some call protected classes, \"second class citizens.\" I prefer - like IBM and related professionals - to call them, \"key employee groups.\" I do not subcribe to the twisted-Ontological Utilatarian approach of which your posts remind me, e.g., protect few, as if this is in the best interest of the Greater Good (?). How can you possibly consider homosexuals to be treated differently when even, \"White men,\" are grouped in as a, \"protected minority,\" under organizational theory? Stockdale, Margaret S., and Crosby, Faye J., Edited by, The Psychology and Management of Workplace Diversity. Malden, Massachusetts: Blackwell Publishing, Ltd., 2008 *** Personally I think your posts are in denial of macro-realities, proven time, after time, after time, after time. But as I said, \"'[R]educetension,' you make a great and passionate micro-argument for minority Equal Rights [...]\" Please quote me on that, often! *** \"It's a new day[!]\" I second that. And because of that, the real professional see the big picture.", 
        "intTime": 20090303, 
        "postID": 4, 
        "quote": "", 
        "reply": "\"reducetension,\" Please quote me on the following often: Mat: \"[R]educetension,\" you make a great and passionate micro-argument for minority Equal Rights. I have made the same micro-argument for quite some time now, and also feel passionate about it on a micro-level. That said, micro-arguments supporting specific minority Equal Rights, while distorting, ignoring, disregarding, or denying, the common macro-Equal Rights of all service members, fails in any logical arena except that of the subject minority group - which hasn't even happened on these boards, as I've had several GLBT members publicly acknowledge a universal and necessary, \"Right to Privacy\" - even in the US military, including a very specific submariner who posted with me on the very subject here, about a year and a half ago.\" *** Seperately, it appears to me, you keep harping on my suggested solutions within AAVPIPS as if those mere suggestions are my main arguments (?). This is a totally false inference you make as it appears to me. *** My base argument is two-fold: 1.) Validate the thesis, \"'Privacy,' is a Natural Right.\" 2.) If 1.) is true, then thesis two is consequently also true, \"'Privacy,' is a Legal Right.\" It does not get any more complicated than those two (2) thesis. *** If they are true, which I'm already confident as I've already done most of it according to the Modern form of philosophical dialectics, in terms of Natural Law. At that point, Physical Law becomes self-evident, in my opinion. Much existing Case Law is already on the books to further validate an underlying universal premise as such. *** May sound like heavy stuff to some but for a layman - myself included - it's really just a fancy way of respecting a common, human right to privacy. Everyone gets the basic premise, even you when you conveniently, \"use,\" it to fight for, \"privacy rights,\" regarding, \"disclosure.\" The rest falls very neatly in place under the US Constitution, the Civil Rights Act of 1964, and existing EEOC regulations from which DoD EEO, and military EO, are already written ... to soon include, \"sexual orientation,\" as a protected minority. *** Even IBM Corporations included, \"White men,\" as a, \"usual suspects,\" group common to be on the receiving end of discrimination, when writing their order for a Work Force Diversity Executive Task Forces (Stockdale/Crosby, 218). The difference with some, and real professionals is, some call protected classes, \"second class citizens.\" I prefer - like IBM and related professionals - to call them, \"key employee groups.\" I do not subcribe to the twisted-Ontological Utilatarian approach of which your posts remind me, e.g., protect few, as if this is in the best interest of the Greater Good (?). How can you possibly consider homosexuals to be treated differently when even, \"White men,\" are grouped in as a, \"protected minority,\" under organizational theory? Stockdale, Margaret S., and Crosby, Faye J., Edited by, The Psychology and Management of Workplace Diversity. Malden, Massachusetts: Blackwell Publishing, Ltd., 2008 *** Personally I think your posts are in denial of macro-realities, proven time, after time, after time, after time. But as I said, \"'[R]educetension,' you make a great and passionate micro-argument for minority Equal Rights [...]\" Please quote me on that, often! *** \"It's a new day[!]\" I second that. And because of that, the real professional see the big picture.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-03 17:27:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "", 
        "reply": "Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-03 20:14:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Where's, \"reducetension?\" He may think this is an absolute outrage as he told me numerous times on other threads! *** \"President [...] consulting with advisors [...][?].\" Didn't he go to Harvard? *** \"[...] officials will not reveal how it may happen [...][?].\" \"reducetension,\" says just sign the repeal, and then do nothing. *** \"[...] a team of experts may be commissioned [...][?].\" Experts? Like organizational theorists? \"reducetension,\" says that's like both, foolish and unnecessary - a bunch of hacks. *** \"[...] proper reversal [...][?].\" \"Proper?\" Isn't anyone listening to, \"reducetension,\" on this? Just sign the repeal, that's it. *** \"[...] so that change is done in a sensible way [...][?].\" Again, you mean like the way organizational theory deals with every other major social change? *** Oh, I'm sorry, we're talking about Laws on America soil. Not those of other countries. My bust, sorry! *** Sounds like fundamentalist Americans with the US Constitution in mind are about to have an intellectual picnic, as it should be. I'd sure like to be a fly on the food at that table.", 
        "intTime": 20090304, 
        "postID": 6, 
        "quote": "", 
        "reply": "Where's, \"reducetension?\" He may think this is an absolute outrage as he told me numerous times on other threads! *** \"President [...] consulting with advisors [...][?].\" Didn't he go to Harvard? *** \"[...] officials will not reveal how it may happen [...][?].\" \"reducetension,\" says just sign the repeal, and then do nothing. *** \"[...] a team of experts may be commissioned [...][?].\" Experts? Like organizational theorists? \"reducetension,\" says that's like both, foolish and unnecessary - a bunch of hacks. *** \"[...] proper reversal [...][?].\" \"Proper?\" Isn't anyone listening to, \"reducetension,\" on this? Just sign the repeal, that's it. *** \"[...] so that change is done in a sensible way [...][?].\" Again, you mean like the way organizational theory deals with every other major social change? *** Oh, I'm sorry, we're talking about Laws on America soil. Not those of other countries. My bust, sorry! *** Sounds like fundamentalist Americans with the US Constitution in mind are about to have an intellectual picnic, as it should be. I'd sure like to be a fly on the food at that table.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 00:08:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal...", 
        "intTime": 20090304, 
        "postID": 7, 
        "quote": "Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp", 
        "reply": " Excellent News!! It's almost time to start planning for a party in celebration of the repeal...", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 05:09:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal... The implications here are....that a simple elimination of the DADT policy is NOT in the cards. Rather, that some revision of it is under consideration.", 
        "intTime": 20090304, 
        "postID": 8, 
        "quote": "Originally posted by JimCrackCorn: quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal...", 
        "reply": " The implications here are....that a simple elimination of the DADT policy is NOT in the cards. Rather, that some revision of it is under consideration.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 10:31:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "19022583"
    }, 
    {
        "content": "In the current issue of The Army Times ... >http://www.armytimes.com/news/2009/03/ap_obama_gays_military_030309/", 
        "intTime": 20090304, 
        "postID": 9, 
        "quote": "", 
        "reply": "In the current issue of The Army Times ... >http://www.armytimes.com/news/2009/03/ap_obama_gays_military_030309/", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 10:31:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Another study will delay but not prevent the eventual dismissal of a policy of \"silence\". And, if wiser heads prevail, they will not replace or revise it with a new policy of \"confession\". What kind of Government or society needs to know the sexual orientation of its citizens? Nazi Germany comes to mind, and those of the \"unnatural\" orientation according to Nazi \"purification\" via Natural Law theory gave 'special treatment' to those who did not line up on the far right side of political correctness. But, study it they probably will. Selecting the studiers will be the key point and one can hope with the liberating administration of this President the progressive nature of American will unfold some more to enhance full free participation of the members of the gay community with stigmatizing them 'in the name of privacy'! We, as a nation are still maturing.", 
        "intTime": 20090304, 
        "postID": 10, 
        "quote": "", 
        "reply": "Another study will delay but not prevent the eventual dismissal of a policy of \"silence\". And, if wiser heads prevail, they will not replace or revise it with a new policy of \"confession\". What kind of Government or society needs to know the sexual orientation of its citizens? Nazi Germany comes to mind, and those of the \"unnatural\" orientation according to Nazi \"purification\" via Natural Law theory gave 'special treatment' to those who did not line up on the far right side of political correctness. But, study it they probably will. Selecting the studiers will be the key point and one can hope with the liberating administration of this President the progressive nature of American will unfold some more to enhance full free participation of the members of the gay community with stigmatizing them 'in the name of privacy'! We, as a nation are still maturing.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 10:57:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "One thing clearly concerns me about one particular poster: Obsessive literal references, and subtle inferences, to the greatest atrocity in recorded human history, the Holocaust (please correct my history conclustion if I'm incorrect (?).). I would easier believe the literal, or infered, throwing of the kitchen sink. Perhaps you're a fan of reality, and shock, TV? *** I personally question the motivation of someone who continues to compare Civil Rights across the board, to the attempted extermination of a people, and the resulting twenty-to-thirty foot piles of rotting corpses bulldozed into mass piles and graves. *** Please clarify with brevity but very specific clarity, perhaps in a single post? Otherwise, I can only conclude that either some folks don't understand the gross falseness of their comparrisons, or don't care enough about the gravity - and human and emotional cost to humanity - of the Holocaust. *** We're talking about preserving the Civil Rights of all Americans. Not the killing of millions of people. *** At a minimum, out of respect for about a, \"thousand,\" things, reconsider your analogies. Perhaps something closer to, \"apples,\" and, \"oranges,\" not, \"inalienable and universal privacy,\" and, \"minority genocide.\" *** In my opinion, the vulgarity of the attempt to make such comparisons, puts any credibility of the poster's intent in question (?). ***", 
        "intTime": 20090304, 
        "postID": 11, 
        "quote": "", 
        "reply": "One thing clearly concerns me about one particular poster: Obsessive literal references, and subtle inferences, to the greatest atrocity in recorded human history, the Holocaust (please correct my history conclustion if I'm incorrect (?).). I would easier believe the literal, or infered, throwing of the kitchen sink. Perhaps you're a fan of reality, and shock, TV? *** I personally question the motivation of someone who continues to compare Civil Rights across the board, to the attempted extermination of a people, and the resulting twenty-to-thirty foot piles of rotting corpses bulldozed into mass piles and graves. *** Please clarify with brevity but very specific clarity, perhaps in a single post? Otherwise, I can only conclude that either some folks don't understand the gross falseness of their comparrisons, or don't care enough about the gravity - and human and emotional cost to humanity - of the Holocaust. *** We're talking about preserving the Civil Rights of all Americans. Not the killing of millions of people. *** At a minimum, out of respect for about a, \"thousand,\" things, reconsider your analogies. Perhaps something closer to, \"apples,\" and, \"oranges,\" not, \"inalienable and universal privacy,\" and, \"minority genocide.\" *** In my opinion, the vulgarity of the attempt to make such comparisons, puts any credibility of the poster's intent in question (?). ***", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 11:24:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "The question is not 'to Holocaust or not to Holocaust.' You're such a reactionary! I guess if you can't answer me then make an attempt at stigmatizing me? So be it. I'm sure the hoards of those reading these posts will identify me with Fascists political correctness! I asked: What kind of Government or society needs to know the sexual orientation of its citizens? Can you think of any?", 
        "intTime": 20090304, 
        "postID": 12, 
        "quote": "", 
        "reply": "The question is not 'to Holocaust or not to Holocaust.' You're such a reactionary! I guess if you can't answer me then make an attempt at stigmatizing me? So be it. I'm sure the hoards of those reading these posts will identify me with Fascists political correctness! I asked: What kind of Government or society needs to know the sexual orientation of its citizens? Can you think of any?", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 11:47:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "Again, you keep - perhaps - addressing my, \"SORS,\" as a suggested solution proposed in, \"AAVPIPS\" (?). *** My answer to your question: Yes, but you appear to grossly abuse what, \"know,\" means, relative to a government or society, in the greater context of a solution. The kind of government that respects everyone's inalienable and universal right to privacy, and subsequent Civil Rights, if that government can't create the literal privacy barriers to both respect privacy, and maintain good order and discipline, while at the same time, protect itself from Civil Liability. *** Having policies in place to address, \"breaches in privacy, which are open doors to a lack of discipline, and Civil Liability\" - after the fact - is not a solution, and is not leadership. Again, my argument is not for, \"SORS,\" specifically. I'm saying, if you have no basis from which to respect privacy, create appropriate barriers, and mitigate Civil Liability, you have zero basis to address, \"inclusive policy,\" in Federal Law.", 
        "intTime": 20090304, 
        "postID": 13, 
        "quote": "", 
        "reply": "Again, you keep - perhaps - addressing my, \"SORS,\" as a suggested solution proposed in, \"AAVPIPS\" (?). *** My answer to your question: Yes, but you appear to grossly abuse what, \"know,\" means, relative to a government or society, in the greater context of a solution. The kind of government that respects everyone's inalienable and universal right to privacy, and subsequent Civil Rights, if that government can't create the literal privacy barriers to both respect privacy, and maintain good order and discipline, while at the same time, protect itself from Civil Liability. *** Having policies in place to address, \"breaches in privacy, which are open doors to a lack of discipline, and Civil Liability\" - after the fact - is not a solution, and is not leadership. Again, my argument is not for, \"SORS,\" specifically. I'm saying, if you have no basis from which to respect privacy, create appropriate barriers, and mitigate Civil Liability, you have zero basis to address, \"inclusive policy,\" in Federal Law.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 12:04:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: Again, you keep - perhaps - addressing my, \"SORS,\" as a suggested solution proposed in, \"AAVPIPS\" (?). *** My answer to your question: Yes, but you appear to grossly abuse what, \"know,\" means, relative to a government or society, in the greater context of a solution. The kind of government that respects everyone's inalienable and universal right to privacy, and subsequent Civil Rights, if that government can't create the literal privacy barriers to both respect privacy, and maintain good order and discipline, while at the same time, protect itself from Civil Liability. So, we'd be the first country, since Nazi German, to require a disclosure of sexual orientation, as far as you know? *** Having policies in place to address, \"breaches in privacy, which are open doors to a lack of discipline, and Civil Liability\" - after the fact - is not a solution, and is not leadership. Again, my argument is not for, \"SORS,\" specifically. I'm saying, if you have no basis from which to respect privacy, create appropriate barriers, and mitigate Civil Liability, you have zero basis to address, \"inclusive policy,\" in Federal Law. So, I suppose to avoid having to know by law what someone's sexual orientation is they could install restrooms that say 'other'? I know some places have special restrooms for gays with a half man/half woman symbols for those who choose to use them. Will people wanting to use heterosexual restroom have to provide proof of orientation? And again, are there now any existing Federal laws that stipulate separate restrooms for men and women? Yes or no. And reference, please.", 
        "intTime": 20090304, 
        "postID": 14, 
        "quote": "Originally posted by EqualRightstoPrivacy: Again, you keep - perhaps - addressing my, \"SORS,\" as a suggested solution proposed in, \"AAVPIPS\" (?). *** My answer to your question: Yes, but you appear to grossly abuse what, \"know,\" means, relative to a government or society, in the greater context of a solution. The kind of government that respects everyone's inalienable and universal right to privacy, and subsequent Civil Rights, if that government can't create the literal privacy barriers to both respect privacy, and maintain good order and discipline, while at the same time, protect itself from Civil Liability. So, we'd be the first country, since Nazi German, to require a disclosure of sexual orientation, as far as you know? *** Having policies in place to address, \"breaches in privacy, which are open doors to a lack of discipline, and Civil Liability\" - after the fact - is not a solution, and is not leadership. Again, my argument is not for, \"SORS,\" specifically. I'm saying, if you have no basis from which to respect privacy, create appropriate barriers, and mitigate Civil Liability, you have zero basis to address, \"inclusive policy,\" in Federal Law.", 
        "reply": " So, I suppose to avoid having to know by law what someone's sexual orientation is they could install restrooms that say 'other'? I know some places have special restrooms for gays with a half man/half woman symbols for those who choose to use them. Will people wanting to use heterosexual restroom have to provide proof of orientation? And again, are there now any existing Federal laws that stipulate separate restrooms for men and women? Yes or no. And reference, please.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 12:38:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "I think it is appropriate at this point - taking a step back to about the fifth post north - to make a very important and relevant distinction. At the same sime - with the exception of this sentence - I will not respond to the buffoonery of a post as is the one above this post. *** Some see inclusive policy, as I have clearly premised, and suggested (with extensive security measure), as a means to respect sexual orientation, and protect privacy. *** Some see my inclusive policy premises, and suggestions, as a means to point out that if sexual orientation is known (which would require NATO-Top Secret style security breach, in my suggestion), this is a bad thing (?). *** Isn't the latter person attempting to villianize the sexual orientation of the GLBT community in that it were, \"found out,\" - regardless of the means - that the sexual orientation itself is a bad thing? It appears that way to me. Again, the end goal is, \"respect for the individual,\" not, \"the extermination of the individual.\" *** Shame, shame ... if that is the case.", 
        "intTime": 20090304, 
        "postID": 15, 
        "quote": "", 
        "reply": "I think it is appropriate at this point - taking a step back to about the fifth post north - to make a very important and relevant distinction. At the same sime - with the exception of this sentence - I will not respond to the buffoonery of a post as is the one above this post. *** Some see inclusive policy, as I have clearly premised, and suggested (with extensive security measure), as a means to respect sexual orientation, and protect privacy. *** Some see my inclusive policy premises, and suggestions, as a means to point out that if sexual orientation is known (which would require NATO-Top Secret style security breach, in my suggestion), this is a bad thing (?). *** Isn't the latter person attempting to villianize the sexual orientation of the GLBT community in that it were, \"found out,\" - regardless of the means - that the sexual orientation itself is a bad thing? It appears that way to me. Again, the end goal is, \"respect for the individual,\" not, \"the extermination of the individual.\" *** Shame, shame ... if that is the case.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 13:08:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: I think it is appropriate at this point - taking a step back to about the fifth post north - to make a very important and relevant distinction. At the same sime - with the exception of this sentence - I will not respond to the buffoonery of a post as is the one above this post. *** Some see inclusive policy, as I have clearly premised, and suggested (with extensive security measure), as a means to respect sexual orientation, and protect privacy. *** Some see my inclusive policy premises, and suggestions, as a means to point out that if sexual orientation is known (which would require NATO-Top Secret style security breach, in my suggestion), this is a bad thing (?). *** Isn't the latter person attempting to villianize the sexual orientation of the GLBT community in that it were, \"found out,\" - regardless of the means - that the sexual orientation itself is a bad thing? Oh, it would mean anyone's sexual orientation, hetero or homo. So, are they 'bad things'? Even as a heterosexual I would refuse on principle to disclose my sexual orientation. Then what happens? It appears that way to me. Again, the end goal is, \"respect for the individual,\" not, \"the extermination of the individual.\" *** Shame, shame ... if that is the case.", 
        "intTime": 20090304, 
        "postID": 16, 
        "quote": "Originally posted by EqualRightstoPrivacy: I think it is appropriate at this point - taking a step back to about the fifth post north - to make a very important and relevant distinction. At the same sime - with the exception of this sentence - I will not respond to the buffoonery of a post as is the one above this post. *** Some see inclusive policy, as I have clearly premised, and suggested (with extensive security measure), as a means to respect sexual orientation, and protect privacy. *** Some see my inclusive policy premises, and suggestions, as a means to point out that if sexual orientation is known (which would require NATO-Top Secret style security breach, in my suggestion), this is a bad thing (?). *** Isn't the latter person attempting to villianize the sexual orientation of the GLBT community in that it were, \"found out,\" - regardless of the means - that the sexual orientation itself is a bad thing? Oh, it would mean anyone's sexual orientation, hetero or homo. So, are they 'bad things'? Even as a heterosexual I would refuse on principle to disclose my sexual orientation. Then what happens? It appears that way to me. Again, the end goal is, \"respect for the individual,\" not, \"the extermination of the individual.\" *** Shame, shame ... if that is the case.", 
        "reply": "", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 13:34:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by 19022583: quote: Originally posted by JimCrackCorn: quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal... The implications here are....that a simple elimination of the DADT policy is NOT in the cards. Rather, that some revision of it is under consideration. It's POSSIBLE, yea even likely that the Army Times reporters ain't privy to the re-election strategizing already in progress in the Obama camp. Rumor has it that....they believe that by 2012 there will be quite enough controversial issues on the table with which to deal. As a result, REVISION (not repeal) of DADT will be taken up seriously when/if a second term is in the offing.", 
        "intTime": 20090305, 
        "postID": 17, 
        "quote": "Originally posted by 19022583: quote: Originally posted by JimCrackCorn: quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal... The implications here are....that a simple elimination of the DADT policy is NOT in the cards. Rather, that some revision of it is under consideration.", 
        "reply": " It's POSSIBLE, yea even likely that the Army Times reporters ain't privy to the re-election strategizing already in progress in the Obama camp. Rumor has it that....they believe that by 2012 there will be quite enough controversial issues on the table with which to deal. As a result, REVISION (not repeal) of DADT will be taken up seriously when/if a second term is in the offing.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-05 10:37:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: It's POSSIBLE, yea even likely that the Army Times reporters ain't privy to the re-election strategizing already in progress in the Obama camp. Rumor has it that....they believe that by 2012 there will be quite enough controversial issues on the table with which to deal. As a result, REVISION (not repeal) of DADT will be taken up seriously when/if a second term is in the offing. What happens if Congress takes up the issue first? Rep. Ellen Tauscher (D-CA) is doing just that. The Presidents re-election strategist may want Congress to take the lead on this Bill to repeal DADT. They may also realize that if the Bill is passed now, by 2012 the American public will have forgotten all about a Non-Discrimination Bill that was passed 3 years earlier, especially if the problems some say will happen such as mass exodus of heterosexuals from the military - doesn't come to pass after DADT is repealed. Politically, 2009 is a good time for the President to sign the Bill, and the sooner it is implemented the sooner people will realize that it is a non-event for the military.", 
        "intTime": 20090305, 
        "postID": 18, 
        "quote": "Originally posted by 19022583: It's POSSIBLE, yea even likely that the Army Times reporters ain't privy to the re-election strategizing already in progress in the Obama camp. Rumor has it that....they believe that by 2012 there will be quite enough controversial issues on the table with which to deal. As a result, REVISION (not repeal) of DADT will be taken up seriously when/if a second term is in the offing.", 
        "reply": " What happens if Congress takes up the issue first? Rep. Ellen Tauscher (D-CA) is doing just that. The Presidents re-election strategist may want Congress to take the lead on this Bill to repeal DADT. They may also realize that if the Bill is passed now, by 2012 the American public will have forgotten all about a Non-Discrimination Bill that was passed 3 years earlier, especially if the problems some say will happen such as mass exodus of heterosexuals from the military - doesn't come to pass after DADT is repealed. Politically, 2009 is a good time for the President to sign the Bill, and the sooner it is implemented the sooner people will realize that it is a non-event for the military.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-05 13:45:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "\"reducetension,\" quote: Then what happens? *** Mat's Answer: Peace Corps, community service, etc. The world - with the exception the US military - is your oyster. At least that is, anywhere that doesn't have community berthing, bathing, and bowls, where the inalienable Right to Privacy is respected by Law.", 
        "intTime": 20090305, 
        "postID": 19, 
        "quote": "Then what happens?", 
        "reply": "\"reducetension,\"  *** Mat's Answer: Peace Corps, community service, etc. The world - with the exception the US military - is your oyster. At least that is, anywhere that doesn't have community berthing, bathing, and bowls, where the inalienable Right to Privacy is respected by Law.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-05 14:59:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: \"reducetension,\" quote: Then what happens? *** Mat's Answer: Peace Corps, community service, etc. The world - with the exception the US military - is your oyster. At least that is, anywhere that doesn't have community berthing, bathing, and bowls, where the inalienable Right to Privacy is respected by Law. Well, why am I not surprised... dominionist thinking. What a '1984' pipe dream!! Gallop back to yester-years. And what makes you think the GLBT community will buy into your wild scheme to be herded around by your law? I don't think very many heterosexuals will let this warped idea slip by. I'm sure not for it. You think the GBLT folks will see this law and sign up? Maybe they'll let you enforce it? Appoint you the commissioner of sexual orientation extraction.", 
        "intTime": 20090305, 
        "postID": 20, 
        "quote": "Originally posted by EqualRightstoPrivacy: \"reducetension,\" quote: Then what happens? *** Mat's Answer: Peace Corps, community service, etc. The world - with the exception the US military - is your oyster. At least that is, anywhere that doesn't have community berthing, bathing, and bowls, where the inalienable Right to Privacy is respected by Law.", 
        "reply": " Well, why am I not surprised... dominionist thinking. What a '1984' pipe dream!! Gallop back to yester-years. And what makes you think the GLBT community will buy into your wild scheme to be herded around by your law? I don't think very many heterosexuals will let this warped idea slip by. I'm sure not for it. You think the GBLT folks will see this law and sign up? Maybe they'll let you enforce it? Appoint you the commissioner of sexual orientation extraction.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-05 17:40:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "WASHINGTON, DC 3-02-09 -- Today Rep. Ellen Tauscher (D-CA) announced at the Center for American Progress that she will introduce a bill to repeal the \"Don't Ask, Don't Tell\" law that bans gays and lesbians from serving openly. \"Rep. Tauscher's bill will significantly improve our military readiness by allowing highly qualified linguists, medics, and intelligence analysts to serve openly in the armed forces,\" said Aubrey Sarvis, executive director of the Servicemembers Legal Defense Network. \"SLDN, as well as the 12,500 people who have been discharged under the law and the 3,000 men and women each year who choose not to enlist or re-enlist because of the law, owe the congresswoman our sincere gratitude.\" The Military Enhancement Readiness Act (MREA) repeals the current ban on military service by openly lesbian, gay and bisexual Americans, commonly referred to as \"Don't Ask, Don't Tell.\" It would replace the current law with new provisions prohibiting discrimination based on sexual orientation in the Armed Forces. Last year, the MREA had 149 bipartisan cosponsors. \"This law has failed our country and our military for 15 years,\" said Rep. Tauscher. \"It harms military readiness and discriminates against patriotic young men and women who want to serve their country. It's time for Congress to right this wrong.\" Rep. Tauscher will be announcing her legislation at the Center for American Progress, 1333 H Street NW, 10th Floor, Washington, D.C. \"There is a window of opportunity to get repeal done this year,\" said Sarvis. \"We urge the Commander-in-Chief to lead on this issue, particularly at a time, as reported last week by the Associated Press, when the Pentagon itself concluded the U.S. military is stressed, stretched, and strained.\" Today's bill announcement prompted this statement from WH. “The President supports changing Don’t Ask Don’t Tell. As part of a long standing pledge, he has also begun consulting closely with Secretary Gates and Chairman Mullen so that this change is done in a sensible way that strengthens our armed forces and our national security.”", 
        "intTime": 20090302, 
        "postID": 21, 
        "quote": "", 
        "reply": "WASHINGTON, DC 3-02-09 -- Today Rep. Ellen Tauscher (D-CA) announced at the Center for American Progress that she will introduce a bill to repeal the \"Don't Ask, Don't Tell\" law that bans gays and lesbians from serving openly. \"Rep. Tauscher's bill will significantly improve our military readiness by allowing highly qualified linguists, medics, and intelligence analysts to serve openly in the armed forces,\" said Aubrey Sarvis, executive director of the Servicemembers Legal Defense Network. \"SLDN, as well as the 12,500 people who have been discharged under the law and the 3,000 men and women each year who choose not to enlist or re-enlist because of the law, owe the congresswoman our sincere gratitude.\" The Military Enhancement Readiness Act (MREA) repeals the current ban on military service by openly lesbian, gay and bisexual Americans, commonly referred to as \"Don't Ask, Don't Tell.\" It would replace the current law with new provisions prohibiting discrimination based on sexual orientation in the Armed Forces. Last year, the MREA had 149 bipartisan cosponsors. \"This law has failed our country and our military for 15 years,\" said Rep. Tauscher. \"It harms military readiness and discriminates against patriotic young men and women who want to serve their country. It's time for Congress to right this wrong.\" Rep. Tauscher will be announcing her legislation at the Center for American Progress, 1333 H Street NW, 10th Floor, Washington, D.C. \"There is a window of opportunity to get repeal done this year,\" said Sarvis. \"We urge the Commander-in-Chief to lead on this issue, particularly at a time, as reported last week by the Associated Press, when the Pentagon itself concluded the U.S. military is stressed, stretched, and strained.\" Today's bill announcement prompted this statement from WH. “The President supports changing Don’t Ask Don’t Tell. As part of a long standing pledge, he has also begun consulting closely with Secretary Gates and Chairman Mullen so that this change is done in a sensible way that strengthens our armed forces and our national security.”", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-02 20:34:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "\"IHAWKERS'\" Thread: \"Change [...] Put on hold.\" appeared to tell a different story regarding the, \"timing,\" of such a Bill. This should be a real test of where the Administration stands. Surprising the Decromats' argument will be, \"recruiting.\" Democrats have a history of being spineless on real issues. The real issue is of, \"Equal Rights,\" of what will become a protected minority class under Federal Law, when this thing passess, or one like it. Again, sad the Democrats will attempt to hide behind, \"recruiting,\" verses the human rights of American citizens. Not to mention, in my opinion, \"Military Readiness,\" is also a weak argument in relation to this social issue relative to the necessary social change it implies. *** That said, it really becomes necessary to take a real close look at, \"H.R. 1246,\" if that is the Bill they will present, or if there are modifications, what are they, etc. (?): 1.) Unless something has changed, the subject Bill does not include the, \"T,\" in GLBT. This is an absolute human rights violation and the Democrats should be ashamed. Again, a spineless move if, \"T,\" are kicked to the political curb. 2.) The language I've highlighted in Red Bold is what I think is the other major flaw with, \"H.R. 1246.\" Probably even more sinister. Please excuse if this below reference is way different than the Bill-form Rep. Tauscher is suggesting. Perhaps someone could post her Bill-form if it's available? *** 110TH CONGRESS 1ST SESSION H. R. 1246 To amend title 10, United States Code, to enhance the readiness of the Armed Forces by replacing the current policy concerning homosexuality in the Armed Forces, referred to as ‘‘Don’t Ask, Don’t Tell’’, with a policy of nondiscrimination on the basis of sexual orientation. IN THE HOUSE OF REPRESENTATIVES FEBRUARY 28, 2007 Mr. MEEHAN (for himself, Mr. SMITH of Washington, Mr. WYNN, Mr. HASTINGS of Florida, Ms. SCHWARTZ, Mr. WEINER, Ms. LEE, Mr. FRANK of Massachusetts, Ms. MCCOLLUM of Minnesota, Mr. PASCRELL, Mr. FILNER, Mrs. MALONEY of New York, Mr. FATTAH, Mr. RANGEL, Mr. SHAYS, Mr. VAN HOLLEN, Ms. CORRINE BROWN of Florida, Mr. DAVIS of Illinois, Mr. WU, Ms. WASSERMAN SCHULTZ, Mr. KUCINICH, Ms. WATSON, Mr. PAYNE, Ms. MATSUI, Mr. BLUMENAUER, Mr. PASTOR, Ms. EDDIE BERNICE JOHNSON of Texas, Mr. TOWNS, Mr. MARKEY, Ms. NORTON, Mr. CUMMINGS, Mr. ENGEL, Mrs. TAUSCHER, Mr. CLEAVER, Mr. PALLONE, Mr. ACKERMAN, Mr. GEORGE MILLER of California, Mrs. NAPOLITANO, Mr. MEEKS of New York, Ms. MOORE of Wisconsin, Mr. JOHNSON of Georgia, Mr. WAXMAN, Ms. SOLIS, Mr. BERMAN, Ms. ROSLEHTINEN, Mr. LANGEVIN, Mr. MORAN of Virginia, Mr. OBERSTAR, Ms. SCHAKOWSKY, Ms. HARMAN, Mr. INSLEE, Mr. NADLER, Mr. MCDERMOTT, Mr. MCGOVERN, Mr. DINGELL, Mr. LARSON of Connecticut, Mr. LEWIS of Georgia, Mr. OLVER, Mr. TIERNEY, Mr. SERRANO, Mr. CROWLEY, Ms. CARSON, Ms. CASTOR, Mr. ELLISON, Ms. LINDA T. SA ´NCHEZ of California, Mrs. CAPPS, Ms. SLAUGHTER, Ms. ROYBAL-ALLARD, Mr. GUTIERREZ, Ms. WOOLSEY, Mr. UDALL of Colorado, Mr. HINCHEY, Ms. WATERS, Ms. HIRONO, Mr. CAPUANO, Mr. DOYLE, Mr. HONDA, Mr. MICHAUD, Mr. ABERCROMBIE, Mrs. LOWEY, Ms. VELA´ZQUEZ, Mr. KENNEDY, Mr. STARK, Mr. DEFAZIO, Mr. WELCH of Vermont, Mr. HARE, Mr. EMANUEL, Mr. GRIJALVA, Mr. NEAL of Massachusetts, Mr. BRADY of Pennsylvania, Mr. WEXLER, Ms. DELAURO, Mr. HOLT, Mr. FARR, Ms. JACKSON-LEE of Texas, Ms. BERKLEY, Mrs. JONES of Ohio, Mr. LYNCH, Mr. COHEN, Mr. ISRAEL, Mr. ROTHMAN, Mrs. DAVIS of California, Ms. BALDWIN, Mr. ALLEN, Mr. LANTOS, Mr. GILCHREST, Mr. DELAHUNT, Mr. CLAY, Mr. BECERRA, and Ms. ZOE LOFGREN of California) introduced the following bill; which was referred to the Committee on Armed Services VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00001 Fmt 6652 Sfmt 6652 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 2 •HR 1246 IH A BILL To amend title 10, United States Code, to enhance the readiness of the Armed Forces by replacing the current policy concerning homosexuality in the Armed Forces, referred to as ‘‘Don’t Ask, Don’t Tell’’, with a policy of nondiscrimination on the basis of sexual orientation. 1 Be it enacted by the Senate and House of Representa2 tives of the United States of America in Congress assembled, 3 SECTION 1. SHORT TITLE. 4 This Act may be cited as the ‘‘Military Readiness En5 hancement Act of 2007’’. 6 SEC. 2. PURPOSE. 7 The purpose of this Act is to institute in the Armed 8 Forces a policy of nondiscrimination based on sexual ori9 entation. 10 SEC. 3. REPEAL OF 1993 POLICY CONCERNING HOMOSEX11 UALITY IN THE ARMED FORCES. 12 The following provisions of law are repealed: 13 (1) Section 654 of title 10, United States Code. 14 (2) Subsections (b), (c), and (d) of section 571 15 of the National Defense Authorization Act for Fiscal 16 Year 1994 (10 U.S.C. 654 note). VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00002 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 3 •HR 1246 IH 1 SEC. 4. ESTABLISHMENT OF POLICY OF NONDISCRIMINA2 TION BASED ON SEXUAL ORIENTATION IN 3 THE ARMED FORCES. 4 (a) ESTABLISHMENT OF POLICY.—(1) Chapter 37 of 5 title 10, United States Code, is amended by adding at the 6 end the following new section: 7 ‘‘§ 656. Policy of nondiscrimination based on sexual 8 orientation 9 ‘‘(a) POLICY.—The Secretary of Defense, and the 10 Secretary of Homeland Security with respect to the Coast 11 Guard when it is not operating as a service in the Navy, 12 may not discriminate on the basis of sexual orientation 13 against any member of the armed forces or against any 14 person seeking to become a member of the armed forces. 15 ‘‘(b) DISCRIMINATION ON BASIS OF SEXUAL ORI16 ENTATION.—For purposes of this section, discrimination 17 on the basis of sexual orientation is— 18 ‘‘(1) in the case of a member of the armed 19 forces, the taking of any personnel or administrative 20 action (including any action relating to promotion, 21 demotion, evaluation, selection for an award, selec22 tion for a duty assignment, transfer, or separation) 23 in whole or in part on the basis of sexual orienta24 tion; and 25 ‘‘(2) in the case of a person seeking to become 26 a member of the armed forces, denial of accession VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00003 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 4 •HR 1246 IH 1 into the armed forces in whole or in part on the 2 basis of sexual orientation. 3 ‘‘(c) PERSONNEL AND ADMINISTRATIVE POLICIES 4 AND ACTION.—The Secretary of Defense, and the Sec5 retary of Homeland Security with respect to the Coast 6 Guard when it is not operating as a service in the Navy, 7 may not establish, implement, or apply any personnel or 8 administrative policy, or take any personnel or administra9 tive action (including any policy or action relating to pro10 motions, demotions, evaluations, selections for awards, se11 lections for duty assignments, transfers, or separations) 12 in whole or in part on the basis of sexual orientation. 13 ‘‘(d) RULES AND POLICIES REGARDING CONDUCT.— 14 Nothing in this section prohibits the Secretary of Defense, 15 and the Secretary of Homeland Security with respect to 16 the Coast Guard when it is not operating as a service in 17 the Navy, from prescribing or enforcing regulations gov18 erning the conduct of members of the armed forces if the 19 regulations are designed and applied without regard to 20 sexual orientation. 21 ‘‘(e) RE-ACCESSION OF OTHERWISE QUALIFIED 22 PERSONS PERMITTED.—Any person separated from the 23 armed forces for homosexuality, bisexuality, or homo24 sexual conduct in accordance with laws and regulations 25 in effect before the date of the enactment of this section, VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00004 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 5 •HR 1246 IH 1 if otherwise qualified for re-accession into the armed 2 forces, shall not be prohibited from re-accession into the 3 armed forces on the sole basis of such separation. 4 ‘‘(f) SEXUAL ORIENTATION.—In this section, the 5 term ‘sexual orientation’ means heterosexuality, homosex6 uality, or bisexuality, whether the orientation is real or 7 perceived, and includes statements and consensual sexual 8 conduct manifesting heterosexuality, homosexuality, or bi9 sexuality.’’. 10 (2) The table of sections at the beginning of such 11 chapter is amended— 12 (A) by striking the item relating to section 654; 13 and 14 (B) by adding at the end the following new 15 item: ‘‘656. Policy of nondiscrimination based on sexual orientation in the armed forces.’’. 16 (b) CONFORMING AMENDMENTS.—Title 10, United 17 States Code, is amended as follows: 18 (1) Section 481 is amended— 19 (A) In subsection (a)(2), by inserting ‘‘, in20 cluding sexual orientation discrimination,’’ after 21 ‘‘discrimination’’ in subparagraphs (C) and (D); 22 and VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00005 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 6 •HR 1246 IH 1 (B) in subsection (c), by inserting ‘‘and 2 sexual orientation-based’’ after ‘‘gender-based’’ 3 both places it appears. 4 (2) Section 983(a)(1) is amended by striking 5 ‘‘(in accordance with section 654 of this title and 6 other applicable Federal laws)’’. 7 (3) Section 1034(i)(3) is amended by inserting 8 ‘‘sexual orientation,’’ after ‘‘sex,’’. 9 SEC. 5. BENEFITS. 10 Nothing in this Act, or the amendments made by this 11 Act, shall be construed to require the furnishing of de12 pendent benefits in violation of section 7 of title 1, United 13 States Code (relating to the definitions of ‘‘marriage’’ and 14 ‘‘spouse’’ and referred to as the ‘‘Defense of Marriage 15 Act’’). 16 SEC. 6. NO PRIVATE CAUSE OF ACTION FOR DAMAGES. 17 Nothing in this Act, or the amendments made by this 18 Act, shall be construed to create a private cause of action 19 for damages. 20 SEC. 7. REGULATIONS. 21 (a) IN GENERAL.—Not later than 90 days after the 22 date of the enactment of this Act, the Secretary of Defense 23 shall revise Department of Defense regulations, and shall 24 issue such new regulations as may be necessary, to imple25 ment section 656 of title 10, United States Code, as added VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00006 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 7 •HR 1246 IH 1 by section 4(a). The Secretary of Defense shall further 2 direct the Secretary of each military department to revise 3 regulations of that military department in accordance with 4 section 656 of title 10, United States Code, as added by 5 section 4(a), not later than 180 days after the date of the 6 enactment of this Act. Such revisions shall include the fol7 lowing: 8 (1) Revision of all equal opportunity and 9 human relations regulations, directives, and instruc10 tions to add sexual orientation nondiscrimination to 11 the Department of Defense Equal Opportunity pol12 icy and to related human relations training pro13 grams. 14 (2) Revision of Department of Defense and 15 military department personnel regulations to elimi16 nate procedures for involuntary discharges based on 17 sexual orientation. 18 (3) Revision of Department of Defense and 19 military department regulations governing victims’ 20 advocacy programs to include sexual orientation dis21 crimination among the forms of discrimination for 22 which members of the Armed Forces and their fami23 lies may seek assistance. 24 (b) REGULATION OF CONDUCT.—The Secretary of 25 Defense, and the Secretary of Homeland Security with re- VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00007 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 8 •HR 1246 IH 1 spect to the Coast Guard when it is not operating as a 2 service in the Navy, shall ensure that regulations gov3 erning the personal conduct of members of the Armed 4 Forces shall be written and enforced without regard to 5 sexual orientation. 6 (c) DEFINITION.—In this section, the term ‘‘sexual 7 orientation’’ has the meaning given that term in section 8 656(f) of title 10, United States Code, as added by section 9 4(a). *** It is my opinion that the line items I highlighted in Red Bold: - fail to address, \"T,\" which is a solitification in itself of the fact that this is not a Bill for, \"Equal Rights,\" it's a Bill that writes into Federal Law legally putting a special interest agenda on the books, that specifically and willing excludes members of essentially the same minority group. - appears to shut the discussion down - in Federal Law - addressing dependent benefits for GLB members, which is a solitification in itself of the fact that this is not a Bill for, \"Equal Rights,\" it's a Bill that writes into Federal Law legally putting GLB into for-now permanent box of second-class citizen. - does not account for, \"berthing, bathing, and bowls,\" and actually Federalizes in Law the disregard for all service members' Right to Privacy. - allows for Partner Enlisted Quarters (PEQs). - vaguely references litigation in an exclusive way, not inclusive way. - and makes it difficult - if not impossible - to write policies and or regulations addressing: \"As for [a] DIRECT answer to this question, \"[...] are [you] trying to protect gays by making sure they are identified for 'special treatment'?\" is: If I had a say in the resulting repealing of DA/DT, and writing of inclusive policy: - it would include, \"T.\" - it would protect GLBT within the spirit of existing protected minority classes with existing EEOC and AA, recruiting, analysis, etc., initiatives. - In my opinion, \"disclosure,\" would serve a number of purposes including; a.) protecting GLBT, b.) allowing for the most effective EEOC [referencing the Constitutional premise as it applies to EO] and AA initiatives, c.) protect the DoD/Federal Government from liability (much the same way, \"disclosure,\" has been addressed with, ENDA, as I have clearly pointed out on several posts.), d.) protect all service members' common right to privacy - including that of GLBT, and e.) set the stage for an extremely effective organizational theory, e.g., \"disclosure,\" from research I've done on both sides is that it is a short and long-term win-win for numerous reasons, and f.) set the obvious stage for dependent benefits, which inherently requires disclosure, and g.) allow leaders - at every echelon - the opportunity to know who they are leading, and give the training necessary to deal appropriately - we roled played sensitivity training while I was on active duty (again, I am not outling a full-disclosure policy, and never have. I'm talking about [...] a narrow and limited disclosure policy. I am only advocating that relevant professionals address, \"disclosure,\" in terms, of the real and perceived hostile environment(s) that exist in organizations [...]. [This is not v]iolating privacy rights[] - it's an all-voluteer force [...] They're the real professionals [...]. [...] To me, this fact infers the obvious, it is secondary to the greater good in social/organizational theory. GLBT, \"fear,\" that [...] is real, but not something from which to write Federal Policy on. It is a type of, \"fear,\" that you write Federal Policy in a way that enforces specifically, and strategically, the healthy environment to allow GLBT to overcome it.\" - The, \"EO,\" references may supersede the general language in the Bill, but I don't know for sure. It doesn't look like it. It actually looks like it prevents EO from doing its' job, \"How can you address, \"sexual orientation,\" if you're not allowed to intitiate any policies or regulations with, \"sexual orientation,\" as the basis? What it appears to do is tie the hands of EO officers by only allowing them to respond to issues. If that is the case, that is a poor knot to tie. - At a minimum, it deserves clarification. *** For further clarity. Red Bold mine: From SLDN regarding the original H.R. 1246: MILITARY READINESS ENHANCEMENT ACT (H.R. 1246) SECTION BY SECTION ANALYSIS Section 1. Short Title. Section 1 provides the short title for the legislation. The “Military Readiness Enhancement Act” is the title of this legislation. Section 2. Purpose. Section 2 identifies the purpose of the legislation, which is to repeal 10 U.S.C. 654 and replace it with a new policy of non-discrimination based on sexual orientation in the Armed Forces. Section 3. Repeal of 1994 Policy Concerning Homosexuality in the Armed Forces. This section repeals the current law, 10 U.S.C. 654. Section 4. Policy of Non-Discrimination Based on Sexual Orientation in the Armed Forces. (a). Establishment of Policy. This section establishes a new law prohibiting sexual orientation discrimination in the Armed Forces. This section provides for a policy of non-discrimination based on sexual orientation in the Armed Forces, to be titled 10 U.S.C. 656. (a) Policy. Subsection (a) provides the new policy statement, prohibiting sexual orientation discrimination within the Armed Forces and among people seeking entry into the Armed Forces. (b) Discrimination on the Basis of Sexual Orientation. This subsection provides a non-exclusive list of what constitutes discrimination on the basis of sexual orientation in the Armed Forces. For current members of the Armed Forces, this section includes within the definition of sexual orientation discrimination any personnel or administrative action taken in whole or in part on the basis of sexual orientation. For applicants for military service, denial of accession made in whole or in part on the basis of sexual orientation constitutes sexual orientation discrimination. (c) Personnel and Administrative Policies and Action. This section prohibits the Secretary of Defense, and the Secretary of Homeland Security with respect to the Coast Guard when it is not operating under the Navy, from establishing, implementing or applying any personnel or administrative policies, or taking an personnel or administrative action, in whole or in part on the basis of sexual orientation. It is designed to prevent the military from re-instituting discriminatory policies once “Don’t Ask, Don’t Tell” is repealed. (d) Rules and Policies Regarding Conduct. This language is modeled on ENDA’s Section 11 (a), “Construction: Employer Rules and Policies.” It is intended to clarify that nothing in the legislation will prevent the military from continuing to regulate the conduct of its members, as long as any such regulation is written and enforced in a sexual orientation-neutral manner. (e) Re-accession of Otherwise Qualified Persons Permitted. This language provides the opportunity for persons discharged for homosexuality or homosexual conduct under “Don’t Ask, Don’t Tell” or its predecessor regulations to re-apply for entry into the Armed Forces. The “otherwise qualified” language makes clear that there is no absolute right of re-entry for anyone discharged under “Don’t Ask, Don’t Tell” or the predecessor regulations. For example, age and physical requirements to re-enter the military would still be applied to persons who wished to re-enter the Armed Forces under this provision. (f) Sexual Orientation. Sexual orientation is defined as “heterosexuality, bisexuality, or homosexuality, whether the orientation is real or perceived, and includes statements and consensual sexual conduct manifesting heterosexuality, homosexuality, or bisexuality.” This first part of this definition is fairly standard, and consistent with most state law definitions of sexual orientation. It is consistent with although broader than the only current federal statutory definition of sexual orientation, which appears in 28 U.S.C. 534, the federal hate crimes Continued on next page…. reporting statute. This definition is “consensual homosexuality or heterosexuality.” The second part of the definition is meant to ensure that the gap created between status and conduct through the “Don’t Ask, Don’t Tell” policy will not persist beyond the policy’s repeal. Military discharges based on statements of sexual orientation or conduct manifesting homosexual or bisexual orientation form the basis of “Don’t Ask, Don’t Tell.” The distinction is cemented in case law challenging the ban on constitutional grounds. Without the second part of this definition, it is possible Defense Department officials could effectively continue a policy of discriminating based on statements or conduct, versus sexual orientation per se. (2). Section 4 subsection (a)(2) provides the necessary changes to the table of contents to reflect the deletion of 10 U.S.C. 654 and the addition of 10 U.S.C. 656. (b). Conforming Amendments. Section 4 subsection (b) provides the conforming amendments required by the new legislation. (1). Subsection (b)(1) adds sexual orientation discrimination to a list of issues statutorily mandated for quadrennial surveys by the Department of Defense. (2). Subsection (b)(2) modifies the Solomon Amendment to remove the reference to 10 U.S.C. 654 and related laws. It is unclear whether the Solomon Amendment will have any relevance once the current Section 654 is repealed. However, the consequence of leaving 10 U.S.C. 983 as it is would be the possibility that certain schools might prohibit military recruiters from their campuses because of the military’s new policy of non-discrimination based on sexual orientation. (3). Subsection (b)(3) adds sexual orientation to the definition of “unlawful discrimination” in the code provision prohibiting retaliatory personnel actions. Section 5. Benefits. This provision makes clear that this legislation does not require the military to provide dependent benefits in violation of the Defense of Marriage Act. Section 6. No Private Cause of Action for Damages. This section makes clear that this legislation does not create a private cause of action for damages. Section 7. Regulations. This section provides the authority to issue regulations implementing this legislation and gives guidance as to the content of those regulations. (a). In General. The Secretary of Defense has 90 days following enactment of the legislation to issue Department of Defense regulations implementing the legislation, and must direct each service to revise its regulations no later than 180 days after the enactment of the legislation. Regulations which must be amended include but are not limited to: (1). All Equal Opportunity and Human Relations regulations, directives, and instructions and training guidance; (2). Personnel regulations governing involuntary discharges; (3). Victim’s advocacy regulations to include sexual orientation discrimination among the forms of discrimination for which members of the Armed Forces and their families may seek assistance. This provision is intended to ensure that victims of sexual orientation-based hate violence and sexual orientation discrimination can access Victims’ Advocacy programs to the same extent that other victims of prohibited discrimination and hate violence can. (b). Regulation of Conduct. This provision mandates the regulations governing service members’ conduct be written and enforced without regard to sexual orientation. It is essentially a reiteration of Section 3 (c), but we think it is important that this concept appear in both the policy section and the regulation section of the legislation as a political matter. (c). Definition. This section provides reference to the new 10 USC 656(f) for the definition of sexual orientation. *** Again the highlighted line items are grey - as I explained above - to say the least and need to be clearly addressed. *** Either way, \"H.R. 1246,\" - if that is what is about to be on the table - is clearly suspect for a large number of reasons. Americans can do a lot better than that ... the GLBT community deserve better. Under Section 8 of the US Constitution, Congress can do much, much better. This message has been edited. Last edited by: EqualRightstoPrivacy, Mon 02 March 2009 11:48 PM", 
        "intTime": 20090302, 
        "postID": 22, 
        "quote": "", 
        "reply": "\"IHAWKERS'\" Thread: \"Change [...] Put on hold.\" appeared to tell a different story regarding the, \"timing,\" of such a Bill. This should be a real test of where the Administration stands. Surprising the Decromats' argument will be, \"recruiting.\" Democrats have a history of being spineless on real issues. The real issue is of, \"Equal Rights,\" of what will become a protected minority class under Federal Law, when this thing passess, or one like it. Again, sad the Democrats will attempt to hide behind, \"recruiting,\" verses the human rights of American citizens. Not to mention, in my opinion, \"Military Readiness,\" is also a weak argument in relation to this social issue relative to the necessary social change it implies. *** That said, it really becomes necessary to take a real close look at, \"H.R. 1246,\" if that is the Bill they will present, or if there are modifications, what are they, etc. (?): 1.) Unless something has changed, the subject Bill does not include the, \"T,\" in GLBT. This is an absolute human rights violation and the Democrats should be ashamed. Again, a spineless move if, \"T,\" are kicked to the political curb. 2.) The language I've highlighted in Red Bold is what I think is the other major flaw with, \"H.R. 1246.\" Probably even more sinister. Please excuse if this below reference is way different than the Bill-form Rep. Tauscher is suggesting. Perhaps someone could post her Bill-form if it's available? *** 110TH CONGRESS 1ST SESSION H. R. 1246 To amend title 10, United States Code, to enhance the readiness of the Armed Forces by replacing the current policy concerning homosexuality in the Armed Forces, referred to as ‘‘Don’t Ask, Don’t Tell’’, with a policy of nondiscrimination on the basis of sexual orientation. IN THE HOUSE OF REPRESENTATIVES FEBRUARY 28, 2007 Mr. MEEHAN (for himself, Mr. SMITH of Washington, Mr. WYNN, Mr. HASTINGS of Florida, Ms. SCHWARTZ, Mr. WEINER, Ms. LEE, Mr. FRANK of Massachusetts, Ms. MCCOLLUM of Minnesota, Mr. PASCRELL, Mr. FILNER, Mrs. MALONEY of New York, Mr. FATTAH, Mr. RANGEL, Mr. SHAYS, Mr. VAN HOLLEN, Ms. CORRINE BROWN of Florida, Mr. DAVIS of Illinois, Mr. WU, Ms. WASSERMAN SCHULTZ, Mr. KUCINICH, Ms. WATSON, Mr. PAYNE, Ms. MATSUI, Mr. BLUMENAUER, Mr. PASTOR, Ms. EDDIE BERNICE JOHNSON of Texas, Mr. TOWNS, Mr. MARKEY, Ms. NORTON, Mr. CUMMINGS, Mr. ENGEL, Mrs. TAUSCHER, Mr. CLEAVER, Mr. PALLONE, Mr. ACKERMAN, Mr. GEORGE MILLER of California, Mrs. NAPOLITANO, Mr. MEEKS of New York, Ms. MOORE of Wisconsin, Mr. JOHNSON of Georgia, Mr. WAXMAN, Ms. SOLIS, Mr. BERMAN, Ms. ROSLEHTINEN, Mr. LANGEVIN, Mr. MORAN of Virginia, Mr. OBERSTAR, Ms. SCHAKOWSKY, Ms. HARMAN, Mr. INSLEE, Mr. NADLER, Mr. MCDERMOTT, Mr. MCGOVERN, Mr. DINGELL, Mr. LARSON of Connecticut, Mr. LEWIS of Georgia, Mr. OLVER, Mr. TIERNEY, Mr. SERRANO, Mr. CROWLEY, Ms. CARSON, Ms. CASTOR, Mr. ELLISON, Ms. LINDA T. SA ´NCHEZ of California, Mrs. CAPPS, Ms. SLAUGHTER, Ms. ROYBAL-ALLARD, Mr. GUTIERREZ, Ms. WOOLSEY, Mr. UDALL of Colorado, Mr. HINCHEY, Ms. WATERS, Ms. HIRONO, Mr. CAPUANO, Mr. DOYLE, Mr. HONDA, Mr. MICHAUD, Mr. ABERCROMBIE, Mrs. LOWEY, Ms. VELA´ZQUEZ, Mr. KENNEDY, Mr. STARK, Mr. DEFAZIO, Mr. WELCH of Vermont, Mr. HARE, Mr. EMANUEL, Mr. GRIJALVA, Mr. NEAL of Massachusetts, Mr. BRADY of Pennsylvania, Mr. WEXLER, Ms. DELAURO, Mr. HOLT, Mr. FARR, Ms. JACKSON-LEE of Texas, Ms. BERKLEY, Mrs. JONES of Ohio, Mr. LYNCH, Mr. COHEN, Mr. ISRAEL, Mr. ROTHMAN, Mrs. DAVIS of California, Ms. BALDWIN, Mr. ALLEN, Mr. LANTOS, Mr. GILCHREST, Mr. DELAHUNT, Mr. CLAY, Mr. BECERRA, and Ms. ZOE LOFGREN of California) introduced the following bill; which was referred to the Committee on Armed Services VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00001 Fmt 6652 Sfmt 6652 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 2 •HR 1246 IH A BILL To amend title 10, United States Code, to enhance the readiness of the Armed Forces by replacing the current policy concerning homosexuality in the Armed Forces, referred to as ‘‘Don’t Ask, Don’t Tell’’, with a policy of nondiscrimination on the basis of sexual orientation. 1 Be it enacted by the Senate and House of Representa2 tives of the United States of America in Congress assembled, 3 SECTION 1. SHORT TITLE. 4 This Act may be cited as the ‘‘Military Readiness En5 hancement Act of 2007’’. 6 SEC. 2. PURPOSE. 7 The purpose of this Act is to institute in the Armed 8 Forces a policy of nondiscrimination based on sexual ori9 entation. 10 SEC. 3. REPEAL OF 1993 POLICY CONCERNING HOMOSEX11 UALITY IN THE ARMED FORCES. 12 The following provisions of law are repealed: 13 (1) Section 654 of title 10, United States Code. 14 (2) Subsections (b), (c), and (d) of section 571 15 of the National Defense Authorization Act for Fiscal 16 Year 1994 (10 U.S.C. 654 note). VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00002 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 3 •HR 1246 IH 1 SEC. 4. ESTABLISHMENT OF POLICY OF NONDISCRIMINA2 TION BASED ON SEXUAL ORIENTATION IN 3 THE ARMED FORCES. 4 (a) ESTABLISHMENT OF POLICY.—(1) Chapter 37 of 5 title 10, United States Code, is amended by adding at the 6 end the following new section: 7 ‘‘§ 656. Policy of nondiscrimination based on sexual 8 orientation 9 ‘‘(a) POLICY.—The Secretary of Defense, and the 10 Secretary of Homeland Security with respect to the Coast 11 Guard when it is not operating as a service in the Navy, 12 may not discriminate on the basis of sexual orientation 13 against any member of the armed forces or against any 14 person seeking to become a member of the armed forces. 15 ‘‘(b) DISCRIMINATION ON BASIS OF SEXUAL ORI16 ENTATION.—For purposes of this section, discrimination 17 on the basis of sexual orientation is— 18 ‘‘(1) in the case of a member of the armed 19 forces, the taking of any personnel or administrative 20 action (including any action relating to promotion, 21 demotion, evaluation, selection for an award, selec22 tion for a duty assignment, transfer, or separation) 23 in whole or in part on the basis of sexual orienta24 tion; and 25 ‘‘(2) in the case of a person seeking to become 26 a member of the armed forces, denial of accession VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00003 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 4 •HR 1246 IH 1 into the armed forces in whole or in part on the 2 basis of sexual orientation. 3 ‘‘(c) PERSONNEL AND ADMINISTRATIVE POLICIES 4 AND ACTION.—The Secretary of Defense, and the Sec5 retary of Homeland Security with respect to the Coast 6 Guard when it is not operating as a service in the Navy, 7 may not establish, implement, or apply any personnel or 8 administrative policy, or take any personnel or administra9 tive action (including any policy or action relating to pro10 motions, demotions, evaluations, selections for awards, se11 lections for duty assignments, transfers, or separations) 12 in whole or in part on the basis of sexual orientation. 13 ‘‘(d) RULES AND POLICIES REGARDING CONDUCT.— 14 Nothing in this section prohibits the Secretary of Defense, 15 and the Secretary of Homeland Security with respect to 16 the Coast Guard when it is not operating as a service in 17 the Navy, from prescribing or enforcing regulations gov18 erning the conduct of members of the armed forces if the 19 regulations are designed and applied without regard to 20 sexual orientation. 21 ‘‘(e) RE-ACCESSION OF OTHERWISE QUALIFIED 22 PERSONS PERMITTED.—Any person separated from the 23 armed forces for homosexuality, bisexuality, or homo24 sexual conduct in accordance with laws and regulations 25 in effect before the date of the enactment of this section, VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00004 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 5 •HR 1246 IH 1 if otherwise qualified for re-accession into the armed 2 forces, shall not be prohibited from re-accession into the 3 armed forces on the sole basis of such separation. 4 ‘‘(f) SEXUAL ORIENTATION.—In this section, the 5 term ‘sexual orientation’ means heterosexuality, homosex6 uality, or bisexuality, whether the orientation is real or 7 perceived, and includes statements and consensual sexual 8 conduct manifesting heterosexuality, homosexuality, or bi9 sexuality.’’. 10 (2) The table of sections at the beginning of such 11 chapter is amended— 12 (A) by striking the item relating to section 654; 13 and 14 (B) by adding at the end the following new 15 item: ‘‘656. Policy of nondiscrimination based on sexual orientation in the armed forces.’’. 16 (b) CONFORMING AMENDMENTS.—Title 10, United 17 States Code, is amended as follows: 18 (1) Section 481 is amended— 19 (A) In subsection (a)(2), by inserting ‘‘, in20 cluding sexual orientation discrimination,’’ after 21 ‘‘discrimination’’ in subparagraphs (C) and (D); 22 and VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00005 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 6 •HR 1246 IH 1 (B) in subsection (c), by inserting ‘‘and 2 sexual orientation-based’’ after ‘‘gender-based’’ 3 both places it appears. 4 (2) Section 983(a)(1) is amended by striking 5 ‘‘(in accordance with section 654 of this title and 6 other applicable Federal laws)’’. 7 (3) Section 1034(i)(3) is amended by inserting 8 ‘‘sexual orientation,’’ after ‘‘sex,’’. 9 SEC. 5. BENEFITS. 10 Nothing in this Act, or the amendments made by this 11 Act, shall be construed to require the furnishing of de12 pendent benefits in violation of section 7 of title 1, United 13 States Code (relating to the definitions of ‘‘marriage’’ and 14 ‘‘spouse’’ and referred to as the ‘‘Defense of Marriage 15 Act’’). 16 SEC. 6. NO PRIVATE CAUSE OF ACTION FOR DAMAGES. 17 Nothing in this Act, or the amendments made by this 18 Act, shall be construed to create a private cause of action 19 for damages. 20 SEC. 7. REGULATIONS. 21 (a) IN GENERAL.—Not later than 90 days after the 22 date of the enactment of this Act, the Secretary of Defense 23 shall revise Department of Defense regulations, and shall 24 issue such new regulations as may be necessary, to imple25 ment section 656 of title 10, United States Code, as added VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00006 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 7 •HR 1246 IH 1 by section 4(a). The Secretary of Defense shall further 2 direct the Secretary of each military department to revise 3 regulations of that military department in accordance with 4 section 656 of title 10, United States Code, as added by 5 section 4(a), not later than 180 days after the date of the 6 enactment of this Act. Such revisions shall include the fol7 lowing: 8 (1) Revision of all equal opportunity and 9 human relations regulations, directives, and instruc10 tions to add sexual orientation nondiscrimination to 11 the Department of Defense Equal Opportunity pol12 icy and to related human relations training pro13 grams. 14 (2) Revision of Department of Defense and 15 military department personnel regulations to elimi16 nate procedures for involuntary discharges based on 17 sexual orientation. 18 (3) Revision of Department of Defense and 19 military department regulations governing victims’ 20 advocacy programs to include sexual orientation dis21 crimination among the forms of discrimination for 22 which members of the Armed Forces and their fami23 lies may seek assistance. 24 (b) REGULATION OF CONDUCT.—The Secretary of 25 Defense, and the Secretary of Homeland Security with re- VerDate Aug 31 2005 07:08 Mar 02, 2007 Jkt 059200 PO 00000 Frm 00007 Fmt 6652 Sfmt 6201 E:\\BILLS\\H1246.IH H1246 mstockstill on PROD1PC66 with BILLS 8 •HR 1246 IH 1 spect to the Coast Guard when it is not operating as a 2 service in the Navy, shall ensure that regulations gov3 erning the personal conduct of members of the Armed 4 Forces shall be written and enforced without regard to 5 sexual orientation. 6 (c) DEFINITION.—In this section, the term ‘‘sexual 7 orientation’’ has the meaning given that term in section 8 656(f) of title 10, United States Code, as added by section 9 4(a). *** It is my opinion that the line items I highlighted in Red Bold: - fail to address, \"T,\" which is a solitification in itself of the fact that this is not a Bill for, \"Equal Rights,\" it's a Bill that writes into Federal Law legally putting a special interest agenda on the books, that specifically and willing excludes members of essentially the same minority group. - appears to shut the discussion down - in Federal Law - addressing dependent benefits for GLB members, which is a solitification in itself of the fact that this is not a Bill for, \"Equal Rights,\" it's a Bill that writes into Federal Law legally putting GLB into for-now permanent box of second-class citizen. - does not account for, \"berthing, bathing, and bowls,\" and actually Federalizes in Law the disregard for all service members' Right to Privacy. - allows for Partner Enlisted Quarters (PEQs). - vaguely references litigation in an exclusive way, not inclusive way. - and makes it difficult - if not impossible - to write policies and or regulations addressing: \"As for [a] DIRECT answer to this question, \"[...] are [you] trying to protect gays by making sure they are identified for 'special treatment'?\" is: If I had a say in the resulting repealing of DA/DT, and writing of inclusive policy: - it would include, \"T.\" - it would protect GLBT within the spirit of existing protected minority classes with existing EEOC and AA, recruiting, analysis, etc., initiatives. - In my opinion, \"disclosure,\" would serve a number of purposes including; a.) protecting GLBT, b.) allowing for the most effective EEOC [referencing the Constitutional premise as it applies to EO] and AA initiatives, c.) protect the DoD/Federal Government from liability (much the same way, \"disclosure,\" has been addressed with, ENDA, as I have clearly pointed out on several posts.), d.) protect all service members' common right to privacy - including that of GLBT, and e.) set the stage for an extremely effective organizational theory, e.g., \"disclosure,\" from research I've done on both sides is that it is a short and long-term win-win for numerous reasons, and f.) set the obvious stage for dependent benefits, which inherently requires disclosure, and g.) allow leaders - at every echelon - the opportunity to know who they are leading, and give the training necessary to deal appropriately - we roled played sensitivity training while I was on active duty (again, I am not outling a full-disclosure policy, and never have. I'm talking about [...] a narrow and limited disclosure policy. I am only advocating that relevant professionals address, \"disclosure,\" in terms, of the real and perceived hostile environment(s) that exist in organizations [...]. [This is not v]iolating privacy rights[] - it's an all-voluteer force [...] They're the real professionals [...]. [...] To me, this fact infers the obvious, it is secondary to the greater good in social/organizational theory. GLBT, \"fear,\" that [...] is real, but not something from which to write Federal Policy on. It is a type of, \"fear,\" that you write Federal Policy in a way that enforces specifically, and strategically, the healthy environment to allow GLBT to overcome it.\" - The, \"EO,\" references may supersede the general language in the Bill, but I don't know for sure. It doesn't look like it. It actually looks like it prevents EO from doing its' job, \"How can you address, \"sexual orientation,\" if you're not allowed to intitiate any policies or regulations with, \"sexual orientation,\" as the basis? What it appears to do is tie the hands of EO officers by only allowing them to respond to issues. If that is the case, that is a poor knot to tie. - At a minimum, it deserves clarification. *** For further clarity. Red Bold mine: From SLDN regarding the original H.R. 1246: MILITARY READINESS ENHANCEMENT ACT (H.R. 1246) SECTION BY SECTION ANALYSIS Section 1. Short Title. Section 1 provides the short title for the legislation. The “Military Readiness Enhancement Act” is the title of this legislation. Section 2. Purpose. Section 2 identifies the purpose of the legislation, which is to repeal 10 U.S.C. 654 and replace it with a new policy of non-discrimination based on sexual orientation in the Armed Forces. Section 3. Repeal of 1994 Policy Concerning Homosexuality in the Armed Forces. This section repeals the current law, 10 U.S.C. 654. Section 4. Policy of Non-Discrimination Based on Sexual Orientation in the Armed Forces. (a). Establishment of Policy. This section establishes a new law prohibiting sexual orientation discrimination in the Armed Forces. This section provides for a policy of non-discrimination based on sexual orientation in the Armed Forces, to be titled 10 U.S.C. 656. (a) Policy. Subsection (a) provides the new policy statement, prohibiting sexual orientation discrimination within the Armed Forces and among people seeking entry into the Armed Forces. (b) Discrimination on the Basis of Sexual Orientation. This subsection provides a non-exclusive list of what constitutes discrimination on the basis of sexual orientation in the Armed Forces. For current members of the Armed Forces, this section includes within the definition of sexual orientation discrimination any personnel or administrative action taken in whole or in part on the basis of sexual orientation. For applicants for military service, denial of accession made in whole or in part on the basis of sexual orientation constitutes sexual orientation discrimination. (c) Personnel and Administrative Policies and Action. This section prohibits the Secretary of Defense, and the Secretary of Homeland Security with respect to the Coast Guard when it is not operating under the Navy, from establishing, implementing or applying any personnel or administrative policies, or taking an personnel or administrative action, in whole or in part on the basis of sexual orientation. It is designed to prevent the military from re-instituting discriminatory policies once “Don’t Ask, Don’t Tell” is repealed. (d) Rules and Policies Regarding Conduct. This language is modeled on ENDA’s Section 11 (a), “Construction: Employer Rules and Policies.” It is intended to clarify that nothing in the legislation will prevent the military from continuing to regulate the conduct of its members, as long as any such regulation is written and enforced in a sexual orientation-neutral manner. (e) Re-accession of Otherwise Qualified Persons Permitted. This language provides the opportunity for persons discharged for homosexuality or homosexual conduct under “Don’t Ask, Don’t Tell” or its predecessor regulations to re-apply for entry into the Armed Forces. The “otherwise qualified” language makes clear that there is no absolute right of re-entry for anyone discharged under “Don’t Ask, Don’t Tell” or the predecessor regulations. For example, age and physical requirements to re-enter the military would still be applied to persons who wished to re-enter the Armed Forces under this provision. (f) Sexual Orientation. Sexual orientation is defined as “heterosexuality, bisexuality, or homosexuality, whether the orientation is real or perceived, and includes statements and consensual sexual conduct manifesting heterosexuality, homosexuality, or bisexuality.” This first part of this definition is fairly standard, and consistent with most state law definitions of sexual orientation. It is consistent with although broader than the only current federal statutory definition of sexual orientation, which appears in 28 U.S.C. 534, the federal hate crimes Continued on next page…. reporting statute. This definition is “consensual homosexuality or heterosexuality.” The second part of the definition is meant to ensure that the gap created between status and conduct through the “Don’t Ask, Don’t Tell” policy will not persist beyond the policy’s repeal. Military discharges based on statements of sexual orientation or conduct manifesting homosexual or bisexual orientation form the basis of “Don’t Ask, Don’t Tell.” The distinction is cemented in case law challenging the ban on constitutional grounds. Without the second part of this definition, it is possible Defense Department officials could effectively continue a policy of discriminating based on statements or conduct, versus sexual orientation per se. (2). Section 4 subsection (a)(2) provides the necessary changes to the table of contents to reflect the deletion of 10 U.S.C. 654 and the addition of 10 U.S.C. 656. (b). Conforming Amendments. Section 4 subsection (b) provides the conforming amendments required by the new legislation. (1). Subsection (b)(1) adds sexual orientation discrimination to a list of issues statutorily mandated for quadrennial surveys by the Department of Defense. (2). Subsection (b)(2) modifies the Solomon Amendment to remove the reference to 10 U.S.C. 654 and related laws. It is unclear whether the Solomon Amendment will have any relevance once the current Section 654 is repealed. However, the consequence of leaving 10 U.S.C. 983 as it is would be the possibility that certain schools might prohibit military recruiters from their campuses because of the military’s new policy of non-discrimination based on sexual orientation. (3). Subsection (b)(3) adds sexual orientation to the definition of “unlawful discrimination” in the code provision prohibiting retaliatory personnel actions. Section 5. Benefits. This provision makes clear that this legislation does not require the military to provide dependent benefits in violation of the Defense of Marriage Act. Section 6. No Private Cause of Action for Damages. This section makes clear that this legislation does not create a private cause of action for damages. Section 7. Regulations. This section provides the authority to issue regulations implementing this legislation and gives guidance as to the content of those regulations. (a). In General. The Secretary of Defense has 90 days following enactment of the legislation to issue Department of Defense regulations implementing the legislation, and must direct each service to revise its regulations no later than 180 days after the enactment of the legislation. Regulations which must be amended include but are not limited to: (1). All Equal Opportunity and Human Relations regulations, directives, and instructions and training guidance; (2). Personnel regulations governing involuntary discharges; (3). Victim’s advocacy regulations to include sexual orientation discrimination among the forms of discrimination for which members of the Armed Forces and their families may seek assistance. This provision is intended to ensure that victims of sexual orientation-based hate violence and sexual orientation discrimination can access Victims’ Advocacy programs to the same extent that other victims of prohibited discrimination and hate violence can. (b). Regulation of Conduct. This provision mandates the regulations governing service members’ conduct be written and enforced without regard to sexual orientation. It is essentially a reiteration of Section 3 (c), but we think it is important that this concept appear in both the policy section and the regulation section of the legislation as a political matter. (c). Definition. This section provides reference to the new 10 USC 656(f) for the definition of sexual orientation. *** Again the highlighted line items are grey - as I explained above - to say the least and need to be clearly addressed. *** Either way, \"H.R. 1246,\" - if that is what is about to be on the table - is clearly suspect for a large number of reasons. Americans can do a lot better than that ... the GLBT community deserve better. Under Section 8 of the US Constitution, Congress can do much, much better. This message has been edited. Last edited by: EqualRightstoPrivacy, Mon 02 March 2009 11:48 PM", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-02 23:18:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "Got GLBT folks on your band wagon yet, Equal? Any of you GLBT folks out there signing on to his scheme to get 'special treatment' at shower time? I realize, Equal, you just want to see this scheme of 'forced to divulge' ones sexual orientation fulfilled by law in order to \"protect\" GLBT folks and establish their rights to privacy at the same time. But, it's just more of BIG government herding minority members of society around. Sexual Apartheid monitoring of American citizens in uniform to avoid the possibility of someone in uniform being offended. The objective of removing DA/DT is so that patriotic qualified American's can serve their country without fear of 'special treatment' (like getting 'fired') should they reveal their sexual orientation or should they be 'found out'. They want to serve as freely as the others who have, of their own volition, also chosen to make themselves expendable so others can live in peace and safety, pursuing life, liberty and happiness. Let Congress debate it... and they will. Who was signed on or off the issue before is past. It's a new day. Let's get on with it in a democratic reasonable manner that will not intentionally stigmatize a group of patriots. What's wrong with that? Why should they have to tell anyone what their sexual preferences are in some public forum? Weird!", 
        "intTime": 20090303, 
        "postID": 23, 
        "quote": "", 
        "reply": "Got GLBT folks on your band wagon yet, Equal? Any of you GLBT folks out there signing on to his scheme to get 'special treatment' at shower time? I realize, Equal, you just want to see this scheme of 'forced to divulge' ones sexual orientation fulfilled by law in order to \"protect\" GLBT folks and establish their rights to privacy at the same time. But, it's just more of BIG government herding minority members of society around. Sexual Apartheid monitoring of American citizens in uniform to avoid the possibility of someone in uniform being offended. The objective of removing DA/DT is so that patriotic qualified American's can serve their country without fear of 'special treatment' (like getting 'fired') should they reveal their sexual orientation or should they be 'found out'. They want to serve as freely as the others who have, of their own volition, also chosen to make themselves expendable so others can live in peace and safety, pursuing life, liberty and happiness. Let Congress debate it... and they will. Who was signed on or off the issue before is past. It's a new day. Let's get on with it in a democratic reasonable manner that will not intentionally stigmatize a group of patriots. What's wrong with that? Why should they have to tell anyone what their sexual preferences are in some public forum? Weird!", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-03 09:26:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "\"reducetension,\" Please quote me on the following often: Mat: \"[R]educetension,\" you make a great and passionate micro-argument for minority Equal Rights. I have made the same micro-argument for quite some time now, and also feel passionate about it on a micro-level. That said, micro-arguments supporting specific minority Equal Rights, while distorting, ignoring, disregarding, or denying, the common macro-Equal Rights of all service members, fails in any logical arena except that of the subject minority group - which hasn't even happened on these boards, as I've had several GLBT members publicly acknowledge a universal and necessary, \"Right to Privacy\" - even in the US military, including a very specific submariner who posted with me on the very subject here, about a year and a half ago.\" *** Seperately, it appears to me, you keep harping on my suggested solutions within AAVPIPS as if those mere suggestions are my main arguments (?). This is a totally false inference you make as it appears to me. *** My base argument is two-fold: 1.) Validate the thesis, \"'Privacy,' is a Natural Right.\" 2.) If 1.) is true, then thesis two is consequently also true, \"'Privacy,' is a Legal Right.\" It does not get any more complicated than those two (2) thesis. *** If they are true, which I'm already confident as I've already done most of it according to the Modern form of philosophical dialectics, in terms of Natural Law. At that point, Physical Law becomes self-evident, in my opinion. Much existing Case Law is already on the books to further validate an underlying universal premise as such. *** May sound like heavy stuff to some but for a layman - myself included - it's really just a fancy way of respecting a common, human right to privacy. Everyone gets the basic premise, even you when you conveniently, \"use,\" it to fight for, \"privacy rights,\" regarding, \"disclosure.\" The rest falls very neatly in place under the US Constitution, the Civil Rights Act of 1964, and existing EEOC regulations from which DoD EEO, and military EO, are already written ... to soon include, \"sexual orientation,\" as a protected minority. *** Even IBM Corporations included, \"White men,\" as a, \"usual suspects,\" group common to be on the receiving end of discrimination, when writing their order for a Work Force Diversity Executive Task Forces (Stockdale/Crosby, 218). The difference with some, and real professionals is, some call protected classes, \"second class citizens.\" I prefer - like IBM and related professionals - to call them, \"key employee groups.\" I do not subcribe to the twisted-Ontological Utilatarian approach of which your posts remind me, e.g., protect few, as if this is in the best interest of the Greater Good (?). How can you possibly consider homosexuals to be treated differently when even, \"White men,\" are grouped in as a, \"protected minority,\" under organizational theory? Stockdale, Margaret S., and Crosby, Faye J., Edited by, The Psychology and Management of Workplace Diversity. Malden, Massachusetts: Blackwell Publishing, Ltd., 2008 *** Personally I think your posts are in denial of macro-realities, proven time, after time, after time, after time. But as I said, \"'[R]educetension,' you make a great and passionate micro-argument for minority Equal Rights [...]\" Please quote me on that, often! *** \"It's a new day[!]\" I second that. And because of that, the real professional see the big picture.", 
        "intTime": 20090303, 
        "postID": 24, 
        "quote": "", 
        "reply": "\"reducetension,\" Please quote me on the following often: Mat: \"[R]educetension,\" you make a great and passionate micro-argument for minority Equal Rights. I have made the same micro-argument for quite some time now, and also feel passionate about it on a micro-level. That said, micro-arguments supporting specific minority Equal Rights, while distorting, ignoring, disregarding, or denying, the common macro-Equal Rights of all service members, fails in any logical arena except that of the subject minority group - which hasn't even happened on these boards, as I've had several GLBT members publicly acknowledge a universal and necessary, \"Right to Privacy\" - even in the US military, including a very specific submariner who posted with me on the very subject here, about a year and a half ago.\" *** Seperately, it appears to me, you keep harping on my suggested solutions within AAVPIPS as if those mere suggestions are my main arguments (?). This is a totally false inference you make as it appears to me. *** My base argument is two-fold: 1.) Validate the thesis, \"'Privacy,' is a Natural Right.\" 2.) If 1.) is true, then thesis two is consequently also true, \"'Privacy,' is a Legal Right.\" It does not get any more complicated than those two (2) thesis. *** If they are true, which I'm already confident as I've already done most of it according to the Modern form of philosophical dialectics, in terms of Natural Law. At that point, Physical Law becomes self-evident, in my opinion. Much existing Case Law is already on the books to further validate an underlying universal premise as such. *** May sound like heavy stuff to some but for a layman - myself included - it's really just a fancy way of respecting a common, human right to privacy. Everyone gets the basic premise, even you when you conveniently, \"use,\" it to fight for, \"privacy rights,\" regarding, \"disclosure.\" The rest falls very neatly in place under the US Constitution, the Civil Rights Act of 1964, and existing EEOC regulations from which DoD EEO, and military EO, are already written ... to soon include, \"sexual orientation,\" as a protected minority. *** Even IBM Corporations included, \"White men,\" as a, \"usual suspects,\" group common to be on the receiving end of discrimination, when writing their order for a Work Force Diversity Executive Task Forces (Stockdale/Crosby, 218). The difference with some, and real professionals is, some call protected classes, \"second class citizens.\" I prefer - like IBM and related professionals - to call them, \"key employee groups.\" I do not subcribe to the twisted-Ontological Utilatarian approach of which your posts remind me, e.g., protect few, as if this is in the best interest of the Greater Good (?). How can you possibly consider homosexuals to be treated differently when even, \"White men,\" are grouped in as a, \"protected minority,\" under organizational theory? Stockdale, Margaret S., and Crosby, Faye J., Edited by, The Psychology and Management of Workplace Diversity. Malden, Massachusetts: Blackwell Publishing, Ltd., 2008 *** Personally I think your posts are in denial of macro-realities, proven time, after time, after time, after time. But as I said, \"'[R]educetension,' you make a great and passionate micro-argument for minority Equal Rights [...]\" Please quote me on that, often! *** \"It's a new day[!]\" I second that. And because of that, the real professional see the big picture.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-03 17:27:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp", 
        "intTime": 20090303, 
        "postID": 25, 
        "quote": "", 
        "reply": "Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-03 20:14:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Where's, \"reducetension?\" He may think this is an absolute outrage as he told me numerous times on other threads! *** \"President [...] consulting with advisors [...][?].\" Didn't he go to Harvard? *** \"[...] officials will not reveal how it may happen [...][?].\" \"reducetension,\" says just sign the repeal, and then do nothing. *** \"[...] a team of experts may be commissioned [...][?].\" Experts? Like organizational theorists? \"reducetension,\" says that's like both, foolish and unnecessary - a bunch of hacks. *** \"[...] proper reversal [...][?].\" \"Proper?\" Isn't anyone listening to, \"reducetension,\" on this? Just sign the repeal, that's it. *** \"[...] so that change is done in a sensible way [...][?].\" Again, you mean like the way organizational theory deals with every other major social change? *** Oh, I'm sorry, we're talking about Laws on America soil. Not those of other countries. My bust, sorry! *** Sounds like fundamentalist Americans with the US Constitution in mind are about to have an intellectual picnic, as it should be. I'd sure like to be a fly on the food at that table.", 
        "intTime": 20090304, 
        "postID": 26, 
        "quote": "", 
        "reply": "Where's, \"reducetension?\" He may think this is an absolute outrage as he told me numerous times on other threads! *** \"President [...] consulting with advisors [...][?].\" Didn't he go to Harvard? *** \"[...] officials will not reveal how it may happen [...][?].\" \"reducetension,\" says just sign the repeal, and then do nothing. *** \"[...] a team of experts may be commissioned [...][?].\" Experts? Like organizational theorists? \"reducetension,\" says that's like both, foolish and unnecessary - a bunch of hacks. *** \"[...] proper reversal [...][?].\" \"Proper?\" Isn't anyone listening to, \"reducetension,\" on this? Just sign the repeal, that's it. *** \"[...] so that change is done in a sensible way [...][?].\" Again, you mean like the way organizational theory deals with every other major social change? *** Oh, I'm sorry, we're talking about Laws on America soil. Not those of other countries. My bust, sorry! *** Sounds like fundamentalist Americans with the US Constitution in mind are about to have an intellectual picnic, as it should be. I'd sure like to be a fly on the food at that table.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 00:08:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal...", 
        "intTime": 20090304, 
        "postID": 27, 
        "quote": "Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp", 
        "reply": " Excellent News!! It's almost time to start planning for a party in celebration of the repeal...", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 05:09:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal... The implications here are....that a simple elimination of the DADT policy is NOT in the cards. Rather, that some revision of it is under consideration.", 
        "intTime": 20090304, 
        "postID": 28, 
        "quote": "Originally posted by JimCrackCorn: quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal...", 
        "reply": " The implications here are....that a simple elimination of the DADT policy is NOT in the cards. Rather, that some revision of it is under consideration.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 10:31:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "19022583"
    }, 
    {
        "content": "In the current issue of The Army Times ... >http://www.armytimes.com/news/2009/03/ap_obama_gays_military_030309/", 
        "intTime": 20090304, 
        "postID": 29, 
        "quote": "", 
        "reply": "In the current issue of The Army Times ... >http://www.armytimes.com/news/2009/03/ap_obama_gays_military_030309/", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 10:31:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Another study will delay but not prevent the eventual dismissal of a policy of \"silence\". And, if wiser heads prevail, they will not replace or revise it with a new policy of \"confession\". What kind of Government or society needs to know the sexual orientation of its citizens? Nazi Germany comes to mind, and those of the \"unnatural\" orientation according to Nazi \"purification\" via Natural Law theory gave 'special treatment' to those who did not line up on the far right side of political correctness. But, study it they probably will. Selecting the studiers will be the key point and one can hope with the liberating administration of this President the progressive nature of American will unfold some more to enhance full free participation of the members of the gay community with stigmatizing them 'in the name of privacy'! We, as a nation are still maturing.", 
        "intTime": 20090304, 
        "postID": 30, 
        "quote": "", 
        "reply": "Another study will delay but not prevent the eventual dismissal of a policy of \"silence\". And, if wiser heads prevail, they will not replace or revise it with a new policy of \"confession\". What kind of Government or society needs to know the sexual orientation of its citizens? Nazi Germany comes to mind, and those of the \"unnatural\" orientation according to Nazi \"purification\" via Natural Law theory gave 'special treatment' to those who did not line up on the far right side of political correctness. But, study it they probably will. Selecting the studiers will be the key point and one can hope with the liberating administration of this President the progressive nature of American will unfold some more to enhance full free participation of the members of the gay community with stigmatizing them 'in the name of privacy'! We, as a nation are still maturing.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 10:57:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "One thing clearly concerns me about one particular poster: Obsessive literal references, and subtle inferences, to the greatest atrocity in recorded human history, the Holocaust (please correct my history conclustion if I'm incorrect (?).). I would easier believe the literal, or infered, throwing of the kitchen sink. Perhaps you're a fan of reality, and shock, TV? *** I personally question the motivation of someone who continues to compare Civil Rights across the board, to the attempted extermination of a people, and the resulting twenty-to-thirty foot piles of rotting corpses bulldozed into mass piles and graves. *** Please clarify with brevity but very specific clarity, perhaps in a single post? Otherwise, I can only conclude that either some folks don't understand the gross falseness of their comparrisons, or don't care enough about the gravity - and human and emotional cost to humanity - of the Holocaust. *** We're talking about preserving the Civil Rights of all Americans. Not the killing of millions of people. *** At a minimum, out of respect for about a, \"thousand,\" things, reconsider your analogies. Perhaps something closer to, \"apples,\" and, \"oranges,\" not, \"inalienable and universal privacy,\" and, \"minority genocide.\" *** In my opinion, the vulgarity of the attempt to make such comparisons, puts any credibility of the poster's intent in question (?). ***", 
        "intTime": 20090304, 
        "postID": 31, 
        "quote": "", 
        "reply": "One thing clearly concerns me about one particular poster: Obsessive literal references, and subtle inferences, to the greatest atrocity in recorded human history, the Holocaust (please correct my history conclustion if I'm incorrect (?).). I would easier believe the literal, or infered, throwing of the kitchen sink. Perhaps you're a fan of reality, and shock, TV? *** I personally question the motivation of someone who continues to compare Civil Rights across the board, to the attempted extermination of a people, and the resulting twenty-to-thirty foot piles of rotting corpses bulldozed into mass piles and graves. *** Please clarify with brevity but very specific clarity, perhaps in a single post? Otherwise, I can only conclude that either some folks don't understand the gross falseness of their comparrisons, or don't care enough about the gravity - and human and emotional cost to humanity - of the Holocaust. *** We're talking about preserving the Civil Rights of all Americans. Not the killing of millions of people. *** At a minimum, out of respect for about a, \"thousand,\" things, reconsider your analogies. Perhaps something closer to, \"apples,\" and, \"oranges,\" not, \"inalienable and universal privacy,\" and, \"minority genocide.\" *** In my opinion, the vulgarity of the attempt to make such comparisons, puts any credibility of the poster's intent in question (?). ***", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 11:24:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "The question is not 'to Holocaust or not to Holocaust.' You're such a reactionary! I guess if you can't answer me then make an attempt at stigmatizing me? So be it. I'm sure the hoards of those reading these posts will identify me with Fascists political correctness! I asked: What kind of Government or society needs to know the sexual orientation of its citizens? Can you think of any?", 
        "intTime": 20090304, 
        "postID": 32, 
        "quote": "", 
        "reply": "The question is not 'to Holocaust or not to Holocaust.' You're such a reactionary! I guess if you can't answer me then make an attempt at stigmatizing me? So be it. I'm sure the hoards of those reading these posts will identify me with Fascists political correctness! I asked: What kind of Government or society needs to know the sexual orientation of its citizens? Can you think of any?", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 11:47:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "Again, you keep - perhaps - addressing my, \"SORS,\" as a suggested solution proposed in, \"AAVPIPS\" (?). *** My answer to your question: Yes, but you appear to grossly abuse what, \"know,\" means, relative to a government or society, in the greater context of a solution. The kind of government that respects everyone's inalienable and universal right to privacy, and subsequent Civil Rights, if that government can't create the literal privacy barriers to both respect privacy, and maintain good order and discipline, while at the same time, protect itself from Civil Liability. *** Having policies in place to address, \"breaches in privacy, which are open doors to a lack of discipline, and Civil Liability\" - after the fact - is not a solution, and is not leadership. Again, my argument is not for, \"SORS,\" specifically. I'm saying, if you have no basis from which to respect privacy, create appropriate barriers, and mitigate Civil Liability, you have zero basis to address, \"inclusive policy,\" in Federal Law.", 
        "intTime": 20090304, 
        "postID": 33, 
        "quote": "", 
        "reply": "Again, you keep - perhaps - addressing my, \"SORS,\" as a suggested solution proposed in, \"AAVPIPS\" (?). *** My answer to your question: Yes, but you appear to grossly abuse what, \"know,\" means, relative to a government or society, in the greater context of a solution. The kind of government that respects everyone's inalienable and universal right to privacy, and subsequent Civil Rights, if that government can't create the literal privacy barriers to both respect privacy, and maintain good order and discipline, while at the same time, protect itself from Civil Liability. *** Having policies in place to address, \"breaches in privacy, which are open doors to a lack of discipline, and Civil Liability\" - after the fact - is not a solution, and is not leadership. Again, my argument is not for, \"SORS,\" specifically. I'm saying, if you have no basis from which to respect privacy, create appropriate barriers, and mitigate Civil Liability, you have zero basis to address, \"inclusive policy,\" in Federal Law.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 12:04:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: Again, you keep - perhaps - addressing my, \"SORS,\" as a suggested solution proposed in, \"AAVPIPS\" (?). *** My answer to your question: Yes, but you appear to grossly abuse what, \"know,\" means, relative to a government or society, in the greater context of a solution. The kind of government that respects everyone's inalienable and universal right to privacy, and subsequent Civil Rights, if that government can't create the literal privacy barriers to both respect privacy, and maintain good order and discipline, while at the same time, protect itself from Civil Liability. So, we'd be the first country, since Nazi German, to require a disclosure of sexual orientation, as far as you know? *** Having policies in place to address, \"breaches in privacy, which are open doors to a lack of discipline, and Civil Liability\" - after the fact - is not a solution, and is not leadership. Again, my argument is not for, \"SORS,\" specifically. I'm saying, if you have no basis from which to respect privacy, create appropriate barriers, and mitigate Civil Liability, you have zero basis to address, \"inclusive policy,\" in Federal Law. So, I suppose to avoid having to know by law what someone's sexual orientation is they could install restrooms that say 'other'? I know some places have special restrooms for gays with a half man/half woman symbols for those who choose to use them. Will people wanting to use heterosexual restroom have to provide proof of orientation? And again, are there now any existing Federal laws that stipulate separate restrooms for men and women? Yes or no. And reference, please.", 
        "intTime": 20090304, 
        "postID": 34, 
        "quote": "Originally posted by EqualRightstoPrivacy: Again, you keep - perhaps - addressing my, \"SORS,\" as a suggested solution proposed in, \"AAVPIPS\" (?). *** My answer to your question: Yes, but you appear to grossly abuse what, \"know,\" means, relative to a government or society, in the greater context of a solution. The kind of government that respects everyone's inalienable and universal right to privacy, and subsequent Civil Rights, if that government can't create the literal privacy barriers to both respect privacy, and maintain good order and discipline, while at the same time, protect itself from Civil Liability. So, we'd be the first country, since Nazi German, to require a disclosure of sexual orientation, as far as you know? *** Having policies in place to address, \"breaches in privacy, which are open doors to a lack of discipline, and Civil Liability\" - after the fact - is not a solution, and is not leadership. Again, my argument is not for, \"SORS,\" specifically. I'm saying, if you have no basis from which to respect privacy, create appropriate barriers, and mitigate Civil Liability, you have zero basis to address, \"inclusive policy,\" in Federal Law.", 
        "reply": " So, I suppose to avoid having to know by law what someone's sexual orientation is they could install restrooms that say 'other'? I know some places have special restrooms for gays with a half man/half woman symbols for those who choose to use them. Will people wanting to use heterosexual restroom have to provide proof of orientation? And again, are there now any existing Federal laws that stipulate separate restrooms for men and women? Yes or no. And reference, please.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 12:38:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "I think it is appropriate at this point - taking a step back to about the fifth post north - to make a very important and relevant distinction. At the same sime - with the exception of this sentence - I will not respond to the buffoonery of a post as is the one above this post. *** Some see inclusive policy, as I have clearly premised, and suggested (with extensive security measure), as a means to respect sexual orientation, and protect privacy. *** Some see my inclusive policy premises, and suggestions, as a means to point out that if sexual orientation is known (which would require NATO-Top Secret style security breach, in my suggestion), this is a bad thing (?). *** Isn't the latter person attempting to villianize the sexual orientation of the GLBT community in that it were, \"found out,\" - regardless of the means - that the sexual orientation itself is a bad thing? It appears that way to me. Again, the end goal is, \"respect for the individual,\" not, \"the extermination of the individual.\" *** Shame, shame ... if that is the case.", 
        "intTime": 20090304, 
        "postID": 35, 
        "quote": "", 
        "reply": "I think it is appropriate at this point - taking a step back to about the fifth post north - to make a very important and relevant distinction. At the same sime - with the exception of this sentence - I will not respond to the buffoonery of a post as is the one above this post. *** Some see inclusive policy, as I have clearly premised, and suggested (with extensive security measure), as a means to respect sexual orientation, and protect privacy. *** Some see my inclusive policy premises, and suggestions, as a means to point out that if sexual orientation is known (which would require NATO-Top Secret style security breach, in my suggestion), this is a bad thing (?). *** Isn't the latter person attempting to villianize the sexual orientation of the GLBT community in that it were, \"found out,\" - regardless of the means - that the sexual orientation itself is a bad thing? It appears that way to me. Again, the end goal is, \"respect for the individual,\" not, \"the extermination of the individual.\" *** Shame, shame ... if that is the case.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 13:08:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: I think it is appropriate at this point - taking a step back to about the fifth post north - to make a very important and relevant distinction. At the same sime - with the exception of this sentence - I will not respond to the buffoonery of a post as is the one above this post. *** Some see inclusive policy, as I have clearly premised, and suggested (with extensive security measure), as a means to respect sexual orientation, and protect privacy. *** Some see my inclusive policy premises, and suggestions, as a means to point out that if sexual orientation is known (which would require NATO-Top Secret style security breach, in my suggestion), this is a bad thing (?). *** Isn't the latter person attempting to villianize the sexual orientation of the GLBT community in that it were, \"found out,\" - regardless of the means - that the sexual orientation itself is a bad thing? Oh, it would mean anyone's sexual orientation, hetero or homo. So, are they 'bad things'? Even as a heterosexual I would refuse on principle to disclose my sexual orientation. Then what happens? It appears that way to me. Again, the end goal is, \"respect for the individual,\" not, \"the extermination of the individual.\" *** Shame, shame ... if that is the case.", 
        "intTime": 20090304, 
        "postID": 36, 
        "quote": "Originally posted by EqualRightstoPrivacy: I think it is appropriate at this point - taking a step back to about the fifth post north - to make a very important and relevant distinction. At the same sime - with the exception of this sentence - I will not respond to the buffoonery of a post as is the one above this post. *** Some see inclusive policy, as I have clearly premised, and suggested (with extensive security measure), as a means to respect sexual orientation, and protect privacy. *** Some see my inclusive policy premises, and suggestions, as a means to point out that if sexual orientation is known (which would require NATO-Top Secret style security breach, in my suggestion), this is a bad thing (?). *** Isn't the latter person attempting to villianize the sexual orientation of the GLBT community in that it were, \"found out,\" - regardless of the means - that the sexual orientation itself is a bad thing? Oh, it would mean anyone's sexual orientation, hetero or homo. So, are they 'bad things'? Even as a heterosexual I would refuse on principle to disclose my sexual orientation. Then what happens? It appears that way to me. Again, the end goal is, \"respect for the individual,\" not, \"the extermination of the individual.\" *** Shame, shame ... if that is the case.", 
        "reply": "", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-04 13:34:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by 19022583: quote: Originally posted by JimCrackCorn: quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal... The implications here are....that a simple elimination of the DADT policy is NOT in the cards. Rather, that some revision of it is under consideration. It's POSSIBLE, yea even likely that the Army Times reporters ain't privy to the re-election strategizing already in progress in the Obama camp. Rumor has it that....they believe that by 2012 there will be quite enough controversial issues on the table with which to deal. As a result, REVISION (not repeal) of DADT will be taken up seriously when/if a second term is in the offing.", 
        "intTime": 20090305, 
        "postID": 37, 
        "quote": "Originally posted by 19022583: quote: Originally posted by JimCrackCorn: quote: Originally posted by IHAWKER: Obama Looks for Advice on 'Don't Ask, Don't Tell' March 04, 2009 President Barack Obama has started consulting with advisers as to how the federal government may overturn the ban on service by openly gay people in the military. Administration officials will not reveal how it may happen or how soon, but some Democrats have suggested that a team of experts may be commissioned to investigate a proper reversal of the policy, according to the Associated Press. Obama has been consulting with Defense secretary Robert Gates and Joint Chiefs of Staff chairman Michael Mullen \"so that this change is done in a sensible way that strengthens our armed forces and our national security,\" Tommy Vietor, a White House spokesman, said in an e-mail this week. The reversal of the law is part of a campaign promise to which Obama is trying to adhere. California congresswoman Ellen Tauscher reintroduced legislation to repeal the \"don't ask, don't tell\" policy, signed into law by President Bill Clinton in 1993. Tauscher's bill garnered 143 cosponsors when it was introduced in 2008, but it never reached a floor vote. Tauscher mentioned at an event Monday for the Center for American Progress Action Fund that 26 other countries, mostly allies like the United Kingdom and Germany, no longer have such bans on the books. She also said that if Colin Powell, who was the \"physical embodiment\" of opposition to openly gay service members, could change his mind now, it's time to make a change. \"Seventy-five percent of the American people believe that this is the wrong policy,\" she said, adding that \"we have a lot of people behind us.\" >http://www.advocate.com/news_detail_ektid74206.asp Excellent News!! It's almost time to start planning for a party in celebration of the repeal... The implications here are....that a simple elimination of the DADT policy is NOT in the cards. Rather, that some revision of it is under consideration.", 
        "reply": " It's POSSIBLE, yea even likely that the Army Times reporters ain't privy to the re-election strategizing already in progress in the Obama camp. Rumor has it that....they believe that by 2012 there will be quite enough controversial issues on the table with which to deal. As a result, REVISION (not repeal) of DADT will be taken up seriously when/if a second term is in the offing.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-05 10:37:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: It's POSSIBLE, yea even likely that the Army Times reporters ain't privy to the re-election strategizing already in progress in the Obama camp. Rumor has it that....they believe that by 2012 there will be quite enough controversial issues on the table with which to deal. As a result, REVISION (not repeal) of DADT will be taken up seriously when/if a second term is in the offing. What happens if Congress takes up the issue first? Rep. Ellen Tauscher (D-CA) is doing just that. The Presidents re-election strategist may want Congress to take the lead on this Bill to repeal DADT. They may also realize that if the Bill is passed now, by 2012 the American public will have forgotten all about a Non-Discrimination Bill that was passed 3 years earlier, especially if the problems some say will happen such as mass exodus of heterosexuals from the military - doesn't come to pass after DADT is repealed. Politically, 2009 is a good time for the President to sign the Bill, and the sooner it is implemented the sooner people will realize that it is a non-event for the military.", 
        "intTime": 20090305, 
        "postID": 38, 
        "quote": "Originally posted by 19022583: It's POSSIBLE, yea even likely that the Army Times reporters ain't privy to the re-election strategizing already in progress in the Obama camp. Rumor has it that....they believe that by 2012 there will be quite enough controversial issues on the table with which to deal. As a result, REVISION (not repeal) of DADT will be taken up seriously when/if a second term is in the offing.", 
        "reply": " What happens if Congress takes up the issue first? Rep. Ellen Tauscher (D-CA) is doing just that. The Presidents re-election strategist may want Congress to take the lead on this Bill to repeal DADT. They may also realize that if the Bill is passed now, by 2012 the American public will have forgotten all about a Non-Discrimination Bill that was passed 3 years earlier, especially if the problems some say will happen such as mass exodus of heterosexuals from the military - doesn't come to pass after DADT is repealed. Politically, 2009 is a good time for the President to sign the Bill, and the sooner it is implemented the sooner people will realize that it is a non-event for the military.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-05 13:45:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "\"reducetension,\" quote: Then what happens? *** Mat's Answer: Peace Corps, community service, etc. The world - with the exception the US military - is your oyster. At least that is, anywhere that doesn't have community berthing, bathing, and bowls, where the inalienable Right to Privacy is respected by Law.", 
        "intTime": 20090305, 
        "postID": 39, 
        "quote": "Then what happens?", 
        "reply": "\"reducetension,\"  *** Mat's Answer: Peace Corps, community service, etc. The world - with the exception the US military - is your oyster. At least that is, anywhere that doesn't have community berthing, bathing, and bowls, where the inalienable Right to Privacy is respected by Law.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-05 14:59:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: \"reducetension,\" quote: Then what happens? *** Mat's Answer: Peace Corps, community service, etc. The world - with the exception the US military - is your oyster. At least that is, anywhere that doesn't have community berthing, bathing, and bowls, where the inalienable Right to Privacy is respected by Law. Well, why am I not surprised... dominionist thinking. What a '1984' pipe dream!! Gallop back to yester-years. And what makes you think the GLBT community will buy into your wild scheme to be herded around by your law? I don't think very many heterosexuals will let this warped idea slip by. I'm sure not for it. You think the GBLT folks will see this law and sign up? Maybe they'll let you enforce it? Appoint you the commissioner of sexual orientation extraction.", 
        "intTime": 20090305, 
        "postID": 40, 
        "quote": "Originally posted by EqualRightstoPrivacy: \"reducetension,\" quote: Then what happens? *** Mat's Answer: Peace Corps, community service, etc. The world - with the exception the US military - is your oyster. At least that is, anywhere that doesn't have community berthing, bathing, and bowls, where the inalienable Right to Privacy is respected by Law.", 
        "reply": " Well, why am I not surprised... dominionist thinking. What a '1984' pipe dream!! Gallop back to yester-years. And what makes you think the GLBT community will buy into your wild scheme to be herded around by your law? I don't think very many heterosexuals will let this warped idea slip by. I'm sure not for it. You think the GBLT folks will see this law and sign up? Maybe they'll let you enforce it? Appoint you the commissioner of sexual orientation extraction.", 
        "threadID": "27819558_5250047612001", 
        "time": "2009-03-05 17:40:00", 
        "title": "Rep. Tauscher to introduce a bill to repeal DA/DT", 
        "userID": "reducetension"
    }
]