[
    {
        "content": "A very interesting and enlighting article ... Research on the Open Secret: Possible Implication for Don't Ask Don't Tell Andrew D. Reichert Texas A & M University April 21, 2009 As a doctoral student in Counseling Psychology at Texas A&M University, I am currently conducting research on the open secret, a phrase sometimes used to describe situations where a gay, lesbian, bisexual, or transgender (GLBT) person's sexuality is known, but not discussed. For example, Kenji Yoshino, a dean and law professor at Yale University and the author of Covering: The Hidden Assault on Our Civil Rights, notes that, \"Many gay people have had this experience of the 'open secret.' I was gay – she knew I was gay – I knew she knew I was gay ... [But] because I would never acknowledge our collective knowledge, she could not do so either. So we carried on – each week more strained than the last\" \"The military's policy is designed so that nobody knows, but in reality, people do know; yet, they cannot confirm their knowledge by asking or telling, and that is what seems to be problematic. If GLBT servicemembers were allowed to simply disclose their sexual orientation – get it out in the open, let everyone talk about it, and then move on – the secrecy and mistrust could dissipate. The policy suggests that people in the military cannot handle having an openly GLBT person in their midst. This would seem to seriously underestimate the intelligence and abilities of America’s men and women in uniform.\" Andrew D. Reichert is a doctoral student in Counseling Psychology at Texas A&M University. An ordained minister in The United Methodist Church, he holds a Master of Science in Educational Psychology from Texas A&M University and a Master of Divinity from Duke University. Read the full article at >>>>http://www.thegaymilitarytimes.com/0905Reichert.html", 
        "intTime": 20090426, 
        "postID": 1, 
        "quote": "", 
        "reply": "A very interesting and enlighting article ... Research on the Open Secret: Possible Implication for Don't Ask Don't Tell Andrew D. Reichert Texas A & M University April 21, 2009 As a doctoral student in Counseling Psychology at Texas A&M University, I am currently conducting research on the open secret, a phrase sometimes used to describe situations where a gay, lesbian, bisexual, or transgender (GLBT) person's sexuality is known, but not discussed. For example, Kenji Yoshino, a dean and law professor at Yale University and the author of Covering: The Hidden Assault on Our Civil Rights, notes that, \"Many gay people have had this experience of the 'open secret.' I was gay – she knew I was gay – I knew she knew I was gay ... [But] because I would never acknowledge our collective knowledge, she could not do so either. So we carried on – each week more strained than the last\" \"The military's policy is designed so that nobody knows, but in reality, people do know; yet, they cannot confirm their knowledge by asking or telling, and that is what seems to be problematic. If GLBT servicemembers were allowed to simply disclose their sexual orientation – get it out in the open, let everyone talk about it, and then move on – the secrecy and mistrust could dissipate. The policy suggests that people in the military cannot handle having an openly GLBT person in their midst. This would seem to seriously underestimate the intelligence and abilities of America’s men and women in uniform.\" Andrew D. Reichert is a doctoral student in Counseling Psychology at Texas A&M University. An ordained minister in The United Methodist Church, he holds a Master of Science in Educational Psychology from Texas A&M University and a Master of Divinity from Duke University. Read the full article at >>>>http://www.thegaymilitarytimes.com/0905Reichert.html", 
        "threadID": "27819558_8690028122001", 
        "time": "2009-04-26 12:24:00", 
        "title": "Research on the Open Secret: Possible Implication for Don't Ask Don't Tell", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "The British military did a study 6 months after they lifted their gay ban in 2000, and were surprised to find that it actually increased recruiting, retention, and overall effectiveness of their military at a time when the economy was making it a challenge to retain qualified servicemembers. One of the reasons cited was the fact that openness removed stress from both gay and straight servicemembers, who both felt more valued as employees, and could focus better on their jobs. The report was intended to be an internal report so as not to invite political gamesterism, but it was subsequently leaked in the British media about a year later.", 
        "intTime": 20090426, 
        "postID": 2, 
        "quote": "", 
        "reply": "The British military did a study 6 months after they lifted their gay ban in 2000, and were surprised to find that it actually increased recruiting, retention, and overall effectiveness of their military at a time when the economy was making it a challenge to retain qualified servicemembers. One of the reasons cited was the fact that openness removed stress from both gay and straight servicemembers, who both felt more valued as employees, and could focus better on their jobs. The report was intended to be an internal report so as not to invite political gamesterism, but it was subsequently leaked in the British media about a year later.", 
        "threadID": "27819558_8690028122001", 
        "time": "2009-04-26 19:50:00", 
        "title": "Research on the Open Secret: Possible Implication for Don't Ask Don't Tell", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: The British military did a study 6 months after they lifted their gay ban in 2000, and were surprised to find that it actually increased recruiting, retention, and overall effectiveness of their military at a time when the economy was making it a challenge to retain qualified servicemembers. One of the reasons cited was the fact that openness removed stress from both gay and straight servicemembers, who both felt more valued as employees, and could focus better on their jobs. The report was intended to be an internal report so as not to invite political gamesterism, but it was subsequently leaked in the British media about a year later. I don't understand what stress might be experienced by str8 members?", 
        "intTime": 20090427, 
        "postID": 3, 
        "quote": "Originally posted by Bleah: The British military did a study 6 months after they lifted their gay ban in 2000, and were surprised to find that it actually increased recruiting, retention, and overall effectiveness of their military at a time when the economy was making it a challenge to retain qualified servicemembers. One of the reasons cited was the fact that openness removed stress from both gay and straight servicemembers, who both felt more valued as employees, and could focus better on their jobs. The report was intended to be an internal report so as not to invite political gamesterism, but it was subsequently leaked in the British media about a year later.", 
        "reply": " I don't understand what stress might be experienced by str8 members?", 
        "threadID": "27819558_8690028122001", 
        "time": "2009-04-27 14:23:00", 
        "title": "Research on the Open Secret: Possible Implication for Don't Ask Don't Tell", 
        "userID": "21194237"
    }, 
    {
        "content": "One of the stresses that heterosexuals have displayed right here on these boards is whether to report a gay or lesbian to military authorities - or not to report them.", 
        "intTime": 20090427, 
        "postID": 4, 
        "quote": "", 
        "reply": "One of the stresses that heterosexuals have displayed right here on these boards is whether to report a gay or lesbian to military authorities - or not to report them.", 
        "threadID": "27819558_8690028122001", 
        "time": "2009-04-27 15:12:00", 
        "title": "Research on the Open Secret: Possible Implication for Don't Ask Don't Tell", 
        "userID": "JimCrackCorn"
    }
]