[
    {
        "content": "N.Y. Gov. to Renew Same-Sex Marriage Push April 09, 2009 New York governor David Paterson said on Wednesday that he would reintroduce legislation to legalize same-sex marriage. According to reports, the legislation will mirror a program bill for same-sex marriage introduced in 2007 by former governor Eliot Spitzer. Paterson will introduce the legislation before an annual gay rights lobby day scheduled for April 28 in Albany, the state capital. >http://www.advocate.com/news_detail_ektid78306.asp", 
        "intTime": 20090409, 
        "postID": 1, 
        "quote": "", 
        "reply": "N.Y. Gov. to Renew Same-Sex Marriage Push April 09, 2009 New York governor David Paterson said on Wednesday that he would reintroduce legislation to legalize same-sex marriage. According to reports, the legislation will mirror a program bill for same-sex marriage introduced in 2007 by former governor Eliot Spitzer. Paterson will introduce the legislation before an annual gay rights lobby day scheduled for April 28 in Albany, the state capital. >http://www.advocate.com/news_detail_ektid78306.asp", 
        "threadID": "27819558_2320072022001", 
        "time": "2009-04-09 10:23:00", 
        "title": "N.Y. Gov. to Renew Same-Sex Marriage Push", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "A new Quinnipiac University poll shows that, given three choices, 41% of New Yorkers believe same-sex couples should be allowed to marry, 33% support civil unions, and 19% think there should be no legal recognition. I like New York, they have great apples, great skiing, beautiful scenic mountains, friendly folks, and they don't tax Military Retiree Pay... Oh, and they have a pretty darn nifty Governor too.", 
        "intTime": 20090409, 
        "postID": 2, 
        "quote": "", 
        "reply": "A new Quinnipiac University poll shows that, given three choices, 41% of New Yorkers believe same-sex couples should be allowed to marry, 33% support civil unions, and 19% think there should be no legal recognition. I like New York, they have great apples, great skiing, beautiful scenic mountains, friendly folks, and they don't tax Military Retiree Pay... Oh, and they have a pretty darn nifty Governor too.", 
        "threadID": "27819558_2320072022001", 
        "time": "2009-04-09 18:18:00", 
        "title": "N.Y. Gov. to Renew Same-Sex Marriage Push", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: A new Quinnipiac University poll shows that, given three choices, 41% of New Yorkers believe same-sex couples should be allowed to marry, 33% support civil unions, and 19% think there should be no legal recognition. I like New York, they have great apples, great skiing, beautiful scenic mountains, friendly folks, and they don't tax Military Retiree Pay... Oh, and they have a pretty darn nifty Governor too. He better hurry; his 'popularity' ain't so great. He wasn't elected and ain't likely to be, either!", 
        "intTime": 20090410, 
        "postID": 3, 
        "quote": "Originally posted by JimCrackCorn: A new Quinnipiac University poll shows that, given three choices, 41% of New Yorkers believe same-sex couples should be allowed to marry, 33% support civil unions, and 19% think there should be no legal recognition. I like New York, they have great apples, great skiing, beautiful scenic mountains, friendly folks, and they don't tax Military Retiree Pay... Oh, and they have a pretty darn nifty Governor too.", 
        "reply": " He better hurry; his 'popularity' ain't so great. He wasn't elected and ain't likely to be, either!", 
        "threadID": "27819558_2320072022001", 
        "time": "2009-04-10 10:04:00", 
        "title": "N.Y. Gov. to Renew Same-Sex Marriage Push", 
        "userID": "19022583"
    }
]