[
    {
        "content": "Vermont Mental Health Experts Support Gay Marriage Forces Join For Equality For Same-Sex Couples BURLINGTON, Vt. -- The Vermont chapters of four national mental health organizations say the best research suggests a range of benefits to children of same-sex parents granted equal access to civil marriage under state law. The state Legislature begins hearings next Monday to consider whether to replace Vermont's civil union statute with one that offers gay couples the right to marry. Dr. Jackie Weinstock, a UVM professor and psychologist, released the joint statement of support signed by the state chapter of the National Psychiatric Association, the Psychological Association, the Association of Mental Health Counselors and the Vermont chapter of the National Association of Social Workers. \"What brings us here today,\" Weinstock said, \"is a shared interest in the psychological well-being of all people.\" She said the groups want to \"set the record straight\" given what they said had been a \"misinterpretation\" of available scientific literature by marriage equality opponents. \"Research has shown children of same-sex couples are as likely as children of heterosexual parents to flourish,\" Weinstock said, adding \"research shows same-sex parents are just as likely to provide healthy and supportive environments for children.\" >http://www.wptz.com/cnn-news/18891460/detail.html", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "Vermont Mental Health Experts Support Gay Marriage Forces Join For Equality For Same-Sex Couples BURLINGTON, Vt. -- The Vermont chapters of four national mental health organizations say the best research suggests a range of benefits to children of same-sex parents granted equal access to civil marriage under state law. The state Legislature begins hearings next Monday to consider whether to replace Vermont's civil union statute with one that offers gay couples the right to marry. Dr. Jackie Weinstock, a UVM professor and psychologist, released the joint statement of support signed by the state chapter of the National Psychiatric Association, the Psychological Association, the Association of Mental Health Counselors and the Vermont chapter of the National Association of Social Workers. \"What brings us here today,\" Weinstock said, \"is a shared interest in the psychological well-being of all people.\" She said the groups want to \"set the record straight\" given what they said had been a \"misinterpretation\" of available scientific literature by marriage equality opponents. \"Research has shown children of same-sex couples are as likely as children of heterosexual parents to flourish,\" Weinstock said, adding \"research shows same-sex parents are just as likely to provide healthy and supportive environments for children.\" >http://www.wptz.com/cnn-news/18891460/detail.html", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-10 19:06:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "The Vermont Legislature is moving along, I'm pretty confident they will allow same-sex marriage in their State. Come to thing of it, Vermont has been working on this project for about a year now, and I'm anxious to see them get this passed. My mate and I make a yearly pilgrimage to visit relatives in Vermont and I'm hoping to talk my better half into getting married when we go up there later this year.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "The Vermont Legislature is moving along, I'm pretty confident they will allow same-sex marriage in their State. Come to thing of it, Vermont has been working on this project for about a year now, and I'm anxious to see them get this passed. My mate and I make a yearly pilgrimage to visit relatives in Vermont and I'm hoping to talk my better half into getting married when we go up there later this year.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-10 21:48:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes?", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "", 
        "reply": "Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes?", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-11 09:04:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes? Oh, that has probably happen in all states at some time, even Missouri, the \"Show Me State\". But then that's the state rights issues, isn't it. Didn't Missouri get involved in starting a war over states rights?", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes?", 
        "reply": " Oh, that has probably happen in all states at some time, even Missouri, the \"Show Me State\". But then that's the state rights issues, isn't it. Didn't Missouri get involved in starting a war over states rights?", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-11 11:52:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes? Vermont was one of ten states that didn't adopt Jessica's Law, so they're not the only one. The problem is more about the judges that refused to apply heavy sentences. The most notorious example is Judge Edward Cashman, who only sentenced an admitted repeat child rapist to 60 days in jail. Cashman is a life-long conservative Republican and church-goer, who argued that \"punishment just does not work\" in regards to child molesters. Naturally, other judges have imposed much heavier sentences on other offenders, because ultimately, it is up to the judge to apply up to, and including, the maximum allowable sentence for these crimes. Other judges in other states have let child rapists off with far too little punishment. So, there's the answer to your question. Your question had nothing to do with the topic at hand. Other than that, Vermont is a fine state with good people, small New England towns, and until just this past decade, they had more cows than people. Additionally, the Vermont chapters of these NATIONAL mental health organizations have nothing to do with the Vermont Legislature or the state's judges (who are clearly wimps).", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes?", 
        "reply": " Vermont was one of ten states that didn't adopt Jessica's Law, so they're not the only one. The problem is more about the judges that refused to apply heavy sentences. The most notorious example is Judge Edward Cashman, who only sentenced an admitted repeat child rapist to 60 days in jail. Cashman is a life-long conservative Republican and church-goer, who argued that \"punishment just does not work\" in regards to child molesters. Naturally, other judges have imposed much heavier sentences on other offenders, because ultimately, it is up to the judge to apply up to, and including, the maximum allowable sentence for these crimes. Other judges in other states have let child rapists off with far too little punishment. So, there's the answer to your question. Your question had nothing to do with the topic at hand. Other than that, Vermont is a fine state with good people, small New England towns, and until just this past decade, they had more cows than people. Additionally, the Vermont chapters of these NATIONAL mental health organizations have nothing to do with the Vermont Legislature or the state's judges (who are clearly wimps).", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-11 11:53:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes? Oh, that has probably happen in all states at some time, even Missouri, the \"Show Me State\". But then that's the state rights issues, isn't it. Didn't Missouri get involved in starting a war over states rights? Does our Constitution not carefully delineate what rights are federal and those left to the states? And, NO....Missouri was NOT one of the eleven that made up the confederacy!", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "Originally posted by reducetension: quote: Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes? Oh, that has probably happen in all states at some time, even Missouri, the \"Show Me State\". But then that's the state rights issues, isn't it. Didn't Missouri get involved in starting a war over states rights?", 
        "reply": " Does our Constitution not carefully delineate what rights are federal and those left to the states? And, NO....Missouri was NOT one of the eleven that made up the confederacy!", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-12 11:54:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "19022583"
    }, 
    {
        "content": "Breaking news on Vermont... The clergy are weighing in... and supporting equal marriage rights! \"http://www.wptz.com/cnn-news/18910412/detail.html quote: The Rev. Linda Maloney, an Episcopal minister from Enosburg Falls, said , \"Civil unions are a good thing, but are still not equality.\" Maloney joined about 25 colleagues of varying Christian denominations at a news conference at City Hall in Burlington Wednesday to voice their support for marriage equality. They released a roster of Christian and Jewish clergy from across Vermont who signed a statement of support for same-sex marriage rights, framing the issue as one that protects their religious freedoms. \"We affirm the First Amendment to the U.S. Constitution,\" said the Rev. Johanna Nichols of the Unitarian Universalist Society. \"The state can't require religious groups to bless same gender marriages nor may it favor the convictions of one group over another and deny individuals their fundamental right to civil marriage.\" Looks like the religion argument for/against gay marriage isn't as one-sided as the fundamentalists would like to think! I lived in Vermont for two years. Great state. I'd move back there in a heartbeat.", 
        "intTime": 20090312, 
        "postID": 7, 
        "quote": "The Rev. Linda Maloney, an Episcopal minister from Enosburg Falls, said , \"Civil unions are a good thing, but are still not equality.\" Maloney joined about 25 colleagues of varying Christian denominations at a news conference at City Hall in Burlington Wednesday to voice their support for marriage equality. They released a roster of Christian and Jewish clergy from across Vermont who signed a statement of support for same-sex marriage rights, framing the issue as one that protects their religious freedoms. \"We affirm the First Amendment to the U.S. Constitution,\" said the Rev. Johanna Nichols of the Unitarian Universalist Society. \"The state can't require religious groups to bless same gender marriages nor may it favor the convictions of one group over another and deny individuals their fundamental right to civil marriage.\"", 
        "reply": "Breaking news on Vermont... The clergy are weighing in... and supporting equal marriage rights! \"http://www.wptz.com/cnn-news/18910412/detail.html  Looks like the religion argument for/against gay marriage isn't as one-sided as the fundamentalists would like to think! I lived in Vermont for two years. Great state. I'd move back there in a heartbeat.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-12 12:19:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp", 
        "intTime": 20090312, 
        "postID": 8, 
        "quote": "", 
        "reply": "Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-12 20:10:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp Sounds like these \"religious\" leaders are much better....secularists!", 
        "intTime": 20090314, 
        "postID": 9, 
        "quote": "Originally posted by IHAWKER: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp", 
        "reply": " Sounds like these \"religious\" leaders are much better....secularists!", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-14 10:07:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: Sounds like these \"religious\" leaders are much better....secularists! Do you think other Christians who believe differently than you are less Christian?", 
        "intTime": 20090314, 
        "postID": 10, 
        "quote": "Originally posted by 19022583: Sounds like these \"religious\" leaders are much better....secularists!", 
        "reply": " Do you think other Christians who believe differently than you are less Christian?", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-14 11:31:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "There are Muslims that believe in peace and follow the Koran and abhor these acts of terror. Then there are other Muslims who attempt to use the Koran to carry out acts of terrorism to fulfill their agenda. Are these Muslims who believe differently than the first Muslims less Muslim? I believe that when we stand before God and are judged, what religion we were part of on Earth will not matter. The only thing that will matter is, here is what I said, here is what you did. All things being judged uniquely according to ones own heart. Will people that misinterpreted his words and did something else be guiltless? You think that the Phelps cult misinterprets the Bible to act the way that they do. I do too and feel the same way that you do and shudder when I see them doing things like trying to get a hate statue put up \"in honor\" of Matthew Sheppard after he was killed. How will they be judged? Then there are these people that, in my opinion, have tried to dig deep into the Bible and original translations in order to show that we have been wrong this whole time about what God thinks about homosexuality in order to justify what they want to be true. Controversy amongst the Church goes even further when you look at the Church of Christ who believes that people who use musical instruments in a church service are not acting according to God. Who can really know though until we are faced with the one who said it? It is none of my business how you translate the Bible or choose to follow or not follow after God. We can discuss it in love and if you ask me my opinion I will tell you, but yours is yours and not mine, and you are responsible for yours as I am mine. In some ways many Christians are minor versions of the Phelps group, but then again so are many homosexuals.", 
        "intTime": 20090314, 
        "postID": 11, 
        "quote": "", 
        "reply": "There are Muslims that believe in peace and follow the Koran and abhor these acts of terror. Then there are other Muslims who attempt to use the Koran to carry out acts of terrorism to fulfill their agenda. Are these Muslims who believe differently than the first Muslims less Muslim? I believe that when we stand before God and are judged, what religion we were part of on Earth will not matter. The only thing that will matter is, here is what I said, here is what you did. All things being judged uniquely according to ones own heart. Will people that misinterpreted his words and did something else be guiltless? You think that the Phelps cult misinterprets the Bible to act the way that they do. I do too and feel the same way that you do and shudder when I see them doing things like trying to get a hate statue put up \"in honor\" of Matthew Sheppard after he was killed. How will they be judged? Then there are these people that, in my opinion, have tried to dig deep into the Bible and original translations in order to show that we have been wrong this whole time about what God thinks about homosexuality in order to justify what they want to be true. Controversy amongst the Church goes even further when you look at the Church of Christ who believes that people who use musical instruments in a church service are not acting according to God. Who can really know though until we are faced with the one who said it? It is none of my business how you translate the Bible or choose to follow or not follow after God. We can discuss it in love and if you ask me my opinion I will tell you, but yours is yours and not mine, and you are responsible for yours as I am mine. In some ways many Christians are minor versions of the Phelps group, but then again so are many homosexuals.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-14 13:56:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "JimmieJam007"
    }, 
    {
        "content": "quote: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp *** Unless I'm missing something, isn't it interesting to see, \"the GLBT community,\" use, \"Church & State,\" arguments like this above - four clicks north - then, conveniently argue for the, \"Separation of Church and State,\" when that position serves a better argument. *** Organize the Cause, and pick a side!", 
        "intTime": 20090314, 
        "postID": 12, 
        "quote": "Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp", 
        "reply": " *** Unless I'm missing something, isn't it interesting to see, \"the GLBT community,\" use, \"Church & State,\" arguments like this above - four clicks north - then, conveniently argue for the, \"Separation of Church and State,\" when that position serves a better argument. *** Organize the Cause, and pick a side!", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-14 22:52:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: quote: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp *** Unless I'm missing something, isn't it interesting to see, \"the GLBT community,\" use, \"Church & State,\" arguments like this above - four clicks north - then, conveniently argue for the, \"Separation of Church and State,\" when that position serves a better argument. *** Organize the Cause, and pick a side! We're not arguing anything about \"church and state.\" I'm making the argument that the Religious Right Reich likes to claim that religion is anti-gay-marriage. This shows otherwise. That's the primary point I'm making. The secondary point is that if, as the Religious Reich claims, marriage is a religious institution, then this proves that quite a few religions would allow gay couples to marry. So why should those religions be subject to the restrictions of other religions that do not allow gays to marry? I'm happy to \"pick a side.\" My side is that each individual religion can do whatever it wants in regards to its religious ceremonies, which people it wants to marry (or not), and how their run their churches and dogma. However, I feel that the law, separate from the church, must apply equally to all couples. What is so hard to understand about that?", 
        "intTime": 20090316, 
        "postID": 13, 
        "quote": "Originally posted by EqualRightstoPrivacy: quote: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp *** Unless I'm missing something, isn't it interesting to see, \"the GLBT community,\" use, \"Church & State,\" arguments like this above - four clicks north - then, conveniently argue for the, \"Separation of Church and State,\" when that position serves a better argument. *** Organize the Cause, and pick a side!", 
        "reply": " We're not arguing anything about \"church and state.\" I'm making the argument that the Religious Right Reich likes to claim that religion is anti-gay-marriage. This shows otherwise. That's the primary point I'm making. The secondary point is that if, as the Religious Reich claims, marriage is a religious institution, then this proves that quite a few religions would allow gay couples to marry. So why should those religions be subject to the restrictions of other religions that do not allow gays to marry? I'm happy to \"pick a side.\" My side is that each individual religion can do whatever it wants in regards to its religious ceremonies, which people it wants to marry (or not), and how their run their churches and dogma. However, I feel that the law, separate from the church, must apply equally to all couples. What is so hard to understand about that?", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 07:15:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "\"We're not arguing anything about, 'church and state.' [...]\" *** Oh contrar ... The said Clergy are making a legal appeal to the State with their declaration. And thus the above poster(s)/post(s) clearly makes an, \"Appeal to Religious Authority,\" which is an, \"Appeal to their Declaration to the State,\" which has everything to do with, \"Church and State.\" *** Such appeals against your cause, are argued by your cause. ... Not really confused here, the GLBT agenda will say anything in narrative to attempt to sway public opinion, with little regard for reason, basis, logic, etc. At least opponents against the cause, have a definitive side with a fundamental basis. *** I understand the individual points made in response to my post. That said, it is obvious some refuse to acknowledge the irrefutable point I've made. Simple math, the premises in the one-click-north post don't, \"add-up,\" to the conclusion(s). There is no argument for this. Notta! *** What we've got here is more fallicious narrative that pieces together conflicting pieces of the broader discussion in an [fallicious] attempt to make a, \"profound-not,\" point. I'm just calling it how it is written, which again is irrefutable. *** Pick a side! *** My opinion of course.", 
        "intTime": 20090316, 
        "postID": 14, 
        "quote": "", 
        "reply": "\"We're not arguing anything about, 'church and state.' [...]\" *** Oh contrar ... The said Clergy are making a legal appeal to the State with their declaration. And thus the above poster(s)/post(s) clearly makes an, \"Appeal to Religious Authority,\" which is an, \"Appeal to their Declaration to the State,\" which has everything to do with, \"Church and State.\" *** Such appeals against your cause, are argued by your cause. ... Not really confused here, the GLBT agenda will say anything in narrative to attempt to sway public opinion, with little regard for reason, basis, logic, etc. At least opponents against the cause, have a definitive side with a fundamental basis. *** I understand the individual points made in response to my post. That said, it is obvious some refuse to acknowledge the irrefutable point I've made. Simple math, the premises in the one-click-north post don't, \"add-up,\" to the conclusion(s). There is no argument for this. Notta! *** What we've got here is more fallicious narrative that pieces together conflicting pieces of the broader discussion in an [fallicious] attempt to make a, \"profound-not,\" point. I'm just calling it how it is written, which again is irrefutable. *** Pick a side! *** My opinion of course.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 10:15:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: fallicious [sic] narrative Fallacious narrative appears to be your forte, Equal. That some have served honorably as gays and tell about it is not fallacious, it is courageous. Did you see the news release about the West Point GLBT advocates? It's on the IN THE NEWS thread. That takes guts! IMHO UPDATE: I posted the link to it below. Enjoy.", 
        "intTime": 20090316, 
        "postID": 15, 
        "quote": "fallicious [sic] narrative", 
        "reply": " Fallacious narrative appears to be your forte, Equal. That some have served honorably as gays and tell about it is not fallacious, it is courageous. Did you see the news release about the West Point GLBT advocates? It's on the IN THE NEWS thread. That takes guts! IMHO UPDATE: I posted the link to it below. Enjoy.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 13:33:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "reducetension"
    }, 
    {
        "content": "reducetension, you should copy and post the West Point article here in the gay forum also.", 
        "intTime": 20090316, 
        "postID": 16, 
        "quote": "", 
        "reply": "reducetension, you should copy and post the West Point article here in the gay forum also.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 13:35:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Here's a link to it: http://forums.military.com/eve/forums/a/tpc/f/672198221...712001#4640079712001 Subject: quote: WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER Organizers offer partnership with the nation’s oldest military academy as the end to “Don’t Ask, Don’t Tell” quickly approaches. WEST POINT, NY – A courageous group of America’s best and brightest are once again answering their call to duty, honor, and country: by coming out of the closet. Hope that works. Certainly a courageous, if not risky thing, those active duty officers have done. But then, shouldn't a good officer know when to take risks? Now is the time.", 
        "intTime": 20090316, 
        "postID": 17, 
        "quote": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER Organizers offer partnership with the nation’s oldest military academy as the end to “Don’t Ask, Don’t Tell” quickly approaches. WEST POINT, NY – A courageous group of America’s best and brightest are once again answering their call to duty, honor, and country: by coming out of the closet.", 
        "reply": "Here's a link to it: http://forums.military.com/eve/forums/a/tpc/f/672198221...712001#4640079712001 Subject:  Hope that works. Certainly a courageous, if not risky thing, those active duty officers have done. But then, shouldn't a good officer know when to take risks? Now is the time.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 13:39:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "reducetension"
    }, 
    {
        "content": "I’ve thought about this many times in the past but now it comes back to mind again triggered by the actions of the West Point group. I have often wondered if ALL of the estimated 64,000 that are estimated to be in the military were to stand up all at once on the same day and come out of the closet. First of all I think many would be truly shocked to their core as to who those 64,000 are and what positions they hold. Secondly, I don’t think the military could/would do much about it. They can’t discharge 64,000 people, not as hard pressed as they are now for personnel. Of course I am not advocating anyone do this, but it does make one wonder what would really happen.", 
        "intTime": 20090316, 
        "postID": 18, 
        "quote": "", 
        "reply": "I’ve thought about this many times in the past but now it comes back to mind again triggered by the actions of the West Point group. I have often wondered if ALL of the estimated 64,000 that are estimated to be in the military were to stand up all at once on the same day and come out of the closet. First of all I think many would be truly shocked to their core as to who those 64,000 are and what positions they hold. Secondly, I don’t think the military could/would do much about it. They can’t discharge 64,000 people, not as hard pressed as they are now for personnel. Of course I am not advocating anyone do this, but it does make one wonder what would really happen.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 14:24:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "The 'rule of thumb' is, if enough people 'deviate' against a rule/law, the rule/law changes. Civil Rights Movement being the most notable. It depends on many factors and always involves risk of suffering under the law. My own feeling is that it is not now necessary for a large number of gay service personnel to do so. I think it will change (be dropped.) However, if some crazy scheme like Equal has proposed were to come to pass (which I doubt) then hard-core protest would be called for as nothing is really accomplished except to satisfy the prejudices of the heterosexual minority.", 
        "intTime": 20090316, 
        "postID": 19, 
        "quote": "", 
        "reply": "The 'rule of thumb' is, if enough people 'deviate' against a rule/law, the rule/law changes. Civil Rights Movement being the most notable. It depends on many factors and always involves risk of suffering under the law. My own feeling is that it is not now necessary for a large number of gay service personnel to do so. I think it will change (be dropped.) However, if some crazy scheme like Equal has proposed were to come to pass (which I doubt) then hard-core protest would be called for as nothing is really accomplished except to satisfy the prejudices of the heterosexual minority.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 17:09:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "reducetension"
    }, 
    {
        "content": "Do you think that all the people who don't want to go overseas and fight should also stand up in Mutiny and refuse to go? What a swell idea! After that, I and many others will ban together in protest and have our hair long and wear our earrings on the base, man oh man I have missed being able to do that. Come to think of it, I never understood the whole hat thing, time to take that off too. We have had many a discussion on the repeal/don't repeal DADT and the potential harm to the morale, integrity, and essence of what makes our military what it is today. I think this just made the top of the list and also breaks just about every one of our codes of conduct. This message has been edited. Last edited by: JimmieJam007, Mon 16 March 2009 08:59 PM", 
        "intTime": 20090316, 
        "postID": 20, 
        "quote": "", 
        "reply": "Do you think that all the people who don't want to go overseas and fight should also stand up in Mutiny and refuse to go? What a swell idea! After that, I and many others will ban together in protest and have our hair long and wear our earrings on the base, man oh man I have missed being able to do that. Come to think of it, I never understood the whole hat thing, time to take that off too. We have had many a discussion on the repeal/don't repeal DADT and the potential harm to the morale, integrity, and essence of what makes our military what it is today. I think this just made the top of the list and also breaks just about every one of our codes of conduct. This message has been edited. Last edited by: JimmieJam007, Mon 16 March 2009 08:59 PM", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 17:57:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "JimmieJam007"
    }, 
    {
        "content": "Vermont Mental Health Experts Support Gay Marriage Forces Join For Equality For Same-Sex Couples BURLINGTON, Vt. -- The Vermont chapters of four national mental health organizations say the best research suggests a range of benefits to children of same-sex parents granted equal access to civil marriage under state law. The state Legislature begins hearings next Monday to consider whether to replace Vermont's civil union statute with one that offers gay couples the right to marry. Dr. Jackie Weinstock, a UVM professor and psychologist, released the joint statement of support signed by the state chapter of the National Psychiatric Association, the Psychological Association, the Association of Mental Health Counselors and the Vermont chapter of the National Association of Social Workers. \"What brings us here today,\" Weinstock said, \"is a shared interest in the psychological well-being of all people.\" She said the groups want to \"set the record straight\" given what they said had been a \"misinterpretation\" of available scientific literature by marriage equality opponents. \"Research has shown children of same-sex couples are as likely as children of heterosexual parents to flourish,\" Weinstock said, adding \"research shows same-sex parents are just as likely to provide healthy and supportive environments for children.\" >http://www.wptz.com/cnn-news/18891460/detail.html", 
        "intTime": 20090310, 
        "postID": 21, 
        "quote": "", 
        "reply": "Vermont Mental Health Experts Support Gay Marriage Forces Join For Equality For Same-Sex Couples BURLINGTON, Vt. -- The Vermont chapters of four national mental health organizations say the best research suggests a range of benefits to children of same-sex parents granted equal access to civil marriage under state law. The state Legislature begins hearings next Monday to consider whether to replace Vermont's civil union statute with one that offers gay couples the right to marry. Dr. Jackie Weinstock, a UVM professor and psychologist, released the joint statement of support signed by the state chapter of the National Psychiatric Association, the Psychological Association, the Association of Mental Health Counselors and the Vermont chapter of the National Association of Social Workers. \"What brings us here today,\" Weinstock said, \"is a shared interest in the psychological well-being of all people.\" She said the groups want to \"set the record straight\" given what they said had been a \"misinterpretation\" of available scientific literature by marriage equality opponents. \"Research has shown children of same-sex couples are as likely as children of heterosexual parents to flourish,\" Weinstock said, adding \"research shows same-sex parents are just as likely to provide healthy and supportive environments for children.\" >http://www.wptz.com/cnn-news/18891460/detail.html", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-10 19:06:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "The Vermont Legislature is moving along, I'm pretty confident they will allow same-sex marriage in their State. Come to thing of it, Vermont has been working on this project for about a year now, and I'm anxious to see them get this passed. My mate and I make a yearly pilgrimage to visit relatives in Vermont and I'm hoping to talk my better half into getting married when we go up there later this year.", 
        "intTime": 20090310, 
        "postID": 22, 
        "quote": "", 
        "reply": "The Vermont Legislature is moving along, I'm pretty confident they will allow same-sex marriage in their State. Come to thing of it, Vermont has been working on this project for about a year now, and I'm anxious to see them get this passed. My mate and I make a yearly pilgrimage to visit relatives in Vermont and I'm hoping to talk my better half into getting married when we go up there later this year.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-10 21:48:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes?", 
        "intTime": 20090311, 
        "postID": 23, 
        "quote": "", 
        "reply": "Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes?", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-11 09:04:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes? Oh, that has probably happen in all states at some time, even Missouri, the \"Show Me State\". But then that's the state rights issues, isn't it. Didn't Missouri get involved in starting a war over states rights?", 
        "intTime": 20090311, 
        "postID": 24, 
        "quote": "Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes?", 
        "reply": " Oh, that has probably happen in all states at some time, even Missouri, the \"Show Me State\". But then that's the state rights issues, isn't it. Didn't Missouri get involved in starting a war over states rights?", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-11 11:52:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes? Vermont was one of ten states that didn't adopt Jessica's Law, so they're not the only one. The problem is more about the judges that refused to apply heavy sentences. The most notorious example is Judge Edward Cashman, who only sentenced an admitted repeat child rapist to 60 days in jail. Cashman is a life-long conservative Republican and church-goer, who argued that \"punishment just does not work\" in regards to child molesters. Naturally, other judges have imposed much heavier sentences on other offenders, because ultimately, it is up to the judge to apply up to, and including, the maximum allowable sentence for these crimes. Other judges in other states have let child rapists off with far too little punishment. So, there's the answer to your question. Your question had nothing to do with the topic at hand. Other than that, Vermont is a fine state with good people, small New England towns, and until just this past decade, they had more cows than people. Additionally, the Vermont chapters of these NATIONAL mental health organizations have nothing to do with the Vermont Legislature or the state's judges (who are clearly wimps).", 
        "intTime": 20090311, 
        "postID": 25, 
        "quote": "Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes?", 
        "reply": " Vermont was one of ten states that didn't adopt Jessica's Law, so they're not the only one. The problem is more about the judges that refused to apply heavy sentences. The most notorious example is Judge Edward Cashman, who only sentenced an admitted repeat child rapist to 60 days in jail. Cashman is a life-long conservative Republican and church-goer, who argued that \"punishment just does not work\" in regards to child molesters. Naturally, other judges have imposed much heavier sentences on other offenders, because ultimately, it is up to the judge to apply up to, and including, the maximum allowable sentence for these crimes. Other judges in other states have let child rapists off with far too little punishment. So, there's the answer to your question. Your question had nothing to do with the topic at hand. Other than that, Vermont is a fine state with good people, small New England towns, and until just this past decade, they had more cows than people. Additionally, the Vermont chapters of these NATIONAL mental health organizations have nothing to do with the Vermont Legislature or the state's judges (who are clearly wimps).", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-11 11:53:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes? Oh, that has probably happen in all states at some time, even Missouri, the \"Show Me State\". But then that's the state rights issues, isn't it. Didn't Missouri get involved in starting a war over states rights? Does our Constitution not carefully delineate what rights are federal and those left to the states? And, NO....Missouri was NOT one of the eleven that made up the confederacy!", 
        "intTime": 20090312, 
        "postID": 26, 
        "quote": "Originally posted by reducetension: quote: Originally posted by 19022583: Isn't Vermont that state where judges won't prosecute pedophiles and releases convicted murder/rapists to repeat their crimes? Oh, that has probably happen in all states at some time, even Missouri, the \"Show Me State\". But then that's the state rights issues, isn't it. Didn't Missouri get involved in starting a war over states rights?", 
        "reply": " Does our Constitution not carefully delineate what rights are federal and those left to the states? And, NO....Missouri was NOT one of the eleven that made up the confederacy!", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-12 11:54:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "19022583"
    }, 
    {
        "content": "Breaking news on Vermont... The clergy are weighing in... and supporting equal marriage rights! \"http://www.wptz.com/cnn-news/18910412/detail.html quote: The Rev. Linda Maloney, an Episcopal minister from Enosburg Falls, said , \"Civil unions are a good thing, but are still not equality.\" Maloney joined about 25 colleagues of varying Christian denominations at a news conference at City Hall in Burlington Wednesday to voice their support for marriage equality. They released a roster of Christian and Jewish clergy from across Vermont who signed a statement of support for same-sex marriage rights, framing the issue as one that protects their religious freedoms. \"We affirm the First Amendment to the U.S. Constitution,\" said the Rev. Johanna Nichols of the Unitarian Universalist Society. \"The state can't require religious groups to bless same gender marriages nor may it favor the convictions of one group over another and deny individuals their fundamental right to civil marriage.\" Looks like the religion argument for/against gay marriage isn't as one-sided as the fundamentalists would like to think! I lived in Vermont for two years. Great state. I'd move back there in a heartbeat.", 
        "intTime": 20090312, 
        "postID": 27, 
        "quote": "The Rev. Linda Maloney, an Episcopal minister from Enosburg Falls, said , \"Civil unions are a good thing, but are still not equality.\" Maloney joined about 25 colleagues of varying Christian denominations at a news conference at City Hall in Burlington Wednesday to voice their support for marriage equality. They released a roster of Christian and Jewish clergy from across Vermont who signed a statement of support for same-sex marriage rights, framing the issue as one that protects their religious freedoms. \"We affirm the First Amendment to the U.S. Constitution,\" said the Rev. Johanna Nichols of the Unitarian Universalist Society. \"The state can't require religious groups to bless same gender marriages nor may it favor the convictions of one group over another and deny individuals their fundamental right to civil marriage.\"", 
        "reply": "Breaking news on Vermont... The clergy are weighing in... and supporting equal marriage rights! \"http://www.wptz.com/cnn-news/18910412/detail.html  Looks like the religion argument for/against gay marriage isn't as one-sided as the fundamentalists would like to think! I lived in Vermont for two years. Great state. I'd move back there in a heartbeat.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-12 12:19:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp", 
        "intTime": 20090312, 
        "postID": 28, 
        "quote": "", 
        "reply": "Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-12 20:10:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp Sounds like these \"religious\" leaders are much better....secularists!", 
        "intTime": 20090314, 
        "postID": 29, 
        "quote": "Originally posted by IHAWKER: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp", 
        "reply": " Sounds like these \"religious\" leaders are much better....secularists!", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-14 10:07:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: Sounds like these \"religious\" leaders are much better....secularists! Do you think other Christians who believe differently than you are less Christian?", 
        "intTime": 20090314, 
        "postID": 30, 
        "quote": "Originally posted by 19022583: Sounds like these \"religious\" leaders are much better....secularists!", 
        "reply": " Do you think other Christians who believe differently than you are less Christian?", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-14 11:31:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "There are Muslims that believe in peace and follow the Koran and abhor these acts of terror. Then there are other Muslims who attempt to use the Koran to carry out acts of terrorism to fulfill their agenda. Are these Muslims who believe differently than the first Muslims less Muslim? I believe that when we stand before God and are judged, what religion we were part of on Earth will not matter. The only thing that will matter is, here is what I said, here is what you did. All things being judged uniquely according to ones own heart. Will people that misinterpreted his words and did something else be guiltless? You think that the Phelps cult misinterprets the Bible to act the way that they do. I do too and feel the same way that you do and shudder when I see them doing things like trying to get a hate statue put up \"in honor\" of Matthew Sheppard after he was killed. How will they be judged? Then there are these people that, in my opinion, have tried to dig deep into the Bible and original translations in order to show that we have been wrong this whole time about what God thinks about homosexuality in order to justify what they want to be true. Controversy amongst the Church goes even further when you look at the Church of Christ who believes that people who use musical instruments in a church service are not acting according to God. Who can really know though until we are faced with the one who said it? It is none of my business how you translate the Bible or choose to follow or not follow after God. We can discuss it in love and if you ask me my opinion I will tell you, but yours is yours and not mine, and you are responsible for yours as I am mine. In some ways many Christians are minor versions of the Phelps group, but then again so are many homosexuals.", 
        "intTime": 20090314, 
        "postID": 31, 
        "quote": "", 
        "reply": "There are Muslims that believe in peace and follow the Koran and abhor these acts of terror. Then there are other Muslims who attempt to use the Koran to carry out acts of terrorism to fulfill their agenda. Are these Muslims who believe differently than the first Muslims less Muslim? I believe that when we stand before God and are judged, what religion we were part of on Earth will not matter. The only thing that will matter is, here is what I said, here is what you did. All things being judged uniquely according to ones own heart. Will people that misinterpreted his words and did something else be guiltless? You think that the Phelps cult misinterprets the Bible to act the way that they do. I do too and feel the same way that you do and shudder when I see them doing things like trying to get a hate statue put up \"in honor\" of Matthew Sheppard after he was killed. How will they be judged? Then there are these people that, in my opinion, have tried to dig deep into the Bible and original translations in order to show that we have been wrong this whole time about what God thinks about homosexuality in order to justify what they want to be true. Controversy amongst the Church goes even further when you look at the Church of Christ who believes that people who use musical instruments in a church service are not acting according to God. Who can really know though until we are faced with the one who said it? It is none of my business how you translate the Bible or choose to follow or not follow after God. We can discuss it in love and if you ask me my opinion I will tell you, but yours is yours and not mine, and you are responsible for yours as I am mine. In some ways many Christians are minor versions of the Phelps group, but then again so are many homosexuals.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-14 13:56:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "JimmieJam007"
    }, 
    {
        "content": "quote: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp *** Unless I'm missing something, isn't it interesting to see, \"the GLBT community,\" use, \"Church & State,\" arguments like this above - four clicks north - then, conveniently argue for the, \"Separation of Church and State,\" when that position serves a better argument. *** Organize the Cause, and pick a side!", 
        "intTime": 20090314, 
        "postID": 32, 
        "quote": "Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp", 
        "reply": " *** Unless I'm missing something, isn't it interesting to see, \"the GLBT community,\" use, \"Church & State,\" arguments like this above - four clicks north - then, conveniently argue for the, \"Separation of Church and State,\" when that position serves a better argument. *** Organize the Cause, and pick a side!", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-14 22:52:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: quote: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp *** Unless I'm missing something, isn't it interesting to see, \"the GLBT community,\" use, \"Church & State,\" arguments like this above - four clicks north - then, conveniently argue for the, \"Separation of Church and State,\" when that position serves a better argument. *** Organize the Cause, and pick a side! We're not arguing anything about \"church and state.\" I'm making the argument that the Religious Right Reich likes to claim that religion is anti-gay-marriage. This shows otherwise. That's the primary point I'm making. The secondary point is that if, as the Religious Reich claims, marriage is a religious institution, then this proves that quite a few religions would allow gay couples to marry. So why should those religions be subject to the restrictions of other religions that do not allow gays to marry? I'm happy to \"pick a side.\" My side is that each individual religion can do whatever it wants in regards to its religious ceremonies, which people it wants to marry (or not), and how their run their churches and dogma. However, I feel that the law, separate from the church, must apply equally to all couples. What is so hard to understand about that?", 
        "intTime": 20090316, 
        "postID": 33, 
        "quote": "Originally posted by EqualRightstoPrivacy: quote: Vt. Clergy Members Support Marriage Equality One hundred eighty-two clergy members representing nine religious denominations have signed a declaration in support of same-sex marriage in Vermont. An excerpt of the declaration reads, “As religious people, clergy, and leaders, we commit ourselves to public action, visibility, and education to support the right and freedom of same-gender couples to participate in civil marriage. We oppose the application of sacred texts and religious traditions for the purpose of denying legal and social equity to same-gender couples.” >http://www.advocate.com/news_detail_ektid75063.asp *** Unless I'm missing something, isn't it interesting to see, \"the GLBT community,\" use, \"Church & State,\" arguments like this above - four clicks north - then, conveniently argue for the, \"Separation of Church and State,\" when that position serves a better argument. *** Organize the Cause, and pick a side!", 
        "reply": " We're not arguing anything about \"church and state.\" I'm making the argument that the Religious Right Reich likes to claim that religion is anti-gay-marriage. This shows otherwise. That's the primary point I'm making. The secondary point is that if, as the Religious Reich claims, marriage is a religious institution, then this proves that quite a few religions would allow gay couples to marry. So why should those religions be subject to the restrictions of other religions that do not allow gays to marry? I'm happy to \"pick a side.\" My side is that each individual religion can do whatever it wants in regards to its religious ceremonies, which people it wants to marry (or not), and how their run their churches and dogma. However, I feel that the law, separate from the church, must apply equally to all couples. What is so hard to understand about that?", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 07:15:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "\"We're not arguing anything about, 'church and state.' [...]\" *** Oh contrar ... The said Clergy are making a legal appeal to the State with their declaration. And thus the above poster(s)/post(s) clearly makes an, \"Appeal to Religious Authority,\" which is an, \"Appeal to their Declaration to the State,\" which has everything to do with, \"Church and State.\" *** Such appeals against your cause, are argued by your cause. ... Not really confused here, the GLBT agenda will say anything in narrative to attempt to sway public opinion, with little regard for reason, basis, logic, etc. At least opponents against the cause, have a definitive side with a fundamental basis. *** I understand the individual points made in response to my post. That said, it is obvious some refuse to acknowledge the irrefutable point I've made. Simple math, the premises in the one-click-north post don't, \"add-up,\" to the conclusion(s). There is no argument for this. Notta! *** What we've got here is more fallicious narrative that pieces together conflicting pieces of the broader discussion in an [fallicious] attempt to make a, \"profound-not,\" point. I'm just calling it how it is written, which again is irrefutable. *** Pick a side! *** My opinion of course.", 
        "intTime": 20090316, 
        "postID": 34, 
        "quote": "", 
        "reply": "\"We're not arguing anything about, 'church and state.' [...]\" *** Oh contrar ... The said Clergy are making a legal appeal to the State with their declaration. And thus the above poster(s)/post(s) clearly makes an, \"Appeal to Religious Authority,\" which is an, \"Appeal to their Declaration to the State,\" which has everything to do with, \"Church and State.\" *** Such appeals against your cause, are argued by your cause. ... Not really confused here, the GLBT agenda will say anything in narrative to attempt to sway public opinion, with little regard for reason, basis, logic, etc. At least opponents against the cause, have a definitive side with a fundamental basis. *** I understand the individual points made in response to my post. That said, it is obvious some refuse to acknowledge the irrefutable point I've made. Simple math, the premises in the one-click-north post don't, \"add-up,\" to the conclusion(s). There is no argument for this. Notta! *** What we've got here is more fallicious narrative that pieces together conflicting pieces of the broader discussion in an [fallicious] attempt to make a, \"profound-not,\" point. I'm just calling it how it is written, which again is irrefutable. *** Pick a side! *** My opinion of course.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 10:15:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: fallicious [sic] narrative Fallacious narrative appears to be your forte, Equal. That some have served honorably as gays and tell about it is not fallacious, it is courageous. Did you see the news release about the West Point GLBT advocates? It's on the IN THE NEWS thread. That takes guts! IMHO UPDATE: I posted the link to it below. Enjoy.", 
        "intTime": 20090316, 
        "postID": 35, 
        "quote": "fallicious [sic] narrative", 
        "reply": " Fallacious narrative appears to be your forte, Equal. That some have served honorably as gays and tell about it is not fallacious, it is courageous. Did you see the news release about the West Point GLBT advocates? It's on the IN THE NEWS thread. That takes guts! IMHO UPDATE: I posted the link to it below. Enjoy.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 13:33:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "reducetension"
    }, 
    {
        "content": "reducetension, you should copy and post the West Point article here in the gay forum also.", 
        "intTime": 20090316, 
        "postID": 36, 
        "quote": "", 
        "reply": "reducetension, you should copy and post the West Point article here in the gay forum also.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 13:35:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Here's a link to it: http://forums.military.com/eve/forums/a/tpc/f/672198221...712001#4640079712001 Subject: quote: WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER Organizers offer partnership with the nation’s oldest military academy as the end to “Don’t Ask, Don’t Tell” quickly approaches. WEST POINT, NY – A courageous group of America’s best and brightest are once again answering their call to duty, honor, and country: by coming out of the closet. Hope that works. Certainly a courageous, if not risky thing, those active duty officers have done. But then, shouldn't a good officer know when to take risks? Now is the time.", 
        "intTime": 20090316, 
        "postID": 37, 
        "quote": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER Organizers offer partnership with the nation’s oldest military academy as the end to “Don’t Ask, Don’t Tell” quickly approaches. WEST POINT, NY – A courageous group of America’s best and brightest are once again answering their call to duty, honor, and country: by coming out of the closet.", 
        "reply": "Here's a link to it: http://forums.military.com/eve/forums/a/tpc/f/672198221...712001#4640079712001 Subject:  Hope that works. Certainly a courageous, if not risky thing, those active duty officers have done. But then, shouldn't a good officer know when to take risks? Now is the time.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 13:39:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "reducetension"
    }, 
    {
        "content": "I’ve thought about this many times in the past but now it comes back to mind again triggered by the actions of the West Point group. I have often wondered if ALL of the estimated 64,000 that are estimated to be in the military were to stand up all at once on the same day and come out of the closet. First of all I think many would be truly shocked to their core as to who those 64,000 are and what positions they hold. Secondly, I don’t think the military could/would do much about it. They can’t discharge 64,000 people, not as hard pressed as they are now for personnel. Of course I am not advocating anyone do this, but it does make one wonder what would really happen.", 
        "intTime": 20090316, 
        "postID": 38, 
        "quote": "", 
        "reply": "I’ve thought about this many times in the past but now it comes back to mind again triggered by the actions of the West Point group. I have often wondered if ALL of the estimated 64,000 that are estimated to be in the military were to stand up all at once on the same day and come out of the closet. First of all I think many would be truly shocked to their core as to who those 64,000 are and what positions they hold. Secondly, I don’t think the military could/would do much about it. They can’t discharge 64,000 people, not as hard pressed as they are now for personnel. Of course I am not advocating anyone do this, but it does make one wonder what would really happen.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 14:24:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "The 'rule of thumb' is, if enough people 'deviate' against a rule/law, the rule/law changes. Civil Rights Movement being the most notable. It depends on many factors and always involves risk of suffering under the law. My own feeling is that it is not now necessary for a large number of gay service personnel to do so. I think it will change (be dropped.) However, if some crazy scheme like Equal has proposed were to come to pass (which I doubt) then hard-core protest would be called for as nothing is really accomplished except to satisfy the prejudices of the heterosexual minority.", 
        "intTime": 20090316, 
        "postID": 39, 
        "quote": "", 
        "reply": "The 'rule of thumb' is, if enough people 'deviate' against a rule/law, the rule/law changes. Civil Rights Movement being the most notable. It depends on many factors and always involves risk of suffering under the law. My own feeling is that it is not now necessary for a large number of gay service personnel to do so. I think it will change (be dropped.) However, if some crazy scheme like Equal has proposed were to come to pass (which I doubt) then hard-core protest would be called for as nothing is really accomplished except to satisfy the prejudices of the heterosexual minority.", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 17:09:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "reducetension"
    }, 
    {
        "content": "Do you think that all the people who don't want to go overseas and fight should also stand up in Mutiny and refuse to go? What a swell idea! After that, I and many others will ban together in protest and have our hair long and wear our earrings on the base, man oh man I have missed being able to do that. Come to think of it, I never understood the whole hat thing, time to take that off too. We have had many a discussion on the repeal/don't repeal DADT and the potential harm to the morale, integrity, and essence of what makes our military what it is today. I think this just made the top of the list and also breaks just about every one of our codes of conduct. This message has been edited. Last edited by: JimmieJam007, Mon 16 March 2009 08:59 PM", 
        "intTime": 20090316, 
        "postID": 40, 
        "quote": "", 
        "reply": "Do you think that all the people who don't want to go overseas and fight should also stand up in Mutiny and refuse to go? What a swell idea! After that, I and many others will ban together in protest and have our hair long and wear our earrings on the base, man oh man I have missed being able to do that. Come to think of it, I never understood the whole hat thing, time to take that off too. We have had many a discussion on the repeal/don't repeal DADT and the potential harm to the morale, integrity, and essence of what makes our military what it is today. I think this just made the top of the list and also breaks just about every one of our codes of conduct. This message has been edited. Last edited by: JimmieJam007, Mon 16 March 2009 08:59 PM", 
        "threadID": "27819558_3640094712001", 
        "time": "2009-03-16 17:57:00", 
        "title": "Vermont Mental Health Experts Support Gay Marriage", 
        "userID": "JimmieJam007"
    }
]