[
    {
        "content": "And Then There Were Six New Hampshire governor John Lynch announced Thursday that he will sign legislation to extend full marriage rights to gay and lesbian couples, making his state the fifth in New England to put such a law on the books. However, Lynch has asked for some changes in the language before he goes on to officially sign the bill. The law would let religious organizations, and individuals affiliated with such groups, govern whether they would extend \"services, accommodations, advantages, facilities, goods, or privileges\" based on marriage status. This includes married housing, religious counseling, and conducting wedding ceremonies. Furthermore, refusing such services would not provide a basis for legal action. \"My personal views on the subject of marriage have been shaped by my own experience, tradition, and upbringing,\" he said in a statement on Thursday. \"But as governor of New Hampshire, I recognize that I have a responsibility to consider this issue through a broader lens.\" Read the full article at ... >>>http://www.advocate.com/news_detail_ektid84116.asp", 
        "intTime": 20090514, 
        "postID": 1, 
        "quote": "", 
        "reply": "And Then There Were Six New Hampshire governor John Lynch announced Thursday that he will sign legislation to extend full marriage rights to gay and lesbian couples, making his state the fifth in New England to put such a law on the books. However, Lynch has asked for some changes in the language before he goes on to officially sign the bill. The law would let religious organizations, and individuals affiliated with such groups, govern whether they would extend \"services, accommodations, advantages, facilities, goods, or privileges\" based on marriage status. This includes married housing, religious counseling, and conducting wedding ceremonies. Furthermore, refusing such services would not provide a basis for legal action. \"My personal views on the subject of marriage have been shaped by my own experience, tradition, and upbringing,\" he said in a statement on Thursday. \"But as governor of New Hampshire, I recognize that I have a responsibility to consider this issue through a broader lens.\" Read the full article at ... >>>http://www.advocate.com/news_detail_ektid84116.asp", 
        "threadID": "27819558_6310043322001", 
        "time": "2009-05-14 19:30:00", 
        "title": "And Then There Were Six", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "I can't believe the rash of good news! I'm so happy! It feels like progress at long last, like the ice is breaking up.", 
        "intTime": 20090514, 
        "postID": 2, 
        "quote": "", 
        "reply": "I can't believe the rash of good news! I'm so happy! It feels like progress at long last, like the ice is breaking up.", 
        "threadID": "27819558_6310043322001", 
        "time": "2009-05-14 19:58:00", 
        "title": "And Then There Were Six", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "One step, one state at a time makes for a journey, albet long one....but a journey all the same.", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "", 
        "reply": "One step, one state at a time makes for a journey, albet long one....but a journey all the same.", 
        "threadID": "27819558_6310043322001", 
        "time": "2009-05-15 02:35:00", 
        "title": "And Then There Were Six", 
        "userID": "12522973"
    }, 
    {
        "content": "Too bad we'll never see it here in the Redneck Bible Belt South.", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "", 
        "reply": "Too bad we'll never see it here in the Redneck Bible Belt South.", 
        "threadID": "27819558_6310043322001", 
        "time": "2009-05-15 05:49:00", 
        "title": "And Then There Were Six", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: \"My personal views on the subject of marriage have been shaped by my own experience, tradition, and upbringing,\" he said in a statement on Thursday. \"But as governor of New Hampshire, I recognize that I have a responsibility to consider this issue through a broader lens.\" I think a very scrary precedence is being set here. Can you imagine what would happen to this country of all our politicians put personal feelings aside and considered the big picture? Complete chaos will follow if common sense prevails from our leadership. What will people think if integrity and confidence in our elected officials ability to govern is restored. Live Free or Die!!!", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "\"My personal views on the subject of marriage have been shaped by my own experience, tradition, and upbringing,\" he said in a statement on Thursday. \"But as governor of New Hampshire, I recognize that I have a responsibility to consider this issue through a broader lens.\"", 
        "reply": " I think a very scrary precedence is being set here. Can you imagine what would happen to this country of all our politicians put personal feelings aside and considered the big picture? Complete chaos will follow if common sense prevails from our leadership. What will people think if integrity and confidence in our elected officials ability to govern is restored. Live Free or Die!!!", 
        "threadID": "27819558_6310043322001", 
        "time": "2009-05-15 08:57:00", 
        "title": "And Then There Were Six", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: I can't believe the rash of good news! I'm so happy! It feels like progress at long last, like the ice is breaking up. Could this be the real global warming?", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "Originally posted by Frank_A_Valdez: I can't believe the rash of good news! I'm so happy! It feels like progress at long last, like the ice is breaking up.", 
        "reply": " Could this be the real global warming?", 
        "threadID": "27819558_6310043322001", 
        "time": "2009-05-15 09:22:00", 
        "title": "And Then There Were Six", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: Too bad we'll never see it here in the Redneck Bible Belt South. Some said the same thing about integration of the races and yet now days we witness MORE racial prejudice in the north than below the Mason Dixon line.", 
        "intTime": 20090516, 
        "postID": 7, 
        "quote": "Originally posted by Vicdude: Too bad we'll never see it here in the Redneck Bible Belt South.", 
        "reply": " Some said the same thing about integration of the races and yet now days we witness MORE racial prejudice in the north than below the Mason Dixon line.", 
        "threadID": "27819558_6310043322001", 
        "time": "2009-05-16 10:07:00", 
        "title": "And Then There Were Six", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by 21194237: quote: Originally posted by Vicdude: Too bad we'll never see it here in the Redneck Bible Belt South. Some said the same thing about integration of the races and yet now days we witness MORE racial prejudice in the north than below the Mason Dixon line. That is absolutely untrue. I have lived in New England, the Pacific northwest, the upper midwest, and southern California - and the deep south, where I live currently. The big culture shock for me in moving here from California is that people are actually racist here. It's subtle, and it resides in pesky little facts - like the fact that the city of Jacksonville, FL makes no effort to educate the black kids. My partner has brown skin, and trust me, people look at him differently here, and treat him differently than they do me. I most certainly never saw that in other parts of the country, and it was a huge surprise to me that people are this way in my generation. Southerners are odd people...politely offensive is how I would characterize their behavior. As Dan Savage said once, \"they are very nice about telling me that I should burn in hell.\"", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": "Originally posted by 21194237: quote: Originally posted by Vicdude: Too bad we'll never see it here in the Redneck Bible Belt South. Some said the same thing about integration of the races and yet now days we witness MORE racial prejudice in the north than below the Mason Dixon line.", 
        "reply": " That is absolutely untrue. I have lived in New England, the Pacific northwest, the upper midwest, and southern California - and the deep south, where I live currently. The big culture shock for me in moving here from California is that people are actually racist here. It's subtle, and it resides in pesky little facts - like the fact that the city of Jacksonville, FL makes no effort to educate the black kids. My partner has brown skin, and trust me, people look at him differently here, and treat him differently than they do me. I most certainly never saw that in other parts of the country, and it was a huge surprise to me that people are this way in my generation. Southerners are odd people...politely offensive is how I would characterize their behavior. As Dan Savage said once, \"they are very nice about telling me that I should burn in hell.\"", 
        "threadID": "27819558_6310043322001", 
        "time": "2009-05-18 17:45:00", 
        "title": "And Then There Were Six", 
        "userID": "Bleah"
    }
]