[
    {
        "content": "Arkansas Rejects Ban on Domestic-Partnership Registries A bill that would have banned domestic-partnership registries in Arkansas failed to move forward this morning in a house committee. The committee on city, county, and local affairs rejected the proposal in a voice vote. >http://www.advocate.com/news_detail_ektid76626.asp", 
        "intTime": 20090328, 
        "postID": 1, 
        "quote": "", 
        "reply": "Arkansas Rejects Ban on Domestic-Partnership Registries A bill that would have banned domestic-partnership registries in Arkansas failed to move forward this morning in a house committee. The committee on city, county, and local affairs rejected the proposal in a voice vote. >http://www.advocate.com/news_detail_ektid76626.asp", 
        "threadID": "27819558_1950071912001", 
        "time": "2009-03-28 08:52:00", 
        "title": "OMG, even in Arkansas of all places", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Arkansas Rejects Ban on Domestic-Partnership Registries A bill that would have banned domestic-partnership registries in Arkansas failed to move forward this morning in a house committee. The committee on city, county, and local affairs rejected the proposal in a voice vote. >http://www.advocate.com/news_detail_ektid76626.asp Surprising, but impressive. Still... why would any rational person want to live in a state with a governor like Huckabee, the far-right wingnut who wants to institute Shari'a Law Biblical Law? From Huckabee, during the election primaries last year: quote: \"I have opponents in this race who do not want to change the Constitution,\" Huckabee told a Michigan audience on Monday. \"But I believe it's a lot easier to change the Constitution than it would be to change the word of the living god. And that's what we need to do -- to amend the Constitution so it's in God's standards rather than try to change God's standards so it lines up with some contemporary view.\" Yeah, while it's nice that Arkansas has shown a faint glimmer of hope in the \"not being facist bigot homophobe\" category, I still couldn't imagine living there. Kansas may not be great, but we've got an awesome governor.", 
        "intTime": 20090328, 
        "postID": 2, 
        "quote": "Originally posted by IHAWKER: Arkansas Rejects Ban on Domestic-Partnership Registries A bill that would have banned domestic-partnership registries in Arkansas failed to move forward this morning in a house committee. The committee on city, county, and local affairs rejected the proposal in a voice vote. >http://www.advocate.com/news_detail_ektid76626.asp", 
        "reply": " Surprising, but impressive. Still... why would any rational person want to live in a state with a governor like Huckabee, the far-right wingnut who wants to institute Shari'a Law Biblical Law? From Huckabee, during the election primaries last year: quote: \"I have opponents in this race who do not want to change the Constitution,\" Huckabee told a Michigan audience on Monday. \"But I believe it's a lot easier to change the Constitution than it would be to change the word of the living god. And that's what we need to do -- to amend the Constitution so it's in God's standards rather than try to change God's standards so it lines up with some contemporary view.\" Yeah, while it's nice that Arkansas has shown a faint glimmer of hope in the \"not being facist bigot homophobe\" category, I still couldn't imagine living there. Kansas may not be great, but we've got an awesome governor.", 
        "threadID": "27819558_1950071912001", 
        "time": "2009-03-28 11:42:00", 
        "title": "OMG, even in Arkansas of all places", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "It must be the Clinton effect? And do I hear strains of \"Deliverance\" in the back ground?", 
        "intTime": 20090328, 
        "postID": 3, 
        "quote": "", 
        "reply": "It must be the Clinton effect? And do I hear strains of \"Deliverance\" in the back ground?", 
        "threadID": "27819558_1950071912001", 
        "time": "2009-03-28 12:12:00", 
        "title": "OMG, even in Arkansas of all places", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Deliverance \"http://www.youtube.com/watch?v=9gLN3QoN-q8\"", 
        "intTime": 20090328, 
        "postID": 4, 
        "quote": "Deliverance", 
        "reply": " \"http://www.youtube.com/watch?v=9gLN3QoN-q8\"", 
        "threadID": "27819558_1950071912001", 
        "time": "2009-03-28 20:25:00", 
        "title": "OMG, even in Arkansas of all places", 
        "userID": "Vicdude"
    }
]