[
    {
        "content": "serving Britain's armed forces Gays in the Military :: FAQs This selection of frequently asked questions is aimed towards straight service personnel; the answers to common questions may prove useful to all engaged in discussion the issues surrounding military life. “As a heterosexual man, I should not have to expose my body to a gay man in the shower.” heterosexuals are already exposing their bodies to gays in the shower. A recent study of 368 officers and enlisted personnel in the U.S. Navy and Marine Corps found that 20.1 percent personally know a homosexual service member; another 22.3 percent are unsure as to whether they know a homosexual service member. If these figures are extrapolated to the entire armed forces, then approximately 301,500 service members personally know a homosexual peer, and approximately 334,500 service members are unsure as to whether they personally know a homosexual peer. Other studies show the same thing. Finally, nothing will change in the shower after the lifting of the ban. Even though service members are already showering next to peers whom they know to be gay, the experiences of foreign militaries as well as domestic police and fire departments show that very few additional homosexuals will reveal their sexual orientation after the lifting of the ban. Hence, nothing will change in the shower after the lifting of the ban. “If heterosexual soldiers are constantly worried about being looked at in the shower by gay soldiers, they will either quit the armed forces or retaliate against gay soldiers.” Canada and Britain wrongly predicted that service members would quit after the lifting of gay bans. In a 1985 survey of 6,500 male soldiers, the Canadian Department of National Defence found that 62% of male service members would refuse to share showers, undress or sleep in the same room as a gay soldier, and that 45% would refuse to work with gays. A 1996 survey of 13,500 British service members reported that two-thirds of male respondents would not willingly serve in the military if gays and lesbians were allowed to serve. Yet when Canada and Britain lifted their gay bans, no more than a handful of people retired. “What happens if openly gay soldiers come onto a straight soldier in the showers? What happens if gay soldiers hit on each other?” This has not been a problem in foreign militaries that lifted their gay bans. Foreign militaries have found that by holding all service members to the same standards, inappropriate conduct is very rare, and that when it happens, it can be disciplined in an even-handed way. Inappropriate displays of affection by all personnel are covered in the Code of Conduct. “Anyone who has served in combat knows that battlefield conditions are not conducive for heterosexual soldiers serving alongside openly gay soldiers. Soldiers sometimes share body heat - those necessities couldn’t happen if a soldier believed someone was sexually aroused by such contact.” The British and Canadian militaries predicted that cohesion would deteriorate if gays and lesbians were allowed to serve openly, but even senior experts and officials who had predicted such deterioration are now unable to point to any problems whatsoever. In the Israeli military, a recent survey found that approximately 20% of combat soldiers know a gay peer in their unit. We can’t risk introducing romantic liaisons of any kind in war. What would happen if a gay soldier saw his lover injured on the battlefield?” The 24 foreign military forces that have lifted their bans, as well as the FBI, NSA, CIA, Secret Service, as well as police and fire departments that have lifted their bans, have found that gay and lesbian soldiers are just as loyal as everyone else, and that romantic liaisons are not a major problem. “What about [incident X] in Iraq, in which a gay British soldier compromised unit cohesion? And yet anecdotes about disciplinary problems concerning members of other groups do not mean that an entire group of people must be fired. If a Korean-American soldier undermined his unit’s cohesion, the military would not fire all Korean American service members. Isolated problems are nothing new, and the question is not whether the lifting of a gay ban might lead to a few, isolated problems. The point, rather, is whether the lifting of a gay ban has an overall impact on unit cohesion. And the evidence from 24 foreign militaries is that the lifting of a gay ban is a non-event that has no impact on performance. For a concrete example of this, read Out Sailors Recount Iraq War Experiences Alongside US Troops “Do you have any evidence from the foreign militaries that openly gay soldiers actually do serve in openly integrated units with straight soldiers? Isn’t it true with these other countries that gays stay in the closet anyway?” In the case of Israel, for example, Professor Charles Moskos, one of the principle architects of “Don’t-Ask, Don’t Tell”, testified before the Senate Armed Services Committee in 1993 that known gay soldiers were not assigned to elite combat units, did not work for intelligence units, and did not hold command positions in any branch of the Israel Defense Forces. In later work, Moskos reaffirmed that “gays are excluded from elite combat units, and most sleep at their own homes rather than in barracks”. During two appearances on National Public Radio, Moskos said that there are no gay soldiers in combat or intelligence units of the IDF who are out of the closet. To test whether Moskos’s claims were accurate, the University of California administered a survey in 2000 to soldiers in 17 the Israel Defense Forces that included the question: “Do you know (or have known in the past) a homosexual or lesbian soldier in your unit”? Of the 194 combat soldiers who responded, 42 (21.6%) responded that they know a homosexual peer in their combat unit, and 38 (19.6%) responded that they might know a homosexual peer in their combat unit. The percentages were almost equivalent for non-combat troops. To the extent that these results can be extrapolated, then roughly 28,000 of Israel’s 130,000 active duty land forces know a gay peer in their unit. Even in combat and intelligence units with known gay soldiers, however, a recent, comprehensive study published in the prestigious journal Armed Forces and Society found no evidence of a deterioration in cohesion, performance, readiness or morale. Generals, ministry officials, scholars, and NGO observers all have claimed that their presence has not eroded cohesion, performance, readiness or morale. Gay bashing - You can’t expect these boys to accept open homosexuals overnight.” In Britain, none of the twenty-five experts, officials, activists, and service members interviewed for a recent University of California report knew of a single case of gay-bashing or assault related to sexual orientation after the lifting of the ban. One military official reported that there have been no incidents related to sexual orientation reported to his office since the ban was lifted. He added: “The change in policy has been a complete non-event.” Comparisons with Racial Integration “Skin color is a benign, non-behavioral characteristic. Sexual orientation is perhaps the most profound of human behavioral characteristics. Comparison of the two is a convenient but invalid argument. Blacks do not choose to be black, but gays can choose not to act gay.” The question isn’t whether race is biological and sexuality is chosen or whether racial difference is benign while differences in sexuality are not, but whether lifting the gay ban would undermine military effectiveness. In fact, many experts believe that sexuality is chosen for some people and biologically determined for others. But again, the origin of sexuality is not what’s important. What matters is whether lifting the gay ban undermines the military. And the evidence shows decisively that it does not. “Why do gay soldiers have to tell other soldiers that they are gay?” The answer to the question is simple: honour and integrity. Whether we mean to or not, all of us regularly ask questions that make assumptions about sexuality: “Are you married?” “Do you think she’s attractive?” “Who are you taking to the dining in night / ball / social?” There is no way for gay servicemen to answer such ordinary questions without pretending to be straight oradmitting they are gay. Gay and lesbian service members do not seek the right to “flaunt” their identity or put their sexuality above the interests of the military. What they do seek, however, is the same right every other soldier has: to say who they are honestly and honorably, without getting fired or beaten up. It is just as unrealistic and dishonorable to expect gay soldiers to constantly lie about themselves to their civilian friends as to their military peers. \"Have there been any anecdotal problems of integrating to open service in other countries?” Even the leading opponents of allowing gays and lesbians into foreign militaries believe that the lifting of the bans did not damage the armed forces. Professor Christopher Dandeker, one of Britain’s most distinguished military experts, predicted that the lifting of UK’s gay ban would undermine the military. He has since concluded, however, that integration has not caused any problems. An internal government report that appraised the British change in policy characterized it as a “solid achievement … with fewer problems than might have been expected.” The assistant chief of the navy staff, Rear- Admiral James Burnell-Nugent concurred, “Although some did not welcome the change in policy, it has not caused any degree of difficulty.” Overall, the report suggests that “there has been a marked lack of reaction” to the issue of including homosexual personnel in the British Armed Services. In Australia, for example, spokesmen for the Returned and Services League, the country’s largest veterans’ group, predicted that lifting the gay ban would jeopardize morale and military performance. Eight years after Australia’s 1992 decision to lift its ban, however, the President of the Returned and Services League, Major General Peter Philips, stated that gays in the military have “not been a significant public issue. The Defence Forces have not had a lot of difficulty in this area.” Commodore R.W. Gates, whose rank is equivalent to a one-star admiral, remarked that the lifting of the ban was “an absolute non-event.” Professor Hugh Smith, a leading academicexpert on homosexuality in the Australian military, observed that when the government ordered the military to lift theban, some officers said, “Over my dead body, if this happens I’ll resign.” However, Smith said that there were nodepartures and that the change was accepted in “true military tradition.” Bronwen Grey, an official in the Australian Defence Ministry reported, “[T]here was no increase in complaints about gay people or by gay people. There was noknown increase in fights, on a ship, or in Army units or something … The recruitment figures didn’t alter.” In Canada, Steve Leveque, a civilian official in the Department of National Defence, commented that including gays and lesbians in the Canadian Forces is “not that big a deal for us … On a day-to-day basis there probably hasn’t been much of a change.” A 1995 internal report from the Canadian government on the lifting of the ban concluded, “Despite all the anxiety that existed through the late 80s into the early 90s about the change in policy, here’s what the indicators show– no effect.” In Israel, Stuart Cohen, a Professor at the Center for Strategic Studies who is recognized as a leading expert on the Israel Defense Forces, remarked, “As far as I have been able to tell, homosexuals do not constitute an issue [with respect to] unit cohesion in the IDF. In fact, the entire subject is very marginal indeed as far as this military is concerned.” Reuven Gal, the director of the Israeli Institute for Military Studies, wrote, “According to military reports, [homosexuals’] presence, whether openly or clandestinely, has not impaired the morale, cohesion, readiness, or security of any unit.” In over 100 interviews conducted by University of California researchers with both pro-gay and anti-gay experts, not one expert informant believed that the Australian, Canadian, Israeli, or British decisions to lift their gay bans undermined military performance, readiness or cohesion, led to increased difficulties in recruiting or retention, or increased the rate of HIV infection among the troops. “Isn’t it true that no foreign military has conducted rigorous internal reviews of open service 5+ years after changing their policies?” The reason the foreign militaries tend not to conduct ongoing internal reviews is that early inquiries, when problems should be most apparent, uncover so few problems that these organizations conclude that there is no reason to conduct additional research. In 1995, for example, the Section Head for Human Rights Policy, a bureau of the Canadian Department of National Defence, prepared a memo on the lifting of the gay ban. His conclusion was that “Despite all the anxiety that existed through the late 80s into the early 90s about the change in policy, here’s what the indicators show– no effect.” In Britain, the military’s own comprehensive, internal assessment at six months found that there were no indications of negative effects on recruiting levels, no mass resignations, no major reported cases of gay-bashing or harassment of sexual minorities, no major reported cases of harassment or inappropriate behavior by gay or lesbian soldiers, and no perceived effect on morale, unit cohesion or operational effectiveness. The classified report was not intended for a civilian audience, and was not written with an eye toward shifting public opinion or influencing policy debates. It concluded that the policy change produced a “marked lack of reaction.” In Australia, Bronwen Grey, a Defence Ministry official responsible for monitoring the effects of the lifting of the ban reported 8 years after the policy change that “[T]here was no increase in complaints about gay people or by gay people. There was no known increase in fights, on a ship, or in Army units or something … The recruitment figures didn’t alter.” Unbiased, external reviewers conclude exactly the same thing as these internal reports: the lifting of a gay ban does not undermine the military. The Rand Corporation, which is not a liberal or gay organization, concluded on the basis of its multi-million dollar study that lifting the gay ban would not undermine cohesion in the US military. The Harvard University journal International Security, which is the most prestigious journal in the field of military studies, published a peer-reviewed 1998 study concluding lifting the ban would not undermine cohesion. \"Should HIV+ positive soldiers be able to continue to serve?” Some would argue that HIV+ service members should not be allowed to serve in combat or combat-support roles, but that they should be allowed to serve in administrative capacities that do not entail the possibility of exposure. ”Should transsexuals be able to serve in the armed services, too?” Some would argue that anyone who is capable of doing a good job and who is willing to follow orders should be allowed to serve. >http://www.proud2serve.net/lifestyle/faq.htm This message has been edited. Last edited by: IHAWKER, Tue 10 March 2009 07:02 AM", 
        "intTime": 20090309, 
        "postID": 1, 
        "quote": "", 
        "reply": "serving Britain's armed forces Gays in the Military :: FAQs This selection of frequently asked questions is aimed towards straight service personnel; the answers to common questions may prove useful to all engaged in discussion the issues surrounding military life. “As a heterosexual man, I should not have to expose my body to a gay man in the shower.” heterosexuals are already exposing their bodies to gays in the shower. A recent study of 368 officers and enlisted personnel in the U.S. Navy and Marine Corps found that 20.1 percent personally know a homosexual service member; another 22.3 percent are unsure as to whether they know a homosexual service member. If these figures are extrapolated to the entire armed forces, then approximately 301,500 service members personally know a homosexual peer, and approximately 334,500 service members are unsure as to whether they personally know a homosexual peer. Other studies show the same thing. Finally, nothing will change in the shower after the lifting of the ban. Even though service members are already showering next to peers whom they know to be gay, the experiences of foreign militaries as well as domestic police and fire departments show that very few additional homosexuals will reveal their sexual orientation after the lifting of the ban. Hence, nothing will change in the shower after the lifting of the ban. “If heterosexual soldiers are constantly worried about being looked at in the shower by gay soldiers, they will either quit the armed forces or retaliate against gay soldiers.” Canada and Britain wrongly predicted that service members would quit after the lifting of gay bans. In a 1985 survey of 6,500 male soldiers, the Canadian Department of National Defence found that 62% of male service members would refuse to share showers, undress or sleep in the same room as a gay soldier, and that 45% would refuse to work with gays. A 1996 survey of 13,500 British service members reported that two-thirds of male respondents would not willingly serve in the military if gays and lesbians were allowed to serve. Yet when Canada and Britain lifted their gay bans, no more than a handful of people retired. “What happens if openly gay soldiers come onto a straight soldier in the showers? What happens if gay soldiers hit on each other?” This has not been a problem in foreign militaries that lifted their gay bans. Foreign militaries have found that by holding all service members to the same standards, inappropriate conduct is very rare, and that when it happens, it can be disciplined in an even-handed way. Inappropriate displays of affection by all personnel are covered in the Code of Conduct. “Anyone who has served in combat knows that battlefield conditions are not conducive for heterosexual soldiers serving alongside openly gay soldiers. Soldiers sometimes share body heat - those necessities couldn’t happen if a soldier believed someone was sexually aroused by such contact.” The British and Canadian militaries predicted that cohesion would deteriorate if gays and lesbians were allowed to serve openly, but even senior experts and officials who had predicted such deterioration are now unable to point to any problems whatsoever. In the Israeli military, a recent survey found that approximately 20% of combat soldiers know a gay peer in their unit. We can’t risk introducing romantic liaisons of any kind in war. What would happen if a gay soldier saw his lover injured on the battlefield?” The 24 foreign military forces that have lifted their bans, as well as the FBI, NSA, CIA, Secret Service, as well as police and fire departments that have lifted their bans, have found that gay and lesbian soldiers are just as loyal as everyone else, and that romantic liaisons are not a major problem. “What about [incident X] in Iraq, in which a gay British soldier compromised unit cohesion? And yet anecdotes about disciplinary problems concerning members of other groups do not mean that an entire group of people must be fired. If a Korean-American soldier undermined his unit’s cohesion, the military would not fire all Korean American service members. Isolated problems are nothing new, and the question is not whether the lifting of a gay ban might lead to a few, isolated problems. The point, rather, is whether the lifting of a gay ban has an overall impact on unit cohesion. And the evidence from 24 foreign militaries is that the lifting of a gay ban is a non-event that has no impact on performance. For a concrete example of this, read Out Sailors Recount Iraq War Experiences Alongside US Troops “Do you have any evidence from the foreign militaries that openly gay soldiers actually do serve in openly integrated units with straight soldiers? Isn’t it true with these other countries that gays stay in the closet anyway?” In the case of Israel, for example, Professor Charles Moskos, one of the principle architects of “Don’t-Ask, Don’t Tell”, testified before the Senate Armed Services Committee in 1993 that known gay soldiers were not assigned to elite combat units, did not work for intelligence units, and did not hold command positions in any branch of the Israel Defense Forces. In later work, Moskos reaffirmed that “gays are excluded from elite combat units, and most sleep at their own homes rather than in barracks”. During two appearances on National Public Radio, Moskos said that there are no gay soldiers in combat or intelligence units of the IDF who are out of the closet. To test whether Moskos’s claims were accurate, the University of California administered a survey in 2000 to soldiers in 17 the Israel Defense Forces that included the question: “Do you know (or have known in the past) a homosexual or lesbian soldier in your unit”? Of the 194 combat soldiers who responded, 42 (21.6%) responded that they know a homosexual peer in their combat unit, and 38 (19.6%) responded that they might know a homosexual peer in their combat unit. The percentages were almost equivalent for non-combat troops. To the extent that these results can be extrapolated, then roughly 28,000 of Israel’s 130,000 active duty land forces know a gay peer in their unit. Even in combat and intelligence units with known gay soldiers, however, a recent, comprehensive study published in the prestigious journal Armed Forces and Society found no evidence of a deterioration in cohesion, performance, readiness or morale. Generals, ministry officials, scholars, and NGO observers all have claimed that their presence has not eroded cohesion, performance, readiness or morale. Gay bashing - You can’t expect these boys to accept open homosexuals overnight.” In Britain, none of the twenty-five experts, officials, activists, and service members interviewed for a recent University of California report knew of a single case of gay-bashing or assault related to sexual orientation after the lifting of the ban. One military official reported that there have been no incidents related to sexual orientation reported to his office since the ban was lifted. He added: “The change in policy has been a complete non-event.” Comparisons with Racial Integration “Skin color is a benign, non-behavioral characteristic. Sexual orientation is perhaps the most profound of human behavioral characteristics. Comparison of the two is a convenient but invalid argument. Blacks do not choose to be black, but gays can choose not to act gay.” The question isn’t whether race is biological and sexuality is chosen or whether racial difference is benign while differences in sexuality are not, but whether lifting the gay ban would undermine military effectiveness. In fact, many experts believe that sexuality is chosen for some people and biologically determined for others. But again, the origin of sexuality is not what’s important. What matters is whether lifting the gay ban undermines the military. And the evidence shows decisively that it does not. “Why do gay soldiers have to tell other soldiers that they are gay?” The answer to the question is simple: honour and integrity. Whether we mean to or not, all of us regularly ask questions that make assumptions about sexuality: “Are you married?” “Do you think she’s attractive?” “Who are you taking to the dining in night / ball / social?” There is no way for gay servicemen to answer such ordinary questions without pretending to be straight oradmitting they are gay. Gay and lesbian service members do not seek the right to “flaunt” their identity or put their sexuality above the interests of the military. What they do seek, however, is the same right every other soldier has: to say who they are honestly and honorably, without getting fired or beaten up. It is just as unrealistic and dishonorable to expect gay soldiers to constantly lie about themselves to their civilian friends as to their military peers. \"Have there been any anecdotal problems of integrating to open service in other countries?” Even the leading opponents of allowing gays and lesbians into foreign militaries believe that the lifting of the bans did not damage the armed forces. Professor Christopher Dandeker, one of Britain’s most distinguished military experts, predicted that the lifting of UK’s gay ban would undermine the military. He has since concluded, however, that integration has not caused any problems. An internal government report that appraised the British change in policy characterized it as a “solid achievement … with fewer problems than might have been expected.” The assistant chief of the navy staff, Rear- Admiral James Burnell-Nugent concurred, “Although some did not welcome the change in policy, it has not caused any degree of difficulty.” Overall, the report suggests that “there has been a marked lack of reaction” to the issue of including homosexual personnel in the British Armed Services. In Australia, for example, spokesmen for the Returned and Services League, the country’s largest veterans’ group, predicted that lifting the gay ban would jeopardize morale and military performance. Eight years after Australia’s 1992 decision to lift its ban, however, the President of the Returned and Services League, Major General Peter Philips, stated that gays in the military have “not been a significant public issue. The Defence Forces have not had a lot of difficulty in this area.” Commodore R.W. Gates, whose rank is equivalent to a one-star admiral, remarked that the lifting of the ban was “an absolute non-event.” Professor Hugh Smith, a leading academicexpert on homosexuality in the Australian military, observed that when the government ordered the military to lift theban, some officers said, “Over my dead body, if this happens I’ll resign.” However, Smith said that there were nodepartures and that the change was accepted in “true military tradition.” Bronwen Grey, an official in the Australian Defence Ministry reported, “[T]here was no increase in complaints about gay people or by gay people. There was noknown increase in fights, on a ship, or in Army units or something … The recruitment figures didn’t alter.” In Canada, Steve Leveque, a civilian official in the Department of National Defence, commented that including gays and lesbians in the Canadian Forces is “not that big a deal for us … On a day-to-day basis there probably hasn’t been much of a change.” A 1995 internal report from the Canadian government on the lifting of the ban concluded, “Despite all the anxiety that existed through the late 80s into the early 90s about the change in policy, here’s what the indicators show– no effect.” In Israel, Stuart Cohen, a Professor at the Center for Strategic Studies who is recognized as a leading expert on the Israel Defense Forces, remarked, “As far as I have been able to tell, homosexuals do not constitute an issue [with respect to] unit cohesion in the IDF. In fact, the entire subject is very marginal indeed as far as this military is concerned.” Reuven Gal, the director of the Israeli Institute for Military Studies, wrote, “According to military reports, [homosexuals’] presence, whether openly or clandestinely, has not impaired the morale, cohesion, readiness, or security of any unit.” In over 100 interviews conducted by University of California researchers with both pro-gay and anti-gay experts, not one expert informant believed that the Australian, Canadian, Israeli, or British decisions to lift their gay bans undermined military performance, readiness or cohesion, led to increased difficulties in recruiting or retention, or increased the rate of HIV infection among the troops. “Isn’t it true that no foreign military has conducted rigorous internal reviews of open service 5+ years after changing their policies?” The reason the foreign militaries tend not to conduct ongoing internal reviews is that early inquiries, when problems should be most apparent, uncover so few problems that these organizations conclude that there is no reason to conduct additional research. In 1995, for example, the Section Head for Human Rights Policy, a bureau of the Canadian Department of National Defence, prepared a memo on the lifting of the gay ban. His conclusion was that “Despite all the anxiety that existed through the late 80s into the early 90s about the change in policy, here’s what the indicators show– no effect.” In Britain, the military’s own comprehensive, internal assessment at six months found that there were no indications of negative effects on recruiting levels, no mass resignations, no major reported cases of gay-bashing or harassment of sexual minorities, no major reported cases of harassment or inappropriate behavior by gay or lesbian soldiers, and no perceived effect on morale, unit cohesion or operational effectiveness. The classified report was not intended for a civilian audience, and was not written with an eye toward shifting public opinion or influencing policy debates. It concluded that the policy change produced a “marked lack of reaction.” In Australia, Bronwen Grey, a Defence Ministry official responsible for monitoring the effects of the lifting of the ban reported 8 years after the policy change that “[T]here was no increase in complaints about gay people or by gay people. There was no known increase in fights, on a ship, or in Army units or something … The recruitment figures didn’t alter.” Unbiased, external reviewers conclude exactly the same thing as these internal reports: the lifting of a gay ban does not undermine the military. The Rand Corporation, which is not a liberal or gay organization, concluded on the basis of its multi-million dollar study that lifting the gay ban would not undermine cohesion in the US military. The Harvard University journal International Security, which is the most prestigious journal in the field of military studies, published a peer-reviewed 1998 study concluding lifting the ban would not undermine cohesion. \"Should HIV+ positive soldiers be able to continue to serve?” Some would argue that HIV+ service members should not be allowed to serve in combat or combat-support roles, but that they should be allowed to serve in administrative capacities that do not entail the possibility of exposure. ”Should transsexuals be able to serve in the armed services, too?” Some would argue that anyone who is capable of doing a good job and who is willing to follow orders should be allowed to serve. >http://www.proud2serve.net/lifestyle/faq.htm This message has been edited. Last edited by: IHAWKER, Tue 10 March 2009 07:02 AM", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-09 23:22:00", 
        "title": "serving Britain's armed forces", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "I was going to honestly attempt to read this entire post but after the first couple of paragraphs I have clearly witnessed, \"fallicious narrative,\" there's an official name for it that escapes me now, but it is when a piece is written, stringing together bits of information, arranged in an order to appear to make a valid point (which in reality is unfounded). At first glance it sounds good to the uniformed but upon further inspection it's nonsense like that rediculous article written by the rear admiral ... *** Jumping from, \"[...] I should not have to expose my body to a gay man in the shower [...],\" to, \"[...] heterosexuals are already exposing their bodies to gays in the shower [...],\" to, \"[...]A recent study [...] found that 20.1 percent personally know a homosexual service member [...].\" *** 1.) Heterosexual concern. 2.) Stated fact(s) regarding current breaches of the Right to Privacy currently exploited by a disregard for sexual harassment policies based on Federal EEOC regulations, otherwise set to protect folks against sex discrimination. 3.) Then the fallicious kicker. Follow-up with some long-winded narrative about a Poll conducted regarding, \"know[ing] a homesexual service member,\" as if this has anything directly to do with community, \"berthing, bathing, or bowls.\" 4.) Then falliciously state, \"[...] Even though service members are already showering next to peers whom they know to be gay [...]\" Really? Was that the Poll question asked? I don't think so (?). 5.) Anything goes from that point on. *** It's a very sad attempt to drag a reader through a long-winded entanglement of falsely strewn together bits, culminating to the proverbial, \"And that's why GLB should serve, without anything else changing ... See, See!\" *** Sorry, I didn't read any further. When an article starts out that ignorantly, I find other things more productive to do with my time, like post against it. I think, \"FollowMeInfantry,\" made a very strong point regarding otherwise supporters for the cause losing support at the sight of these types of tactics. Some should be ashamed. *** Please save this kind of garbage for brainwashing narrative for school children [I don't mean that literally]. *** Please provide relevant and intelligent information for adult viewers. *** I mean really, this is an important cause. Just fight for legitimate rights, with legitimate premises. Adults understand that. R/S Mat *** Otherwise ...", 
        "intTime": 20090309, 
        "postID": 2, 
        "quote": "", 
        "reply": "I was going to honestly attempt to read this entire post but after the first couple of paragraphs I have clearly witnessed, \"fallicious narrative,\" there's an official name for it that escapes me now, but it is when a piece is written, stringing together bits of information, arranged in an order to appear to make a valid point (which in reality is unfounded). At first glance it sounds good to the uniformed but upon further inspection it's nonsense like that rediculous article written by the rear admiral ... *** Jumping from, \"[...] I should not have to expose my body to a gay man in the shower [...],\" to, \"[...] heterosexuals are already exposing their bodies to gays in the shower [...],\" to, \"[...]A recent study [...] found that 20.1 percent personally know a homosexual service member [...].\" *** 1.) Heterosexual concern. 2.) Stated fact(s) regarding current breaches of the Right to Privacy currently exploited by a disregard for sexual harassment policies based on Federal EEOC regulations, otherwise set to protect folks against sex discrimination. 3.) Then the fallicious kicker. Follow-up with some long-winded narrative about a Poll conducted regarding, \"know[ing] a homesexual service member,\" as if this has anything directly to do with community, \"berthing, bathing, or bowls.\" 4.) Then falliciously state, \"[...] Even though service members are already showering next to peers whom they know to be gay [...]\" Really? Was that the Poll question asked? I don't think so (?). 5.) Anything goes from that point on. *** It's a very sad attempt to drag a reader through a long-winded entanglement of falsely strewn together bits, culminating to the proverbial, \"And that's why GLB should serve, without anything else changing ... See, See!\" *** Sorry, I didn't read any further. When an article starts out that ignorantly, I find other things more productive to do with my time, like post against it. I think, \"FollowMeInfantry,\" made a very strong point regarding otherwise supporters for the cause losing support at the sight of these types of tactics. Some should be ashamed. *** Please save this kind of garbage for brainwashing narrative for school children [I don't mean that literally]. *** Please provide relevant and intelligent information for adult viewers. *** I mean really, this is an important cause. Just fight for legitimate rights, with legitimate premises. Adults understand that. R/S Mat *** Otherwise ...", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-09 23:56:00", 
        "title": "serving Britain's armed forces", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "Mat, you sound more and more like a fanatic each time you post. First you quote a bunch of academic stuff - reams of it elsewhere - and then when in a post like this with legitimate academic information is noted you 'dis' it wholesale. I think your world view is shaky. I'm surprised you don't strap a bomb on yourself and rush headlong into a Gay Pride Parade screaming \"I'm doing this for you!\"", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "Mat, you sound more and more like a fanatic each time you post. First you quote a bunch of academic stuff - reams of it elsewhere - and then when in a post like this with legitimate academic information is noted you 'dis' it wholesale. I think your world view is shaky. I'm surprised you don't strap a bomb on yourself and rush headlong into a Gay Pride Parade screaming \"I'm doing this for you!\"", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-10 00:35:00", 
        "title": "serving Britain's armed forces", 
        "userID": "reducetension"
    }, 
    {
        "content": "Equal: Ya sound like one of the FEW rational thinkers around here. Reckon ol' reduce is all hyped up on something?", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "", 
        "reply": "Equal: Ya sound like one of the FEW rational thinkers around here. Reckon ol' reduce is all hyped up on something?", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-10 08:28:00", 
        "title": "serving Britain's armed forces", 
        "userID": "19022583"
    }, 
    {
        "content": "Let's just say that - it appears to me - apparently as folks get older, like beyond the Baby Boomers - especially when they cling to their perceived education and static surroundings as false armor - they subsequently become less relevant to the fight(s) of today, and therefore, troll posts and posters, trying to further cling, to youth. Yet, still have zero points. *** My analysis of this thread starter is completely accurate. Please read it for yourself. Several posters have made similar - and accurate - arguments on other threads. *** Signed, \"raving wolf\"", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "", 
        "reply": "Let's just say that - it appears to me - apparently as folks get older, like beyond the Baby Boomers - especially when they cling to their perceived education and static surroundings as false armor - they subsequently become less relevant to the fight(s) of today, and therefore, troll posts and posters, trying to further cling, to youth. Yet, still have zero points. *** My analysis of this thread starter is completely accurate. Please read it for yourself. Several posters have made similar - and accurate - arguments on other threads. *** Signed, \"raving wolf\"", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-10 10:27:00", 
        "title": "serving Britain's armed forces", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "How many points have you got =?", 
        "intTime": 20090310, 
        "postID": 6, 
        "quote": "", 
        "reply": "How many points have you got =?", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-10 13:39:00", 
        "title": "serving Britain's armed forces", 
        "userID": "reducetension"
    }, 
    {
        "content": "- One (1), two-part main point. - Nineteen (19) subordinate - but clearly relevant points, all independantly unique. Answer: At a, \"rough,\" count, that makes twenty-one (21). *** I'm preparing for Midterms, so your pestilence is time intensive more so, yet - due to the cause at hand - I'm willing to play your fallicious games. ***", 
        "intTime": 20090310, 
        "postID": 7, 
        "quote": "", 
        "reply": "- One (1), two-part main point. - Nineteen (19) subordinate - but clearly relevant points, all independantly unique. Answer: At a, \"rough,\" count, that makes twenty-one (21). *** I'm preparing for Midterms, so your pestilence is time intensive more so, yet - due to the cause at hand - I'm willing to play your fallicious games. ***", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-10 14:03:00", 
        "title": "serving Britain's armed forces", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: “If heterosexual soldiers are constantly worried about being looked at in the shower by gay soldiers, they will either quit the armed forces or retaliate against gay soldiers.” Let's leave it at that. Let's see who has their military bearing and who does not. It reminds me of a quote: Why can't they have gay people in the army? Personally, I think they are just afraid of a thousand guys with M16s going, \"Who'd you call a f a g g o *?\"” Jon Stewart Last night on the Daily Show, Stewart had on Dr. Nathaniel Frank, senior research fellow at the Palm Center. Not only did the original designers of the DA/DT policy lie to the DoD and Executive and Congress, they fabricated scenarios that could happen if gays were \"open\" (able to serve honestly and freely) by introducing the idea of 'unit cohesion disruption'. The whole scheme was based on their uninformed bias and homophobia. They deliberately paid no attention to the research and advice. He noted, too, that much of what is considered 'military bearing' today's US military was designed by a homosexual Prussian General at the beginning of the 20th Century. So, where is the real problem with gays in the military? It's heterosexuals acting out on their personal prejudices and fears. After 13 years of mental health issues working for Army Community Services dealing with domestic violence, I can think of a number of heterosexuals who should not be serving in the military! Or even in a relationship, for that matter. Heterosexual egos and fears have been far more disruptive than anything that any homosexuals could contribute to. But, I'm not against heterosexual serving if they do their job and have some sense of self control and discipline - keep their hands to themselves when at work and such. Just like the homosexual members I have known who do their jobs.", 
        "intTime": 20090310, 
        "postID": 8, 
        "quote": "“If heterosexual soldiers are constantly worried about being looked at in the shower by gay soldiers, they will either quit the armed forces or retaliate against gay soldiers.”", 
        "reply": " Let's leave it at that. Let's see who has their military bearing and who does not. It reminds me of a quote: Why can't they have gay people in the army? Personally, I think they are just afraid of a thousand guys with M16s going, \"Who'd you call a f a g g o *?\"” Jon Stewart Last night on the Daily Show, Stewart had on Dr. Nathaniel Frank, senior research fellow at the Palm Center. Not only did the original designers of the DA/DT policy lie to the DoD and Executive and Congress, they fabricated scenarios that could happen if gays were \"open\" (able to serve honestly and freely) by introducing the idea of 'unit cohesion disruption'. The whole scheme was based on their uninformed bias and homophobia. They deliberately paid no attention to the research and advice. He noted, too, that much of what is considered 'military bearing' today's US military was designed by a homosexual Prussian General at the beginning of the 20th Century. So, where is the real problem with gays in the military? It's heterosexuals acting out on their personal prejudices and fears. After 13 years of mental health issues working for Army Community Services dealing with domestic violence, I can think of a number of heterosexuals who should not be serving in the military! Or even in a relationship, for that matter. Heterosexual egos and fears have been far more disruptive than anything that any homosexuals could contribute to. But, I'm not against heterosexual serving if they do their job and have some sense of self control and discipline - keep their hands to themselves when at work and such. Just like the homosexual members I have known who do their jobs.", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-10 15:24:00", 
        "title": "serving Britain's armed forces", 
        "userID": "reducetension"
    }, 
    {
        "content": "What Congress and our Military will be looking at when implementing the new non-discrimination policy are countries like Britain, Israel, Australia, & Canada who have successfully made the change over. What they will find when looking at these countries is that it isn't necessary to track homosexuals in order to separate them from heterosexuals in close quarter environments. Privacy will remain a priority in that it is an overall goal within our military to provide each and every member with as much privacy as feasible in a military environment. The \"One Plus One\" Plan for individual private sleeping quarters was approved by the Secretary of Defense for all of the services in 1997. These new style barracks have been replacing the old barracks for the past 11 years. Privacy is being address, and has been for the past 11 years. The argument over Equal Right to Privacy in the military is of little or no practical value this late in the game. \"http://usmilitary.about.com/od/theorderlyroom/l/bldormitories.htm", 
        "intTime": 20090310, 
        "postID": 9, 
        "quote": "", 
        "reply": "What Congress and our Military will be looking at when implementing the new non-discrimination policy are countries like Britain, Israel, Australia, & Canada who have successfully made the change over. What they will find when looking at these countries is that it isn't necessary to track homosexuals in order to separate them from heterosexuals in close quarter environments. Privacy will remain a priority in that it is an overall goal within our military to provide each and every member with as much privacy as feasible in a military environment. The \"One Plus One\" Plan for individual private sleeping quarters was approved by the Secretary of Defense for all of the services in 1997. These new style barracks have been replacing the old barracks for the past 11 years. Privacy is being address, and has been for the past 11 years. The argument over Equal Right to Privacy in the military is of little or no practical value this late in the game. \"http://usmilitary.about.com/od/theorderlyroom/l/bldormitories.htm", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-10 23:05:00", 
        "title": "serving Britain's armed forces", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "When our President, the Congress, and all the other powers at be, pull the plug on DA/DT, and replace it with inclusive policy, there main focus will be, roughly in this order (top first): - The US Constitution. - Especially, Section 8 of The US Constitution. - The US, \"Bill of Rights.\" - The Civil Rights Act of 1964, specifically Title VII. - Existing federal regulations under The Equal Employment Opportunity Commission (EEOC). - Existing DoD EEO, and military EO regulations. - Relevant existing Case Law. - Any other legal reference that supports liability mitigation. - ENDA if passed first (if not the, \"ENDA,\" subject itself). - DOMA. - The relative Laws of US States. - The Joint Chiefs. - A panel of US military experts. - Organizational Theory, like, \"Full Integration Theory.\" - The conclusions made by a team of US civilian organizational theorists. - Ideas like, \"AAVPIPS\" ( making sure you're reading). - Statistics on GLBT personnel in the DoD, and US militaries. - Statistics on GLBT civilians in the US. ... *** And when their eyes are done burning from that little coffee-driven, do-nut eating pow-wow, they'll review what other countries did, but that will be dead last when it comes to it. This is America, and, \"we,\" start with the US Constitution, what matters to Americans, and what is in the best interest of Americans - not that of special interest - then, \"we,\" work our way down. *** Don't kid yourselves, it's embarrassing.", 
        "intTime": 20090310, 
        "postID": 10, 
        "quote": "", 
        "reply": "When our President, the Congress, and all the other powers at be, pull the plug on DA/DT, and replace it with inclusive policy, there main focus will be, roughly in this order (top first): - The US Constitution. - Especially, Section 8 of The US Constitution. - The US, \"Bill of Rights.\" - The Civil Rights Act of 1964, specifically Title VII. - Existing federal regulations under The Equal Employment Opportunity Commission (EEOC). - Existing DoD EEO, and military EO regulations. - Relevant existing Case Law. - Any other legal reference that supports liability mitigation. - ENDA if passed first (if not the, \"ENDA,\" subject itself). - DOMA. - The relative Laws of US States. - The Joint Chiefs. - A panel of US military experts. - Organizational Theory, like, \"Full Integration Theory.\" - The conclusions made by a team of US civilian organizational theorists. - Ideas like, \"AAVPIPS\" ( making sure you're reading). - Statistics on GLBT personnel in the DoD, and US militaries. - Statistics on GLBT civilians in the US. ... *** And when their eyes are done burning from that little coffee-driven, do-nut eating pow-wow, they'll review what other countries did, but that will be dead last when it comes to it. This is America, and, \"we,\" start with the US Constitution, what matters to Americans, and what is in the best interest of Americans - not that of special interest - then, \"we,\" work our way down. *** Don't kid yourselves, it's embarrassing.", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-10 23:26:00", 
        "title": "serving Britain's armed forces", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "This really puts a monkey wrench in your gears doesn't it. OnePlusOne does it without tracking & separating!!! quote: The \"One Plus One\" Plan for individual private sleeping quarters was approved by the Secretary of Defense for all of the services in 1997. These new style barracks have been replacing the old barracks for the past 11 years. Privacy is being address, and has been for the past 11 years. The argument over Equal Right to Privacy in the military is of little or no practical value this late in the game. \"http://usmilitary.about.com/od/theorderlyroom/l/bldormitories.htm", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "The \"One Plus One\" Plan for individual private sleeping quarters was approved by the Secretary of Defense for all of the services in 1997. These new style barracks have been replacing the old barracks for the past 11 years. Privacy is being address, and has been for the past 11 years. The argument over Equal Right to Privacy in the military is of little or no practical value this late in the game. \"http://usmilitary.about.com/od/theorderlyroom/l/bldormitories.htm", 
        "reply": "This really puts a monkey wrench in your gears doesn't it. OnePlusOne does it without tracking & separating!!! ", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-11 00:35:00", 
        "title": "serving Britain's armed forces", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: This really puts a monkey wrench in your gears doesn't it. OnePlusOne does it without tracking & separating!!! quote: The \"One Plus One\" Plan for individual private sleeping quarters was approved by the Secretary of Defense for all of the services in 1997. These new style barracks have been replacing the old barracks for the past 11 years. Privacy is being address, and has been for the past 11 years. The argument over Equal Right to Privacy in the military is of little or no practical value this late in the game. \"http://usmilitary.about.com/od/theorderlyroom/l/bldormitories.htm This introduction of PC (political correctness) will end up neutralizing military society in much the same way it has the American civilian world leaving us as ordinary as the rest of the world.", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "Originally posted by JimCrackCorn: This really puts a monkey wrench in your gears doesn't it. OnePlusOne does it without tracking & separating!!! quote: The \"One Plus One\" Plan for individual private sleeping quarters was approved by the Secretary of Defense for all of the services in 1997. These new style barracks have been replacing the old barracks for the past 11 years. Privacy is being address, and has been for the past 11 years. The argument over Equal Right to Privacy in the military is of little or no practical value this late in the game. \"http://usmilitary.about.com/od/theorderlyroom/l/bldormitories.htm", 
        "reply": " This introduction of PC (political correctness) will end up neutralizing military society in much the same way it has the American civilian world leaving us as ordinary as the rest of the world.", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-11 08:55:00", 
        "title": "serving Britain's armed forces", 
        "userID": "19022583"
    }, 
    {
        "content": "\"JimCrackCorn,\" Question I: Is, \"One Plus One,\" complete? Question II: Is it system-wide, no exceptions? *** You're only validating my argument for, \"privacy.\" \"reducetendons,\" also validates the argument for, \"privacy.\" I think we're reaching critical mass? *** If either answers are, \"Yes,\" you personally make the argument for delaying the repealing of DA/DT.", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "", 
        "reply": "\"JimCrackCorn,\" Question I: Is, \"One Plus One,\" complete? Question II: Is it system-wide, no exceptions? *** You're only validating my argument for, \"privacy.\" \"reducetendons,\" also validates the argument for, \"privacy.\" I think we're reaching critical mass? *** If either answers are, \"Yes,\" you personally make the argument for delaying the repealing of DA/DT.", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-11 20:53:00", 
        "title": "serving Britain's armed forces", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: \"JimCrackCorn,\" Question I: Is, \"One Plus One,\" complete? Question II: Is it system-wide, no exceptions? *** You're only validating my argument for, \"privacy.\" \"reducetendons,\" also validates the argument for, \"privacy.\" I think we're reaching critical mass? *** If either answers are, \"Yes,\" you personally make the argument for delaying the repealing of DA/DT. To the contrary, I'm making the argument that your \"Right to Privacy\" policy is already being addressed by the military and has been doing so for 11 years. They are doing it for much different reasons than what you propose but the outcome is the same. As of 2005, the Army has finished about $6 billion of a scheduled $10 billion in improvements to reach the OnePlusOne standard. \"http://www.armywell-being.org/skins/WBLO/display.aspx?ModuleID=f6c229ca-03ae-4c81-8d0a-81a5a0c208f9&Action=display_user_object&CategoryID=d952a9db-faa5-43e5-a233-40847fe8ba88&ObjectID=7fc46784-c8f2-41be-9266-6966e37f6708\" That was three (3) years ago. I imagine they are above 75% complete by now, and the Army was lagging behind the other services on updating their barracks. The chance of a homosexual military member being placed in the old style barracks with a heterosexual is now what? 0.1% ???. You think the military should keep it's DADT policy or apply your AAVPIPS policy in order to keep such a small percentage of homosexual personnel separated? Even common sense would suggest that it would be overkill at this stage of the game. Wouldn't it be much easier for the military to let the leadership at the command level decide how to deal with berthing arrangements on a one-on-one basis considering how few homosexuals will affect the overall outcome? A prudent man would think so. Your questions do not deserve a \"Yes\" or \"No\", because they don't deal with the reality that there will be very few people affected because of all the changes that have been made to barracks, and those few people can be handled on a one-on-one basis if necessary.", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "Originally posted by EqualRightstoPrivacy: \"JimCrackCorn,\" Question I: Is, \"One Plus One,\" complete? Question II: Is it system-wide, no exceptions? *** You're only validating my argument for, \"privacy.\" \"reducetendons,\" also validates the argument for, \"privacy.\" I think we're reaching critical mass? *** If either answers are, \"Yes,\" you personally make the argument for delaying the repealing of DA/DT.", 
        "reply": " To the contrary, I'm making the argument that your \"Right to Privacy\" policy is already being addressed by the military and has been doing so for 11 years. They are doing it for much different reasons than what you propose but the outcome is the same. As of 2005, the Army has finished about $6 billion of a scheduled $10 billion in improvements to reach the OnePlusOne standard. \"http://www.armywell-being.org/skins/WBLO/display.aspx?ModuleID=f6c229ca-03ae-4c81-8d0a-81a5a0c208f9&Action=display_user_object&CategoryID=d952a9db-faa5-43e5-a233-40847fe8ba88&ObjectID=7fc46784-c8f2-41be-9266-6966e37f6708\" That was three (3) years ago. I imagine they are above 75% complete by now, and the Army was lagging behind the other services on updating their barracks. The chance of a homosexual military member being placed in the old style barracks with a heterosexual is now what? 0.1% ???. You think the military should keep it's DADT policy or apply your AAVPIPS policy in order to keep such a small percentage of homosexual personnel separated? Even common sense would suggest that it would be overkill at this stage of the game. Wouldn't it be much easier for the military to let the leadership at the command level decide how to deal with berthing arrangements on a one-on-one basis considering how few homosexuals will affect the overall outcome? A prudent man would think so. Your questions do not deserve a \"Yes\" or \"No\", because they don't deal with the reality that there will be very few people affected because of all the changes that have been made to barracks, and those few people can be handled on a one-on-one basis if necessary.", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-11 22:49:00", 
        "title": "serving Britain's armed forces", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "\"JimCrackCorn,\" says, \"[...] stage of the game [...].\" *** A prudent man would think, \"What are all those small-unit leaders supposed to do with all those ghosts?\" Oh, that's right, they don't know who to, \"lead,\" to privacy do they? *** Bottom line, this is nothing but, \"fallicious narrative,\" i.e., a whole lot of things, pieced together to imply something, that is really nothing. \"The Right to Privacy,\" is, \"The Right to Privacy.\" It is not a, \"%\" thing, it's an all or nothing - and the nothing is un-Constitutional, which leaves the, \"One plus One,\" discussion a, \"Call me when you're done!\" *** By refusing to answer my questions, you solidify (\"Hide,\" or, \"Edit,\" Post always available) your position, that you have none of any rational, logic, or relevance. The, \"One Plus One,\" initiative is a stated, \"Quality of Life,\" initiative, which has everything to do with, \"The Right to Privacy,\" validated here once again. *** I like you as a person, \"JimCrackCorn,\" and you're really funny, but you dig deep gaping holes for your cause.", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "", 
        "reply": "\"JimCrackCorn,\" says, \"[...] stage of the game [...].\" *** A prudent man would think, \"What are all those small-unit leaders supposed to do with all those ghosts?\" Oh, that's right, they don't know who to, \"lead,\" to privacy do they? *** Bottom line, this is nothing but, \"fallicious narrative,\" i.e., a whole lot of things, pieced together to imply something, that is really nothing. \"The Right to Privacy,\" is, \"The Right to Privacy.\" It is not a, \"%\" thing, it's an all or nothing - and the nothing is un-Constitutional, which leaves the, \"One plus One,\" discussion a, \"Call me when you're done!\" *** By refusing to answer my questions, you solidify (\"Hide,\" or, \"Edit,\" Post always available) your position, that you have none of any rational, logic, or relevance. The, \"One Plus One,\" initiative is a stated, \"Quality of Life,\" initiative, which has everything to do with, \"The Right to Privacy,\" validated here once again. *** I like you as a person, \"JimCrackCorn,\" and you're really funny, but you dig deep gaping holes for your cause.", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-11 23:05:00", 
        "title": "serving Britain's armed forces", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: \"JimCrackCorn,\" says, \"[...] stage of the game [...].\" *** A prudent man would think, \"What are all those small-unit leaders supposed to do with all those ghosts?\" Oh, that's right, they don't know who to, \"lead,\" to privacy do they? Leadership at the command level will only get involved when a problem arises. With the odds being against a heterosexual & homosexual rooming together in an old style barracks, it can be handled at the local level. That's pretty easy isn't it? *** Bottom line, this is nothing but, \"fallicious narrative,\" i.e., a whole lot of things, pieced together to imply something, that is really nothing. \"The Right to Privacy,\" is, \"The Right to Privacy.\" It is not a, \"%\" thing, it's an all or nothing - and the nothing is un-Constitutional, which leaves the, \"One plus One,\" discussion a, \"Call me when you're done!\" You say \"it's all or nothing\" now, but in your AAVIPPS proposal you recommend that troops in the field and Naval ships apply the \"prudent man rules\" where homosexuals & heterosexuals live together but wear underwear in berthing areas and keep their eyes forward in showers. That isn't \"all or nothing\", it's a practical compromise that's workable. And at the command level they can easily find a solution if and when the need arises. You and I both know you will not give up on your \"Right to Privacy\" policy, you've worked for years on it and it would be sacrilege to discard after all this time. The OnePlusOne rooms are close to completion and your privacy policy is disintegrating right before your eyes because the military has been updating the barracks for 11 years already. *** By refusing to answer my questions, you solidify (\"Hide,\" or, \"Edit,\" Post always available) your position, that you have none of any rational, logic, or relevance. I guess those links weren't rational, logical or relevant enough. They answer all your questions for you, mainly, your privacy policy isn't needed, the military has been addressing it for the last 11 years. The, \"One Plus One,\" initiative is a stated, \"Quality of Life,\" initiative, which has everything to do with, \"The Right to Privacy,\" validated here once again. And it invalidates the need for tracking & separating homosexuals, which makes your Right to Privacy designed to track and separate homosexuals, a totally unecessary requirement. *** I like you as a person, \"JimCrackCorn,\" and you're really funny, but you dig deep gaping holes for your cause. Na, the holes are very small and easily manageable at the command level. I'm just showing you why your Right to Privacy has already been addressed by the military and trying to get you to understand what you're attempting to achieve is no longer necessary. I wish you the best of luck in all your other endeavors.", 
        "intTime": 20090312, 
        "postID": 16, 
        "quote": "Originally posted by EqualRightstoPrivacy: \"JimCrackCorn,\" says, \"[...] stage of the game [...].\" *** A prudent man would think, \"What are all those small-unit leaders supposed to do with all those ghosts?\" Oh, that's right, they don't know who to, \"lead,\" to privacy do they? Leadership at the command level will only get involved when a problem arises. With the odds being against a heterosexual & homosexual rooming together in an old style barracks, it can be handled at the local level. That's pretty easy isn't it? *** Bottom line, this is nothing but, \"fallicious narrative,\" i.e., a whole lot of things, pieced together to imply something, that is really nothing. \"The Right to Privacy,\" is, \"The Right to Privacy.\" It is not a, \"%\" thing, it's an all or nothing - and the nothing is un-Constitutional, which leaves the, \"One plus One,\" discussion a, \"Call me when you're done!\" You say \"it's all or nothing\" now, but in your AAVIPPS proposal you recommend that troops in the field and Naval ships apply the \"prudent man rules\" where homosexuals & heterosexuals live together but wear underwear in berthing areas and keep their eyes forward in showers. That isn't \"all or nothing\", it's a practical compromise that's workable. And at the command level they can easily find a solution if and when the need arises. You and I both know you will not give up on your \"Right to Privacy\" policy, you've worked for years on it and it would be sacrilege to discard after all this time. The OnePlusOne rooms are close to completion and your privacy policy is disintegrating right before your eyes because the military has been updating the barracks for 11 years already. *** By refusing to answer my questions, you solidify (\"Hide,\" or, \"Edit,\" Post always available) your position, that you have none of any rational, logic, or relevance. I guess those links weren't rational, logical or relevant enough. They answer all your questions for you, mainly, your privacy policy isn't needed, the military has been addressing it for the last 11 years. The, \"One Plus One,\" initiative is a stated, \"Quality of Life,\" initiative, which has everything to do with, \"The Right to Privacy,\" validated here once again. And it invalidates the need for tracking & separating homosexuals, which makes your Right to Privacy designed to track and separate homosexuals, a totally unecessary requirement. *** I like you as a person, \"JimCrackCorn,\" and you're really funny, but you dig deep gaping holes for your cause. Na, the holes are very small and easily manageable at the command level. I'm just showing you why your Right to Privacy has already been addressed by the military and trying to get you to understand what you're attempting to achieve is no longer necessary. I wish you the best of luck in all your other endeavors.", 
        "reply": "", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-12 02:28:00", 
        "title": "serving Britain's armed forces", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "Very good Jim! Certainly the two military bases I have been working at the past 16 years have made huge inroads to \"privacy\" in building some very impressive quarters for solders and airmen! In my days aboard an old ocean-going tug in the CG (1960s) about 40 of us slept in one berthing area, some stacked five high in ancient canvas racks, no one would have given any thought to ask for privacy! So today's standards sometimes surprise me.... they even have outside private entrances to apartment like settings for even the lowly of the low E's! Very nice! I have heard no complaints or even concerns from active duty people concerning this \"privacy\" (aka \"shower) issue though I know it there among a few. Only the vets. bring it up from time to time but the active duty generally dismiss it as irrelevant and much of that is due to the logic you so politely point out to those who would compel people to \"confess\" their sexual orientation against their will. If a gay service member wants to 'announce' their sexual preferences, so be it, but only of their own volition. That's personal privacy. I hope it goes well for our armed services personnel who happen to be gay. This was an issue I paid very little attention to until three years ago. Since then I have been very impressed with the quality of the gay/lesbian service members I have met, both active and veterans. Thanks! RT", 
        "intTime": 20090312, 
        "postID": 17, 
        "quote": "", 
        "reply": "Very good Jim! Certainly the two military bases I have been working at the past 16 years have made huge inroads to \"privacy\" in building some very impressive quarters for solders and airmen! In my days aboard an old ocean-going tug in the CG (1960s) about 40 of us slept in one berthing area, some stacked five high in ancient canvas racks, no one would have given any thought to ask for privacy! So today's standards sometimes surprise me.... they even have outside private entrances to apartment like settings for even the lowly of the low E's! Very nice! I have heard no complaints or even concerns from active duty people concerning this \"privacy\" (aka \"shower) issue though I know it there among a few. Only the vets. bring it up from time to time but the active duty generally dismiss it as irrelevant and much of that is due to the logic you so politely point out to those who would compel people to \"confess\" their sexual orientation against their will. If a gay service member wants to 'announce' their sexual preferences, so be it, but only of their own volition. That's personal privacy. I hope it goes well for our armed services personnel who happen to be gay. This was an issue I paid very little attention to until three years ago. Since then I have been very impressed with the quality of the gay/lesbian service members I have met, both active and veterans. Thanks! RT", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-12 08:23:00", 
        "title": "serving Britain's armed forces", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Very good Jim! Certainly the two military bases I have been working at the past 16 years have made huge inroads to \"privacy\" in building some very impressive quarters for solders and airmen! In my days aboard an old ocean-going tug in the CG (1960s) about 40 of us slept in one berthing area, some stacked five high in ancient canvas racks, no one would have given any thought to ask for privacy! So today's standards sometimes surprise me.... they even have outside private entrances to apartment like settings for even the lowly of the low E's! Very nice! I have heard no complaints or even concerns from active duty people concerning this \"privacy\" (aka \"shower) issue though I know it there among a few. Only the vets. bring it up from time to time but the active duty generally dismiss it as irrelevant and much of that is due to the logic you so politely point out to those who would compel people to \"confess\" their sexual orientation against their will. If a gay service member wants to 'announce' their sexual preferences, so be it, but only of their own volition. That's personal privacy. I hope it goes well for our armed services personnel who happen to be gay. This was an issue I paid very little attention to until three years ago. Since then I have been very impressed with the quality of the gay/lesbian service members I have met, both active and veterans. Thanks! RT I never had the pleasure of sleeping in one of those old canvas racks but there were a few of them still on the USS Oriskany when I served aboard her. One of my shipmates that slept on a canvas rack told me that he had to adjust the straps frequently in order to keep it tight enough to sleep in. The sagging canvas would keep him from rolling out of the rack during \"High Winds & Heavy Seas\", so it served an additional purpose (smile). I had to put an extra pillow between me and the edge of the metal rack to keep my body anchored to the mattress on those nights when the seas were not cooperating with us. I've always seen the military as an adaptive organization where change is a constant part of military life. Most of us found it a challenging environment and we adjusted quickly to diversity. We dealt with personal issues & biases at the local level and protected our own, meaning we kept it in house. Like you, during my time in the military we were not concerned with nor thought of privacy as being some inalienable right, anyone who'd complain about such foolishness would have been given additional duties to help occupy his overactive imagination. The military recognizes that the younger generation will more readily join and stay in the military if they are provided the same comforts as they'd receive in the civilian community. A private apartment style barracks was the ideal solution. What surprises me is how far along they are in switching to the new OnePlusOne barracks, I knew they were trudging along with the project but it hadn't crossed my mind that they were 60% complete back in 2005. The base near where I live has modern apartment style barracks and it's a training base, so I should have guessed if a training base has the new style, then the regular military installations ought to be close to finishing also. It's a pleasure reading your energized posts. Respectfully, Jim", 
        "intTime": 20090312, 
        "postID": 18, 
        "quote": "Originally posted by reducetension: Very good Jim! Certainly the two military bases I have been working at the past 16 years have made huge inroads to \"privacy\" in building some very impressive quarters for solders and airmen! In my days aboard an old ocean-going tug in the CG (1960s) about 40 of us slept in one berthing area, some stacked five high in ancient canvas racks, no one would have given any thought to ask for privacy! So today's standards sometimes surprise me.... they even have outside private entrances to apartment like settings for even the lowly of the low E's! Very nice! I have heard no complaints or even concerns from active duty people concerning this \"privacy\" (aka \"shower) issue though I know it there among a few. Only the vets. bring it up from time to time but the active duty generally dismiss it as irrelevant and much of that is due to the logic you so politely point out to those who would compel people to \"confess\" their sexual orientation against their will. If a gay service member wants to 'announce' their sexual preferences, so be it, but only of their own volition. That's personal privacy. I hope it goes well for our armed services personnel who happen to be gay. This was an issue I paid very little attention to until three years ago. Since then I have been very impressed with the quality of the gay/lesbian service members I have met, both active and veterans. Thanks! RT", 
        "reply": " I never had the pleasure of sleeping in one of those old canvas racks but there were a few of them still on the USS Oriskany when I served aboard her. One of my shipmates that slept on a canvas rack told me that he had to adjust the straps frequently in order to keep it tight enough to sleep in. The sagging canvas would keep him from rolling out of the rack during \"High Winds & Heavy Seas\", so it served an additional purpose (smile). I had to put an extra pillow between me and the edge of the metal rack to keep my body anchored to the mattress on those nights when the seas were not cooperating with us. I've always seen the military as an adaptive organization where change is a constant part of military life. Most of us found it a challenging environment and we adjusted quickly to diversity. We dealt with personal issues & biases at the local level and protected our own, meaning we kept it in house. Like you, during my time in the military we were not concerned with nor thought of privacy as being some inalienable right, anyone who'd complain about such foolishness would have been given additional duties to help occupy his overactive imagination. The military recognizes that the younger generation will more readily join and stay in the military if they are provided the same comforts as they'd receive in the civilian community. A private apartment style barracks was the ideal solution. What surprises me is how far along they are in switching to the new OnePlusOne barracks, I knew they were trudging along with the project but it hadn't crossed my mind that they were 60% complete back in 2005. The base near where I live has modern apartment style barracks and it's a training base, so I should have guessed if a training base has the new style, then the regular military installations ought to be close to finishing also. It's a pleasure reading your energized posts. Respectfully, Jim", 
        "threadID": "27819558_1690004712001", 
        "time": "2009-03-12 22:05:00", 
        "title": "serving Britain's armed forces", 
        "userID": "JimCrackCorn"
    }
]