[
    {
        "content": "Maryland Gay Couples Get Tax Break The Maryland general assembly on Monday approved a measure that will exempt same-sex domestic partners who co-own a home from paying state inheritance tax when property changes hands. Current state law exempts spouses, children, parents, grandparents, stepchildren or stepparents, and siblings from paying state inheritance tax when property changes hands. All others pay a 10% tax on the property's value. The measure, which passed the senate by a vote of 27-18, adds domestic partners to the list. The bill is awaiting the signature of Gov. Martin O’Malley, who intends to sign it. >http://www.advocate.com/news_detail_ektid78951.asp Since Maryland doesn't allow civil unions or any other recognition of gay marriages how do you prove you are someone's domestic partner?", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "Maryland Gay Couples Get Tax Break The Maryland general assembly on Monday approved a measure that will exempt same-sex domestic partners who co-own a home from paying state inheritance tax when property changes hands. Current state law exempts spouses, children, parents, grandparents, stepchildren or stepparents, and siblings from paying state inheritance tax when property changes hands. All others pay a 10% tax on the property's value. The measure, which passed the senate by a vote of 27-18, adds domestic partners to the list. The bill is awaiting the signature of Gov. Martin O’Malley, who intends to sign it. >http://www.advocate.com/news_detail_ektid78951.asp Since Maryland doesn't allow civil unions or any other recognition of gay marriages how do you prove you are someone's domestic partner?", 
        "threadID": "27819558_3640077022001", 
        "time": "2009-04-14 23:21:00", 
        "title": "Maryland Gay Couples Get Tax Break", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Maryland Gay Couples Get Tax Break Since Maryland doesn't allow civil unions or any other recognition of gay marriages how do you prove you are someone's domestic partner? I'm sure that issue will come up in that state now, so let the discussions begin.", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "Originally posted by IHAWKER: Maryland Gay Couples Get Tax Break Since Maryland doesn't allow civil unions or any other recognition of gay marriages how do you prove you are someone's domestic partner?", 
        "reply": " I'm sure that issue will come up in that state now, so let the discussions begin.", 
        "threadID": "27819558_3640077022001", 
        "time": "2009-04-15 08:17:00", 
        "title": "Maryland Gay Couples Get Tax Break", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Where in the constitution does it give authority for any group to be subsidized?", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "", 
        "reply": "Where in the constitution does it give authority for any group to be subsidized?", 
        "threadID": "27819558_3640077022001", 
        "time": "2009-04-15 08:35:00", 
        "title": "Maryland Gay Couples Get Tax Break", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Where in the constitution does it give authority for any group to be subsidized? What part of co-owning the property do you not understand?", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "Originally posted by soscorpio: Where in the constitution does it give authority for any group to be subsidized?", 
        "reply": " What part of co-owning the property do you not understand?", 
        "threadID": "27819558_3640077022001", 
        "time": "2009-04-15 08:55:00", 
        "title": "Maryland Gay Couples Get Tax Break", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Where in the constitution does it give authority for any group to be subsidized? I agree. Nowhere in the Constitution does it mandate that we subsidize any group. I think that all those str8 married couples should have to give up their subsidy...AND it should be retroactive. Tax them for all of that property that was willed to them. The revenue from just the last 50 years should be enough to dig us out of this fiscal mess. You DID say NO group is subsidized, right?", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "Originally posted by soscorpio: Where in the constitution does it give authority for any group to be subsidized?", 
        "reply": " I agree. Nowhere in the Constitution does it mandate that we subsidize any group. I think that all those str8 married couples should have to give up their subsidy...AND it should be retroactive. Tax them for all of that property that was willed to them. The revenue from just the last 50 years should be enough to dig us out of this fiscal mess. You DID say NO group is subsidized, right?", 
        "threadID": "27819558_3640077022001", 
        "time": "2009-04-15 08:55:00", 
        "title": "Maryland Gay Couples Get Tax Break", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Where in the constitution does it give authority for any group to be subsidized? Well, not that it pertains exactly to this 'group' but doesn't the Constitution mention compensating civilians if the military billets or uses their homes? (I'm too lazy this early in the am to look it up.)", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "Originally posted by soscorpio: Where in the constitution does it give authority for any group to be subsidized?", 
        "reply": " Well, not that it pertains exactly to this 'group' but doesn't the Constitution mention compensating civilians if the military billets or uses their homes? (I'm too lazy this early in the am to look it up.)", 
        "threadID": "27819558_3640077022001", 
        "time": "2009-04-15 08:58:00", 
        "title": "Maryland Gay Couples Get Tax Break", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Maryland Gay Couples Get Tax Break The Maryland general assembly on Monday approved a measure that will exempt same-sex domestic partners who co-own a home from paying state inheritance tax when property changes hands. THERE IS A CRACK (PUN INTENDED) IN THE DOOR FOR OBAMA TO HIT PEOPLE WITH A CAPITAL GAINS TAX. GOD FORBID YOU MAKE SOME MONEY. As an aside; If you are a homosexual our nations founders would be rolling over in their graves at the direction and the reasoning you people use for your twisted thinking and perverse desires. Current state law exempts spouses, children, parents, grandparents, stepchildren or stepparents, and siblings from paying state inheritance tax when property changes hands. All others pay a 10% tax on the property's value. The measure, which passed the senate by a vote of 27-18, adds domestic partners to the list. The bill is awaiting the signature of Gov. Martin O’Malley, who intends to sign it. >http://www.advocate.com/news_detail_ektid78951.asp Since Maryland doesn't allow civil unions or any other recognition of gay marriages how do you prove you are someone's domestic partner?", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "Originally posted by IHAWKER: Maryland Gay Couples Get Tax Break The Maryland general assembly on Monday approved a measure that will exempt same-sex domestic partners who co-own a home from paying state inheritance tax when property changes hands. THERE IS A CRACK (PUN INTENDED) IN THE DOOR FOR OBAMA TO HIT PEOPLE WITH A CAPITAL GAINS TAX. GOD FORBID YOU MAKE SOME MONEY. As an aside; If you are a homosexual our nations founders would be rolling over in their graves at the direction and the reasoning you people use for your twisted thinking and perverse desires. Current state law exempts spouses, children, parents, grandparents, stepchildren or stepparents, and siblings from paying state inheritance tax when property changes hands. All others pay a 10% tax on the property's value. The measure, which passed the senate by a vote of 27-18, adds domestic partners to the list. The bill is awaiting the signature of Gov. Martin O’Malley, who intends to sign it. >http://www.advocate.com/news_detail_ektid78951.asp Since Maryland doesn't allow civil unions or any other recognition of gay marriages how do you prove you are someone's domestic partner?", 
        "reply": "", 
        "threadID": "27819558_3640077022001", 
        "time": "2009-04-15 13:32:00", 
        "title": "Maryland Gay Couples Get Tax Break", 
        "userID": "5727609"
    }
]