[
    {
        "content": "CNN Questions Obama's \"Gay\" Silence On the heels of a New York Times article calling into question Barack Obama's relative silence on gay issues in his first few months in office, CNN has launched its own investigation. CNN senior political correspondent Candy Crowley says this has been a sensitive issue for all politicians -- but she suggests Obama is going to face an uphill battle if he wants to distance himself from the mounting debate over marriage equality. CNN video at ... >>>http://www.advocate.com/news_detail_ektid83039.asp This message has been edited. Last edited by: IHAWKER, Sun 10 May 2009 03:59 PM", 
        "intTime": 20090507, 
        "postID": 1, 
        "quote": "", 
        "reply": "CNN Questions Obama's \"Gay\" Silence On the heels of a New York Times article calling into question Barack Obama's relative silence on gay issues in his first few months in office, CNN has launched its own investigation. CNN senior political correspondent Candy Crowley says this has been a sensitive issue for all politicians -- but she suggests Obama is going to face an uphill battle if he wants to distance himself from the mounting debate over marriage equality. CNN video at ... >>>http://www.advocate.com/news_detail_ektid83039.asp This message has been edited. Last edited by: IHAWKER, Sun 10 May 2009 03:59 PM", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-07 21:33:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did.", 
        "intTime": 20090508, 
        "postID": 2, 
        "quote": "", 
        "reply": "Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-08 05:41:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "I have no serious complaints as yet either, but I am monitoring the situation very closely. I agree that there are far more important and urgent issues at the moment, but being DADT was a campaign promise I do not expect this to be fully ignored. With all that is going on with gay marriage and other gay related things it seems that it would not be expecting too much at this point to at least have a little lip service from the President if nothing else. I am willing to be patient until mid 2010, but if nothing significant has happened by then I think it would be time to cal l the President out on his promise of DADT.", 
        "intTime": 20090508, 
        "postID": 3, 
        "quote": "", 
        "reply": "I have no serious complaints as yet either, but I am monitoring the situation very closely. I agree that there are far more important and urgent issues at the moment, but being DADT was a campaign promise I do not expect this to be fully ignored. With all that is going on with gay marriage and other gay related things it seems that it would not be expecting too much at this point to at least have a little lip service from the President if nothing else. I am willing to be patient until mid 2010, but if nothing significant has happened by then I think it would be time to cal l the President out on his promise of DADT.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-08 11:30:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "View From the Hill An Advocate.com exclusive posted May 8, 2009 If there was ever a sign that the culture was more ready to advance on LGBT issues than Washington’s politicians, it was the virtual deluge of coverage from nearly every corner of mainstream media this week. The cascade was dizzying: The New York Times, The Washington Post, CNN, MSNBC, Politico, The Hill. Meanwhile, back at the White House, press secretary Robert Gibbs was asked one question about whether the president had a reaction to Maine legalizing same-sex marriage and he nearly ducked behind his podium. \"No, I think the president's position on same-sex marriages has been talked about and discussed,\" he replied curtly, seemingly hoping to move away from the topic as quickly as possible. As Democratic analyst Paul Begala noted during Thursday's CNN segment on LGBT issues, \"The gay rights movement and marriage equality is advancing very nicely, thank you very much, without Barack Obama's help.\" Begala also predicted that the president would eventually come around to supporting marriage equality, but not any time soon. Full article found at ... >>>http://www.advocate.com/exclusive_detail_ektid83220.asp Interesting read.", 
        "intTime": 20090508, 
        "postID": 4, 
        "quote": "", 
        "reply": "View From the Hill An Advocate.com exclusive posted May 8, 2009 If there was ever a sign that the culture was more ready to advance on LGBT issues than Washington’s politicians, it was the virtual deluge of coverage from nearly every corner of mainstream media this week. The cascade was dizzying: The New York Times, The Washington Post, CNN, MSNBC, Politico, The Hill. Meanwhile, back at the White House, press secretary Robert Gibbs was asked one question about whether the president had a reaction to Maine legalizing same-sex marriage and he nearly ducked behind his podium. \"No, I think the president's position on same-sex marriages has been talked about and discussed,\" he replied curtly, seemingly hoping to move away from the topic as quickly as possible. As Democratic analyst Paul Begala noted during Thursday's CNN segment on LGBT issues, \"The gay rights movement and marriage equality is advancing very nicely, thank you very much, without Barack Obama's help.\" Begala also predicted that the president would eventually come around to supporting marriage equality, but not any time soon. Full article found at ... >>>http://www.advocate.com/exclusive_detail_ektid83220.asp Interesting read.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-08 20:59:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Will 'Don't Ask' Be Back on the Agenda? With the mountain of issues piling up on the President's plate right now, among the words he'd least like to hear are probably these four: \"don't ask, don't tell.\" President Clinton learned the hard way that this issue has the potential to derail agendas and stoke culture wars. Robert Gibbs confirmed in January that it's Obama's intention to end the policy, but amid significant economic and international challenges, it simply isn't a priority. General Jones recently told the Washington Post he'd advised Obama to avoid the issue for now. But the White House might not get to dictate the timing on this one. There's a small storm brewing in the blogosphere and on cable TV over Dan Choi, an officer in the National Guard who received notice that he'll be discharged after admitting he is gay on the Rachel Maddow Show in March. Choi, who recently returned from a tour in Iraq, is a fluent Arabic speaker - a skill the military needs and sorely lacks. Read the full article at ... >>>http://blog.newsweek.com/blogs/thegaggle/archive/2009/05/08/will-don-t-ask-be-back-on-the-agenda.aspx", 
        "intTime": 20090510, 
        "postID": 5, 
        "quote": "", 
        "reply": "Will 'Don't Ask' Be Back on the Agenda? With the mountain of issues piling up on the President's plate right now, among the words he'd least like to hear are probably these four: \"don't ask, don't tell.\" President Clinton learned the hard way that this issue has the potential to derail agendas and stoke culture wars. Robert Gibbs confirmed in January that it's Obama's intention to end the policy, but amid significant economic and international challenges, it simply isn't a priority. General Jones recently told the Washington Post he'd advised Obama to avoid the issue for now. But the White House might not get to dictate the timing on this one. There's a small storm brewing in the blogosphere and on cable TV over Dan Choi, an officer in the National Guard who received notice that he'll be discharged after admitting he is gay on the Rachel Maddow Show in March. Choi, who recently returned from a tour in Iraq, is a fluent Arabic speaker - a skill the military needs and sorely lacks. Read the full article at ... >>>http://blog.newsweek.com/blogs/thegaggle/archive/2009/05/08/will-don-t-ask-be-back-on-the-agenda.aspx", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-10 12:05:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "UPDATE \"Preliminary\" talks held on U.S. military gay policy WASHINGTON (Reuters) - The Obama administration is holding \"preliminary discussions\" about changing the military's prohibition against openly gay service members, White House National Security Advisor James Jones said on Sunday. President Barack Obama pledged during the presidential campaign to change the policy. But the issue has been on the back-burner as the White House tackles other issues such as the economy and the wars in Iraq and Afghanistan. Jones said he does not know if the policy, known as \"don't ask, don't tell,\" will be overturned, and indicated a cautious approach. \"We have a lot on our plate right now. It has to be teed up at the right time ... to do this the right way,\" Jones said on the ABC program \"This Week.\" Asked if the policy will be overturned, Jones said, \"I don't know. ... The president has said that he is in favor of that. We'll just wait. We'll have to wait and see.\" Full article at ... >>>http://uk.reuters.com/article/usPoliticsNews/idUKTRE5491OQ20090510", 
        "intTime": 20090510, 
        "postID": 6, 
        "quote": "", 
        "reply": "UPDATE \"Preliminary\" talks held on U.S. military gay policy WASHINGTON (Reuters) - The Obama administration is holding \"preliminary discussions\" about changing the military's prohibition against openly gay service members, White House National Security Advisor James Jones said on Sunday. President Barack Obama pledged during the presidential campaign to change the policy. But the issue has been on the back-burner as the White House tackles other issues such as the economy and the wars in Iraq and Afghanistan. Jones said he does not know if the policy, known as \"don't ask, don't tell,\" will be overturned, and indicated a cautious approach. \"We have a lot on our plate right now. It has to be teed up at the right time ... to do this the right way,\" Jones said on the ABC program \"This Week.\" Asked if the policy will be overturned, Jones said, \"I don't know. ... The president has said that he is in favor of that. We'll just wait. We'll have to wait and see.\" Full article at ... >>>http://uk.reuters.com/article/usPoliticsNews/idUKTRE5491OQ20090510", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-10 16:06:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it.", 
        "intTime": 20090512, 
        "postID": 7, 
        "quote": "Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did.", 
        "reply": " If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-12 12:06:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by 21194237: quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it. I know exactly why gays have been treated like second class citizens for centuries and continue to be treated like dirt today. It's because fundamentalist religion in this country has far too much sway. It's because ignorant people can still be convinced that sexual orientation is a \"deviant choice.\" It's because ignorant people still believe that gays are automatically HIV-infected, promiscuous, drug-using criminals who will rape children and sexually harass straight people. And people are dumb enough to keep believing those lies. That's why it's taken so long for gays to gain any footing in the realm of equal rights. However, when the entire economic system is cracking at the seams, and North Korea is launching missiles, and a pandemic is looming... those are things that could impact EVERYONE. Gays, straights, troops, civilians, the elderly, young children. Of course I think marriage rights and other equal rights for gays are important? Absolutely. Do I consider them to be pressing issues that SHOULD be fixed immediately? Yes. However, I'm a rational person who understands how Americans as a whole react to issues of equal rights for gays. It breaks out into a hissing and spitting match of people snarling and screaming at each other. The religious right has a field day throwing Bible verses at people, and politicians do this ridiculous tap-dance to make everyone happy without committing to anything, and everyone ignores every other important issue happening at any given time. It would be nice if people could just be rational about it, but since when have people been rational?", 
        "intTime": 20090512, 
        "postID": 8, 
        "quote": "Originally posted by 21194237: quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it.", 
        "reply": " I know exactly why gays have been treated like second class citizens for centuries and continue to be treated like dirt today. It's because fundamentalist religion in this country has far too much sway. It's because ignorant people can still be convinced that sexual orientation is a \"deviant choice.\" It's because ignorant people still believe that gays are automatically HIV-infected, promiscuous, drug-using criminals who will rape children and sexually harass straight people. And people are dumb enough to keep believing those lies. That's why it's taken so long for gays to gain any footing in the realm of equal rights. However, when the entire economic system is cracking at the seams, and North Korea is launching missiles, and a pandemic is looming... those are things that could impact EVERYONE. Gays, straights, troops, civilians, the elderly, young children. Of course I think marriage rights and other equal rights for gays are important? Absolutely. Do I consider them to be pressing issues that SHOULD be fixed immediately? Yes. However, I'm a rational person who understands how Americans as a whole react to issues of equal rights for gays. It breaks out into a hissing and spitting match of people snarling and screaming at each other. The religious right has a field day throwing Bible verses at people, and politicians do this ridiculous tap-dance to make everyone happy without committing to anything, and everyone ignores every other important issue happening at any given time. It would be nice if people could just be rational about it, but since when have people been rational?", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-12 13:21:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not.", 
        "intTime": 20090512, 
        "postID": 9, 
        "quote": "Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals?", 
        "reply": " That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-12 16:06:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "reducetension"
    }, 
    {
        "content": "White House Won't End Dismissals Of Gay Service Members White House spokesman Robert Gibbs today indicated that President Obama will not intervene to keep gay servicemembers from being dismissed from the military, despite his vow to end the \"Don't Ask, Don't Tell\" policy. Gibbs said \"the policy isn’t working for our national interests,\" but added that ending it will \"require more than the snapping of one's fingers.\" \"To get fundamental reform in this instance requires a legislative vehicle,\" Gibbs said. \"The president made a promise to change this policy; he will work with the Joints Chiefs of Staff, the administration and with Congress to ensure that we have a policy that works for our national interests.\" Noted a reporter at the briefing: \"He is the Commander-in-Chief. I mean, if the president and the Secretary of Defense can bring about a new leadership in Afghanistan, replace the commanding general there, couldn't the president and the secretary of defense delay any more people getting fired under 'don't ask, don't tell'?\" Responded Gibbs: \"Well, there have been discussions about the best way to move forward, and the only sustainable way to do that is through -- sustainable and durable way -- is through legislation, which the president has promised and has continued to work for.\" >>>http://www.cbsnews.com/blogs/2009/05/12/politics/politicalhotsheet/entry5009420.shtml", 
        "intTime": 20090512, 
        "postID": 10, 
        "quote": "", 
        "reply": "White House Won't End Dismissals Of Gay Service Members White House spokesman Robert Gibbs today indicated that President Obama will not intervene to keep gay servicemembers from being dismissed from the military, despite his vow to end the \"Don't Ask, Don't Tell\" policy. Gibbs said \"the policy isn’t working for our national interests,\" but added that ending it will \"require more than the snapping of one's fingers.\" \"To get fundamental reform in this instance requires a legislative vehicle,\" Gibbs said. \"The president made a promise to change this policy; he will work with the Joints Chiefs of Staff, the administration and with Congress to ensure that we have a policy that works for our national interests.\" Noted a reporter at the briefing: \"He is the Commander-in-Chief. I mean, if the president and the Secretary of Defense can bring about a new leadership in Afghanistan, replace the commanding general there, couldn't the president and the secretary of defense delay any more people getting fired under 'don't ask, don't tell'?\" Responded Gibbs: \"Well, there have been discussions about the best way to move forward, and the only sustainable way to do that is through -- sustainable and durable way -- is through legislation, which the president has promised and has continued to work for.\" >>>http://www.cbsnews.com/blogs/2009/05/12/politics/politicalhotsheet/entry5009420.shtml", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-12 18:08:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by 21194237: quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it. I know exactly why gays have been treated like second class citizens for centuries and continue to be treated like dirt today. It's because fundamentalist religion in this country has far too much sway. It's because ignorant people can still be convinced that sexual orientation is a \"deviant choice.\" It's because ignorant people still believe that gays are automatically HIV-infected, promiscuous, drug-using criminals who will rape children and sexually harass straight people. And people are dumb enough to keep believing those lies. That's why it's taken so long for gays to gain any footing in the realm of equal rights. However, when the entire economic system is cracking at the seams, and North Korea is launching missiles, and a pandemic is looming... those are things that could impact EVERYONE. Gays, straights, troops, civilians, the elderly, young children. Of course I think marriage rights and other equal rights for gays are important? Absolutely. Do I consider them to be pressing issues that SHOULD be fixed immediately? Yes. However, I'm a rational person who understands how Americans as a whole react to issues of equal rights for gays. It breaks out into a hissing and spitting match of people snarling and screaming at each other. The religious right has a field day throwing Bible verses at people, and politicians do this ridiculous tap-dance to make everyone happy without committing to anything, and everyone ignores every other important issue happening at any given time. It would be nice if people could just be rational about it, but since when have people been rational? If 'marriage' is granted to gays, how can it be denied to ANY group of people?", 
        "intTime": 20090513, 
        "postID": 11, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by 21194237: quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it. I know exactly why gays have been treated like second class citizens for centuries and continue to be treated like dirt today. It's because fundamentalist religion in this country has far too much sway. It's because ignorant people can still be convinced that sexual orientation is a \"deviant choice.\" It's because ignorant people still believe that gays are automatically HIV-infected, promiscuous, drug-using criminals who will rape children and sexually harass straight people. And people are dumb enough to keep believing those lies. That's why it's taken so long for gays to gain any footing in the realm of equal rights. However, when the entire economic system is cracking at the seams, and North Korea is launching missiles, and a pandemic is looming... those are things that could impact EVERYONE. Gays, straights, troops, civilians, the elderly, young children. Of course I think marriage rights and other equal rights for gays are important? Absolutely. Do I consider them to be pressing issues that SHOULD be fixed immediately? Yes. However, I'm a rational person who understands how Americans as a whole react to issues of equal rights for gays. It breaks out into a hissing and spitting match of people snarling and screaming at each other. The religious right has a field day throwing Bible verses at people, and politicians do this ridiculous tap-dance to make everyone happy without committing to anything, and everyone ignores every other important issue happening at any given time. It would be nice if people could just be rational about it, but since when have people been rational?", 
        "reply": " If 'marriage' is granted to gays, how can it be denied to ANY group of people?", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-13 12:48:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not. Uh, what 'cultures' would they be?", 
        "intTime": 20090513, 
        "postID": 12, 
        "quote": "Originally posted by reducetension: quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not.", 
        "reply": " Uh, what 'cultures' would they be?", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-13 12:51:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by 15304062: quote: Originally posted by reducetension: quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not. I have done my homework. It has rarely taken a special status in any culture and the overwhelming majority of cultures frown upon homosexuality. It is usually seen as a hidden perversion in most cultures both historically and in modern times. The \"aversion\" in not learned it in intrinsic in nature and is why we have such a hard time getting past the stigma that is homosexuality. As to homosexuality being a part of ones DNA, there are studies that say it is and there are studies that say it isnt. I am not ready to discount either. I dont think it can be unlearned any more than understanding that murder is wrong. You dont unlearn that. I am not ready to declare it a \"learned\" behavior, based on current scientific study, there are just to many opinions. But from what I have studied and observed, it appears to be nothing more than a genetic defect. One of millions that occur to babies every year. I was talking about unlearning prejudices, not homosexuality. Prejudices are learned behavior and they can therefore be unlearned, depending how deeply entrenched they are in the mental needs of those who ascribe to them.", 
        "intTime": 20090513, 
        "postID": 13, 
        "quote": "Originally posted by 15304062: quote: Originally posted by reducetension: quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not. I have done my homework. It has rarely taken a special status in any culture and the overwhelming majority of cultures frown upon homosexuality. It is usually seen as a hidden perversion in most cultures both historically and in modern times. The \"aversion\" in not learned it in intrinsic in nature and is why we have such a hard time getting past the stigma that is homosexuality. As to homosexuality being a part of ones DNA, there are studies that say it is and there are studies that say it isnt. I am not ready to discount either. I dont think it can be unlearned any more than understanding that murder is wrong. You dont unlearn that. I am not ready to declare it a \"learned\" behavior, based on current scientific study, there are just to many opinions. But from what I have studied and observed, it appears to be nothing more than a genetic defect. One of millions that occur to babies every year.", 
        "reply": " I was talking about unlearning prejudices, not homosexuality. Prejudices are learned behavior and they can therefore be unlearned, depending how deeply entrenched they are in the mental needs of those who ascribe to them.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-13 15:19:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "reducetension"
    }, 
    {
        "content": "Homosexuality has existed, to one extent or another, in all cultures spread out across all different kinds of geographies. Don't make the mistake of believing that heterosexuality is normal simply because it's common. In many societies of Melanesia, especially in Papua New Guinea, same-sex relationships were an integral part of the culture until the middle of the last century. The Etoro and Marind-anim for example, even viewed heterosexuality as sinful and celebrated homosexuality instead. women in Lesotho engaged in socially sanctioned \"long term, erotic relationships\" called \"motsoalle\" male Azande warriors in the northern Congo routinely took on young male lovers between the ages of twelve and twenty, who helped with household tasks and participated in intercrural sex with their older husbands. The first recorded homosexual couple in history is commonly regarded as Khnumhotep and Niankhkhnum, an Egyptian male couple, who lived around the 2400 BCE. The pair are portrayed in a nose-kissing position, the most intimate pose in Egyptian art, surrounded by what appear to be their heirs. Homosexual and transgender individuals were also common among other pre-conquest civilizations in Latin America, such as the Aztecs, Mayans, Quechuas, Moches, Zapotecs, and the Tupinambá of Brazil. In East Asia, same-sex love has been referred to since the earliest recorded history. Homosexuality in China, known as the pleasures of the bitten peach, the cut sleeve, or the southern custom, has been recorded since approximately 600 BCE. in Thailand, Kathoey, or \"ladyboys,\" have been a feature of Thai society for many centuries, and Thai kings had male as well as female lovers. While Kathoey may encompass simple effeminacy or transvestism, it most commonly is treated in Thai culture as a third gender. They are generally accepted by society, and Thailand has never had legal prohibitions against homosexuality or homosexual behavior. The earliest Western documents concerning same-sex relationships are derived from ancient Greece. They depict a world in which relationships with women and relationships with youths were the essential foundation of a normal man's love life. Ancient Rome the situation was reversed. Though the young male body remained a focus of male sexual attention, free boys were off limits as sexual partners. All the emperors with the exception of Claudius took male lovers. The Hellenophile emperor Hadrian is renowned for his relationship with Antinous. During the Renaissance, wealthy cities in northern Italy—Florence and Venice in particular—were renowned for their widespread practice of same-sex love, engaged in by a considerable part of the male population and constructed along the classical pattern of Greece and Rome. A tradition of art and literature sprang up constructing Middle Eastern homosexuality. Muslim—often Sufi—poets in medieval Arab lands and in Persia wrote odes to the beautiful wine boys who served them in the taverns. In many areas the practice survived into modern times In Persia homosexuality and homoerotic expressions were tolerated in numerous public places, from monasteries and seminaries to taverns, military camps, bathhouses, and coffee houses. In the early Safavid era (1501–1723), male houses of prostitution (amrad khane) were legally recognized and paid taxes. Persian poets, such as Sa’di (d. 1291), Hafez (d. 1389), and Jami (d. 1492), wrote poems replete with homoerotic allusions. The two most commonly documented forms were commercial sex with transgender young males or males enacting transgender roles exemplified by the köçeks and the bacchás, and Sufi spiritual practices in which the practitioner admired the form of a beautiful boy in order to enter ecstatic states and glimpse the beauty of god. source:\"http://en.wikipedia.org/wiki/Homosexuality#History_2", 
        "intTime": 20090514, 
        "postID": 14, 
        "quote": "", 
        "reply": "Homosexuality has existed, to one extent or another, in all cultures spread out across all different kinds of geographies. Don't make the mistake of believing that heterosexuality is normal simply because it's common. In many societies of Melanesia, especially in Papua New Guinea, same-sex relationships were an integral part of the culture until the middle of the last century. The Etoro and Marind-anim for example, even viewed heterosexuality as sinful and celebrated homosexuality instead. women in Lesotho engaged in socially sanctioned \"long term, erotic relationships\" called \"motsoalle\" male Azande warriors in the northern Congo routinely took on young male lovers between the ages of twelve and twenty, who helped with household tasks and participated in intercrural sex with their older husbands. The first recorded homosexual couple in history is commonly regarded as Khnumhotep and Niankhkhnum, an Egyptian male couple, who lived around the 2400 BCE. The pair are portrayed in a nose-kissing position, the most intimate pose in Egyptian art, surrounded by what appear to be their heirs. Homosexual and transgender individuals were also common among other pre-conquest civilizations in Latin America, such as the Aztecs, Mayans, Quechuas, Moches, Zapotecs, and the Tupinambá of Brazil. In East Asia, same-sex love has been referred to since the earliest recorded history. Homosexuality in China, known as the pleasures of the bitten peach, the cut sleeve, or the southern custom, has been recorded since approximately 600 BCE. in Thailand, Kathoey, or \"ladyboys,\" have been a feature of Thai society for many centuries, and Thai kings had male as well as female lovers. While Kathoey may encompass simple effeminacy or transvestism, it most commonly is treated in Thai culture as a third gender. They are generally accepted by society, and Thailand has never had legal prohibitions against homosexuality or homosexual behavior. The earliest Western documents concerning same-sex relationships are derived from ancient Greece. They depict a world in which relationships with women and relationships with youths were the essential foundation of a normal man's love life. Ancient Rome the situation was reversed. Though the young male body remained a focus of male sexual attention, free boys were off limits as sexual partners. All the emperors with the exception of Claudius took male lovers. The Hellenophile emperor Hadrian is renowned for his relationship with Antinous. During the Renaissance, wealthy cities in northern Italy—Florence and Venice in particular—were renowned for their widespread practice of same-sex love, engaged in by a considerable part of the male population and constructed along the classical pattern of Greece and Rome. A tradition of art and literature sprang up constructing Middle Eastern homosexuality. Muslim—often Sufi—poets in medieval Arab lands and in Persia wrote odes to the beautiful wine boys who served them in the taverns. In many areas the practice survived into modern times In Persia homosexuality and homoerotic expressions were tolerated in numerous public places, from monasteries and seminaries to taverns, military camps, bathhouses, and coffee houses. In the early Safavid era (1501–1723), male houses of prostitution (amrad khane) were legally recognized and paid taxes. Persian poets, such as Sa’di (d. 1291), Hafez (d. 1389), and Jami (d. 1492), wrote poems replete with homoerotic allusions. The two most commonly documented forms were commercial sex with transgender young males or males enacting transgender roles exemplified by the köçeks and the bacchás, and Sufi spiritual practices in which the practitioner admired the form of a beautiful boy in order to enter ecstatic states and glimpse the beauty of god. source:\"http://en.wikipedia.org/wiki/Homosexuality#History_2", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-14 10:58:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: Homosexuality has existed, to one extent or another, in all cultures spread out across all different kinds of geographies. Don't make the mistake of believing that heterosexuality is normal simply because it's common. In many societies of Melanesia, especially in Papua New Guinea, same-sex relationships were an integral part of the culture until the middle of the last century. The Etoro and Marind-anim for example, even viewed heterosexuality as sinful and celebrated homosexuality instead. women in Lesotho engaged in socially sanctioned \"long term, erotic relationships\" called \"motsoalle\" male Azande warriors in the northern Congo routinely took on young male lovers between the ages of twelve and twenty, who helped with household tasks and participated in intercrural sex with their older husbands. The first recorded homosexual couple in history is commonly regarded as Khnumhotep and Niankhkhnum, an Egyptian male couple, who lived around the 2400 BCE. The pair are portrayed in a nose-kissing position, the most intimate pose in Egyptian art, surrounded by what appear to be their heirs. Homosexual and transgender individuals were also common among other pre-conquest civilizations in Latin America, such as the Aztecs, Mayans, Quechuas, Moches, Zapotecs, and the Tupinambá of Brazil. In East Asia, same-sex love has been referred to since the earliest recorded history. Homosexuality in China, known as the pleasures of the bitten peach, the cut sleeve, or the southern custom, has been recorded since approximately 600 BCE. in Thailand, Kathoey, or \"ladyboys,\" have been a feature of Thai society for many centuries, and Thai kings had male as well as female lovers. While Kathoey may encompass simple effeminacy or transvestism, it most commonly is treated in Thai culture as a third gender. They are generally accepted by society, and Thailand has never had legal prohibitions against homosexuality or homosexual behavior. The earliest Western documents concerning same-sex relationships are derived from ancient Greece. They depict a world in which relationships with women and relationships with youths were the essential foundation of a normal man's love life. Ancient Rome the situation was reversed. Though the young male body remained a focus of male sexual attention, free boys were off limits as sexual partners. All the emperors with the exception of Claudius took male lovers. The Hellenophile emperor Hadrian is renowned for his relationship with Antinous. During the Renaissance, wealthy cities in northern Italy—Florence and Venice in particular—were renowned for their widespread practice of same-sex love, engaged in by a considerable part of the male population and constructed along the classical pattern of Greece and Rome. A tradition of art and literature sprang up constructing Middle Eastern homosexuality. Muslim—often Sufi—poets in medieval Arab lands and in Persia wrote odes to the beautiful wine boys who served them in the taverns. In many areas the practice survived into modern times In Persia homosexuality and homoerotic expressions were tolerated in numerous public places, from monasteries and seminaries to taverns, military camps, bathhouses, and coffee houses. In the early Safavid era (1501–1723), male houses of prostitution (amrad khane) were legally recognized and paid taxes. Persian poets, such as Sa’di (d. 1291), Hafez (d. 1389), and Jami (d. 1492), wrote poems replete with homoerotic allusions. The two most commonly documented forms were commercial sex with transgender young males or males enacting transgender roles exemplified by the köçeks and the bacchás, and Sufi spiritual practices in which the practitioner admired the form of a beautiful boy in order to enter ecstatic states and glimpse the beauty of god. source:\"http://en.wikipedia.org/wiki/Homosexuality#History_2 FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people.", 
        "intTime": 20090515, 
        "postID": 15, 
        "quote": "Originally posted by Frank_A_Valdez: Homosexuality has existed, to one extent or another, in all cultures spread out across all different kinds of geographies. Don't make the mistake of believing that heterosexuality is normal simply because it's common. In many societies of Melanesia, especially in Papua New Guinea, same-sex relationships were an integral part of the culture until the middle of the last century. The Etoro and Marind-anim for example, even viewed heterosexuality as sinful and celebrated homosexuality instead. women in Lesotho engaged in socially sanctioned \"long term, erotic relationships\" called \"motsoalle\" male Azande warriors in the northern Congo routinely took on young male lovers between the ages of twelve and twenty, who helped with household tasks and participated in intercrural sex with their older husbands. The first recorded homosexual couple in history is commonly regarded as Khnumhotep and Niankhkhnum, an Egyptian male couple, who lived around the 2400 BCE. The pair are portrayed in a nose-kissing position, the most intimate pose in Egyptian art, surrounded by what appear to be their heirs. Homosexual and transgender individuals were also common among other pre-conquest civilizations in Latin America, such as the Aztecs, Mayans, Quechuas, Moches, Zapotecs, and the Tupinambá of Brazil. In East Asia, same-sex love has been referred to since the earliest recorded history. Homosexuality in China, known as the pleasures of the bitten peach, the cut sleeve, or the southern custom, has been recorded since approximately 600 BCE. in Thailand, Kathoey, or \"ladyboys,\" have been a feature of Thai society for many centuries, and Thai kings had male as well as female lovers. While Kathoey may encompass simple effeminacy or transvestism, it most commonly is treated in Thai culture as a third gender. They are generally accepted by society, and Thailand has never had legal prohibitions against homosexuality or homosexual behavior. The earliest Western documents concerning same-sex relationships are derived from ancient Greece. They depict a world in which relationships with women and relationships with youths were the essential foundation of a normal man's love life. Ancient Rome the situation was reversed. Though the young male body remained a focus of male sexual attention, free boys were off limits as sexual partners. All the emperors with the exception of Claudius took male lovers. The Hellenophile emperor Hadrian is renowned for his relationship with Antinous. During the Renaissance, wealthy cities in northern Italy—Florence and Venice in particular—were renowned for their widespread practice of same-sex love, engaged in by a considerable part of the male population and constructed along the classical pattern of Greece and Rome. A tradition of art and literature sprang up constructing Middle Eastern homosexuality. Muslim—often Sufi—poets in medieval Arab lands and in Persia wrote odes to the beautiful wine boys who served them in the taverns. In many areas the practice survived into modern times In Persia homosexuality and homoerotic expressions were tolerated in numerous public places, from monasteries and seminaries to taverns, military camps, bathhouses, and coffee houses. In the early Safavid era (1501–1723), male houses of prostitution (amrad khane) were legally recognized and paid taxes. Persian poets, such as Sa’di (d. 1291), Hafez (d. 1389), and Jami (d. 1492), wrote poems replete with homoerotic allusions. The two most commonly documented forms were commercial sex with transgender young males or males enacting transgender roles exemplified by the köçeks and the bacchás, and Sufi spiritual practices in which the practitioner admired the form of a beautiful boy in order to enter ecstatic states and glimpse the beauty of god. source:\"http://en.wikipedia.org/wiki/Homosexuality#History_2", 
        "reply": " FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-15 14:53:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by 21194237: FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people. One of the problems in soliciting information from the Vietnamese locals about gays & lesbians is they consider it bad behavior to talk openly about sexuality, and particularly bad behavior to talk about gay sex because it's considered shameful. Homosexuality is still a largely taboo subject in the traditionally patriarchal society, long ruled by Confucian social mores and Buddhist beliefs. \"http://www2.hu-Berlin.de/sexology/IES/Vietnam.HTML#1", 
        "intTime": 20090516, 
        "postID": 16, 
        "quote": "Originally posted by 21194237: FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people.", 
        "reply": " One of the problems in soliciting information from the Vietnamese locals about gays & lesbians is they consider it bad behavior to talk openly about sexuality, and particularly bad behavior to talk about gay sex because it's considered shameful. Homosexuality is still a largely taboo subject in the traditionally patriarchal society, long ruled by Confucian social mores and Buddhist beliefs. \"http://www2.hu-Berlin.de/sexology/IES/Vietnam.HTML#1", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-16 10:55:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: quote: Originally posted by 21194237: FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people. One of the problems in soliciting information from the Vietnamese locals about gays & lesbians is they consider it bad behavior to talk openly about sexuality, and particularly bad behavior to talk about gay sex because it's considered shameful. Homosexuality is still a largely taboo subject in the traditionally patriarchal society, long ruled by Confucian social mores and Buddhist beliefs. \"http://www2.hu-Berlin.de/sexology/IES/Vietnam.HTML#1 And THIS is how you explain the reason for the absence of words of a dialect. Nope, I was there!", 
        "intTime": 20090518, 
        "postID": 17, 
        "quote": "Originally posted by JimCrackCorn: quote: Originally posted by 21194237: FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people. One of the problems in soliciting information from the Vietnamese locals about gays & lesbians is they consider it bad behavior to talk openly about sexuality, and particularly bad behavior to talk about gay sex because it's considered shameful. Homosexuality is still a largely taboo subject in the traditionally patriarchal society, long ruled by Confucian social mores and Buddhist beliefs. \"http://www2.hu-Berlin.de/sexology/IES/Vietnam.HTML#1", 
        "reply": " And THIS is how you explain the reason for the absence of words of a dialect. Nope, I was there!", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-18 12:01:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "CNN Questions Obama's \"Gay\" Silence On the heels of a New York Times article calling into question Barack Obama's relative silence on gay issues in his first few months in office, CNN has launched its own investigation. CNN senior political correspondent Candy Crowley says this has been a sensitive issue for all politicians -- but she suggests Obama is going to face an uphill battle if he wants to distance himself from the mounting debate over marriage equality. CNN video at ... >>>http://www.advocate.com/news_detail_ektid83039.asp This message has been edited. Last edited by: IHAWKER, Sun 10 May 2009 03:59 PM", 
        "intTime": 20090507, 
        "postID": 18, 
        "quote": "", 
        "reply": "CNN Questions Obama's \"Gay\" Silence On the heels of a New York Times article calling into question Barack Obama's relative silence on gay issues in his first few months in office, CNN has launched its own investigation. CNN senior political correspondent Candy Crowley says this has been a sensitive issue for all politicians -- but she suggests Obama is going to face an uphill battle if he wants to distance himself from the mounting debate over marriage equality. CNN video at ... >>>http://www.advocate.com/news_detail_ektid83039.asp This message has been edited. Last edited by: IHAWKER, Sun 10 May 2009 03:59 PM", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-07 21:33:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did.", 
        "intTime": 20090508, 
        "postID": 19, 
        "quote": "", 
        "reply": "Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-08 05:41:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "I have no serious complaints as yet either, but I am monitoring the situation very closely. I agree that there are far more important and urgent issues at the moment, but being DADT was a campaign promise I do not expect this to be fully ignored. With all that is going on with gay marriage and other gay related things it seems that it would not be expecting too much at this point to at least have a little lip service from the President if nothing else. I am willing to be patient until mid 2010, but if nothing significant has happened by then I think it would be time to cal l the President out on his promise of DADT.", 
        "intTime": 20090508, 
        "postID": 20, 
        "quote": "", 
        "reply": "I have no serious complaints as yet either, but I am monitoring the situation very closely. I agree that there are far more important and urgent issues at the moment, but being DADT was a campaign promise I do not expect this to be fully ignored. With all that is going on with gay marriage and other gay related things it seems that it would not be expecting too much at this point to at least have a little lip service from the President if nothing else. I am willing to be patient until mid 2010, but if nothing significant has happened by then I think it would be time to cal l the President out on his promise of DADT.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-08 11:30:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "View From the Hill An Advocate.com exclusive posted May 8, 2009 If there was ever a sign that the culture was more ready to advance on LGBT issues than Washington’s politicians, it was the virtual deluge of coverage from nearly every corner of mainstream media this week. The cascade was dizzying: The New York Times, The Washington Post, CNN, MSNBC, Politico, The Hill. Meanwhile, back at the White House, press secretary Robert Gibbs was asked one question about whether the president had a reaction to Maine legalizing same-sex marriage and he nearly ducked behind his podium. \"No, I think the president's position on same-sex marriages has been talked about and discussed,\" he replied curtly, seemingly hoping to move away from the topic as quickly as possible. As Democratic analyst Paul Begala noted during Thursday's CNN segment on LGBT issues, \"The gay rights movement and marriage equality is advancing very nicely, thank you very much, without Barack Obama's help.\" Begala also predicted that the president would eventually come around to supporting marriage equality, but not any time soon. Full article found at ... >>>http://www.advocate.com/exclusive_detail_ektid83220.asp Interesting read.", 
        "intTime": 20090508, 
        "postID": 21, 
        "quote": "", 
        "reply": "View From the Hill An Advocate.com exclusive posted May 8, 2009 If there was ever a sign that the culture was more ready to advance on LGBT issues than Washington’s politicians, it was the virtual deluge of coverage from nearly every corner of mainstream media this week. The cascade was dizzying: The New York Times, The Washington Post, CNN, MSNBC, Politico, The Hill. Meanwhile, back at the White House, press secretary Robert Gibbs was asked one question about whether the president had a reaction to Maine legalizing same-sex marriage and he nearly ducked behind his podium. \"No, I think the president's position on same-sex marriages has been talked about and discussed,\" he replied curtly, seemingly hoping to move away from the topic as quickly as possible. As Democratic analyst Paul Begala noted during Thursday's CNN segment on LGBT issues, \"The gay rights movement and marriage equality is advancing very nicely, thank you very much, without Barack Obama's help.\" Begala also predicted that the president would eventually come around to supporting marriage equality, but not any time soon. Full article found at ... >>>http://www.advocate.com/exclusive_detail_ektid83220.asp Interesting read.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-08 20:59:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Will 'Don't Ask' Be Back on the Agenda? With the mountain of issues piling up on the President's plate right now, among the words he'd least like to hear are probably these four: \"don't ask, don't tell.\" President Clinton learned the hard way that this issue has the potential to derail agendas and stoke culture wars. Robert Gibbs confirmed in January that it's Obama's intention to end the policy, but amid significant economic and international challenges, it simply isn't a priority. General Jones recently told the Washington Post he'd advised Obama to avoid the issue for now. But the White House might not get to dictate the timing on this one. There's a small storm brewing in the blogosphere and on cable TV over Dan Choi, an officer in the National Guard who received notice that he'll be discharged after admitting he is gay on the Rachel Maddow Show in March. Choi, who recently returned from a tour in Iraq, is a fluent Arabic speaker - a skill the military needs and sorely lacks. Read the full article at ... >>>http://blog.newsweek.com/blogs/thegaggle/archive/2009/05/08/will-don-t-ask-be-back-on-the-agenda.aspx", 
        "intTime": 20090510, 
        "postID": 22, 
        "quote": "", 
        "reply": "Will 'Don't Ask' Be Back on the Agenda? With the mountain of issues piling up on the President's plate right now, among the words he'd least like to hear are probably these four: \"don't ask, don't tell.\" President Clinton learned the hard way that this issue has the potential to derail agendas and stoke culture wars. Robert Gibbs confirmed in January that it's Obama's intention to end the policy, but amid significant economic and international challenges, it simply isn't a priority. General Jones recently told the Washington Post he'd advised Obama to avoid the issue for now. But the White House might not get to dictate the timing on this one. There's a small storm brewing in the blogosphere and on cable TV over Dan Choi, an officer in the National Guard who received notice that he'll be discharged after admitting he is gay on the Rachel Maddow Show in March. Choi, who recently returned from a tour in Iraq, is a fluent Arabic speaker - a skill the military needs and sorely lacks. Read the full article at ... >>>http://blog.newsweek.com/blogs/thegaggle/archive/2009/05/08/will-don-t-ask-be-back-on-the-agenda.aspx", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-10 12:05:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "UPDATE \"Preliminary\" talks held on U.S. military gay policy WASHINGTON (Reuters) - The Obama administration is holding \"preliminary discussions\" about changing the military's prohibition against openly gay service members, White House National Security Advisor James Jones said on Sunday. President Barack Obama pledged during the presidential campaign to change the policy. But the issue has been on the back-burner as the White House tackles other issues such as the economy and the wars in Iraq and Afghanistan. Jones said he does not know if the policy, known as \"don't ask, don't tell,\" will be overturned, and indicated a cautious approach. \"We have a lot on our plate right now. It has to be teed up at the right time ... to do this the right way,\" Jones said on the ABC program \"This Week.\" Asked if the policy will be overturned, Jones said, \"I don't know. ... The president has said that he is in favor of that. We'll just wait. We'll have to wait and see.\" Full article at ... >>>http://uk.reuters.com/article/usPoliticsNews/idUKTRE5491OQ20090510", 
        "intTime": 20090510, 
        "postID": 23, 
        "quote": "", 
        "reply": "UPDATE \"Preliminary\" talks held on U.S. military gay policy WASHINGTON (Reuters) - The Obama administration is holding \"preliminary discussions\" about changing the military's prohibition against openly gay service members, White House National Security Advisor James Jones said on Sunday. President Barack Obama pledged during the presidential campaign to change the policy. But the issue has been on the back-burner as the White House tackles other issues such as the economy and the wars in Iraq and Afghanistan. Jones said he does not know if the policy, known as \"don't ask, don't tell,\" will be overturned, and indicated a cautious approach. \"We have a lot on our plate right now. It has to be teed up at the right time ... to do this the right way,\" Jones said on the ABC program \"This Week.\" Asked if the policy will be overturned, Jones said, \"I don't know. ... The president has said that he is in favor of that. We'll just wait. We'll have to wait and see.\" Full article at ... >>>http://uk.reuters.com/article/usPoliticsNews/idUKTRE5491OQ20090510", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-10 16:06:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it.", 
        "intTime": 20090512, 
        "postID": 24, 
        "quote": "Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did.", 
        "reply": " If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-12 12:06:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by 21194237: quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it. I know exactly why gays have been treated like second class citizens for centuries and continue to be treated like dirt today. It's because fundamentalist religion in this country has far too much sway. It's because ignorant people can still be convinced that sexual orientation is a \"deviant choice.\" It's because ignorant people still believe that gays are automatically HIV-infected, promiscuous, drug-using criminals who will rape children and sexually harass straight people. And people are dumb enough to keep believing those lies. That's why it's taken so long for gays to gain any footing in the realm of equal rights. However, when the entire economic system is cracking at the seams, and North Korea is launching missiles, and a pandemic is looming... those are things that could impact EVERYONE. Gays, straights, troops, civilians, the elderly, young children. Of course I think marriage rights and other equal rights for gays are important? Absolutely. Do I consider them to be pressing issues that SHOULD be fixed immediately? Yes. However, I'm a rational person who understands how Americans as a whole react to issues of equal rights for gays. It breaks out into a hissing and spitting match of people snarling and screaming at each other. The religious right has a field day throwing Bible verses at people, and politicians do this ridiculous tap-dance to make everyone happy without committing to anything, and everyone ignores every other important issue happening at any given time. It would be nice if people could just be rational about it, but since when have people been rational?", 
        "intTime": 20090512, 
        "postID": 25, 
        "quote": "Originally posted by 21194237: quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it.", 
        "reply": " I know exactly why gays have been treated like second class citizens for centuries and continue to be treated like dirt today. It's because fundamentalist religion in this country has far too much sway. It's because ignorant people can still be convinced that sexual orientation is a \"deviant choice.\" It's because ignorant people still believe that gays are automatically HIV-infected, promiscuous, drug-using criminals who will rape children and sexually harass straight people. And people are dumb enough to keep believing those lies. That's why it's taken so long for gays to gain any footing in the realm of equal rights. However, when the entire economic system is cracking at the seams, and North Korea is launching missiles, and a pandemic is looming... those are things that could impact EVERYONE. Gays, straights, troops, civilians, the elderly, young children. Of course I think marriage rights and other equal rights for gays are important? Absolutely. Do I consider them to be pressing issues that SHOULD be fixed immediately? Yes. However, I'm a rational person who understands how Americans as a whole react to issues of equal rights for gays. It breaks out into a hissing and spitting match of people snarling and screaming at each other. The religious right has a field day throwing Bible verses at people, and politicians do this ridiculous tap-dance to make everyone happy without committing to anything, and everyone ignores every other important issue happening at any given time. It would be nice if people could just be rational about it, but since when have people been rational?", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-12 13:21:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not.", 
        "intTime": 20090512, 
        "postID": 26, 
        "quote": "Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals?", 
        "reply": " That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-12 16:06:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "reducetension"
    }, 
    {
        "content": "White House Won't End Dismissals Of Gay Service Members White House spokesman Robert Gibbs today indicated that President Obama will not intervene to keep gay servicemembers from being dismissed from the military, despite his vow to end the \"Don't Ask, Don't Tell\" policy. Gibbs said \"the policy isn’t working for our national interests,\" but added that ending it will \"require more than the snapping of one's fingers.\" \"To get fundamental reform in this instance requires a legislative vehicle,\" Gibbs said. \"The president made a promise to change this policy; he will work with the Joints Chiefs of Staff, the administration and with Congress to ensure that we have a policy that works for our national interests.\" Noted a reporter at the briefing: \"He is the Commander-in-Chief. I mean, if the president and the Secretary of Defense can bring about a new leadership in Afghanistan, replace the commanding general there, couldn't the president and the secretary of defense delay any more people getting fired under 'don't ask, don't tell'?\" Responded Gibbs: \"Well, there have been discussions about the best way to move forward, and the only sustainable way to do that is through -- sustainable and durable way -- is through legislation, which the president has promised and has continued to work for.\" >>>http://www.cbsnews.com/blogs/2009/05/12/politics/politicalhotsheet/entry5009420.shtml", 
        "intTime": 20090512, 
        "postID": 27, 
        "quote": "", 
        "reply": "White House Won't End Dismissals Of Gay Service Members White House spokesman Robert Gibbs today indicated that President Obama will not intervene to keep gay servicemembers from being dismissed from the military, despite his vow to end the \"Don't Ask, Don't Tell\" policy. Gibbs said \"the policy isn’t working for our national interests,\" but added that ending it will \"require more than the snapping of one's fingers.\" \"To get fundamental reform in this instance requires a legislative vehicle,\" Gibbs said. \"The president made a promise to change this policy; he will work with the Joints Chiefs of Staff, the administration and with Congress to ensure that we have a policy that works for our national interests.\" Noted a reporter at the briefing: \"He is the Commander-in-Chief. I mean, if the president and the Secretary of Defense can bring about a new leadership in Afghanistan, replace the commanding general there, couldn't the president and the secretary of defense delay any more people getting fired under 'don't ask, don't tell'?\" Responded Gibbs: \"Well, there have been discussions about the best way to move forward, and the only sustainable way to do that is through -- sustainable and durable way -- is through legislation, which the president has promised and has continued to work for.\" >>>http://www.cbsnews.com/blogs/2009/05/12/politics/politicalhotsheet/entry5009420.shtml", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-12 18:08:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by 21194237: quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it. I know exactly why gays have been treated like second class citizens for centuries and continue to be treated like dirt today. It's because fundamentalist religion in this country has far too much sway. It's because ignorant people can still be convinced that sexual orientation is a \"deviant choice.\" It's because ignorant people still believe that gays are automatically HIV-infected, promiscuous, drug-using criminals who will rape children and sexually harass straight people. And people are dumb enough to keep believing those lies. That's why it's taken so long for gays to gain any footing in the realm of equal rights. However, when the entire economic system is cracking at the seams, and North Korea is launching missiles, and a pandemic is looming... those are things that could impact EVERYONE. Gays, straights, troops, civilians, the elderly, young children. Of course I think marriage rights and other equal rights for gays are important? Absolutely. Do I consider them to be pressing issues that SHOULD be fixed immediately? Yes. However, I'm a rational person who understands how Americans as a whole react to issues of equal rights for gays. It breaks out into a hissing and spitting match of people snarling and screaming at each other. The religious right has a field day throwing Bible verses at people, and politicians do this ridiculous tap-dance to make everyone happy without committing to anything, and everyone ignores every other important issue happening at any given time. It would be nice if people could just be rational about it, but since when have people been rational? If 'marriage' is granted to gays, how can it be denied to ANY group of people?", 
        "intTime": 20090513, 
        "postID": 28, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by 21194237: quote: Originally posted by Whirled_Peas: Really, he's got bigger things on his mind right now. Even the most adamant gay rights activist should be able to see that. Between the economy, Iran, North Korea, and a myriad of other severe and pressing issues, there are just more pressing things for him to handle right now. Equal rights for gays are (sadly) a touchy issue for many people. Even though it shouldn't be a big deal, it will take a lot of focus and heated debate to work on this issue, and it would be a bigger distraction than it should be when there are more urgent issues. I've got no complaints (yet). At least Obama is not wasting his efforts pressing malicious anti-gay legislation like his predecessor did. If the issue were truly a matter of equal rights for an oppressed group, WHAT could possibly be MORE important? Shucks, even illegal immigrants enjoy more attention than h o m o s e x u a l s, no? Wonder why? Think about it. I know exactly why gays have been treated like second class citizens for centuries and continue to be treated like dirt today. It's because fundamentalist religion in this country has far too much sway. It's because ignorant people can still be convinced that sexual orientation is a \"deviant choice.\" It's because ignorant people still believe that gays are automatically HIV-infected, promiscuous, drug-using criminals who will rape children and sexually harass straight people. And people are dumb enough to keep believing those lies. That's why it's taken so long for gays to gain any footing in the realm of equal rights. However, when the entire economic system is cracking at the seams, and North Korea is launching missiles, and a pandemic is looming... those are things that could impact EVERYONE. Gays, straights, troops, civilians, the elderly, young children. Of course I think marriage rights and other equal rights for gays are important? Absolutely. Do I consider them to be pressing issues that SHOULD be fixed immediately? Yes. However, I'm a rational person who understands how Americans as a whole react to issues of equal rights for gays. It breaks out into a hissing and spitting match of people snarling and screaming at each other. The religious right has a field day throwing Bible verses at people, and politicians do this ridiculous tap-dance to make everyone happy without committing to anything, and everyone ignores every other important issue happening at any given time. It would be nice if people could just be rational about it, but since when have people been rational?", 
        "reply": " If 'marriage' is granted to gays, how can it be denied to ANY group of people?", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-13 12:48:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not. Uh, what 'cultures' would they be?", 
        "intTime": 20090513, 
        "postID": 29, 
        "quote": "Originally posted by reducetension: quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not.", 
        "reply": " Uh, what 'cultures' would they be?", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-13 12:51:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by 15304062: quote: Originally posted by reducetension: quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not. I have done my homework. It has rarely taken a special status in any culture and the overwhelming majority of cultures frown upon homosexuality. It is usually seen as a hidden perversion in most cultures both historically and in modern times. The \"aversion\" in not learned it in intrinsic in nature and is why we have such a hard time getting past the stigma that is homosexuality. As to homosexuality being a part of ones DNA, there are studies that say it is and there are studies that say it isnt. I am not ready to discount either. I dont think it can be unlearned any more than understanding that murder is wrong. You dont unlearn that. I am not ready to declare it a \"learned\" behavior, based on current scientific study, there are just to many opinions. But from what I have studied and observed, it appears to be nothing more than a genetic defect. One of millions that occur to babies every year. I was talking about unlearning prejudices, not homosexuality. Prejudices are learned behavior and they can therefore be unlearned, depending how deeply entrenched they are in the mental needs of those who ascribe to them.", 
        "intTime": 20090513, 
        "postID": 30, 
        "quote": "Originally posted by 15304062: quote: Originally posted by reducetension: quote: Originally posted by 15304062: ............... While I wouldnt argue your point about religion playing a part in your plight. There is just as much a natural aversion to homosexuality amoungst none religious peoples. I have always wondered, in a world that can agree on nothing and religious factions that want to kill each other, how it is that they all seem to equally have an aversion to homosexuals? I mean its the aversion is pretty universal, across political,socioeconomic, poor, rich. There seems to be no boundries on the aversion to homosexuals? That's not true. In some cultures homosexuality is seen as an exceptional \"gift\" from the unseen powers and is honored. Even among some Native Americans. The 'aversion' is learned by the culture you grow up in. Like any prejudice. And it can be unlearned. Human create their values and belief systems. They are not in our 'DNA'. You live in a culture where such a life-style as we call \"gay\" is not vilified you don't have the 'phobia' you have here. It may be considered amusing or unique but not vilified. The culture wouldn't tolerate it. It's a learned behavior, not a 'natural' behavior due to DNA. So study up on it, it's not a secret we learn our sexual scripts and our ideas of who should be accepted and not. I have done my homework. It has rarely taken a special status in any culture and the overwhelming majority of cultures frown upon homosexuality. It is usually seen as a hidden perversion in most cultures both historically and in modern times. The \"aversion\" in not learned it in intrinsic in nature and is why we have such a hard time getting past the stigma that is homosexuality. As to homosexuality being a part of ones DNA, there are studies that say it is and there are studies that say it isnt. I am not ready to discount either. I dont think it can be unlearned any more than understanding that murder is wrong. You dont unlearn that. I am not ready to declare it a \"learned\" behavior, based on current scientific study, there are just to many opinions. But from what I have studied and observed, it appears to be nothing more than a genetic defect. One of millions that occur to babies every year.", 
        "reply": " I was talking about unlearning prejudices, not homosexuality. Prejudices are learned behavior and they can therefore be unlearned, depending how deeply entrenched they are in the mental needs of those who ascribe to them.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-13 15:19:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "reducetension"
    }, 
    {
        "content": "Homosexuality has existed, to one extent or another, in all cultures spread out across all different kinds of geographies. Don't make the mistake of believing that heterosexuality is normal simply because it's common. In many societies of Melanesia, especially in Papua New Guinea, same-sex relationships were an integral part of the culture until the middle of the last century. The Etoro and Marind-anim for example, even viewed heterosexuality as sinful and celebrated homosexuality instead. women in Lesotho engaged in socially sanctioned \"long term, erotic relationships\" called \"motsoalle\" male Azande warriors in the northern Congo routinely took on young male lovers between the ages of twelve and twenty, who helped with household tasks and participated in intercrural sex with their older husbands. The first recorded homosexual couple in history is commonly regarded as Khnumhotep and Niankhkhnum, an Egyptian male couple, who lived around the 2400 BCE. The pair are portrayed in a nose-kissing position, the most intimate pose in Egyptian art, surrounded by what appear to be their heirs. Homosexual and transgender individuals were also common among other pre-conquest civilizations in Latin America, such as the Aztecs, Mayans, Quechuas, Moches, Zapotecs, and the Tupinambá of Brazil. In East Asia, same-sex love has been referred to since the earliest recorded history. Homosexuality in China, known as the pleasures of the bitten peach, the cut sleeve, or the southern custom, has been recorded since approximately 600 BCE. in Thailand, Kathoey, or \"ladyboys,\" have been a feature of Thai society for many centuries, and Thai kings had male as well as female lovers. While Kathoey may encompass simple effeminacy or transvestism, it most commonly is treated in Thai culture as a third gender. They are generally accepted by society, and Thailand has never had legal prohibitions against homosexuality or homosexual behavior. The earliest Western documents concerning same-sex relationships are derived from ancient Greece. They depict a world in which relationships with women and relationships with youths were the essential foundation of a normal man's love life. Ancient Rome the situation was reversed. Though the young male body remained a focus of male sexual attention, free boys were off limits as sexual partners. All the emperors with the exception of Claudius took male lovers. The Hellenophile emperor Hadrian is renowned for his relationship with Antinous. During the Renaissance, wealthy cities in northern Italy—Florence and Venice in particular—were renowned for their widespread practice of same-sex love, engaged in by a considerable part of the male population and constructed along the classical pattern of Greece and Rome. A tradition of art and literature sprang up constructing Middle Eastern homosexuality. Muslim—often Sufi—poets in medieval Arab lands and in Persia wrote odes to the beautiful wine boys who served them in the taverns. In many areas the practice survived into modern times In Persia homosexuality and homoerotic expressions were tolerated in numerous public places, from monasteries and seminaries to taverns, military camps, bathhouses, and coffee houses. In the early Safavid era (1501–1723), male houses of prostitution (amrad khane) were legally recognized and paid taxes. Persian poets, such as Sa’di (d. 1291), Hafez (d. 1389), and Jami (d. 1492), wrote poems replete with homoerotic allusions. The two most commonly documented forms were commercial sex with transgender young males or males enacting transgender roles exemplified by the köçeks and the bacchás, and Sufi spiritual practices in which the practitioner admired the form of a beautiful boy in order to enter ecstatic states and glimpse the beauty of god. source:\"http://en.wikipedia.org/wiki/Homosexuality#History_2", 
        "intTime": 20090514, 
        "postID": 31, 
        "quote": "", 
        "reply": "Homosexuality has existed, to one extent or another, in all cultures spread out across all different kinds of geographies. Don't make the mistake of believing that heterosexuality is normal simply because it's common. In many societies of Melanesia, especially in Papua New Guinea, same-sex relationships were an integral part of the culture until the middle of the last century. The Etoro and Marind-anim for example, even viewed heterosexuality as sinful and celebrated homosexuality instead. women in Lesotho engaged in socially sanctioned \"long term, erotic relationships\" called \"motsoalle\" male Azande warriors in the northern Congo routinely took on young male lovers between the ages of twelve and twenty, who helped with household tasks and participated in intercrural sex with their older husbands. The first recorded homosexual couple in history is commonly regarded as Khnumhotep and Niankhkhnum, an Egyptian male couple, who lived around the 2400 BCE. The pair are portrayed in a nose-kissing position, the most intimate pose in Egyptian art, surrounded by what appear to be their heirs. Homosexual and transgender individuals were also common among other pre-conquest civilizations in Latin America, such as the Aztecs, Mayans, Quechuas, Moches, Zapotecs, and the Tupinambá of Brazil. In East Asia, same-sex love has been referred to since the earliest recorded history. Homosexuality in China, known as the pleasures of the bitten peach, the cut sleeve, or the southern custom, has been recorded since approximately 600 BCE. in Thailand, Kathoey, or \"ladyboys,\" have been a feature of Thai society for many centuries, and Thai kings had male as well as female lovers. While Kathoey may encompass simple effeminacy or transvestism, it most commonly is treated in Thai culture as a third gender. They are generally accepted by society, and Thailand has never had legal prohibitions against homosexuality or homosexual behavior. The earliest Western documents concerning same-sex relationships are derived from ancient Greece. They depict a world in which relationships with women and relationships with youths were the essential foundation of a normal man's love life. Ancient Rome the situation was reversed. Though the young male body remained a focus of male sexual attention, free boys were off limits as sexual partners. All the emperors with the exception of Claudius took male lovers. The Hellenophile emperor Hadrian is renowned for his relationship with Antinous. During the Renaissance, wealthy cities in northern Italy—Florence and Venice in particular—were renowned for their widespread practice of same-sex love, engaged in by a considerable part of the male population and constructed along the classical pattern of Greece and Rome. A tradition of art and literature sprang up constructing Middle Eastern homosexuality. Muslim—often Sufi—poets in medieval Arab lands and in Persia wrote odes to the beautiful wine boys who served them in the taverns. In many areas the practice survived into modern times In Persia homosexuality and homoerotic expressions were tolerated in numerous public places, from monasteries and seminaries to taverns, military camps, bathhouses, and coffee houses. In the early Safavid era (1501–1723), male houses of prostitution (amrad khane) were legally recognized and paid taxes. Persian poets, such as Sa’di (d. 1291), Hafez (d. 1389), and Jami (d. 1492), wrote poems replete with homoerotic allusions. The two most commonly documented forms were commercial sex with transgender young males or males enacting transgender roles exemplified by the köçeks and the bacchás, and Sufi spiritual practices in which the practitioner admired the form of a beautiful boy in order to enter ecstatic states and glimpse the beauty of god. source:\"http://en.wikipedia.org/wiki/Homosexuality#History_2", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-14 10:58:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: Homosexuality has existed, to one extent or another, in all cultures spread out across all different kinds of geographies. Don't make the mistake of believing that heterosexuality is normal simply because it's common. In many societies of Melanesia, especially in Papua New Guinea, same-sex relationships were an integral part of the culture until the middle of the last century. The Etoro and Marind-anim for example, even viewed heterosexuality as sinful and celebrated homosexuality instead. women in Lesotho engaged in socially sanctioned \"long term, erotic relationships\" called \"motsoalle\" male Azande warriors in the northern Congo routinely took on young male lovers between the ages of twelve and twenty, who helped with household tasks and participated in intercrural sex with their older husbands. The first recorded homosexual couple in history is commonly regarded as Khnumhotep and Niankhkhnum, an Egyptian male couple, who lived around the 2400 BCE. The pair are portrayed in a nose-kissing position, the most intimate pose in Egyptian art, surrounded by what appear to be their heirs. Homosexual and transgender individuals were also common among other pre-conquest civilizations in Latin America, such as the Aztecs, Mayans, Quechuas, Moches, Zapotecs, and the Tupinambá of Brazil. In East Asia, same-sex love has been referred to since the earliest recorded history. Homosexuality in China, known as the pleasures of the bitten peach, the cut sleeve, or the southern custom, has been recorded since approximately 600 BCE. in Thailand, Kathoey, or \"ladyboys,\" have been a feature of Thai society for many centuries, and Thai kings had male as well as female lovers. While Kathoey may encompass simple effeminacy or transvestism, it most commonly is treated in Thai culture as a third gender. They are generally accepted by society, and Thailand has never had legal prohibitions against homosexuality or homosexual behavior. The earliest Western documents concerning same-sex relationships are derived from ancient Greece. They depict a world in which relationships with women and relationships with youths were the essential foundation of a normal man's love life. Ancient Rome the situation was reversed. Though the young male body remained a focus of male sexual attention, free boys were off limits as sexual partners. All the emperors with the exception of Claudius took male lovers. The Hellenophile emperor Hadrian is renowned for his relationship with Antinous. During the Renaissance, wealthy cities in northern Italy—Florence and Venice in particular—were renowned for their widespread practice of same-sex love, engaged in by a considerable part of the male population and constructed along the classical pattern of Greece and Rome. A tradition of art and literature sprang up constructing Middle Eastern homosexuality. Muslim—often Sufi—poets in medieval Arab lands and in Persia wrote odes to the beautiful wine boys who served them in the taverns. In many areas the practice survived into modern times In Persia homosexuality and homoerotic expressions were tolerated in numerous public places, from monasteries and seminaries to taverns, military camps, bathhouses, and coffee houses. In the early Safavid era (1501–1723), male houses of prostitution (amrad khane) were legally recognized and paid taxes. Persian poets, such as Sa’di (d. 1291), Hafez (d. 1389), and Jami (d. 1492), wrote poems replete with homoerotic allusions. The two most commonly documented forms were commercial sex with transgender young males or males enacting transgender roles exemplified by the köçeks and the bacchás, and Sufi spiritual practices in which the practitioner admired the form of a beautiful boy in order to enter ecstatic states and glimpse the beauty of god. source:\"http://en.wikipedia.org/wiki/Homosexuality#History_2 FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people.", 
        "intTime": 20090515, 
        "postID": 32, 
        "quote": "Originally posted by Frank_A_Valdez: Homosexuality has existed, to one extent or another, in all cultures spread out across all different kinds of geographies. Don't make the mistake of believing that heterosexuality is normal simply because it's common. In many societies of Melanesia, especially in Papua New Guinea, same-sex relationships were an integral part of the culture until the middle of the last century. The Etoro and Marind-anim for example, even viewed heterosexuality as sinful and celebrated homosexuality instead. women in Lesotho engaged in socially sanctioned \"long term, erotic relationships\" called \"motsoalle\" male Azande warriors in the northern Congo routinely took on young male lovers between the ages of twelve and twenty, who helped with household tasks and participated in intercrural sex with their older husbands. The first recorded homosexual couple in history is commonly regarded as Khnumhotep and Niankhkhnum, an Egyptian male couple, who lived around the 2400 BCE. The pair are portrayed in a nose-kissing position, the most intimate pose in Egyptian art, surrounded by what appear to be their heirs. Homosexual and transgender individuals were also common among other pre-conquest civilizations in Latin America, such as the Aztecs, Mayans, Quechuas, Moches, Zapotecs, and the Tupinambá of Brazil. In East Asia, same-sex love has been referred to since the earliest recorded history. Homosexuality in China, known as the pleasures of the bitten peach, the cut sleeve, or the southern custom, has been recorded since approximately 600 BCE. in Thailand, Kathoey, or \"ladyboys,\" have been a feature of Thai society for many centuries, and Thai kings had male as well as female lovers. While Kathoey may encompass simple effeminacy or transvestism, it most commonly is treated in Thai culture as a third gender. They are generally accepted by society, and Thailand has never had legal prohibitions against homosexuality or homosexual behavior. The earliest Western documents concerning same-sex relationships are derived from ancient Greece. They depict a world in which relationships with women and relationships with youths were the essential foundation of a normal man's love life. Ancient Rome the situation was reversed. Though the young male body remained a focus of male sexual attention, free boys were off limits as sexual partners. All the emperors with the exception of Claudius took male lovers. The Hellenophile emperor Hadrian is renowned for his relationship with Antinous. During the Renaissance, wealthy cities in northern Italy—Florence and Venice in particular—were renowned for their widespread practice of same-sex love, engaged in by a considerable part of the male population and constructed along the classical pattern of Greece and Rome. A tradition of art and literature sprang up constructing Middle Eastern homosexuality. Muslim—often Sufi—poets in medieval Arab lands and in Persia wrote odes to the beautiful wine boys who served them in the taverns. In many areas the practice survived into modern times In Persia homosexuality and homoerotic expressions were tolerated in numerous public places, from monasteries and seminaries to taverns, military camps, bathhouses, and coffee houses. In the early Safavid era (1501–1723), male houses of prostitution (amrad khane) were legally recognized and paid taxes. Persian poets, such as Sa’di (d. 1291), Hafez (d. 1389), and Jami (d. 1492), wrote poems replete with homoerotic allusions. The two most commonly documented forms were commercial sex with transgender young males or males enacting transgender roles exemplified by the köçeks and the bacchás, and Sufi spiritual practices in which the practitioner admired the form of a beautiful boy in order to enter ecstatic states and glimpse the beauty of god. source:\"http://en.wikipedia.org/wiki/Homosexuality#History_2", 
        "reply": " FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people.", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-15 14:53:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by 21194237: FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people. One of the problems in soliciting information from the Vietnamese locals about gays & lesbians is they consider it bad behavior to talk openly about sexuality, and particularly bad behavior to talk about gay sex because it's considered shameful. Homosexuality is still a largely taboo subject in the traditionally patriarchal society, long ruled by Confucian social mores and Buddhist beliefs. \"http://www2.hu-Berlin.de/sexology/IES/Vietnam.HTML#1", 
        "intTime": 20090516, 
        "postID": 33, 
        "quote": "Originally posted by 21194237: FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people.", 
        "reply": " One of the problems in soliciting information from the Vietnamese locals about gays & lesbians is they consider it bad behavior to talk openly about sexuality, and particularly bad behavior to talk about gay sex because it's considered shameful. Homosexuality is still a largely taboo subject in the traditionally patriarchal society, long ruled by Confucian social mores and Buddhist beliefs. \"http://www2.hu-Berlin.de/sexology/IES/Vietnam.HTML#1", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-16 10:55:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: quote: Originally posted by 21194237: FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people. One of the problems in soliciting information from the Vietnamese locals about gays & lesbians is they consider it bad behavior to talk openly about sexuality, and particularly bad behavior to talk about gay sex because it's considered shameful. Homosexuality is still a largely taboo subject in the traditionally patriarchal society, long ruled by Confucian social mores and Buddhist beliefs. \"http://www2.hu-Berlin.de/sexology/IES/Vietnam.HTML#1 And THIS is how you explain the reason for the absence of words of a dialect. Nope, I was there!", 
        "intTime": 20090518, 
        "postID": 34, 
        "quote": "Originally posted by JimCrackCorn: quote: Originally posted by 21194237: FYI: I spent the better part of two years working with several of the hill tribes of Vietnam during the late '60s and learning some of the dialects spoken there. Children there are rarely clothed before they reach double digit ages. Many hours spent with elders of these cultures revealed that their language(s) included no words relating to h o m o s e x u a l i t y. Searching for some way to convey the meaning to them resulted in confusion, as such a concept was foreign to them. There were MANY ways in which same gendered persons related to one another, but NONE involved sexuality in any way. These societies were isolated from what we consider to be the 'civilized' world. I recall wondering how it was that pre-adolescent unclothed children never indulged in same sex activity. It occurred to me that perhaps their genetic makeup had somehow avoided what might have been a factor. When that notion was researched, it was discovered that large numbers of families in the 'civilized' world have produced gay offspring where NO genetic history of h o m o s e x u a l i t y had existed previously. Since my only experience occurred 40 years ago in the back-bush of Vietnam, I can testify only to the absence of same-sex relationships there & then. But, the fact that certain dialects have no word for anything relating to it is strong evidence that not ALL cultures have gay people. One of the problems in soliciting information from the Vietnamese locals about gays & lesbians is they consider it bad behavior to talk openly about sexuality, and particularly bad behavior to talk about gay sex because it's considered shameful. Homosexuality is still a largely taboo subject in the traditionally patriarchal society, long ruled by Confucian social mores and Buddhist beliefs. \"http://www2.hu-Berlin.de/sexology/IES/Vietnam.HTML#1", 
        "reply": " And THIS is how you explain the reason for the absence of words of a dialect. Nope, I was there!", 
        "threadID": "27819558_2630097222001", 
        "time": "2009-05-18 12:01:00", 
        "title": "UPDATE: CNN Questions Obama's \"Gay\" Silence", 
        "userID": "21194237"
    }
]