[
    {
        "content": "Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep By Col Daniel Tepfer It’s time to repeal “don’t ask, don’t tell,” an immoral policy that prohibits patriotic and qualified gay, lesbian and bisexual citizens from serving openly in the military. The repeal is long overdue, but recent news items highlight the hypocrisy of it. The Department of Defense recently confirmed a significant increase in the number of “moral waivers” granted to allow individuals with criminal convictions to serve in the military. The waivers, given by the Army and the Marine Corps, are for crimes that range from drug offenses and theft to sex crimes and manslaughter or vehicular homicide, some involving weapons. Very good full article at > >http://lezgetreal.com/?p=6874", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep By Col Daniel Tepfer It’s time to repeal “don’t ask, don’t tell,” an immoral policy that prohibits patriotic and qualified gay, lesbian and bisexual citizens from serving openly in the military. The repeal is long overdue, but recent news items highlight the hypocrisy of it. The Department of Defense recently confirmed a significant increase in the number of “moral waivers” granted to allow individuals with criminal convictions to serve in the military. The waivers, given by the Army and the Marine Corps, are for crimes that range from drug offenses and theft to sex crimes and manslaughter or vehicular homicide, some involving weapons. Very good full article at > >http://lezgetreal.com/?p=6874", 
        "threadID": "27819558_8420096812001", 
        "time": "2009-03-23 16:18:00", 
        "title": "Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep By Col Daniel Tepfer It’s time to repeal “don’t ask, don’t tell,” an immoral policy that prohibits patriotic and qualified gay, lesbian and bisexual citizens from serving openly in the military. The repeal is long overdue, but recent news items highlight the hypocrisy of it. The Department of Defense recently confirmed a significant increase in the number of “moral waivers” granted to allow individuals with criminal convictions to serve in the military. The waivers, given by the Army and the Marine Corps, are for crimes that range from drug offenses and theft to sex crimes and manslaughter or vehicular homicide, some involving weapons. Very good full article at > >http://lezgetreal.com/?p=6874 The colonel is entitled to his opinion, just as others are entitled to their's....regarding what's \"moral\" and what ain't.", 
        "intTime": 20090324, 
        "postID": 2, 
        "quote": "Originally posted by IHAWKER: Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep By Col Daniel Tepfer It’s time to repeal “don’t ask, don’t tell,” an immoral policy that prohibits patriotic and qualified gay, lesbian and bisexual citizens from serving openly in the military. The repeal is long overdue, but recent news items highlight the hypocrisy of it. The Department of Defense recently confirmed a significant increase in the number of “moral waivers” granted to allow individuals with criminal convictions to serve in the military. The waivers, given by the Army and the Marine Corps, are for crimes that range from drug offenses and theft to sex crimes and manslaughter or vehicular homicide, some involving weapons. Very good full article at > >http://lezgetreal.com/?p=6874", 
        "reply": " The colonel is entitled to his opinion, just as others are entitled to their's....regarding what's \"moral\" and what ain't.", 
        "threadID": "27819558_8420096812001", 
        "time": "2009-03-24 12:20:00", 
        "title": "Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep", 
        "userID": "19022583"
    }, 
    {
        "content": "Responding to: 19022583 ( He or She or Whoever You Choose To Be) Thread: Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep Date/Time: Tue 24 March 2009 12:20 PM (Pacific) quote: Originally posted by 19022583: The colonel is entitled to his opinion, just as others are entitled to their’s....regarding what’s “moral” and what ain’t. So you’d rather bunk with someone convicted of rape, or with a thief, or someone convicted of selling drugs, over someone who’s gay? As you said, you are entitled to your opinion, but don’t try to make me abide by it!", 
        "intTime": 20090324, 
        "postID": 3, 
        "quote": "Originally posted by 19022583: The colonel is entitled to his opinion, just as others are entitled to their’s....regarding what’s “moral” and what ain’t.", 
        "reply": "Responding to: 19022583 ( He or She or Whoever You Choose To Be) Thread: Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep Date/Time: Tue 24 March 2009 12:20 PM (Pacific)  So you’d rather bunk with someone convicted of rape, or with a thief, or someone convicted of selling drugs, over someone who’s gay? As you said, you are entitled to your opinion, but don’t try to make me abide by it!", 
        "threadID": "27819558_8420096812001", 
        "time": "2009-03-24 17:00:00", 
        "title": "Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep", 
        "userID": "DaleU"
    }, 
    {
        "content": "quote: Originally posted by DaleU: Responding to: 19022583 ( He or She or Whoever You Choose To Be) Thread: Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep Date/Time: Tue 24 March 2009 12:20 PM (Pacific) quote: Originally posted by 19022583: The colonel is entitled to his opinion, just as others are entitled to their’s....regarding what’s “moral” and what ain’t. So you’d rather bunk with someone convicted of rape, or with a thief, or someone convicted of selling drugs, over someone who’s gay? As you said, you are entitled to your opinion, but don’t try to make me abide by it! Responding to: DaleU (s/he or whatever you are) Don't reckon I said much about with whom I'd rather bunk. In MY day, we weren't given choices and I doubt there are today, either. And THAT....is often JUST the point. SOME folks would rather have a criminal that's been given another chance to go \"straight\" (pun intended) over someone who never will. Thanks for recognizing that I'm entitled to an opinion.", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "Originally posted by DaleU: Responding to: 19022583 ( He or She or Whoever You Choose To Be) Thread: Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep Date/Time: Tue 24 March 2009 12:20 PM (Pacific) quote: Originally posted by 19022583: The colonel is entitled to his opinion, just as others are entitled to their’s....regarding what’s “moral” and what ain’t. So you’d rather bunk with someone convicted of rape, or with a thief, or someone convicted of selling drugs, over someone who’s gay? As you said, you are entitled to your opinion, but don’t try to make me abide by it!", 
        "reply": " Responding to: DaleU (s/he or whatever you are) Don't reckon I said much about with whom I'd rather bunk. In MY day, we weren't given choices and I doubt there are today, either. And THAT....is often JUST the point. SOME folks would rather have a criminal that's been given another chance to go \"straight\" (pun intended) over someone who never will. Thanks for recognizing that I'm entitled to an opinion.", 
        "threadID": "27819558_8420096812001", 
        "time": "2009-03-25 14:21:00", 
        "title": "Retired Colonel says… Don’t ask, don’t tell’ policy too costly to keep", 
        "userID": "19022583"
    }
]