[
    {
        "content": "Military's \"Don't ask, don't tell\" policy A bad idea from the start As a Vietnam-era veteran, I served with combat veterans, cared for Navy and Marine Corps casualties, and saw firsthand the ravages of war. I was young and patriotic, and proudly served a country I respected. All that changed forever when, shortly before I was discharged, a corpsman who had returned from the front lines only months before was given a bad-conduct discharge after being photographed leaving a gay bar. He kept his personal life private, so those of us who knew him did not know he was gay. He had returned from combat with a Bronze Star he received for pulling 26 wounded men off a hill under fire. He was quiet and humble and one of the best corpsmen I knew. Even to survive that kind of bravery was a monumental feat, and he considered it \"just part of the job.\" The bad-conduct discharge robbed him of his veterans benefits and left him feeling shame for exercising his God-given right to be himself. He was in civilian clothes, off base and off duty when he was caught. When the policy of \"Don't ask, don't tell\" was adopted, I knew that unsuspecting gays and lesbians would join the military believing that if they were discreet, they could serve their country and expect to be treated fairly. This policy was a bad idea from the start. It allows for persecution and discrimination in a setting that lends itself to cruelty. This has to stop. In addition to the obvious humanitarian reasons, the cost of training and then dismissing qualified, honorable and able men and women is an unconscionable misuse of millions -- perhaps billions -- of dollars of the military budget. Perhaps this money could be better spent on safety equipment to protect those who are willing to risk their lives to serve their country. The Seattle Times", 
        "intTime": 20090317, 
        "postID": 1, 
        "quote": "", 
        "reply": "Military's \"Don't ask, don't tell\" policy A bad idea from the start As a Vietnam-era veteran, I served with combat veterans, cared for Navy and Marine Corps casualties, and saw firsthand the ravages of war. I was young and patriotic, and proudly served a country I respected. All that changed forever when, shortly before I was discharged, a corpsman who had returned from the front lines only months before was given a bad-conduct discharge after being photographed leaving a gay bar. He kept his personal life private, so those of us who knew him did not know he was gay. He had returned from combat with a Bronze Star he received for pulling 26 wounded men off a hill under fire. He was quiet and humble and one of the best corpsmen I knew. Even to survive that kind of bravery was a monumental feat, and he considered it \"just part of the job.\" The bad-conduct discharge robbed him of his veterans benefits and left him feeling shame for exercising his God-given right to be himself. He was in civilian clothes, off base and off duty when he was caught. When the policy of \"Don't ask, don't tell\" was adopted, I knew that unsuspecting gays and lesbians would join the military believing that if they were discreet, they could serve their country and expect to be treated fairly. This policy was a bad idea from the start. It allows for persecution and discrimination in a setting that lends itself to cruelty. This has to stop. In addition to the obvious humanitarian reasons, the cost of training and then dismissing qualified, honorable and able men and women is an unconscionable misuse of millions -- perhaps billions -- of dollars of the military budget. Perhaps this money could be better spent on safety equipment to protect those who are willing to risk their lives to serve their country. The Seattle Times", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-17 15:23:00", 
        "title": "Another story of a hero lost", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Sounds like he got a, \"BCD,\" for breaking the Law, willingly. *** It is a fallacious argument to take a legal fact and try to bury it with Appeals to Patriotic Emotion. This Sailor gave more to his country than most will ever have 1/100th the opportunity, yet none of which excuses breaking the Law. *** Sounds to me like there might be more to the story. Is a, \"BCD,\" \"SOP,\" with DA/DT violations? *** That said, I suggested - in AAVPIPS - that these folks have a Federal Appeals process opened to which in my opinion would include; ammending records, reassessing individuals, on a case-by-case basis, if warranted: \"Thirdly, formal and in writing notification from the DoD, to all individual service members previously processed for discharged or “home awaiting discharge,” notifying them of the change in policy and the administrative assistance to be made available at local prior service recruiting offices, on how to re-apply based on no longer and the otherwise disqualifying conditions created by DADT.\" See full document and discussion via the below link: AAVPIPS", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "Sounds like he got a, \"BCD,\" for breaking the Law, willingly. *** It is a fallacious argument to take a legal fact and try to bury it with Appeals to Patriotic Emotion. This Sailor gave more to his country than most will ever have 1/100th the opportunity, yet none of which excuses breaking the Law. *** Sounds to me like there might be more to the story. Is a, \"BCD,\" \"SOP,\" with DA/DT violations? *** That said, I suggested - in AAVPIPS - that these folks have a Federal Appeals process opened to which in my opinion would include; ammending records, reassessing individuals, on a case-by-case basis, if warranted: \"Thirdly, formal and in writing notification from the DoD, to all individual service members previously processed for discharged or “home awaiting discharge,” notifying them of the change in policy and the administrative assistance to be made available at local prior service recruiting offices, on how to re-apply based on no longer and the otherwise disqualifying conditions created by DADT.\" See full document and discussion via the below link: AAVPIPS", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-17 23:53:00", 
        "title": "Another story of a hero lost", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Military's \"Don't ask, don't tell\" policy A bad idea from the start As a Vietnam-era veteran, I served with combat veterans, cared for Navy and Marine Corps casualties, and saw firsthand the ravages of war. I was young and patriotic, and proudly served a country I respected. All that changed forever when, shortly before I was discharged, a corpsman who had returned from the front lines only months before was given a bad-conduct discharge after being photographed leaving a gay bar. He kept his personal life private, so those of us who knew him did not know he was gay. He had returned from combat with a Bronze Star he received for pulling 26 wounded men off a hill under fire. He was quiet and humble and one of the best corpsmen I knew. Even to survive that kind of bravery was a monumental feat, and he considered it \"just part of the job.\" The bad-conduct discharge robbed him of his veterans benefits and left him feeling shame for exercising his God-given right to be himself. He was in civilian clothes, off base and off duty when he was caught. When the policy of \"Don't ask, don't tell\" was adopted, I knew that unsuspecting gays and lesbians would join the military believing that if they were discreet, they could serve their country and expect to be treated fairly. This policy was a bad idea from the start. It allows for persecution and discrimination in a setting that lends itself to cruelty. This has to stop. In addition to the obvious humanitarian reasons, the cost of training and then dismissing qualified, honorable and able men and women is an unconscionable misuse of millions -- perhaps billions -- of dollars of the military budget. Perhaps this money could be better spent on safety equipment to protect those who are willing to risk their lives to serve their country. The Seattle Times First, let me say that I feel badly for this hero of MY era. Second, as a Veterans Service Officer....I'll state that a BCD need NOT be a barrier to VA benefits. Should this person wish to contact me, I can advise him as to HOW to pursue the benefits due him. Third, this gross miscarriage of justice was the result of a policy that preceded the current DADT policy. I believe that minor modification of the DADT policy now in effect could correct occurrances like the one highlighted here.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "Originally posted by IHAWKER: Military's \"Don't ask, don't tell\" policy A bad idea from the start As a Vietnam-era veteran, I served with combat veterans, cared for Navy and Marine Corps casualties, and saw firsthand the ravages of war. I was young and patriotic, and proudly served a country I respected. All that changed forever when, shortly before I was discharged, a corpsman who had returned from the front lines only months before was given a bad-conduct discharge after being photographed leaving a gay bar. He kept his personal life private, so those of us who knew him did not know he was gay. He had returned from combat with a Bronze Star he received for pulling 26 wounded men off a hill under fire. He was quiet and humble and one of the best corpsmen I knew. Even to survive that kind of bravery was a monumental feat, and he considered it \"just part of the job.\" The bad-conduct discharge robbed him of his veterans benefits and left him feeling shame for exercising his God-given right to be himself. He was in civilian clothes, off base and off duty when he was caught. When the policy of \"Don't ask, don't tell\" was adopted, I knew that unsuspecting gays and lesbians would join the military believing that if they were discreet, they could serve their country and expect to be treated fairly. This policy was a bad idea from the start. It allows for persecution and discrimination in a setting that lends itself to cruelty. This has to stop. In addition to the obvious humanitarian reasons, the cost of training and then dismissing qualified, honorable and able men and women is an unconscionable misuse of millions -- perhaps billions -- of dollars of the military budget. Perhaps this money could be better spent on safety equipment to protect those who are willing to risk their lives to serve their country. The Seattle Times", 
        "reply": " First, let me say that I feel badly for this hero of MY era. Second, as a Veterans Service Officer....I'll state that a BCD need NOT be a barrier to VA benefits. Should this person wish to contact me, I can advise him as to HOW to pursue the benefits due him. Third, this gross miscarriage of justice was the result of a policy that preceded the current DADT policy. I believe that minor modification of the DADT policy now in effect could correct occurrances like the one highlighted here.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-18 09:51:00", 
        "title": "Another story of a hero lost", 
        "userID": "19022583"
    }, 
    {
        "content": "\"19022583,\" If what you're saying is correct, sounds like this language, \"The bad-conduct discharge robbed him of his veterans benefits [...]\" (The Seattle Times), is really just more fallacious narrative when the broader facts are examined. Please share a deeper understanding of how all of this came about, if you don't mind? It appears from your professional experience, the, \"author,\" of The Seattle Times article, needs to do real homework, and or drop the sensationalism, and agenda of spreading lies and deception. *** It's amazing what lengths some will go to push a fallacious agenda. *** Good job in keeping us honest, \"19022583,\" look forward to further explanation from you when you have time. *** It seemed unusually harsh the first time I read it, but we know those who are willing to push an agenda at any cost, including bogas journalism. You might want to write the Editor of the paper for a retraction, and apology. Again, Good job! And keep up the great work taking care of our veterans in need, the greater the sacrifice, the greater the attention they should get - in my opinion of course.", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "\"19022583,\" If what you're saying is correct, sounds like this language, \"The bad-conduct discharge robbed him of his veterans benefits [...]\" (The Seattle Times), is really just more fallacious narrative when the broader facts are examined. Please share a deeper understanding of how all of this came about, if you don't mind? It appears from your professional experience, the, \"author,\" of The Seattle Times article, needs to do real homework, and or drop the sensationalism, and agenda of spreading lies and deception. *** It's amazing what lengths some will go to push a fallacious agenda. *** Good job in keeping us honest, \"19022583,\" look forward to further explanation from you when you have time. *** It seemed unusually harsh the first time I read it, but we know those who are willing to push an agenda at any cost, including bogas journalism. You might want to write the Editor of the paper for a retraction, and apology. Again, Good job! And keep up the great work taking care of our veterans in need, the greater the sacrifice, the greater the attention they should get - in my opinion of course.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-18 10:41:00", 
        "title": "Another story of a hero lost", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: \"19022583,\" If what you're saying is correct, sounds like this language, \"The bad-conduct discharge robbed him of his veterans benefits [...]\" (The Seattle Times), is really just more fallacious narrative when the broader facts are examined. Please share a deeper understanding of how all of this came about, if you don't mind? It appears from your professional experience, the, \"author,\" of The Seattle Times article, needs to do real homework, and or drop the sensationalism, and agenda of spreading lies and deception. *** It's amazing what lengths some will go to push a fallacious agenda. *** Good job in keeping us honest, \"19022583,\" look forward to further explanation from you when you have time. *** It seemed unusually harsh the first time I read it, but we know those who are willing to push an agenda at any cost, including bogas journalism. You might want to write the Editor of the paper for a retraction, and apology. Again, Good job! And keep up the great work taking care of our veterans in need, the greater the sacrifice, the greater the attention they should get - in my opinion of course. The VA is what media types regard as....an easy, large & slow moving target. Media is in the business of creating sensational, eye catching stories....regardless of truth. While it's true that less than honorable separations limit access of service personnel to SOME VA benefits, the implication of this story implies that redress is unavailable. The availability of benefits from the VA is adjudicated on a case by case basis when separations like BCD or Other than Honorable are given by military service departments. Service Organizations exist largely to protect our veterans from unfair adjudications. Further, we know that the military sometimes errs in their assignment of character of service designations. As such, a BCD is subject to review to determine if it was justified, and can be upgraded by the military branch that gave it. The critical element here is with the veteran; s/he must consult a professional who can advise the best approach to obtaining earned benefits.", 
        "intTime": 20090319, 
        "postID": 5, 
        "quote": "Originally posted by EqualRightstoPrivacy: \"19022583,\" If what you're saying is correct, sounds like this language, \"The bad-conduct discharge robbed him of his veterans benefits [...]\" (The Seattle Times), is really just more fallacious narrative when the broader facts are examined. Please share a deeper understanding of how all of this came about, if you don't mind? It appears from your professional experience, the, \"author,\" of The Seattle Times article, needs to do real homework, and or drop the sensationalism, and agenda of spreading lies and deception. *** It's amazing what lengths some will go to push a fallacious agenda. *** Good job in keeping us honest, \"19022583,\" look forward to further explanation from you when you have time. *** It seemed unusually harsh the first time I read it, but we know those who are willing to push an agenda at any cost, including bogas journalism. You might want to write the Editor of the paper for a retraction, and apology. Again, Good job! And keep up the great work taking care of our veterans in need, the greater the sacrifice, the greater the attention they should get - in my opinion of course.", 
        "reply": " The VA is what media types regard as....an easy, large & slow moving target. Media is in the business of creating sensational, eye catching stories....regardless of truth. While it's true that less than honorable separations limit access of service personnel to SOME VA benefits, the implication of this story implies that redress is unavailable. The availability of benefits from the VA is adjudicated on a case by case basis when separations like BCD or Other than Honorable are given by military service departments. Service Organizations exist largely to protect our veterans from unfair adjudications. Further, we know that the military sometimes errs in their assignment of character of service designations. As such, a BCD is subject to review to determine if it was justified, and can be upgraded by the military branch that gave it. The critical element here is with the veteran; s/he must consult a professional who can advise the best approach to obtaining earned benefits.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-19 10:25:00", 
        "title": "Another story of a hero lost", 
        "userID": "19022583"
    }, 
    {
        "content": "Thanks numbers. *** Further validating the fallacious GLBT agenda does not add up, and never will. *** The only road to Equal Rights is Truth. All this other nonsense just hinders the cause ... a bit self-destructive feet stomping, if you ask me(?). That's how most Liberals deal with much of life, like demand-fed babies, always looking for special interest, and a, \"helping,\" handout. *** How about, \"Man-up,\" with one truthful voice, everything else is just static, most of which gets tuned out, and none of which makes a damn bit of sense.", 
        "intTime": 20090319, 
        "postID": 6, 
        "quote": "", 
        "reply": "Thanks numbers. *** Further validating the fallacious GLBT agenda does not add up, and never will. *** The only road to Equal Rights is Truth. All this other nonsense just hinders the cause ... a bit self-destructive feet stomping, if you ask me(?). That's how most Liberals deal with much of life, like demand-fed babies, always looking for special interest, and a, \"helping,\" handout. *** How about, \"Man-up,\" with one truthful voice, everything else is just static, most of which gets tuned out, and none of which makes a damn bit of sense.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-19 10:48:00", 
        "title": "Another story of a hero lost", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "Equal, are you a script writer for Rush Limbaugh? Your sad, sad, sad conservative mind warp is reflecting his image each time you bend over to post. No one is going to make the silly DA/DT conspiracy into something more complex by forcing citizens to divulge their private personal sexual orientation... neither hetero or homosexuals. You should have come over with the Puritans in the 1600s, maybe they would grab on to your \"message\" of morality and self righteous indignation you squirm under with each slightest objection to your mental malaise about people who are not as 'perfect' as you.", 
        "intTime": 20090319, 
        "postID": 7, 
        "quote": "", 
        "reply": "Equal, are you a script writer for Rush Limbaugh? Your sad, sad, sad conservative mind warp is reflecting his image each time you bend over to post. No one is going to make the silly DA/DT conspiracy into something more complex by forcing citizens to divulge their private personal sexual orientation... neither hetero or homosexuals. You should have come over with the Puritans in the 1600s, maybe they would grab on to your \"message\" of morality and self righteous indignation you squirm under with each slightest objection to your mental malaise about people who are not as 'perfect' as you.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-19 17:09:00", 
        "title": "Another story of a hero lost", 
        "userID": "reducetension"
    }, 
    {
        "content": "The thread - as it turned out - is about fallacious, \"journalism.\" *** Do you have a point, \"reducetension?\" Sounds like you're still rambling the same nonsense from a different thread(?). *** That makes you a, \"Troll.\"", 
        "intTime": 20090319, 
        "postID": 8, 
        "quote": "", 
        "reply": "The thread - as it turned out - is about fallacious, \"journalism.\" *** Do you have a point, \"reducetension?\" Sounds like you're still rambling the same nonsense from a different thread(?). *** That makes you a, \"Troll.\"", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-19 22:17:00", 
        "title": "Another story of a hero lost", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: The thread - as it turned out - is about fallacious, \"journalism.\" Yes, and you can't get much more fallacious than Rush now, can you? *** Do you have a point, \"reducetension?\" Yes, the point is you have no point in pointing to a 'recreation' of a \"gay\" law to replace DA/DT when it is dropped once and for all. That's my point and I hope it is a point well taken by others. Sounds like you're still rambling the same nonsense from a different thread(?). Ooooo....we're so much a like! *** That makes you a, \"Troll.\" Troll - Wikipedia, the free encyclopedia \"A troll is a fearsome member of a race of creatures from Norse mythology.\" It's my pure Scandinavian heritage then, my Viking side. Ya, you betcha, by golly! God natt, ulv sinnssyk!", 
        "intTime": 20090319, 
        "postID": 9, 
        "quote": "Originally posted by EqualRightstoPrivacy: The thread - as it turned out - is about fallacious, \"journalism.\" Yes, and you can't get much more fallacious than Rush now, can you? *** Do you have a point, \"reducetension?\" Yes, the point is you have no point in pointing to a 'recreation' of a \"gay\" law to replace DA/DT when it is dropped once and for all. That's my point and I hope it is a point well taken by others. Sounds like you're still rambling the same nonsense from a different thread(?). Ooooo....we're so much a like! *** That makes you a, \"Troll.\" Troll - Wikipedia, the free encyclopedia \"A troll is a fearsome member of a race of creatures from Norse mythology.\" It's my pure Scandinavian heritage then, my Viking side. Ya, you betcha, by golly! God natt, ulv sinnssyk!", 
        "reply": "", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-19 22:50:00", 
        "title": "Another story of a hero lost", 
        "userID": "reducetension"
    }, 
    {
        "content": "Yes, The Seattle Times thread opener is fallacious journalism. And, Rush is a pig, much like you, - neither of which I subscribe to - what's your point ... oh yeah, you don't have one. *** You still aren't over the fact that you brought me Case Law like a studious *****, and I actually read it. Lawrence vs. Texas validates the Constitutional Right to Privacy, and validates the basis for every one of my points. I already said, \"Thanks,\" and I meant it. Face it, here, you're incompetent, posting. *** \"troll [...] a person who lives or sleeps in a park or under a viaduct or bridge as a bag lady or derelict [...]\" (Random House, 2026), (Bold mine).", 
        "intTime": 20090319, 
        "postID": 10, 
        "quote": "", 
        "reply": "Yes, The Seattle Times thread opener is fallacious journalism. And, Rush is a pig, much like you, - neither of which I subscribe to - what's your point ... oh yeah, you don't have one. *** You still aren't over the fact that you brought me Case Law like a studious *****, and I actually read it. Lawrence vs. Texas validates the Constitutional Right to Privacy, and validates the basis for every one of my points. I already said, \"Thanks,\" and I meant it. Face it, here, you're incompetent, posting. *** \"troll [...] a person who lives or sleeps in a park or under a viaduct or bridge as a bag lady or derelict [...]\" (Random House, 2026), (Bold mine).", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-19 23:22:00", 
        "title": "Another story of a hero lost", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: Sounds like he got a, \"BCD,\" for breaking the Law, willingly. *** It is a fallacious argument to take a legal fact and try to bury it with Appeals to Patriotic Emotion. This Sailor gave more to his country than most will ever have 1/100th the opportunity, yet none of which excuses breaking the Law. *** Sounds to me like there might be more to the story. Is a, \"BCD,\" \"SOP,\" with DA/DT violations? *** That said, I suggested - in AAVPIPS - that these folks have a Federal Appeals process opened to which in my opinion would include; ammending records, reassessing individuals, on a case-by-case basis, if warranted: \"Thirdly, formal and in writing notification from the DoD, to all individual service members previously processed for discharged or “home awaiting discharge,” notifying them of the change in policy and the administrative assistance to be made available at local prior service recruiting offices, on how to re-apply based on no longer and the otherwise disqualifying conditions created by DADT.\" See full document and discussion via the below link: AAVPIPS The first part of the story occurred during the Vietnam era when a homosexual could receive a BCD for being homosexual.", 
        "intTime": 20090320, 
        "postID": 11, 
        "quote": "Originally posted by EqualRightstoPrivacy: Sounds like he got a, \"BCD,\" for breaking the Law, willingly. *** It is a fallacious argument to take a legal fact and try to bury it with Appeals to Patriotic Emotion. This Sailor gave more to his country than most will ever have 1/100th the opportunity, yet none of which excuses breaking the Law. *** Sounds to me like there might be more to the story. Is a, \"BCD,\" \"SOP,\" with DA/DT violations? *** That said, I suggested - in AAVPIPS - that these folks have a Federal Appeals process opened to which in my opinion would include; ammending records, reassessing individuals, on a case-by-case basis, if warranted: \"Thirdly, formal and in writing notification from the DoD, to all individual service members previously processed for discharged or “home awaiting discharge,” notifying them of the change in policy and the administrative assistance to be made available at local prior service recruiting offices, on how to re-apply based on no longer and the otherwise disqualifying conditions created by DADT.\" See full document and discussion via the below link: AAVPIPS", 
        "reply": " The first part of the story occurred during the Vietnam era when a homosexual could receive a BCD for being homosexual.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-20 07:02:00", 
        "title": "Another story of a hero lost", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: quote: Originally posted by EqualRightstoPrivacy: Sounds like he got a, \"BCD,\" for breaking the Law, willingly. *** It is a fallacious argument to take a legal fact and try to bury it with Appeals to Patriotic Emotion. This Sailor gave more to his country than most will ever have 1/100th the opportunity, yet none of which excuses breaking the Law. *** Sounds to me like there might be more to the story. Is a, \"BCD,\" \"SOP,\" with DA/DT violations? *** That said, I suggested - in AAVPIPS - that these folks have a Federal Appeals process opened to which in my opinion would include; ammending records, reassessing individuals, on a case-by-case basis, if warranted: \"Thirdly, formal and in writing notification from the DoD, to all individual service members previously processed for discharged or “home awaiting discharge,” notifying them of the change in policy and the administrative assistance to be made available at local prior service recruiting offices, on how to re-apply based on no longer and the otherwise disqualifying conditions created by DADT.\" See full document and discussion via the below link: AAVPIPS The first part of the story occurred during the Vietnam era when a homosexual could receive a BCD for being homosexual. YES, but....the MEAT of the story was that all VA benefits were lost as a result....which AIN'T necessarily so. Further, the story FAILED to do the proper service by advising veterans affected that....separations are subject to review at the veteran's request. As such, the story actually does a DIS-service to gay vets!", 
        "intTime": 20090320, 
        "postID": 12, 
        "quote": "Originally posted by JimCrackCorn: quote: Originally posted by EqualRightstoPrivacy: Sounds like he got a, \"BCD,\" for breaking the Law, willingly. *** It is a fallacious argument to take a legal fact and try to bury it with Appeals to Patriotic Emotion. This Sailor gave more to his country than most will ever have 1/100th the opportunity, yet none of which excuses breaking the Law. *** Sounds to me like there might be more to the story. Is a, \"BCD,\" \"SOP,\" with DA/DT violations? *** That said, I suggested - in AAVPIPS - that these folks have a Federal Appeals process opened to which in my opinion would include; ammending records, reassessing individuals, on a case-by-case basis, if warranted: \"Thirdly, formal and in writing notification from the DoD, to all individual service members previously processed for discharged or “home awaiting discharge,” notifying them of the change in policy and the administrative assistance to be made available at local prior service recruiting offices, on how to re-apply based on no longer and the otherwise disqualifying conditions created by DADT.\" See full document and discussion via the below link: AAVPIPS The first part of the story occurred during the Vietnam era when a homosexual could receive a BCD for being homosexual.", 
        "reply": " YES, but....the MEAT of the story was that all VA benefits were lost as a result....which AIN'T necessarily so. Further, the story FAILED to do the proper service by advising veterans affected that....separations are subject to review at the veteran's request. As such, the story actually does a DIS-service to gay vets!", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-20 09:07:00", 
        "title": "Another story of a hero lost", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: YES, but....the MEAT of the story was that all VA benefits were lost as a result....which AIN'T necessarily so. Further, the story FAILED to do the proper service by advising veterans affected that....separations are subject to review at the veteran's request. As such, the story actually does a DIS-service to gay vets! You are absolutely correct. There are many Veterans out there that are unaware of their right to request a review. Even Veterans who were discharged honorably are often unaware of the benefits available to them. As with most articles, they are written to highlight a problem but fail to give a solution.", 
        "intTime": 20090321, 
        "postID": 13, 
        "quote": "Originally posted by 19022583: YES, but....the MEAT of the story was that all VA benefits were lost as a result....which AIN'T necessarily so. Further, the story FAILED to do the proper service by advising veterans affected that....separations are subject to review at the veteran's request. As such, the story actually does a DIS-service to gay vets!", 
        "reply": " You are absolutely correct. There are many Veterans out there that are unaware of their right to request a review. Even Veterans who were discharged honorably are often unaware of the benefits available to them. As with most articles, they are written to highlight a problem but fail to give a solution.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-21 07:46:00", 
        "title": "Another story of a hero lost", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: quote: Originally posted by 19022583: YES, but....the MEAT of the story was that all VA benefits were lost as a result....which AIN'T necessarily so. Further, the story FAILED to do the proper service by advising veterans affected that....separations are subject to review at the veteran's request. As such, the story actually does a DIS-service to gay vets! You are absolutely correct. There are many Veterans out there that are unaware of their right to request a review. Even Veterans who were discharged honorably are often unaware of the benefits available to them. As with most articles, they are written to highlight a problem but fail to give a solution. AND, you'd be right too IF....the obvious intent of the story wasn't to assail the DADT policy. BUT, as usual....an editorialist used a poorly scripted example to imply the error of a policy, and....it failed on BOTH counts. But, that apparently mattered NOT....to both the editorialist AND....IHAWKER. As a professional Veterans Service Officer for more than 35 years, I can tell you that DADT has corrected MUCH of the pre-DADT military policy regarding gays. With a little fine tuning, DADT can be the catalyst that ensures fairness to ALL military personnel.", 
        "intTime": 20090321, 
        "postID": 14, 
        "quote": "Originally posted by JimCrackCorn: quote: Originally posted by 19022583: YES, but....the MEAT of the story was that all VA benefits were lost as a result....which AIN'T necessarily so. Further, the story FAILED to do the proper service by advising veterans affected that....separations are subject to review at the veteran's request. As such, the story actually does a DIS-service to gay vets! You are absolutely correct. There are many Veterans out there that are unaware of their right to request a review. Even Veterans who were discharged honorably are often unaware of the benefits available to them. As with most articles, they are written to highlight a problem but fail to give a solution.", 
        "reply": " AND, you'd be right too IF....the obvious intent of the story wasn't to assail the DADT policy. BUT, as usual....an editorialist used a poorly scripted example to imply the error of a policy, and....it failed on BOTH counts. But, that apparently mattered NOT....to both the editorialist AND....IHAWKER. As a professional Veterans Service Officer for more than 35 years, I can tell you that DADT has corrected MUCH of the pre-DADT military policy regarding gays. With a little fine tuning, DADT can be the catalyst that ensures fairness to ALL military personnel.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-03-21 09:13:00", 
        "title": "Another story of a hero lost", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: <Snipped...> As a professional Veterans Service Officer for more than 35 years, I can tell you that DADT has corrected MUCH of the pre-DADT military policy regarding gays. With a little fine tuning, DADT can be the catalyst that ensures fairness to ALL military personnel. Your career as a VSO, notwithstanding, does not qualify you to misquote military policy on character of discharge and separation review processes; however, my time as a personnel records specialist (75D), the many discharges I have overseen and my current occupation with the Department of Veterans Affairs does. It was not until 1979 that DoD was required by the courts in Giles v. Secretary of the Army (Civil Action No. 77-0904) to grant requests for review of separation with regard to character of discharge, but this was not to address mischaracterized discharges as a result of homosexual conduct. It was more for those involved in other illegal activities that caused them to forfeit their VA benefits. This process is not easy and it is certainly not automatic. In order for a former servicemember to be granted such a change, they have to prove that the discharge was not equitable; in other words it is not consistent with policies and traditions. They also have to prove that the character of discharge was improper; meaning that the reason or characterization of the discharge is in error (i.e., is false, or violates a regulation or a law). If you doubt that, please produce a single Chapter 15 discharge (Discharge for Homosexual Conduct, typically BCD, sometimes even Dishonorable) that was reviewed and recharacterized (to a more favorable character) prior to 1993 when DADT went into affect.", 
        "intTime": 20090409, 
        "postID": 15, 
        "quote": "Originally posted by 19022583: <Snipped...> As a professional Veterans Service Officer for more than 35 years, I can tell you that DADT has corrected MUCH of the pre-DADT military policy regarding gays. With a little fine tuning, DADT can be the catalyst that ensures fairness to ALL military personnel.", 
        "reply": " Your career as a VSO, notwithstanding, does not qualify you to misquote military policy on character of discharge and separation review processes; however, my time as a personnel records specialist (75D), the many discharges I have overseen and my current occupation with the Department of Veterans Affairs does. It was not until 1979 that DoD was required by the courts in Giles v. Secretary of the Army (Civil Action No. 77-0904) to grant requests for review of separation with regard to character of discharge, but this was not to address mischaracterized discharges as a result of homosexual conduct. It was more for those involved in other illegal activities that caused them to forfeit their VA benefits. This process is not easy and it is certainly not automatic. In order for a former servicemember to be granted such a change, they have to prove that the discharge was not equitable; in other words it is not consistent with policies and traditions. They also have to prove that the character of discharge was improper; meaning that the reason or characterization of the discharge is in error (i.e., is false, or violates a regulation or a law). If you doubt that, please produce a single Chapter 15 discharge (Discharge for Homosexual Conduct, typically BCD, sometimes even Dishonorable) that was reviewed and recharacterized (to a more favorable character) prior to 1993 when DADT went into affect.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-04-09 18:10:00", 
        "title": "Another story of a hero lost", 
        "userID": "sabow"
    }, 
    {
        "content": "quote: Originally posted by sabow: quote: Originally posted by 19022583: <Snipped...> As a professional Veterans Service Officer for more than 35 years, I can tell you that DADT has corrected MUCH of the pre-DADT military policy regarding gays. With a little fine tuning, DADT can be the catalyst that ensures fairness to ALL military personnel. Your career as a VSO, notwithstanding, does not qualify you to misquote military policy on character of discharge and separation review processes; however, my time as a personnel records specialist (75D), the many discharges I have overseen and my current occupation with the Department of Veterans Affairs does. It was not until 1979 that DoD was required by the courts in Giles v. Secretary of the Army (Civil Action No. 77-0904) to grant requests for review of separation with regard to character of discharge, but this was not to address mischaracterized discharges as a result of homosexual conduct. It was more for those involved in other illegal activities that caused them to forfeit their VA benefits. This process is not easy and it is certainly not automatic. In order for a former servicemember to be granted such a change, they have to prove that the discharge was not equitable; in other words it is not consistent with policies and traditions. They also have to prove that the character of discharge was improper; meaning that the reason or characterization of the discharge is in error (i.e., is false, or violates a regulation or a law). If you doubt that, please produce a single Chapter 15 discharge (Discharge for Homosexual Conduct, typically BCD, sometimes even Dishonorable) that was reviewed and recharacterized (to a more favorable character) prior to 1993 when DADT went into affect. I'm certain that you must have meant something other than what you said in your first paragraph, i.e. that while I was not qualified to misquote military policy....that somehow your current occupation with VA does? My statement was intended to say that post/DADT I was successful in obtaining favorable discharge reviews for veterans separated for homosexual conduct. I'd be happy to cite examples for you, but as a VA employee....I'm certain you MUST be familiar with the provisions of the Privacy Act. BTW....should we believe that you concur with the spirit and accuracy of the newspaper article? If so, we have good reason to be concerned about federal employees who are entrusted to insure that benefits are correctly awarded.", 
        "intTime": 20090410, 
        "postID": 16, 
        "quote": "Originally posted by sabow: quote: Originally posted by 19022583: <Snipped...> As a professional Veterans Service Officer for more than 35 years, I can tell you that DADT has corrected MUCH of the pre-DADT military policy regarding gays. With a little fine tuning, DADT can be the catalyst that ensures fairness to ALL military personnel. Your career as a VSO, notwithstanding, does not qualify you to misquote military policy on character of discharge and separation review processes; however, my time as a personnel records specialist (75D), the many discharges I have overseen and my current occupation with the Department of Veterans Affairs does. It was not until 1979 that DoD was required by the courts in Giles v. Secretary of the Army (Civil Action No. 77-0904) to grant requests for review of separation with regard to character of discharge, but this was not to address mischaracterized discharges as a result of homosexual conduct. It was more for those involved in other illegal activities that caused them to forfeit their VA benefits. This process is not easy and it is certainly not automatic. In order for a former servicemember to be granted such a change, they have to prove that the discharge was not equitable; in other words it is not consistent with policies and traditions. They also have to prove that the character of discharge was improper; meaning that the reason or characterization of the discharge is in error (i.e., is false, or violates a regulation or a law). If you doubt that, please produce a single Chapter 15 discharge (Discharge for Homosexual Conduct, typically BCD, sometimes even Dishonorable) that was reviewed and recharacterized (to a more favorable character) prior to 1993 when DADT went into affect.", 
        "reply": " I'm certain that you must have meant something other than what you said in your first paragraph, i.e. that while I was not qualified to misquote military policy....that somehow your current occupation with VA does? My statement was intended to say that post/DADT I was successful in obtaining favorable discharge reviews for veterans separated for homosexual conduct. I'd be happy to cite examples for you, but as a VA employee....I'm certain you MUST be familiar with the provisions of the Privacy Act. BTW....should we believe that you concur with the spirit and accuracy of the newspaper article? If so, we have good reason to be concerned about federal employees who are entrusted to insure that benefits are correctly awarded.", 
        "threadID": "27819558_1370031812001", 
        "time": "2009-04-10 10:16:00", 
        "title": "Another story of a hero lost", 
        "userID": "19022583"
    }
]