[
    {
        "content": "Same-sex marriage around the world From criminal prosecutions to legal unions Before the Criminal Law Amendment Act was passed in 1969, homosexuality was a criminal offence in Canada, as it remains to this day in many other countries. Four decades later, this country and six others — Belgium, The Netherlands, Norway, Spain, South Africa and Sweden — grant marriage rights to same-sex couples on an equal footing with heterosexuals. Many other countries, as well as most American states, have laws restricting access to same-sex marriage. Here are some key dates in the story: Before the Criminal Law Amendment Act was passed in 1969, homosexuality was a criminal offence in Canada, as it remains to this day in many other countries. Four decades later, this country and six others — Belgium, The Netherlands, Norway, Spain, South Africa and Sweden — grant marriage rights to same-sex couples on an equal footing with heterosexuals. Many other countries, as well as most American states, have laws restricting access to same-sex marriage. Here are some key dates in the story: May 26, 2009: The U.S. In a 6-1 decision, the California Supreme Court upholds the state's same-sex marriage ban. But it also rules that the roughly 18,000 existing same-sex marriages carried out in the state before the ban can stand. Supporters of same-sex marriage vow to press on, hoping to put another proposition over the issue on the 2010 state ballot and eyeing another legal challenge before the Supreme Court in Washington, D.C. May 18, 2009: The U.S. Washington state Gov. Chris Gregoire signs into law a bill that extends all the domestic rights and benefits of heterosexual marriages to same-sex couples. The \"everything but marriage\" law will take effect in July 26, unless opponents can gather enough signatures to force a referendum on the question. May 13, 2009: The U.S. The New York State Assembly passes a same-sex marriage bill, bringing New York one step closer to legalizing such marriages. The bill, which passed 89-52, will now go on to the state Senate for a vote. If passed there, it will go to Gov. David Paterson, who has made it clear he will sign the bill. May 9, 2009: Hungary Hungary's official government publication announces that gay couples will be able to register domestic partnerships beginning July 1, provided both partners are at least 18 years old. Under the law, same-sex couples will not be able to adopt children together. Partners will be required to provide care for each other’s children from earlier relationships if the children are recognized as belonging to the partnership. May 6, 2009: The U.S. Lawmakers vote in favour of same-sex marriage in New Hampshire and Maine. Maine Gov. John Baldacci signed the bill less than an hour after the legislature approved it, making his state the fifth to legalize gay marriage. New Hampshire's governor has not yet signed his state's bill. April 7, 2009: The U.S. Vermont becomes the fourth state to recognize gay marriage. At the same time, Washington D.C. also moves to recognize same-sex unions performed in other states. \"I think we're going to look back at this week as a moment when our entire country turned a corner,\" activist Jennifer C. Pizer told the Washington Post. \"Each time there's an important step forward, it makes it easier for others to follow.\" April 3, 2009: The U.S. Iowa becomes the third state to allow same-sex marriages after the state's Supreme Court unanimously upholds a lower court's decision to strike down a 1998 state law defining marriage as a union between a man and a woman. Several couples rushed to tie the knot on April 27, the day the ruling took effect. April 1, 2009: Sweden Sweden's parliament votes 226-22 to recognize same-sex marriage, becoming the fifth country in Europe to do so. Sweden gave gay couples legal \"partnership\" rights in the mid-1990s, and allowed them to adopt children from 2002. The new law, which comes into force May 1, lets homosexuals wed in either a civil or religious ceremony, though individual churches can opt out. Nov. 4, 2008: The U.S. A majority of California voters — 52 per cent — support Proposition 8, a ballot initiative that defined marriage in the state constitution as a union between a man and a woman. Spending for and against Prop 8 reached $74 million US, the most expensive social-issues campaign in U.S. history. The passing of Proposition 8 leaves Connecticut and Massachusetts as the only two states to allow gay marriage. Amendments to ban gay marriage are also approved in Arizona and Florida. Arkansas voters approve a measure banning unmarried couples from serving as adoptive or foster parents. Supporters of the Arkansas measure make it clear that gays and lesbians are their main target. Oct. 10, 2008: The U.S. Connecticut becomes the third state, after Massachusetts and California, to legalize same-sex marriage. The move came after eight same-sex couples sued the state, which had only allowed them to be joined through civil unions. The state Supreme Court ruled 4-3 in their favour. Aug. 19, 2008: Argentina Argentina grants gay couples the right to collect the pensions of their dead partners, provided they can show they have lived with their partner for at least five years. June 16, 2008: The U.S. A month after California's Supreme Court struck down the state's ban on same-sex marriage as unconstitutional, dozens of couples exchange vows at San Francisco City Hall. California becomes the second U.S. state, after Massachusetts, to grant equal marriage rights. Opponents of the decision, however, say they have enough signatures on a petition to call for a statewide vote on a constitutional ban in the fall. June 11, 2008: Norway Norway's parliament passes a law allowing same-sex couples to marry and adopt children, by a vote of 84 to 41. The legislation replaces a 1993 \"partnership\" act that allowed same-sex civil unions. Feb. 9, 2007: Italy The Italian cabinet approves legislation to grant legal rights to unmarried couples — both same-sex and heterosexual — but stops short of allowing gay marriage. Nov. 21, 2006: Israel Israel's High Court of Justice rules that two gay men married in Canada, as well as four other same-sex couples wedded abroad, should have their union recognized in Israel. Nov. 14, 2006: South Africa South Africa's parliament passes a bill giving same-sex couples the legal right to marry or to have a civil union, making it the first African country to approve same-sex marriage. Nov. 7, 2006: The U.S. Voters in Arizona, Colorado, Idaho, South Carolina, South Dakota, Tennessee, Virginia and Wisconsin are asked whether they support a ban on same-sex marriage. The ballot measure passes in all states except Arizona. Oct. 25, 2006: The U.S. New Jersey's Supreme Court rules that same-sex couples are entitled to the same civil rights as heterosexual couples. The ruling does not approve gay marriage in the state and gives the legislature six months to decide on a definition of marriage. July 6, 2006: The U.S. Top courts in two U.S. states — New York and Georgia — hand down decisions against the gay marriage movement. The New York Court of Appeals, the state's highest court, rules same-sex unions are not allowed under state law. Georgia's Supreme Court reinstates a voter-approved ban on gay marriage, reversing a lower court's ruling. June 30, 2005: Spain The Spanish parliament makes gay marriage and adoption legal. The law also allows people to inherit the property of their same-sex partner. April 14, 2005: The U.S. The Oregon Supreme Court throws out nearly 3,000 marriage licences issued to same-sex couples by Multnomah County. It says laws governing marriage are a state matter and the county didn't have the authority to issue the licences. March 15, 2005: The U.S. A judge in San Francisco Superior Court rules that California's ban on gay marriage is unconstitutional and has \"no rational purpose,\" comparing it to laws requiring racial segregation. January 2005: The U.S. The Indiana Court of Appeals supports a state law prohibiting recognition of same-sex marriages, including those that take place in states where they are legal. Louisiana's Supreme Court reinstates a state constitutional amendment prohibiting gay marriage. A judge in Florida throws out a lawsuit filed by two women who want their Massachusetts marriage recognized there. Dec. 9, 2004: New Zealand New Zealand passes the Civil Union Bill to recognize unions between homosexual couples and unmarried heterosexuals, giving them the same rights as married couples in child custody, taxes and welfare. Nov. 30, 2004: South Africa The Supreme Court of Appeal rules in favour of a lesbian couple seeking to have the common-law definition of marriage changed to a \"union between two persons.\" The government would later announce plans to appeal the decision to the Constitutional Court, the country's highest. Nov. 29, 2004: The U.S. The Supreme Court rejects a challenge to the ruling of the Massachusetts Supreme Court allowing same-sex couples to get married. The challenge was launched by conservative religious groups and 11 state lawmakers. Nov. 2, 2004: The U.S. In the U.S. national election, voters in 11 states — Arkansas, Georgia, Kentucky, Michigan, Mississippi, Montana, Oklahoma, Ohio, North Dakota, Oregon and Utah — pass amendments to state constitutions banning same-sex marriage. Oct. 18, 2004: The United Kingdom The Anglican Church criticizes the U.S. Episcopal Church for consecrating Gene Robinson, who is openly gay, as bishop of New Hampshire. The report also suggests the 38 national churches that make up the Anglican Communion sign an agreement to support the church's current teachings, which also prohibit same-sex marriages. Aug. 12, 2004: The U.S. The Supreme Court of California voids more than 4,000 same-sex marriages performed in San Francisco between Feb. 12 and March 11, 2004. The justices rule that the city's mayor overstepped his authority by issuing marriage licences to gay couples. Aug. 3, 2004: The U.S. About 72 per cent of Missouri voters support an amendment to the state constitution banning gay marriage, making Missouri the first state to do so. Missouri already has laws defining marriage as only between a man and a woman, but some opposed to gay marriages say an amendment is the only way to prevent courts from legalizing it, as they did in Massachusetts. July 14, 2004: The U.S. The U.S. Senate rejects a bid to amend the constitution to ban gay marriage. Before the vote, Republicans said a setback in the Senate would not deter their efforts to get the amendment passed. Six Republicans voted with the Democrats against the measure. May 24, 2004: Australia Prime Minister John Howard asks Parliament to define marriage as a union between a man and a woman. The government also takes steps to block gays from adopting children from overseas. However, homosexuals would be allowed to name their partners as beneficiaries for pension and death benefits. May 17, 2004: The U.S. After a state Supreme Court ruling that struck down Massachusetts' gay marriage ban, city clerks across the state hand out marriage licence applications to gay couples, making it the first state to legalize same-sex marriages. April 13, 2004: Zanzibar The parliament of this semi-autonomous and mainly Muslim island unanimously passes a bill outlawing homosexuality. The penalty for being in a homosexual relationship is a prison term of 25 years for men and seven years for women. March 11, 2004: The U.S. The California Supreme Court orders San Francisco to stop same-sex marriages, nearly one month after the city issued its first same-sex marriage licence to a lesbian couple. In that time, more than 3,700 same-sex couples were wed, including comedian Rosie O'Donnell and her partner Kelli Carpenter. March 3, 2004: The U.S. New York's attorney general, Eliot Spitzer, says gay marriage is illegal in his state. The mayor of New Paltz, a village outside of New York City, faces 19 criminal charges for marrying 25 same-sex couples. Feb. 24, 2004: The U.S. President George W. Bush calls on Congress to prepare a constitutional amendment that would ban same-sex marriage, and \"define and protect marriage as the union of a man and woman as husband and wife.\" Feb. 12, 2004: The U.S. City officials in San Francisco marry a lesbian couple in a closed ceremony at City Hall, defying a state ballot measure defining marriage as a union between a man and a woman. In the following days, more than 3,200 same-sex couples are married. July 31, 2003: The Vatican The Vatican issues a 12-page set of guidelines, approved by Pope John Paul, warning Catholic politicians that it is immoral to support same-sex unions. \"There are absolutely no grounds for considering homosexual unions to be in any way similar or even remotely analogous to God's plan for marriage and family,\" it says. \"Marriage is holy, while homosexual acts go against the natural moral law.\" April 1, 2001: The Netherlands The Netherlands jumps to the forefront when its lower house of parliament enacts the world's most comprehensive legal recognition of gay rights. The Dutch law allows same-sex couples to marry and gives them the same rights as heterosexuals when it comes to adopting. The only restrictions to the new law are that same-sex couples can only adopt Dutch children, and foreign same-sex couples can't come to the Netherlands to marry unless one of them lives there. The law tops Denmark's law, which allows gays and lesbians to adopt their partners' children but not children outside the marriage. Pope John Paul II criticizes the new law saying no adult relationship other than that of a man and a woman should be recognized as marriage. July 1, 2000: The U.S. Vermont's civil union law comes into effect making it the first state in the U.S. to provide same-sex couples with rights, benefits and responsibilities similar to those of heterosexual couples, including medical decision-making, tax breaks and inheritance. However, the unions won't be recognized in other states. Hawaii allows adults who can't legally marry to register as domestic partners. Oct. 1, 1989: Denmark Denmark becomes the first country to legally recognize same-sex partnerships, essentially sanctioning gay marriages. The Danish Registered Partnership Act states \"Two persons of the same sex may have their partnership registered\" and \"the registration of a partnership shall have the same legal effects as the contracting of marriage.\" By 2001, Norway, Sweden, Iceland, the Netherlands and France will recognize registered partnerships. Feb. 25, 1982: The U.S. Wisconsin becomes the first state in the U.S. to pass a gay civil rights law. Massachusetts, Connecticut, Minnesota and Rhode Island follow, with Massachusetts passing a law forbidding the placement of children for adoption or foster care with gay people. June 27, 1969: The U.S. At about midnight, New York City police raid the Stonewall Inn, a private gay club on St. Christopher St. in Greenwich Village. Raids on gay and lesbian bars were common but this time people fight back. The events of June 17, 1969 and the violent protests that occurred during the nights that followed are known as The Stonewall Riots, which is seen as the beginning of the gay civil rights movement in the United States. July 27, 1967: The United Kingdom England and Wales decriminalize private homosexual acts between consenting adult men over the age of 21, except for those in the military and police. Scotland and Northern Ireland follow in 1980 and 1982, respectively. 1961: The U.S. Illinois repeals its sodomy laws making it the first state in the U.S. to decriminalize homosexuality between consenting adults in private. The law takes effect in 1962. Connecticut follows in 1969 with the law taking effect in 1971. In the 1970s a rush of other states decriminalize homosexuality including Colorado, Oregon, Ohio, Hawaii, Delaware, New Hampshire, Maine, California, Washington, New Mexico, West Virginia, South Dakota, Indiana, Iowa, Wyoming, North Dakota, Vermont, Arizona, and New Jersey. Aug. 6, 1885: The United Kingdom The British Parliament votes to make homosexual acts a criminal offence.", 
        "intTime": 20090529, 
        "postID": 1, 
        "quote": "", 
        "reply": "Same-sex marriage around the world From criminal prosecutions to legal unions Before the Criminal Law Amendment Act was passed in 1969, homosexuality was a criminal offence in Canada, as it remains to this day in many other countries. Four decades later, this country and six others — Belgium, The Netherlands, Norway, Spain, South Africa and Sweden — grant marriage rights to same-sex couples on an equal footing with heterosexuals. Many other countries, as well as most American states, have laws restricting access to same-sex marriage. Here are some key dates in the story: Before the Criminal Law Amendment Act was passed in 1969, homosexuality was a criminal offence in Canada, as it remains to this day in many other countries. Four decades later, this country and six others — Belgium, The Netherlands, Norway, Spain, South Africa and Sweden — grant marriage rights to same-sex couples on an equal footing with heterosexuals. Many other countries, as well as most American states, have laws restricting access to same-sex marriage. Here are some key dates in the story: May 26, 2009: The U.S. In a 6-1 decision, the California Supreme Court upholds the state's same-sex marriage ban. But it also rules that the roughly 18,000 existing same-sex marriages carried out in the state before the ban can stand. Supporters of same-sex marriage vow to press on, hoping to put another proposition over the issue on the 2010 state ballot and eyeing another legal challenge before the Supreme Court in Washington, D.C. May 18, 2009: The U.S. Washington state Gov. Chris Gregoire signs into law a bill that extends all the domestic rights and benefits of heterosexual marriages to same-sex couples. The \"everything but marriage\" law will take effect in July 26, unless opponents can gather enough signatures to force a referendum on the question. May 13, 2009: The U.S. The New York State Assembly passes a same-sex marriage bill, bringing New York one step closer to legalizing such marriages. The bill, which passed 89-52, will now go on to the state Senate for a vote. If passed there, it will go to Gov. David Paterson, who has made it clear he will sign the bill. May 9, 2009: Hungary Hungary's official government publication announces that gay couples will be able to register domestic partnerships beginning July 1, provided both partners are at least 18 years old. Under the law, same-sex couples will not be able to adopt children together. Partners will be required to provide care for each other’s children from earlier relationships if the children are recognized as belonging to the partnership. May 6, 2009: The U.S. Lawmakers vote in favour of same-sex marriage in New Hampshire and Maine. Maine Gov. John Baldacci signed the bill less than an hour after the legislature approved it, making his state the fifth to legalize gay marriage. New Hampshire's governor has not yet signed his state's bill. April 7, 2009: The U.S. Vermont becomes the fourth state to recognize gay marriage. At the same time, Washington D.C. also moves to recognize same-sex unions performed in other states. \"I think we're going to look back at this week as a moment when our entire country turned a corner,\" activist Jennifer C. Pizer told the Washington Post. \"Each time there's an important step forward, it makes it easier for others to follow.\" April 3, 2009: The U.S. Iowa becomes the third state to allow same-sex marriages after the state's Supreme Court unanimously upholds a lower court's decision to strike down a 1998 state law defining marriage as a union between a man and a woman. Several couples rushed to tie the knot on April 27, the day the ruling took effect. April 1, 2009: Sweden Sweden's parliament votes 226-22 to recognize same-sex marriage, becoming the fifth country in Europe to do so. Sweden gave gay couples legal \"partnership\" rights in the mid-1990s, and allowed them to adopt children from 2002. The new law, which comes into force May 1, lets homosexuals wed in either a civil or religious ceremony, though individual churches can opt out. Nov. 4, 2008: The U.S. A majority of California voters — 52 per cent — support Proposition 8, a ballot initiative that defined marriage in the state constitution as a union between a man and a woman. Spending for and against Prop 8 reached $74 million US, the most expensive social-issues campaign in U.S. history. The passing of Proposition 8 leaves Connecticut and Massachusetts as the only two states to allow gay marriage. Amendments to ban gay marriage are also approved in Arizona and Florida. Arkansas voters approve a measure banning unmarried couples from serving as adoptive or foster parents. Supporters of the Arkansas measure make it clear that gays and lesbians are their main target. Oct. 10, 2008: The U.S. Connecticut becomes the third state, after Massachusetts and California, to legalize same-sex marriage. The move came after eight same-sex couples sued the state, which had only allowed them to be joined through civil unions. The state Supreme Court ruled 4-3 in their favour. Aug. 19, 2008: Argentina Argentina grants gay couples the right to collect the pensions of their dead partners, provided they can show they have lived with their partner for at least five years. June 16, 2008: The U.S. A month after California's Supreme Court struck down the state's ban on same-sex marriage as unconstitutional, dozens of couples exchange vows at San Francisco City Hall. California becomes the second U.S. state, after Massachusetts, to grant equal marriage rights. Opponents of the decision, however, say they have enough signatures on a petition to call for a statewide vote on a constitutional ban in the fall. June 11, 2008: Norway Norway's parliament passes a law allowing same-sex couples to marry and adopt children, by a vote of 84 to 41. The legislation replaces a 1993 \"partnership\" act that allowed same-sex civil unions. Feb. 9, 2007: Italy The Italian cabinet approves legislation to grant legal rights to unmarried couples — both same-sex and heterosexual — but stops short of allowing gay marriage. Nov. 21, 2006: Israel Israel's High Court of Justice rules that two gay men married in Canada, as well as four other same-sex couples wedded abroad, should have their union recognized in Israel. Nov. 14, 2006: South Africa South Africa's parliament passes a bill giving same-sex couples the legal right to marry or to have a civil union, making it the first African country to approve same-sex marriage. Nov. 7, 2006: The U.S. Voters in Arizona, Colorado, Idaho, South Carolina, South Dakota, Tennessee, Virginia and Wisconsin are asked whether they support a ban on same-sex marriage. The ballot measure passes in all states except Arizona. Oct. 25, 2006: The U.S. New Jersey's Supreme Court rules that same-sex couples are entitled to the same civil rights as heterosexual couples. The ruling does not approve gay marriage in the state and gives the legislature six months to decide on a definition of marriage. July 6, 2006: The U.S. Top courts in two U.S. states — New York and Georgia — hand down decisions against the gay marriage movement. The New York Court of Appeals, the state's highest court, rules same-sex unions are not allowed under state law. Georgia's Supreme Court reinstates a voter-approved ban on gay marriage, reversing a lower court's ruling. June 30, 2005: Spain The Spanish parliament makes gay marriage and adoption legal. The law also allows people to inherit the property of their same-sex partner. April 14, 2005: The U.S. The Oregon Supreme Court throws out nearly 3,000 marriage licences issued to same-sex couples by Multnomah County. It says laws governing marriage are a state matter and the county didn't have the authority to issue the licences. March 15, 2005: The U.S. A judge in San Francisco Superior Court rules that California's ban on gay marriage is unconstitutional and has \"no rational purpose,\" comparing it to laws requiring racial segregation. January 2005: The U.S. The Indiana Court of Appeals supports a state law prohibiting recognition of same-sex marriages, including those that take place in states where they are legal. Louisiana's Supreme Court reinstates a state constitutional amendment prohibiting gay marriage. A judge in Florida throws out a lawsuit filed by two women who want their Massachusetts marriage recognized there. Dec. 9, 2004: New Zealand New Zealand passes the Civil Union Bill to recognize unions between homosexual couples and unmarried heterosexuals, giving them the same rights as married couples in child custody, taxes and welfare. Nov. 30, 2004: South Africa The Supreme Court of Appeal rules in favour of a lesbian couple seeking to have the common-law definition of marriage changed to a \"union between two persons.\" The government would later announce plans to appeal the decision to the Constitutional Court, the country's highest. Nov. 29, 2004: The U.S. The Supreme Court rejects a challenge to the ruling of the Massachusetts Supreme Court allowing same-sex couples to get married. The challenge was launched by conservative religious groups and 11 state lawmakers. Nov. 2, 2004: The U.S. In the U.S. national election, voters in 11 states — Arkansas, Georgia, Kentucky, Michigan, Mississippi, Montana, Oklahoma, Ohio, North Dakota, Oregon and Utah — pass amendments to state constitutions banning same-sex marriage. Oct. 18, 2004: The United Kingdom The Anglican Church criticizes the U.S. Episcopal Church for consecrating Gene Robinson, who is openly gay, as bishop of New Hampshire. The report also suggests the 38 national churches that make up the Anglican Communion sign an agreement to support the church's current teachings, which also prohibit same-sex marriages. Aug. 12, 2004: The U.S. The Supreme Court of California voids more than 4,000 same-sex marriages performed in San Francisco between Feb. 12 and March 11, 2004. The justices rule that the city's mayor overstepped his authority by issuing marriage licences to gay couples. Aug. 3, 2004: The U.S. About 72 per cent of Missouri voters support an amendment to the state constitution banning gay marriage, making Missouri the first state to do so. Missouri already has laws defining marriage as only between a man and a woman, but some opposed to gay marriages say an amendment is the only way to prevent courts from legalizing it, as they did in Massachusetts. July 14, 2004: The U.S. The U.S. Senate rejects a bid to amend the constitution to ban gay marriage. Before the vote, Republicans said a setback in the Senate would not deter their efforts to get the amendment passed. Six Republicans voted with the Democrats against the measure. May 24, 2004: Australia Prime Minister John Howard asks Parliament to define marriage as a union between a man and a woman. The government also takes steps to block gays from adopting children from overseas. However, homosexuals would be allowed to name their partners as beneficiaries for pension and death benefits. May 17, 2004: The U.S. After a state Supreme Court ruling that struck down Massachusetts' gay marriage ban, city clerks across the state hand out marriage licence applications to gay couples, making it the first state to legalize same-sex marriages. April 13, 2004: Zanzibar The parliament of this semi-autonomous and mainly Muslim island unanimously passes a bill outlawing homosexuality. The penalty for being in a homosexual relationship is a prison term of 25 years for men and seven years for women. March 11, 2004: The U.S. The California Supreme Court orders San Francisco to stop same-sex marriages, nearly one month after the city issued its first same-sex marriage licence to a lesbian couple. In that time, more than 3,700 same-sex couples were wed, including comedian Rosie O'Donnell and her partner Kelli Carpenter. March 3, 2004: The U.S. New York's attorney general, Eliot Spitzer, says gay marriage is illegal in his state. The mayor of New Paltz, a village outside of New York City, faces 19 criminal charges for marrying 25 same-sex couples. Feb. 24, 2004: The U.S. President George W. Bush calls on Congress to prepare a constitutional amendment that would ban same-sex marriage, and \"define and protect marriage as the union of a man and woman as husband and wife.\" Feb. 12, 2004: The U.S. City officials in San Francisco marry a lesbian couple in a closed ceremony at City Hall, defying a state ballot measure defining marriage as a union between a man and a woman. In the following days, more than 3,200 same-sex couples are married. July 31, 2003: The Vatican The Vatican issues a 12-page set of guidelines, approved by Pope John Paul, warning Catholic politicians that it is immoral to support same-sex unions. \"There are absolutely no grounds for considering homosexual unions to be in any way similar or even remotely analogous to God's plan for marriage and family,\" it says. \"Marriage is holy, while homosexual acts go against the natural moral law.\" April 1, 2001: The Netherlands The Netherlands jumps to the forefront when its lower house of parliament enacts the world's most comprehensive legal recognition of gay rights. The Dutch law allows same-sex couples to marry and gives them the same rights as heterosexuals when it comes to adopting. The only restrictions to the new law are that same-sex couples can only adopt Dutch children, and foreign same-sex couples can't come to the Netherlands to marry unless one of them lives there. The law tops Denmark's law, which allows gays and lesbians to adopt their partners' children but not children outside the marriage. Pope John Paul II criticizes the new law saying no adult relationship other than that of a man and a woman should be recognized as marriage. July 1, 2000: The U.S. Vermont's civil union law comes into effect making it the first state in the U.S. to provide same-sex couples with rights, benefits and responsibilities similar to those of heterosexual couples, including medical decision-making, tax breaks and inheritance. However, the unions won't be recognized in other states. Hawaii allows adults who can't legally marry to register as domestic partners. Oct. 1, 1989: Denmark Denmark becomes the first country to legally recognize same-sex partnerships, essentially sanctioning gay marriages. The Danish Registered Partnership Act states \"Two persons of the same sex may have their partnership registered\" and \"the registration of a partnership shall have the same legal effects as the contracting of marriage.\" By 2001, Norway, Sweden, Iceland, the Netherlands and France will recognize registered partnerships. Feb. 25, 1982: The U.S. Wisconsin becomes the first state in the U.S. to pass a gay civil rights law. Massachusetts, Connecticut, Minnesota and Rhode Island follow, with Massachusetts passing a law forbidding the placement of children for adoption or foster care with gay people. June 27, 1969: The U.S. At about midnight, New York City police raid the Stonewall Inn, a private gay club on St. Christopher St. in Greenwich Village. Raids on gay and lesbian bars were common but this time people fight back. The events of June 17, 1969 and the violent protests that occurred during the nights that followed are known as The Stonewall Riots, which is seen as the beginning of the gay civil rights movement in the United States. July 27, 1967: The United Kingdom England and Wales decriminalize private homosexual acts between consenting adult men over the age of 21, except for those in the military and police. Scotland and Northern Ireland follow in 1980 and 1982, respectively. 1961: The U.S. Illinois repeals its sodomy laws making it the first state in the U.S. to decriminalize homosexuality between consenting adults in private. The law takes effect in 1962. Connecticut follows in 1969 with the law taking effect in 1971. In the 1970s a rush of other states decriminalize homosexuality including Colorado, Oregon, Ohio, Hawaii, Delaware, New Hampshire, Maine, California, Washington, New Mexico, West Virginia, South Dakota, Indiana, Iowa, Wyoming, North Dakota, Vermont, Arizona, and New Jersey. Aug. 6, 1885: The United Kingdom The British Parliament votes to make homosexual acts a criminal offence.", 
        "threadID": "27819558_2220046422001", 
        "time": "2009-05-29 20:00:00", 
        "title": "Same-sex marriage around the world", 
        "userID": "IHAWKER"
    }
]