[
    {
        "content": "Iraqi police: 2 gay men killed in Baghdad slum Attack comes after leading cleric repeatedly condemns homosexuality BAGHDAD - The bodies of two gay men have been found in Baghdad's Shiite slum of Sadr City after a leading cleric repeatedly condemned homosexuality, an Iraqi police official said Saturday. The killings come after Shiite cleric Sattar al-Battat repeatedly condemned homosexuality during recent Friday prayers, saying Islam prohibits homosexuality. Homosexual acts are punishable by up to seven years in prison in Iraq. The two men were believed killed Thursday by relatives who were shamed by their behavior, said the official. Police said they suspected the killings were at the hands of family members because no one has claimed the bodies or called for an investigation. >http://www.msnbc.msn.com/id/30045225/", 
        "intTime": 20090406, 
        "postID": 1, 
        "quote": "", 
        "reply": "Iraqi police: 2 gay men killed in Baghdad slum Attack comes after leading cleric repeatedly condemns homosexuality BAGHDAD - The bodies of two gay men have been found in Baghdad's Shiite slum of Sadr City after a leading cleric repeatedly condemned homosexuality, an Iraqi police official said Saturday. The killings come after Shiite cleric Sattar al-Battat repeatedly condemned homosexuality during recent Friday prayers, saying Islam prohibits homosexuality. Homosexual acts are punishable by up to seven years in prison in Iraq. The two men were believed killed Thursday by relatives who were shamed by their behavior, said the official. Police said they suspected the killings were at the hands of family members because no one has claimed the bodies or called for an investigation. >http://www.msnbc.msn.com/id/30045225/", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-06 14:31:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Six gay men shot to death in Iraq by tribe members BAGHDAD, Iraq (CNN) -- Six gay men were shot dead by members of their tribe in two separate incidents in the past 10 days, an official with Iraq's Interior ministry said. In the most recent attack, two men were killed Thursday in Sadr City area of Baghdad after they were disowned by relatives, the official said. On March 26, four additional men were fatally shot in the same city, the official said, adding that the victims had also been disowned by their >http://www.cnn.com/2009/WORLD/meast/04/05/gay.deaths.iraq/index.html", 
        "intTime": 20090406, 
        "postID": 2, 
        "quote": "", 
        "reply": "Six gay men shot to death in Iraq by tribe members BAGHDAD, Iraq (CNN) -- Six gay men were shot dead by members of their tribe in two separate incidents in the past 10 days, an official with Iraq's Interior ministry said. In the most recent attack, two men were killed Thursday in Sadr City area of Baghdad after they were disowned by relatives, the official said. On March 26, four additional men were fatally shot in the same city, the official said, adding that the victims had also been disowned by their >http://www.cnn.com/2009/WORLD/meast/04/05/gay.deaths.iraq/index.html", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-06 14:32:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Six gay men shot to death in Iraq by tribe members BAGHDAD, Iraq (CNN) -- Six gay men were shot dead by members of their tribe in two separate incidents in the past 10 days, an official with Iraq's Interior ministry said. In the most recent attack, two men were killed Thursday in Sadr City area of Baghdad after they were disowned by relatives, the official said. On March 26, four additional men were fatally shot in the same city, the official said, adding that the victims had also been disowned by their >http://www.cnn.com/2009/WORLD/meast/04/05/gay.deaths.iraq/index.html So, maybe we should use that as an example.... oh but, wait, we can't use pro-homosexual nations ideas, so I guess we can't use any? Seems to me, if this as a policy and not urban justice, they are more closely aligned to Iraq's \"gay free\" ideology.", 
        "intTime": 20090406, 
        "postID": 3, 
        "quote": "Originally posted by IHAWKER: Six gay men shot to death in Iraq by tribe members BAGHDAD, Iraq (CNN) -- Six gay men were shot dead by members of their tribe in two separate incidents in the past 10 days, an official with Iraq's Interior ministry said. In the most recent attack, two men were killed Thursday in Sadr City area of Baghdad after they were disowned by relatives, the official said. On March 26, four additional men were fatally shot in the same city, the official said, adding that the victims had also been disowned by their >http://www.cnn.com/2009/WORLD/meast/04/05/gay.deaths.iraq/index.html", 
        "reply": " So, maybe we should use that as an example.... oh but, wait, we can't use pro-homosexual nations ideas, so I guess we can't use any? Seems to me, if this as a policy and not urban justice, they are more closely aligned to Iraq's \"gay free\" ideology.", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-06 14:42:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "reducetension"
    }, 
    {
        "content": "All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds.", 
        "intTime": 20090406, 
        "postID": 4, 
        "quote": "", 
        "reply": "All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds.", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-06 14:49:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Shari'a law... Biblical law... And people wonder why I'm extremely cynical about the fringe-groups in this country who want to push religious law into the mainstream. This is what happens. This could happen in the United States if we went down that road.", 
        "intTime": 20090406, 
        "postID": 5, 
        "quote": "", 
        "reply": "Shari'a law... Biblical law... And people wonder why I'm extremely cynical about the fringe-groups in this country who want to push religious law into the mainstream. This is what happens. This could happen in the United States if we went down that road.", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-06 18:58:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "The conservatives are being very silent about this.", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "", 
        "reply": "The conservatives are being very silent about this.", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-08 21:00:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds. Wouldn't that make you much the same as him?", 
        "intTime": 20090409, 
        "postID": 7, 
        "quote": "Originally posted by IHAWKER: All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds.", 
        "reply": " Wouldn't that make you much the same as him?", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-09 07:52:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: quote: Originally posted by IHAWKER: All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds. Wouldn't that make you much the same as him? That's like saying the Allies in WWII were the same as the Nazis and Hitler. \"Oooh, American Soldiers killed Nazi soldiers, so that makes the Americans just as bad!\" We all know that isn't true. When an oppressive, hateful, and malicious person, group, or force rises, the people who stand up to stop it often have to use less-than-desirable methods. Sucker-punching an innocent person is a bad thing. Sucker-punching Fred Phelps would be freakin' hilarious, and would probably gain the applause, appreciation, and approval of almost everyone. Shooting an innocent person is a bad thing. Shooting a person who has incited deadly violence and \"witch-hunts\" against innocent people... maybe isn't quite so bad.", 
        "intTime": 20090409, 
        "postID": 8, 
        "quote": "Originally posted by 19022583: quote: Originally posted by IHAWKER: All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds. Wouldn't that make you much the same as him?", 
        "reply": " That's like saying the Allies in WWII were the same as the Nazis and Hitler. \"Oooh, American Soldiers killed Nazi soldiers, so that makes the Americans just as bad!\" We all know that isn't true. When an oppressive, hateful, and malicious person, group, or force rises, the people who stand up to stop it often have to use less-than-desirable methods. Sucker-punching an innocent person is a bad thing. Sucker-punching Fred Phelps would be freakin' hilarious, and would probably gain the applause, appreciation, and approval of almost everyone. Shooting an innocent person is a bad thing. Shooting a person who has incited deadly violence and \"witch-hunts\" against innocent people... maybe isn't quite so bad.", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-09 08:19:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by 19022583: quote: Originally posted by IHAWKER: All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds. Wouldn't that make you much the same as him? Amazing, truly amazing that you would even think like that. Very telling indeed.", 
        "intTime": 20090409, 
        "postID": 9, 
        "quote": "Originally posted by 19022583: quote: Originally posted by IHAWKER: All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds. Wouldn't that make you much the same as him?", 
        "reply": " Amazing, truly amazing that you would even think like that. Very telling indeed.", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-09 09:22:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Colorado congressman Polis fights for gay rights in Iraq Jared Polis is in Iraq to protest the treatment of gay people in that country. The openly-gay Polis (the representative from Boulder elected to replace Mark Udall after he left to become a U.S. Senator), has been investigating the treatment of gay Iraqis for several months now. Via human rights groups, Polis has been in contact with transgender and gay Iraqis who have been persecuted for their sexual orientation. Polis is discussing his concern about the human rights violations with the Iraqi government. On April 4, two men were killed because their homosexuality shamed their relatives. Homosexuality is also illegal in Iraq, and the New York Times reported this week that a recent crackdown has resulted in the discovery of “the bodies of as many as 25 boys and men suspected of being gay.” >http://www.examiner.com/x-6256-Denver-Legal-News-Examiner~y2009m4d9-Colorado-congressman-Polis-fights-for-gay-rights-in-Iraq", 
        "intTime": 20090410, 
        "postID": 10, 
        "quote": "", 
        "reply": "Colorado congressman Polis fights for gay rights in Iraq Jared Polis is in Iraq to protest the treatment of gay people in that country. The openly-gay Polis (the representative from Boulder elected to replace Mark Udall after he left to become a U.S. Senator), has been investigating the treatment of gay Iraqis for several months now. Via human rights groups, Polis has been in contact with transgender and gay Iraqis who have been persecuted for their sexual orientation. Polis is discussing his concern about the human rights violations with the Iraqi government. On April 4, two men were killed because their homosexuality shamed their relatives. Homosexuality is also illegal in Iraq, and the New York Times reported this week that a recent crackdown has resulted in the discovery of “the bodies of as many as 25 boys and men suspected of being gay.” >http://www.examiner.com/x-6256-Denver-Legal-News-Examiner~y2009m4d9-Colorado-congressman-Polis-fights-for-gay-rights-in-Iraq", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-10 22:28:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by 19022583: quote: Originally posted by IHAWKER: All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds. Wouldn't that make you much the same as him? That's like saying the Allies in WWII were the same as the Nazis and Hitler. \"Oooh, American Soldiers killed Nazi soldiers, so that makes the Americans just as bad!\" We all know that isn't true. When an oppressive, hateful, and malicious person, group, or force rises, the people who stand up to stop it often have to use less-than-desirable methods. Sucker-punching an innocent person is a bad thing. Sucker-punching Fred Phelps would be freakin' hilarious, and would probably gain the applause, appreciation, and approval of almost everyone. Shooting an innocent person is a bad thing. Shooting a person who has incited deadly violence and \"witch-hunts\" against innocent people... maybe isn't quite so bad. So....if heterosexual persons knew of gay people committing similar crimes....it would be OK with you to simply murder them?", 
        "intTime": 20090411, 
        "postID": 11, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by 19022583: quote: Originally posted by IHAWKER: All I can say is that if I were on active duty in Iraq I would keep Shiite cleric Sattar al-Battat in my crosshairs and at the very first opportunity squeeze off a few rounds. Wouldn't that make you much the same as him? That's like saying the Allies in WWII were the same as the Nazis and Hitler. \"Oooh, American Soldiers killed Nazi soldiers, so that makes the Americans just as bad!\" We all know that isn't true. When an oppressive, hateful, and malicious person, group, or force rises, the people who stand up to stop it often have to use less-than-desirable methods. Sucker-punching an innocent person is a bad thing. Sucker-punching Fred Phelps would be freakin' hilarious, and would probably gain the applause, appreciation, and approval of almost everyone. Shooting an innocent person is a bad thing. Shooting a person who has incited deadly violence and \"witch-hunts\" against innocent people... maybe isn't quite so bad.", 
        "reply": " So....if heterosexual persons knew of gay people committing similar crimes....it would be OK with you to simply murder them?", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-11 07:41:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "19022583"
    }, 
    {
        "content": "Polis Demands Action on Gay Iraqi Killings During a visit to Baghdad last week, Colorado congressman Jared Polis -- the first openly gay man elected to the U.S. Congress as a freshman -- called on U.S. and Iraqi officials to launch an investigation into a spate of recent murders of gay men in Iraq. \"The United States should not tolerate human rights violations of any kind, especially by a government that Americans spend billions of taxpayer dollars each year supporting,\" Polis said in a press release. \"Hopefully my trip and letters to U.S. and Iraqi officials will help bring international attention and investigation to this terrible situation and bring an end to any such offenses.\" More at> >http://www.advocate.com/news_detail_ektid78828.asp", 
        "intTime": 20090413, 
        "postID": 12, 
        "quote": "", 
        "reply": "Polis Demands Action on Gay Iraqi Killings During a visit to Baghdad last week, Colorado congressman Jared Polis -- the first openly gay man elected to the U.S. Congress as a freshman -- called on U.S. and Iraqi officials to launch an investigation into a spate of recent murders of gay men in Iraq. \"The United States should not tolerate human rights violations of any kind, especially by a government that Americans spend billions of taxpayer dollars each year supporting,\" Polis said in a press release. \"Hopefully my trip and letters to U.S. and Iraqi officials will help bring international attention and investigation to this terrible situation and bring an end to any such offenses.\" More at> >http://www.advocate.com/news_detail_ektid78828.asp", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-04-13 16:49:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Alleged Executioner of Gay Men in Iraq Speaks of Killings English language newspaper The National, based in Abu Dhabi, reports on the recent executions of gay men in Iraq. They interview a man they call Abu Muslim, who claims to be involved in the actual killings: “We see this [homosexuality] as a serious illness in the community that has been spreading rapidly among the youth after it was brought in from the outside by American soldiers. These are not the habits of Iraq or our community and we must eliminate them...We had approval from the main Iraqi tribes here to liquidate those [men] copying the ways of women. Our aim is not to destabilise the security situation. Our aim is to help stabilise society...Although the Mahdi Army is today limited and in fact stalled, we cannot sit by with our arms crossed while these homosexuals flout the rules and ethics that must be followed under the Islamic religion. These homosexuals think that Iraq is changing and becoming a non-Muslim, liberal society but our tribal and religious customs allow us to punish them in the most severe way.\" Read full article here ... >>>http://www.towleroad.com/2009/05/the-english-language-newspaper-the-national-based-in-abu-dhabi-reports-on-the-recent-executions-of-gay-men-in-iraqthey-int.html", 
        "intTime": 20090505, 
        "postID": 13, 
        "quote": "", 
        "reply": "Alleged Executioner of Gay Men in Iraq Speaks of Killings English language newspaper The National, based in Abu Dhabi, reports on the recent executions of gay men in Iraq. They interview a man they call Abu Muslim, who claims to be involved in the actual killings: “We see this [homosexuality] as a serious illness in the community that has been spreading rapidly among the youth after it was brought in from the outside by American soldiers. These are not the habits of Iraq or our community and we must eliminate them...We had approval from the main Iraqi tribes here to liquidate those [men] copying the ways of women. Our aim is not to destabilise the security situation. Our aim is to help stabilise society...Although the Mahdi Army is today limited and in fact stalled, we cannot sit by with our arms crossed while these homosexuals flout the rules and ethics that must be followed under the Islamic religion. These homosexuals think that Iraq is changing and becoming a non-Muslim, liberal society but our tribal and religious customs allow us to punish them in the most severe way.\" Read full article here ... >>>http://www.towleroad.com/2009/05/the-english-language-newspaper-the-national-based-in-abu-dhabi-reports-on-the-recent-executions-of-gay-men-in-iraqthey-int.html", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-05-05 17:16:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "‘THEY KILL PEOPLE LIKE US,’ SAYS GAY IRAQI By Cheryll Simpson, NBC News Producer Monday, May 04, 2009 BAGHDAD – Widespread violence is down across Baghdad, but not for one minority group. Iraq’s gay population is being targeted by militia groups in a wave of killings that has claimed the lives of up to 25 young men and boys in the past month. \"They know I am gay. I don’t know if I am going to be killed, this is up to God,\" said Moyad, a 38-year-old Baghdad resident who would not give his last name out of fear for his safety. Visibly frightened, he said that he has many friends who have been sadistically tortured, some even murdered. \"They are sticking glue up their anuses; some hospitals refuse to treat them. Is it a war waged against homosexuals?\" he asked. International outrage Most of the attacks have happened in Baghdad’s Shia neighborhoods, and many believe that religious leaders have used Friday sermons in Sadr City as a platform to incite hatred and violence toward homosexuals. The bodies of three gay men were reported to have been found in Sadr City in April with pieces of paper bearing the word for \"pervert\" attached to them. Posters and leaflets have been distributed in the Baghdad neighborhoods of al-Shola, al-Hurya and Sadr City with orders to, \"Cleanse Iraq from the crime of homosexuality.\" Read full article at ... >>>http://worldblog.msnbc.msn.com/archive/2009/05/04/1921277.aspx", 
        "intTime": 20090505, 
        "postID": 14, 
        "quote": "", 
        "reply": "‘THEY KILL PEOPLE LIKE US,’ SAYS GAY IRAQI By Cheryll Simpson, NBC News Producer Monday, May 04, 2009 BAGHDAD – Widespread violence is down across Baghdad, but not for one minority group. Iraq’s gay population is being targeted by militia groups in a wave of killings that has claimed the lives of up to 25 young men and boys in the past month. \"They know I am gay. I don’t know if I am going to be killed, this is up to God,\" said Moyad, a 38-year-old Baghdad resident who would not give his last name out of fear for his safety. Visibly frightened, he said that he has many friends who have been sadistically tortured, some even murdered. \"They are sticking glue up their anuses; some hospitals refuse to treat them. Is it a war waged against homosexuals?\" he asked. International outrage Most of the attacks have happened in Baghdad’s Shia neighborhoods, and many believe that religious leaders have used Friday sermons in Sadr City as a platform to incite hatred and violence toward homosexuals. The bodies of three gay men were reported to have been found in Sadr City in April with pieces of paper bearing the word for \"pervert\" attached to them. Posters and leaflets have been distributed in the Baghdad neighborhoods of al-Shola, al-Hurya and Sadr City with orders to, \"Cleanse Iraq from the crime of homosexuality.\" Read full article at ... >>>http://worldblog.msnbc.msn.com/archive/2009/05/04/1921277.aspx", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-05-05 17:20:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Their religion gives them license to kill & torture innocent people. Their religious leaders spread hatred and condone violence & murder of innocent people. After spilling the blood of thousands of Americans and spending hundreds of billions of dollars in that country to bring them democracy, what they ended up with was a democratically elected government controlled by the religious leaders. Iraq sounds like a great vacation spot for members of the Westboro Baptist Church!!!", 
        "intTime": 20090505, 
        "postID": 15, 
        "quote": "", 
        "reply": "Their religion gives them license to kill & torture innocent people. Their religious leaders spread hatred and condone violence & murder of innocent people. After spilling the blood of thousands of Americans and spending hundreds of billions of dollars in that country to bring them democracy, what they ended up with was a democratically elected government controlled by the religious leaders. Iraq sounds like a great vacation spot for members of the Westboro Baptist Church!!!", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-05-05 18:34:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "It's a good thing I am retired for if I were on active duty, and knowing what I know about Iraq, and ordered to go there I would have to resign.", 
        "intTime": 20090505, 
        "postID": 16, 
        "quote": "", 
        "reply": "It's a good thing I am retired for if I were on active duty, and knowing what I know about Iraq, and ordered to go there I would have to resign.", 
        "threadID": "27819558_6650099912001", 
        "time": "2009-05-05 19:13:00", 
        "title": "Iraqi police: 2 gay men killed in Baghdad slum", 
        "userID": "IHAWKER"
    }
]