[
    {
        "content": "quote: Originally posted by sabow: quote: Originally posted by 19022583: <SNIPPED> I'll overlook your specific criticisms of ME, noting that YOU simply MUST be superior in all respects and....because if I attempt to retaliate, the moderator has an eye on me looking to disqualify my observations. However, like others of your type here....you can't support YOUR assertions that DADT in NOT effective. Could it be a....short-sightedness born of ADULT-LIKE hate, fear and ignorance? Note all you like... Your observations are less than scientific and not worthy of recognition. Perhaps you have heard the phrase \"innocent until proven guilty\" or possibly the term \"proof positive\"? Essentially, they refer to the same idea: You cannot consistently prove a negative. As such, the preponderence of proof falls to the accuser to support the positive. Advocates for the removal of DADT have shown the astronomical amounts of money WASTED (proof positive) to enforce DADT as well as the abuse of that policy to facilitate an agenda of discrimination (again, proof positive). The end result: An over-exerted military and record-low recruitment quotas. By the way, did you catch the comment in the article that the same people kicked out of the military for DADT are almost immediately recruited by the DoD and return to their exact same jobs and co-workers in Iraq for usually triple the salary they were making in the military? You may see that as an acceptable expenditure, but far too many other sensible people disagree. Just like all those who have posted before you, you cannot provide proof positive of the beneficial effects of DADT worth what we have forked out so far. However, if you prefer, we can include a new tax class for those of you who support DADT that bumps you up a few tax brackets to support our shrinking military (not to mention our floundering economy). We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition.", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "Originally posted by sabow: quote: Originally posted by 19022583: <SNIPPED> I'll overlook your specific criticisms of ME, noting that YOU simply MUST be superior in all respects and....because if I attempt to retaliate, the moderator has an eye on me looking to disqualify my observations. However, like others of your type here....you can't support YOUR assertions that DADT in NOT effective. Could it be a....short-sightedness born of ADULT-LIKE hate, fear and ignorance? Note all you like... Your observations are less than scientific and not worthy of recognition. Perhaps you have heard the phrase \"innocent until proven guilty\" or possibly the term \"proof positive\"? Essentially, they refer to the same idea: You cannot consistently prove a negative. As such, the preponderence of proof falls to the accuser to support the positive. Advocates for the removal of DADT have shown the astronomical amounts of money WASTED (proof positive) to enforce DADT as well as the abuse of that policy to facilitate an agenda of discrimination (again, proof positive). The end result: An over-exerted military and record-low recruitment quotas. By the way, did you catch the comment in the article that the same people kicked out of the military for DADT are almost immediately recruited by the DoD and return to their exact same jobs and co-workers in Iraq for usually triple the salary they were making in the military? You may see that as an acceptable expenditure, but far too many other sensible people disagree. Just like all those who have posted before you, you cannot provide proof positive of the beneficial effects of DADT worth what we have forked out so far. However, if you prefer, we can include a new tax class for those of you who support DADT that bumps you up a few tax brackets to support our shrinking military (not to mention our floundering economy).", 
        "reply": " We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition.", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-11 09:30:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: .............................. We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition. Well high time numbers that you admitted to sabow (and the rest of us defenders of patriotic duty) that your opinions (and your masters Equal) are \"NO more 'scientific' than mine and you can't PROVE....ANY....\" So, just dribbling the letters of backwards thought across the screen for you is equally not worthy of recognition?", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by 19022583: .............................. We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition.", 
        "reply": " Well high time numbers that you admitted to sabow (and the rest of us defenders of patriotic duty) that your opinions (and your masters Equal) are \"NO more 'scientific' than mine and you can't PROVE....ANY....\" So, just dribbling the letters of backwards thought across the screen for you is equally not worthy of recognition?", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-11 11:20:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by 19022583: .............................. We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition. Well high time numbers that you admitted to sabow (and the rest of us defenders of patriotic duty) that your opinions (and your masters Equal) are \"NO more 'scientific' than mine and you can't PROVE....ANY....\" So, just dribbling the letters of backwards thought across the screen for you is equally not worthy of recognition? LOL....yep, as I'm fond of observing....opinions bear some similarity to....armpits, and few are better than any other.", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Originally posted by reducetension: quote: Originally posted by 19022583: .............................. We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition. Well high time numbers that you admitted to sabow (and the rest of us defenders of patriotic duty) that your opinions (and your masters Equal) are \"NO more 'scientific' than mine and you can't PROVE....ANY....\" So, just dribbling the letters of backwards thought across the screen for you is equally not worthy of recognition?", 
        "reply": " LOL....yep, as I'm fond of observing....opinions bear some similarity to....armpits, and few are better than any other.", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-12 12:13:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "19022583"
    }, 
    {
        "content": "well, perhaps, i dont know a whole lot, but i do know about me. I am gay, and i was highspeed low drag, paratrooper, and i did well, went far, and my early retirement at 26 years old did not have anything to do with being gay. I fought hard to dismantle the needless hate and fear re: gay people in the army. I made it through the ABN INF then on to OPS group and i was never bothered about it. maybe they found a true soldier who was interested in being a motivated front line fighter. i even was approached many times during hardship tours by str8 guys to do for them what they \"needed\"! i declined out of self respect but i know that my patriotism is not measured by who i date, or if i enjoy the company of a man or women. maybe i am confused but the love for god and country, being willing to die for them, and being gay have absolutely nothing to do one with the other! there are all kinds in americas fighting forces, maybe thats because all those kinds have pride, love, and devotion to serve the very country in which they so enjoy the great life. i guess its kind of rambling but when i looked to my left and to my right, and the point man and on my 6...my concern was that they were proficient with the assignment, not who they saw on there social time. i think the cohesion is alot better when we all get to be what we are and still work so well together! I guess i appreciate the fellow service of the breeder and str8 community (doesnt seem so warm and fuzzy when that is how someone identifies you, does it!?!) let me clearify, i appreciate all those with the tinacity, and drive to serve. maybe if some people focused on there job and not focused on things that dont affect them, we might all be a little better off! and that goes both ways! best wishes all, may a little more peace and warmth be with you! we are gays, and we too are american! the blood on the soals of my boots got there the same way as the blood on the soals of your boots! God speed! thanks for letting me ramble! Greg out!", 
        "intTime": 20090316, 
        "postID": 12, 
        "quote": "", 
        "reply": "well, perhaps, i dont know a whole lot, but i do know about me. I am gay, and i was highspeed low drag, paratrooper, and i did well, went far, and my early retirement at 26 years old did not have anything to do with being gay. I fought hard to dismantle the needless hate and fear re: gay people in the army. I made it through the ABN INF then on to OPS group and i was never bothered about it. maybe they found a true soldier who was interested in being a motivated front line fighter. i even was approached many times during hardship tours by str8 guys to do for them what they \"needed\"! i declined out of self respect but i know that my patriotism is not measured by who i date, or if i enjoy the company of a man or women. maybe i am confused but the love for god and country, being willing to die for them, and being gay have absolutely nothing to do one with the other! there are all kinds in americas fighting forces, maybe thats because all those kinds have pride, love, and devotion to serve the very country in which they so enjoy the great life. i guess its kind of rambling but when i looked to my left and to my right, and the point man and on my 6...my concern was that they were proficient with the assignment, not who they saw on there social time. i think the cohesion is alot better when we all get to be what we are and still work so well together! I guess i appreciate the fellow service of the breeder and str8 community (doesnt seem so warm and fuzzy when that is how someone identifies you, does it!?!) let me clearify, i appreciate all those with the tinacity, and drive to serve. maybe if some people focused on there job and not focused on things that dont affect them, we might all be a little better off! and that goes both ways! best wishes all, may a little more peace and warmth be with you! we are gays, and we too are american! the blood on the soals of my boots got there the same way as the blood on the soals of your boots! God speed! thanks for letting me ramble! Greg out!", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-16 04:02:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "5814315"
    }, 
    {
        "content": "5814315, I can sure relate to what you have said, well done. And as for as not knowing a whole lot, you appear to have a lot better insight than some others that post here.", 
        "intTime": 20090316, 
        "postID": 13, 
        "quote": "", 
        "reply": "5814315, I can sure relate to what you have said, well done. And as for as not knowing a whole lot, you appear to have a lot better insight than some others that post here.", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-16 10:46:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: No Gays, Please, We're Americans It's no secret -- Sunday's New York Times documents it at the top of its front page -- that Army recruiters have had their problems, although with the economy tanking recruiting has recently picked up. It always does, in a recession. In fact, in the fiscal year that ended last October the Army exceeded by 517 its goal of 80,000 recruits. That's the good news. The bad news is that it failed yet again to meet its goal of 90 percent high school graduates. That's what waivers are for. You have a weight problem? No problem. The Army has been granting waivers for that -- and for serious felony convictions, for failure to meet physical and mental standards, for age (it's now 42 for new recruits) -- thousands of waivers every year -- as well as offering such enticements as whopping sign-up bonuses, as much as $40,000 for a few. Don't let me forget the free video games to simulate the \"army experience.\" *** What a fallacious narrative. Having spent two and a half years on Recruiting Duty, officed along side Army Recruiters, GLBT, DA/DT, or any of this discussion hasn't got a rats arse to do with why the Army has often had problems, \"making mission,\" on Recruiting Duty. Pick a premise, a basis for your cause, and stick to it without all of this fallacious narrative about unrelated points. *** And also mentioning, \"5814315's,\" useless points about, \"straights,\" wanting gay sex. That would make them gay, bi,' etc., and it is zero argument for repealing DA/DT. Get ahold of yourself. Please?", 
        "intTime": 20090316, 
        "postID": 14, 
        "quote": "No Gays, Please, We're Americans It's no secret -- Sunday's New York Times documents it at the top of its front page -- that Army recruiters have had their problems, although with the economy tanking recruiting has recently picked up. It always does, in a recession. In fact, in the fiscal year that ended last October the Army exceeded by 517 its goal of 80,000 recruits. That's the good news. The bad news is that it failed yet again to meet its goal of 90 percent high school graduates. That's what waivers are for. You have a weight problem? No problem. The Army has been granting waivers for that -- and for serious felony convictions, for failure to meet physical and mental standards, for age (it's now 42 for new recruits) -- thousands of waivers every year -- as well as offering such enticements as whopping sign-up bonuses, as much as $40,000 for a few. Don't let me forget the free video games to simulate the \"army experience.\"", 
        "reply": " *** What a fallacious narrative. Having spent two and a half years on Recruiting Duty, officed along side Army Recruiters, GLBT, DA/DT, or any of this discussion hasn't got a rats arse to do with why the Army has often had problems, \"making mission,\" on Recruiting Duty. Pick a premise, a basis for your cause, and stick to it without all of this fallacious narrative about unrelated points. *** And also mentioning, \"5814315's,\" useless points about, \"straights,\" wanting gay sex. That would make them gay, bi,' etc., and it is zero argument for repealing DA/DT. Get ahold of yourself. Please?", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-16 11:03:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: 5814315, I can sure relate to what you have said, well done. And as for as not knowing a whole lot, you appear to have a lot better insight than some others that post here. I agree. Thanks for your service. Quality out-ranks sexual orientation any day!", 
        "intTime": 20090316, 
        "postID": 15, 
        "quote": "Originally posted by IHAWKER: 5814315, I can sure relate to what you have said, well done. And as for as not knowing a whole lot, you appear to have a lot better insight than some others that post here.", 
        "reply": " I agree. Thanks for your service. Quality out-ranks sexual orientation any day!", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-16 13:29:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: quote: No Gays, Please, We're Americans It's no secret -- Sunday's New York Times documents it at the top of its front page -- that Army recruiters have had their problems, although with the economy tanking recruiting has recently picked up. It always does, in a recession. In fact, in the fiscal year that ended last October the Army exceeded by 517 its goal of 80,000 recruits. That's the good news. The bad news is that it failed yet again to meet its goal of 90 percent high school graduates. That's what waivers are for. You have a weight problem? No problem. The Army has been granting waivers for that -- and for serious felony convictions, for failure to meet physical and mental standards, for age (it's now 42 for new recruits) -- thousands of waivers every year -- as well as offering such enticements as whopping sign-up bonuses, as much as $40,000 for a few. Don't let me forget the free video games to simulate the \"army experience.\" *** What a fallacious narrative. Having spent two and a half years on Recruiting Duty, officed along side Army Recruiters, GLBT, DA/DT, or any of this discussion hasn't got a rats arse to do with why the Army has often had problems, \"making mission,\" on Recruiting Duty. Pick a premise, a basis for your cause, and stick to it without all of this fallacious narrative about unrelated points. *** And also mentioning, \"5814315's,\" useless points about, \"straights,\" wanting gay sex. That would make them gay, bi,' etc., and it is zero argument for repealing DA/DT. Get ahold of yourself. Please? Nice try, but as we know....your well made points will fall/have fallen on deaf ears!", 
        "intTime": 20090317, 
        "postID": 16, 
        "quote": "Originally posted by EqualRightstoPrivacy: quote: No Gays, Please, We're Americans It's no secret -- Sunday's New York Times documents it at the top of its front page -- that Army recruiters have had their problems, although with the economy tanking recruiting has recently picked up. It always does, in a recession. In fact, in the fiscal year that ended last October the Army exceeded by 517 its goal of 80,000 recruits. That's the good news. The bad news is that it failed yet again to meet its goal of 90 percent high school graduates. That's what waivers are for. You have a weight problem? No problem. The Army has been granting waivers for that -- and for serious felony convictions, for failure to meet physical and mental standards, for age (it's now 42 for new recruits) -- thousands of waivers every year -- as well as offering such enticements as whopping sign-up bonuses, as much as $40,000 for a few. Don't let me forget the free video games to simulate the \"army experience.\" *** What a fallacious narrative. Having spent two and a half years on Recruiting Duty, officed along side Army Recruiters, GLBT, DA/DT, or any of this discussion hasn't got a rats arse to do with why the Army has often had problems, \"making mission,\" on Recruiting Duty. Pick a premise, a basis for your cause, and stick to it without all of this fallacious narrative about unrelated points. *** And also mentioning, \"5814315's,\" useless points about, \"straights,\" wanting gay sex. That would make them gay, bi,' etc., and it is zero argument for repealing DA/DT. Get ahold of yourself. Please?", 
        "reply": " Nice try, but as we know....your well made points will fall/have fallen on deaf ears!", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-17 09:55:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "19022583"
    }, 
    {
        "content": "Don't Ask, Don't Tell, Don't Swallow", 
        "intTime": 20090319, 
        "postID": 17, 
        "quote": "", 
        "reply": "Don't Ask, Don't Tell, Don't Swallow", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-19 10:14:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "waco1965"
    }, 
    {
        "content": "How do I put this discreetly but bluntly,.... You don't treat people in your unit right, and you have problems with this one or that one for their womanizing, drinking, being gay, too religious, too atheist too this, too that,.....when the worst thing that happens does, and it's a decision who gets help I wonder if there will be a slight pause in saving your bacon, and if you never have to go to combat and think about all that, maybe you'll allow that the ones who do go, and are not \"up to normal standards\" whatever that insulting concept means, are those who are deciding a great deal for us all with their risk, sacrifice and sheer guts. Some of us \"college graduates\" not only served, but discovered that education, sexual preference race, IQ, and a whole bunch of other concerns just don't matter a hill of beans when it all goes bad and your primary goal is to make it through the day. This from someone who served both in the military and on the home front in the Emergency Room, I think for a lot of years I lived with the idea that it was a good day if I was alive, made it through and didn't see anyone else lose their life, made sure that everyone I came into contact with was treated the best and most honorable way I was capable of, and that if I did lose someone, I hope I helped them from suffering. Take that for what it is worth.", 
        "intTime": 20090413, 
        "postID": 18, 
        "quote": "", 
        "reply": "How do I put this discreetly but bluntly,.... You don't treat people in your unit right, and you have problems with this one or that one for their womanizing, drinking, being gay, too religious, too atheist too this, too that,.....when the worst thing that happens does, and it's a decision who gets help I wonder if there will be a slight pause in saving your bacon, and if you never have to go to combat and think about all that, maybe you'll allow that the ones who do go, and are not \"up to normal standards\" whatever that insulting concept means, are those who are deciding a great deal for us all with their risk, sacrifice and sheer guts. Some of us \"college graduates\" not only served, but discovered that education, sexual preference race, IQ, and a whole bunch of other concerns just don't matter a hill of beans when it all goes bad and your primary goal is to make it through the day. This from someone who served both in the military and on the home front in the Emergency Room, I think for a lot of years I lived with the idea that it was a good day if I was alive, made it through and didn't see anyone else lose their life, made sure that everyone I came into contact with was treated the best and most honorable way I was capable of, and that if I did lose someone, I hope I helped them from suffering. Take that for what it is worth.", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-04-13 19:39:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "12905561"
    }, 
    {
        "content": "quote: Originally posted by sabow: quote: Originally posted by 19022583: <SNIPPED> I'll overlook your specific criticisms of ME, noting that YOU simply MUST be superior in all respects and....because if I attempt to retaliate, the moderator has an eye on me looking to disqualify my observations. However, like others of your type here....you can't support YOUR assertions that DADT in NOT effective. Could it be a....short-sightedness born of ADULT-LIKE hate, fear and ignorance? Note all you like... Your observations are less than scientific and not worthy of recognition. Perhaps you have heard the phrase \"innocent until proven guilty\" or possibly the term \"proof positive\"? Essentially, they refer to the same idea: You cannot consistently prove a negative. As such, the preponderence of proof falls to the accuser to support the positive. Advocates for the removal of DADT have shown the astronomical amounts of money WASTED (proof positive) to enforce DADT as well as the abuse of that policy to facilitate an agenda of discrimination (again, proof positive). The end result: An over-exerted military and record-low recruitment quotas. By the way, did you catch the comment in the article that the same people kicked out of the military for DADT are almost immediately recruited by the DoD and return to their exact same jobs and co-workers in Iraq for usually triple the salary they were making in the military? You may see that as an acceptable expenditure, but far too many other sensible people disagree. Just like all those who have posted before you, you cannot provide proof positive of the beneficial effects of DADT worth what we have forked out so far. However, if you prefer, we can include a new tax class for those of you who support DADT that bumps you up a few tax brackets to support our shrinking military (not to mention our floundering economy). We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition.", 
        "intTime": 20090311, 
        "postID": 29, 
        "quote": "Originally posted by sabow: quote: Originally posted by 19022583: <SNIPPED> I'll overlook your specific criticisms of ME, noting that YOU simply MUST be superior in all respects and....because if I attempt to retaliate, the moderator has an eye on me looking to disqualify my observations. However, like others of your type here....you can't support YOUR assertions that DADT in NOT effective. Could it be a....short-sightedness born of ADULT-LIKE hate, fear and ignorance? Note all you like... Your observations are less than scientific and not worthy of recognition. Perhaps you have heard the phrase \"innocent until proven guilty\" or possibly the term \"proof positive\"? Essentially, they refer to the same idea: You cannot consistently prove a negative. As such, the preponderence of proof falls to the accuser to support the positive. Advocates for the removal of DADT have shown the astronomical amounts of money WASTED (proof positive) to enforce DADT as well as the abuse of that policy to facilitate an agenda of discrimination (again, proof positive). The end result: An over-exerted military and record-low recruitment quotas. By the way, did you catch the comment in the article that the same people kicked out of the military for DADT are almost immediately recruited by the DoD and return to their exact same jobs and co-workers in Iraq for usually triple the salary they were making in the military? You may see that as an acceptable expenditure, but far too many other sensible people disagree. Just like all those who have posted before you, you cannot provide proof positive of the beneficial effects of DADT worth what we have forked out so far. However, if you prefer, we can include a new tax class for those of you who support DADT that bumps you up a few tax brackets to support our shrinking military (not to mention our floundering economy).", 
        "reply": " We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition.", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-11 09:30:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by 19022583: .............................. We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition. Well high time numbers that you admitted to sabow (and the rest of us defenders of patriotic duty) that your opinions (and your masters Equal) are \"NO more 'scientific' than mine and you can't PROVE....ANY....\" So, just dribbling the letters of backwards thought across the screen for you is equally not worthy of recognition?", 
        "intTime": 20090311, 
        "postID": 30, 
        "quote": "Originally posted by 19022583: .............................. We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition.", 
        "reply": " Well high time numbers that you admitted to sabow (and the rest of us defenders of patriotic duty) that your opinions (and your masters Equal) are \"NO more 'scientific' than mine and you can't PROVE....ANY....\" So, just dribbling the letters of backwards thought across the screen for you is equally not worthy of recognition?", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-11 11:20:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by 19022583: .............................. We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition. Well high time numbers that you admitted to sabow (and the rest of us defenders of patriotic duty) that your opinions (and your masters Equal) are \"NO more 'scientific' than mine and you can't PROVE....ANY....\" So, just dribbling the letters of backwards thought across the screen for you is equally not worthy of recognition? LOL....yep, as I'm fond of observing....opinions bear some similarity to....armpits, and few are better than any other.", 
        "intTime": 20090312, 
        "postID": 31, 
        "quote": "Originally posted by reducetension: quote: Originally posted by 19022583: .............................. We BOTH have merely expressed opinions and....YOUR's are NO more \"scientific\" than mine and you can't PROVE....ANY of your assertions, either....just like all those who have posted before YOU, and therefore not worthy of recognition. Well high time numbers that you admitted to sabow (and the rest of us defenders of patriotic duty) that your opinions (and your masters Equal) are \"NO more 'scientific' than mine and you can't PROVE....ANY....\" So, just dribbling the letters of backwards thought across the screen for you is equally not worthy of recognition?", 
        "reply": " LOL....yep, as I'm fond of observing....opinions bear some similarity to....armpits, and few are better than any other.", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-12 12:13:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "19022583"
    }, 
    {
        "content": "well, perhaps, i dont know a whole lot, but i do know about me. I am gay, and i was highspeed low drag, paratrooper, and i did well, went far, and my early retirement at 26 years old did not have anything to do with being gay. I fought hard to dismantle the needless hate and fear re: gay people in the army. I made it through the ABN INF then on to OPS group and i was never bothered about it. maybe they found a true soldier who was interested in being a motivated front line fighter. i even was approached many times during hardship tours by str8 guys to do for them what they \"needed\"! i declined out of self respect but i know that my patriotism is not measured by who i date, or if i enjoy the company of a man or women. maybe i am confused but the love for god and country, being willing to die for them, and being gay have absolutely nothing to do one with the other! there are all kinds in americas fighting forces, maybe thats because all those kinds have pride, love, and devotion to serve the very country in which they so enjoy the great life. i guess its kind of rambling but when i looked to my left and to my right, and the point man and on my 6...my concern was that they were proficient with the assignment, not who they saw on there social time. i think the cohesion is alot better when we all get to be what we are and still work so well together! I guess i appreciate the fellow service of the breeder and str8 community (doesnt seem so warm and fuzzy when that is how someone identifies you, does it!?!) let me clearify, i appreciate all those with the tinacity, and drive to serve. maybe if some people focused on there job and not focused on things that dont affect them, we might all be a little better off! and that goes both ways! best wishes all, may a little more peace and warmth be with you! we are gays, and we too are american! the blood on the soals of my boots got there the same way as the blood on the soals of your boots! God speed! thanks for letting me ramble! Greg out!", 
        "intTime": 20090316, 
        "postID": 32, 
        "quote": "", 
        "reply": "well, perhaps, i dont know a whole lot, but i do know about me. I am gay, and i was highspeed low drag, paratrooper, and i did well, went far, and my early retirement at 26 years old did not have anything to do with being gay. I fought hard to dismantle the needless hate and fear re: gay people in the army. I made it through the ABN INF then on to OPS group and i was never bothered about it. maybe they found a true soldier who was interested in being a motivated front line fighter. i even was approached many times during hardship tours by str8 guys to do for them what they \"needed\"! i declined out of self respect but i know that my patriotism is not measured by who i date, or if i enjoy the company of a man or women. maybe i am confused but the love for god and country, being willing to die for them, and being gay have absolutely nothing to do one with the other! there are all kinds in americas fighting forces, maybe thats because all those kinds have pride, love, and devotion to serve the very country in which they so enjoy the great life. i guess its kind of rambling but when i looked to my left and to my right, and the point man and on my 6...my concern was that they were proficient with the assignment, not who they saw on there social time. i think the cohesion is alot better when we all get to be what we are and still work so well together! I guess i appreciate the fellow service of the breeder and str8 community (doesnt seem so warm and fuzzy when that is how someone identifies you, does it!?!) let me clearify, i appreciate all those with the tinacity, and drive to serve. maybe if some people focused on there job and not focused on things that dont affect them, we might all be a little better off! and that goes both ways! best wishes all, may a little more peace and warmth be with you! we are gays, and we too are american! the blood on the soals of my boots got there the same way as the blood on the soals of your boots! God speed! thanks for letting me ramble! Greg out!", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-16 04:02:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "5814315"
    }, 
    {
        "content": "5814315, I can sure relate to what you have said, well done. And as for as not knowing a whole lot, you appear to have a lot better insight than some others that post here.", 
        "intTime": 20090316, 
        "postID": 33, 
        "quote": "", 
        "reply": "5814315, I can sure relate to what you have said, well done. And as for as not knowing a whole lot, you appear to have a lot better insight than some others that post here.", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-16 10:46:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: No Gays, Please, We're Americans It's no secret -- Sunday's New York Times documents it at the top of its front page -- that Army recruiters have had their problems, although with the economy tanking recruiting has recently picked up. It always does, in a recession. In fact, in the fiscal year that ended last October the Army exceeded by 517 its goal of 80,000 recruits. That's the good news. The bad news is that it failed yet again to meet its goal of 90 percent high school graduates. That's what waivers are for. You have a weight problem? No problem. The Army has been granting waivers for that -- and for serious felony convictions, for failure to meet physical and mental standards, for age (it's now 42 for new recruits) -- thousands of waivers every year -- as well as offering such enticements as whopping sign-up bonuses, as much as $40,000 for a few. Don't let me forget the free video games to simulate the \"army experience.\" *** What a fallacious narrative. Having spent two and a half years on Recruiting Duty, officed along side Army Recruiters, GLBT, DA/DT, or any of this discussion hasn't got a rats arse to do with why the Army has often had problems, \"making mission,\" on Recruiting Duty. Pick a premise, a basis for your cause, and stick to it without all of this fallacious narrative about unrelated points. *** And also mentioning, \"5814315's,\" useless points about, \"straights,\" wanting gay sex. That would make them gay, bi,' etc., and it is zero argument for repealing DA/DT. Get ahold of yourself. Please?", 
        "intTime": 20090316, 
        "postID": 34, 
        "quote": "No Gays, Please, We're Americans It's no secret -- Sunday's New York Times documents it at the top of its front page -- that Army recruiters have had their problems, although with the economy tanking recruiting has recently picked up. It always does, in a recession. In fact, in the fiscal year that ended last October the Army exceeded by 517 its goal of 80,000 recruits. That's the good news. The bad news is that it failed yet again to meet its goal of 90 percent high school graduates. That's what waivers are for. You have a weight problem? No problem. The Army has been granting waivers for that -- and for serious felony convictions, for failure to meet physical and mental standards, for age (it's now 42 for new recruits) -- thousands of waivers every year -- as well as offering such enticements as whopping sign-up bonuses, as much as $40,000 for a few. Don't let me forget the free video games to simulate the \"army experience.\"", 
        "reply": " *** What a fallacious narrative. Having spent two and a half years on Recruiting Duty, officed along side Army Recruiters, GLBT, DA/DT, or any of this discussion hasn't got a rats arse to do with why the Army has often had problems, \"making mission,\" on Recruiting Duty. Pick a premise, a basis for your cause, and stick to it without all of this fallacious narrative about unrelated points. *** And also mentioning, \"5814315's,\" useless points about, \"straights,\" wanting gay sex. That would make them gay, bi,' etc., and it is zero argument for repealing DA/DT. Get ahold of yourself. Please?", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-16 11:03:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: 5814315, I can sure relate to what you have said, well done. And as for as not knowing a whole lot, you appear to have a lot better insight than some others that post here. I agree. Thanks for your service. Quality out-ranks sexual orientation any day!", 
        "intTime": 20090316, 
        "postID": 35, 
        "quote": "Originally posted by IHAWKER: 5814315, I can sure relate to what you have said, well done. And as for as not knowing a whole lot, you appear to have a lot better insight than some others that post here.", 
        "reply": " I agree. Thanks for your service. Quality out-ranks sexual orientation any day!", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-16 13:29:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: quote: No Gays, Please, We're Americans It's no secret -- Sunday's New York Times documents it at the top of its front page -- that Army recruiters have had their problems, although with the economy tanking recruiting has recently picked up. It always does, in a recession. In fact, in the fiscal year that ended last October the Army exceeded by 517 its goal of 80,000 recruits. That's the good news. The bad news is that it failed yet again to meet its goal of 90 percent high school graduates. That's what waivers are for. You have a weight problem? No problem. The Army has been granting waivers for that -- and for serious felony convictions, for failure to meet physical and mental standards, for age (it's now 42 for new recruits) -- thousands of waivers every year -- as well as offering such enticements as whopping sign-up bonuses, as much as $40,000 for a few. Don't let me forget the free video games to simulate the \"army experience.\" *** What a fallacious narrative. Having spent two and a half years on Recruiting Duty, officed along side Army Recruiters, GLBT, DA/DT, or any of this discussion hasn't got a rats arse to do with why the Army has often had problems, \"making mission,\" on Recruiting Duty. Pick a premise, a basis for your cause, and stick to it without all of this fallacious narrative about unrelated points. *** And also mentioning, \"5814315's,\" useless points about, \"straights,\" wanting gay sex. That would make them gay, bi,' etc., and it is zero argument for repealing DA/DT. Get ahold of yourself. Please? Nice try, but as we know....your well made points will fall/have fallen on deaf ears!", 
        "intTime": 20090317, 
        "postID": 36, 
        "quote": "Originally posted by EqualRightstoPrivacy: quote: No Gays, Please, We're Americans It's no secret -- Sunday's New York Times documents it at the top of its front page -- that Army recruiters have had their problems, although with the economy tanking recruiting has recently picked up. It always does, in a recession. In fact, in the fiscal year that ended last October the Army exceeded by 517 its goal of 80,000 recruits. That's the good news. The bad news is that it failed yet again to meet its goal of 90 percent high school graduates. That's what waivers are for. You have a weight problem? No problem. The Army has been granting waivers for that -- and for serious felony convictions, for failure to meet physical and mental standards, for age (it's now 42 for new recruits) -- thousands of waivers every year -- as well as offering such enticements as whopping sign-up bonuses, as much as $40,000 for a few. Don't let me forget the free video games to simulate the \"army experience.\" *** What a fallacious narrative. Having spent two and a half years on Recruiting Duty, officed along side Army Recruiters, GLBT, DA/DT, or any of this discussion hasn't got a rats arse to do with why the Army has often had problems, \"making mission,\" on Recruiting Duty. Pick a premise, a basis for your cause, and stick to it without all of this fallacious narrative about unrelated points. *** And also mentioning, \"5814315's,\" useless points about, \"straights,\" wanting gay sex. That would make them gay, bi,' etc., and it is zero argument for repealing DA/DT. Get ahold of yourself. Please?", 
        "reply": " Nice try, but as we know....your well made points will fall/have fallen on deaf ears!", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-17 09:55:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "19022583"
    }, 
    {
        "content": "Don't Ask, Don't Tell, Don't Swallow", 
        "intTime": 20090319, 
        "postID": 37, 
        "quote": "", 
        "reply": "Don't Ask, Don't Tell, Don't Swallow", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-03-19 10:14:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "waco1965"
    }, 
    {
        "content": "How do I put this discreetly but bluntly,.... You don't treat people in your unit right, and you have problems with this one or that one for their womanizing, drinking, being gay, too religious, too atheist too this, too that,.....when the worst thing that happens does, and it's a decision who gets help I wonder if there will be a slight pause in saving your bacon, and if you never have to go to combat and think about all that, maybe you'll allow that the ones who do go, and are not \"up to normal standards\" whatever that insulting concept means, are those who are deciding a great deal for us all with their risk, sacrifice and sheer guts. Some of us \"college graduates\" not only served, but discovered that education, sexual preference race, IQ, and a whole bunch of other concerns just don't matter a hill of beans when it all goes bad and your primary goal is to make it through the day. This from someone who served both in the military and on the home front in the Emergency Room, I think for a lot of years I lived with the idea that it was a good day if I was alive, made it through and didn't see anyone else lose their life, made sure that everyone I came into contact with was treated the best and most honorable way I was capable of, and that if I did lose someone, I hope I helped them from suffering. Take that for what it is worth.", 
        "intTime": 20090413, 
        "postID": 38, 
        "quote": "", 
        "reply": "How do I put this discreetly but bluntly,.... You don't treat people in your unit right, and you have problems with this one or that one for their womanizing, drinking, being gay, too religious, too atheist too this, too that,.....when the worst thing that happens does, and it's a decision who gets help I wonder if there will be a slight pause in saving your bacon, and if you never have to go to combat and think about all that, maybe you'll allow that the ones who do go, and are not \"up to normal standards\" whatever that insulting concept means, are those who are deciding a great deal for us all with their risk, sacrifice and sheer guts. Some of us \"college graduates\" not only served, but discovered that education, sexual preference race, IQ, and a whole bunch of other concerns just don't matter a hill of beans when it all goes bad and your primary goal is to make it through the day. This from someone who served both in the military and on the home front in the Emergency Room, I think for a lot of years I lived with the idea that it was a good day if I was alive, made it through and didn't see anyone else lose their life, made sure that everyone I came into contact with was treated the best and most honorable way I was capable of, and that if I did lose someone, I hope I helped them from suffering. Take that for what it is worth.", 
        "threadID": "27819558_8520015512001", 
        "time": "2009-04-13 19:39:00", 
        "title": "No Gays, Please, We're Americans", 
        "userID": "12905561"
    }
]