[
    {
        "content": "LA council to endose new military recruiting policy The Los Angeles City Council is expected today to endorse a federal bill that would replace the military's \"Don't Ask, Don't Tell\" stance on homosexuality with a nondiscrimination-based policy on sexual orientation. The resolution to support a non-discriminatory policy - a symbolic gesture with no actual impact on the federal legislative process - is sponsored by Councilman Bill Rosendahl. Full article at > >http://www.contracostatimes.com/california/ci_11878337", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "LA council to endose new military recruiting policy The Los Angeles City Council is expected today to endorse a federal bill that would replace the military's \"Don't Ask, Don't Tell\" stance on homosexuality with a nondiscrimination-based policy on sexual orientation. The resolution to support a non-discriminatory policy - a symbolic gesture with no actual impact on the federal legislative process - is sponsored by Councilman Bill Rosendahl. Full article at > >http://www.contracostatimes.com/california/ci_11878337", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-10 17:56:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: no actual impact on the federal legislative process - is sponsored by Councilman Bill Rosendahl. Tax payers dollars hard at work ... and is anyone surprised that California is having budget shortfalls, layoffs, etc? Big houses, but nobody's home. *** What a surprise ... not! ***", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "no actual impact on the federal legislative process - is sponsored by Councilman Bill Rosendahl.", 
        "reply": " Tax payers dollars hard at work ... and is anyone surprised that California is having budget shortfalls, layoffs, etc? Big houses, but nobody's home. *** What a surprise ... not! ***", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-10 19:07:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: LA council to endose new military recruiting policy The Los Angeles City Council is expected today to endorse a federal bill that would replace the military's \"Don't Ask, Don't Tell\" stance on homosexuality with a nondiscrimination-based policy on sexual orientation. The resolution to support a non-discriminatory policy - a symbolic gesture with no actual impact on the federal legislative process - is sponsored by Councilman Bill Rosendahl. Full article at > >http://www.contracostatimes.com/california/ci_11878337 Every endorsement counts.", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "Originally posted by IHAWKER: LA council to endose new military recruiting policy The Los Angeles City Council is expected today to endorse a federal bill that would replace the military's \"Don't Ask, Don't Tell\" stance on homosexuality with a nondiscrimination-based policy on sexual orientation. The resolution to support a non-discriminatory policy - a symbolic gesture with no actual impact on the federal legislative process - is sponsored by Councilman Bill Rosendahl. Full article at > >http://www.contracostatimes.com/california/ci_11878337", 
        "reply": " Every endorsement counts.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-10 21:00:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "\"Every endorsement counts,\" Relatively speaking, that's the kind of things that special interest agendas praise. Scary!", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "", 
        "reply": "\"Every endorsement counts,\" Relatively speaking, that's the kind of things that special interest agendas praise. Scary!", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-10 22:36:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: \"Every endorsement counts,\" Relatively speaking, that's the kind of things that special interest agendas praise. Scary! I always find it intriguing when someone defines my opinions by assigning them to an agenda. My agenda today was to switch Insurance companies, I saved $80 a month by switching to GEICO!!", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "Originally posted by EqualRightstoPrivacy: \"Every endorsement counts,\" Relatively speaking, that's the kind of things that special interest agendas praise. Scary!", 
        "reply": " I always find it intriguing when someone defines my opinions by assigning them to an agenda. My agenda today was to switch Insurance companies, I saved $80 a month by switching to GEICO!!", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 00:17:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: quote: no actual impact on the federal legislative process - is sponsored by Councilman Bill Rosendahl. Tax payers dollars hard at work ... and is anyone surprised that California is having budget shortfalls, layoffs, etc? Big houses, but nobody's home. *** What a surprise ... not! *** LOL....yeah, let's have our federal gov't pattern ALL policies after what's done in the land of \"fruits & nuts!\"", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by EqualRightstoPrivacy: quote: no actual impact on the federal legislative process - is sponsored by Councilman Bill Rosendahl. Tax payers dollars hard at work ... and is anyone surprised that California is having budget shortfalls, layoffs, etc? Big houses, but nobody's home. *** What a surprise ... not! ***", 
        "reply": " LOL....yeah, let's have our federal gov't pattern ALL policies after what's done in the land of \"fruits & nuts!\"", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 09:01:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "19022583"
    }, 
    {
        "content": "Well, it took the Supreme Court to straighten out Missouri and Texas, numbers. quote: According to the Associated Press, sodomy laws remained on the books in 13 states as of the middle of 2003. \"Sodomy\" was illegal for everyone -- gay and straight -- in Alabama, Florida, Idaho, Louisiana, Mississippi, North Carolina, South Carolina, Utah and Virginia. In addition, four contiguous states, Kansas, Missouri , Oklahoma and Texas, criminalized certain forms of private, consensual sexual behavior between persons of the same gender, but permitted them if performed by a man and woman. During the first half of 2003, the U.S. Supreme court studied the constitutionality of sodomy legislation. In the Lawrence v. Texas case, they reviewed a Texas law. It criminalized certain sexual behavior by same-sex couples even though the same activities are quite legal if done by opposite-sex couples. In a ground-breaking decision, the Court decided on 2003-JUN-26 that adults are free to engage in private consensual sex without government oppression. They placed limits on the ability by governments to legislate sexual morality. The sodomy laws in Kansas, Missouri, Oklahoma and Texas, were declared unconstitutional. So, Missouri and Texas (where I believe Equal resides) are examples? There must be 'fruits worthy of repentance' (Matthew 3:8) there as well? You better get to work at home! If all the idiots in California moved to Texas and Missouri it would improve the IQ of all three states.", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "According to the Associated Press, sodomy laws remained on the books in 13 states as of the middle of 2003. \"Sodomy\" was illegal for everyone -- gay and straight -- in Alabama, Florida, Idaho, Louisiana, Mississippi, North Carolina, South Carolina, Utah and Virginia. In addition, four contiguous states, Kansas, Missouri , Oklahoma and Texas, criminalized certain forms of private, consensual sexual behavior between persons of the same gender, but permitted them if performed by a man and woman. During the first half of 2003, the U.S. Supreme court studied the constitutionality of sodomy legislation. In the Lawrence v. Texas case, they reviewed a Texas law. It criminalized certain sexual behavior by same-sex couples even though the same activities are quite legal if done by opposite-sex couples. In a ground-breaking decision, the Court decided on 2003-JUN-26 that adults are free to engage in private consensual sex without government oppression. They placed limits on the ability by governments to legislate sexual morality. The sodomy laws in Kansas, Missouri, Oklahoma and Texas, were declared unconstitutional.", 
        "reply": "Well, it took the Supreme Court to straighten out Missouri and Texas, numbers.  So, Missouri and Texas (where I believe Equal resides) are examples? There must be 'fruits worthy of repentance' (Matthew 3:8) there as well? You better get to work at home! If all the idiots in California moved to Texas and Missouri it would improve the IQ of all three states.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 12:03:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "reducetension"
    }, 
    {
        "content": "Gee...sorry my home doesn't live up to your standards. Maybe we could all come to Washington and you could enlighten us.", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "", 
        "reply": "Gee...sorry my home doesn't live up to your standards. Maybe we could all come to Washington and you could enlighten us.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 14:03:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: If all the idiots in California moved to Texas and Missouri it would improve the IQ of all three states. Yeah, but too much arrogance filters down from Washington for them to be worth a damn.", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "If all the idiots in California moved to Texas and Missouri it would improve the IQ of all three states.", 
        "reply": " Yeah, but too much arrogance filters down from Washington for them to be worth a damn.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 15:37:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "JimmieJam007"
    }, 
    {
        "content": "quote: Originally posted by JimmieJam007: quote: If all the idiots in California moved to Texas and Missouri it would improve the IQ of all three states. Yeah, but too much arrogance filters down from Washington for them to be worth a damn. Yes, and a marvelous process it is.", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by JimmieJam007: quote: If all the idiots in California moved to Texas and Missouri it would improve the IQ of all three states. Yeah, but too much arrogance filters down from Washington for them to be worth a damn.", 
        "reply": " Yes, and a marvelous process it is.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 16:16:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "reducetension"
    }, 
    {
        "content": "\"JimCrackCorn,\" \"So easy even a caveman can do it!\" *** I get it brother, I get it! *** On a, \"topic,\" note, \"agendas,\" are those things that will use anything - including those things with; no, little, and even false relevance - and attempt to use it as credible to the cause. I call it how I see it. *** Ps/I excuse myself from the, \"fruits & nuts,\" comments of another poster. My point in referencing, \"California,\" was that it is the most current newsworthy State for budget issues, it had nothing to do with stereotypes about California. California was home for almost five (5) years, and I like California for a number of reasons. *** No kidding, \"PSimon572,\" thanks for joining in. You'll have to understand that, \"reducetendons,\" (\"tendons,\" being those things that bind any, \"fact,\" to any form of, \"reality.\") posts like an arrogant pig talking down to everybody ... at this point many of us conclude he just can't help it. This message has been edited. Last edited by: EqualRightstoPrivacy, Wed 11 March 2009 08:20 PM", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "", 
        "reply": "\"JimCrackCorn,\" \"So easy even a caveman can do it!\" *** I get it brother, I get it! *** On a, \"topic,\" note, \"agendas,\" are those things that will use anything - including those things with; no, little, and even false relevance - and attempt to use it as credible to the cause. I call it how I see it. *** Ps/I excuse myself from the, \"fruits & nuts,\" comments of another poster. My point in referencing, \"California,\" was that it is the most current newsworthy State for budget issues, it had nothing to do with stereotypes about California. California was home for almost five (5) years, and I like California for a number of reasons. *** No kidding, \"PSimon572,\" thanks for joining in. You'll have to understand that, \"reducetendons,\" (\"tendons,\" being those things that bind any, \"fact,\" to any form of, \"reality.\") posts like an arrogant pig talking down to everybody ... at this point many of us conclude he just can't help it. This message has been edited. Last edited by: EqualRightstoPrivacy, Wed 11 March 2009 08:20 PM", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 19:52:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "I applaud the LA City Counsel for their stance. I'm also glad the Supreme Court straighted out (pun intended) Missouri's discrimiatory law. However, his attack against those of us from the Show-Me State was uncalled for. He forgets that we were smart enough to vote for a dead guy over John Ashcroft.", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "", 
        "reply": "I applaud the LA City Counsel for their stance. I'm also glad the Supreme Court straighted out (pun intended) Missouri's discrimiatory law. However, his attack against those of us from the Show-Me State was uncalled for. He forgets that we were smart enough to vote for a dead guy over John Ashcroft.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 20:15:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "PSimon572"
    }, 
    {
        "content": "\"However, his attack [...] was uncalled for.\" *** \"PSimon572,\" Exactly. The question is, \"Are some man enough to admit when they make mistakes?\" *** I say, \"Don't hold your breath for an apology.\" These aren't two-way streets on these threads.", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "", 
        "reply": "\"However, his attack [...] was uncalled for.\" *** \"PSimon572,\" Exactly. The question is, \"Are some man enough to admit when they make mistakes?\" *** I say, \"Don't hold your breath for an apology.\" These aren't two-way streets on these threads.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 20:26:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by PSimon572: I applaud the LA City Counsel for their stance. I'm also glad the Supreme Court straighted out (pun intended) Missouri's discrimiatory law. However, his attack against those of us from the Show-Me State was uncalled for. He forgets that we were smart enough to vote for a dead guy over John Ashcroft. That was so funny I dropped my cigarette. I then looked up the story on the Internet and found it to be true!!! the late Mel Carnahan beat the living John Ashcroft by 41000 votes. ... The stance that the LA City Council took is interesting, I see a lot more States & Cities making symbolic gestures now days. I have yet to figure out why they bother, but I enjoy reading about them and applaud their nerve in taking a stance on sensitive topics. The Brattleboro City Council in Vermont did something similar last year.", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "Originally posted by PSimon572: I applaud the LA City Counsel for their stance. I'm also glad the Supreme Court straighted out (pun intended) Missouri's discrimiatory law. However, his attack against those of us from the Show-Me State was uncalled for. He forgets that we were smart enough to vote for a dead guy over John Ashcroft.", 
        "reply": " That was so funny I dropped my cigarette. I then looked up the story on the Internet and found it to be true!!! the late Mel Carnahan beat the living John Ashcroft by 41000 votes. ... The stance that the LA City Council took is interesting, I see a lot more States & Cities making symbolic gestures now days. I have yet to figure out why they bother, but I enjoy reading about them and applaud their nerve in taking a stance on sensitive topics. The Brattleboro City Council in Vermont did something similar last year.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 20:58:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: You'll have to understand that, \"reducetendons,\" (\"tendons,\" being those things that bind any, \"fact,\" to any form of, \"reality.\") posts like an arrogant pig talking down to everybody My, my, have we gotten nasty! I suppose this is how you eventually get around to disparaging everyone that consistently doesn't agree with you. Of course, having been in law enforcement myself the term 'pig' when hurled my way carries with it a specter of disrespect for authority. I forgive you, since I can see you are incapable of forgiving yourself. As to your redundant ramifications of 'full disclosure' you have still not answered my questions. I guess it is just easier to sputter out judgmental put-downs... it's such an easy way to make yourself look better, teenagers do it all the time, demonstrating a high intolerance of others. I'm keeping notes. And as far as informing the old Coastie Chief about my demeanor. I doubt he needs your instruction, if he is anything like the Chiefs I served with in the Coast Guard they are fully capable of informing themselves. Yes, I do recall that bit of brilliance when the dead guy beat Ashcroft, Chief. I'm also pleased to say to my daughter resides part time in Missouri helping raise hunting dogs (birds). Thus, by a strange set of circumstances about two years ago I was able to assist the State recover original historic documents about the construction of their present state capital building in Jefferson City that were found in a flea market in this state. Missouri is an important part of the Pacific Northwest History beginning with Lewis and Clark and the Oregon Trail. So, I'm sorry for offending any Missourians. My comments were directed at the \"idiot\" numbers I was arguing with. (BTW my comment is taken from a remark Will Rogers made about Oklahoma and California.) This message has been edited. Last edited by: reducetension, Wed 11 March 2009 11:16 PM", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "You'll have to understand that, \"reducetendons,\" (\"tendons,\" being those things that bind any, \"fact,\" to any form of, \"reality.\") posts like an arrogant pig talking down to everybody", 
        "reply": " My, my, have we gotten nasty! I suppose this is how you eventually get around to disparaging everyone that consistently doesn't agree with you. Of course, having been in law enforcement myself the term 'pig' when hurled my way carries with it a specter of disrespect for authority. I forgive you, since I can see you are incapable of forgiving yourself. As to your redundant ramifications of 'full disclosure' you have still not answered my questions. I guess it is just easier to sputter out judgmental put-downs... it's such an easy way to make yourself look better, teenagers do it all the time, demonstrating a high intolerance of others. I'm keeping notes. And as far as informing the old Coastie Chief about my demeanor. I doubt he needs your instruction, if he is anything like the Chiefs I served with in the Coast Guard they are fully capable of informing themselves. Yes, I do recall that bit of brilliance when the dead guy beat Ashcroft, Chief. I'm also pleased to say to my daughter resides part time in Missouri helping raise hunting dogs (birds). Thus, by a strange set of circumstances about two years ago I was able to assist the State recover original historic documents about the construction of their present state capital building in Jefferson City that were found in a flea market in this state. Missouri is an important part of the Pacific Northwest History beginning with Lewis and Clark and the Oregon Trail. So, I'm sorry for offending any Missourians. My comments were directed at the \"idiot\" numbers I was arguing with. (BTW my comment is taken from a remark Will Rogers made about Oklahoma and California.) This message has been edited. Last edited by: reducetension, Wed 11 March 2009 11:16 PM", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 22:32:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "reducetension"
    }, 
    {
        "content": "Hey brother student, I call it how I read it. Myself along with a number of other posters here have observed and discussed the tactics of some with no points. It clearly looks to me like someone who, \"posts like an arrogant pig talking down to everybody.\" *** Please note, I am not attacking you, or your person - I have no idea who you are and I am satisfied with that, although you insist on offering insightful nuggets - only the things I see here posted by a call-sign, \"reducetension,\" and the way, \"reducetension,\" posts them, and later defends them. There is no spinning that, anyone can look around these threads to verify. \"dupontgafbuffoon,\" was much the same type of poster.\" *** You know me, always taking care of the, \"troops,\" (even senior if we were Active, Coast Guard Chiefs) I see a new poster on the thread, and I offer some, \"full-disclosure,\" for the, \"new,\" participant. Point remains, \"Oink, oink,\" Although I do see an apology in your last post, there is hope. *** \"having been in law enforcement,\" see (?). Wow, what a surprise! That fits the Freudian profile perfectly. *** \"JimmieJam007,\" did you catch that one? Brilliant! *** If you're still holding your breath for the, \"What Congressmen?\" question, I've already told you - like twice already - I'm working on a project, and you're not within my need to know ... at any point. If you have a different, relevant question, fire away. *** Anytime you want to, \"Appeal to Relevance,\" let me know.", 
        "intTime": 20090311, 
        "postID": 16, 
        "quote": "", 
        "reply": "Hey brother student, I call it how I read it. Myself along with a number of other posters here have observed and discussed the tactics of some with no points. It clearly looks to me like someone who, \"posts like an arrogant pig talking down to everybody.\" *** Please note, I am not attacking you, or your person - I have no idea who you are and I am satisfied with that, although you insist on offering insightful nuggets - only the things I see here posted by a call-sign, \"reducetension,\" and the way, \"reducetension,\" posts them, and later defends them. There is no spinning that, anyone can look around these threads to verify. \"dupontgafbuffoon,\" was much the same type of poster.\" *** You know me, always taking care of the, \"troops,\" (even senior if we were Active, Coast Guard Chiefs) I see a new poster on the thread, and I offer some, \"full-disclosure,\" for the, \"new,\" participant. Point remains, \"Oink, oink,\" Although I do see an apology in your last post, there is hope. *** \"having been in law enforcement,\" see (?). Wow, what a surprise! That fits the Freudian profile perfectly. *** \"JimmieJam007,\" did you catch that one? Brilliant! *** If you're still holding your breath for the, \"What Congressmen?\" question, I've already told you - like twice already - I'm working on a project, and you're not within my need to know ... at any point. If you have a different, relevant question, fire away. *** Anytime you want to, \"Appeal to Relevance,\" let me know.", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 23:39:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: \"having been in law enforcement,\" see (?). Wow, what a surprise! That fits the Freudian profile perfectly. And how's that?", 
        "intTime": 20090311, 
        "postID": 17, 
        "quote": "\"having been in law enforcement,\" see (?). Wow, what a surprise! That fits the Freudian profile perfectly.", 
        "reply": " And how's that?", 
        "threadID": "27819558_2710094712001", 
        "time": "2009-03-11 23:53:00", 
        "title": "LA council to endose new military recruiting policy", 
        "userID": "reducetension"
    }
]