[
    {
        "content": "After a veto by the governor, the bill to allow gay marriage in Vermont received the veto-busting 2/3 majority in the state House and Senate. Every vote was cast by a democratically elected representative of the people. No \"activist\" judges required. \"http://www.chicagotribune.com/news/nationworld/sns-ap-gay-marriage-vermont,0,2518471.story I miss living in Burlington, Vermont. Beautiful little city, great people. It's nice to see this small state leading the way in civil liberties. Let freedom ring!", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "", 
        "reply": "After a veto by the governor, the bill to allow gay marriage in Vermont received the veto-busting 2/3 majority in the state House and Senate. Every vote was cast by a democratically elected representative of the people. No \"activist\" judges required. \"http://www.chicagotribune.com/news/nationworld/sns-ap-gay-marriage-vermont,0,2518471.story I miss living in Burlington, Vermont. Beautiful little city, great people. It's nice to see this small state leading the way in civil liberties. Let freedom ring!", 
        "threadID": "27819558_8930080022001", 
        "time": "2009-04-07 11:46:00", 
        "title": "VERMONT!  (No activist judges required.)", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "What a \"Down To The Wire\" achievement. They had just enough votes to defeat the Governors veto. On the 1st of September, LGBT folks will be able to legally marry in Vermont. Hurrah!! For the Green Mountain Men & Women.", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "", 
        "reply": "What a \"Down To The Wire\" achievement. They had just enough votes to defeat the Governors veto. On the 1st of September, LGBT folks will be able to legally marry in Vermont. Hurrah!! For the Green Mountain Men & Women.", 
        "threadID": "27819558_8930080022001", 
        "time": "2009-04-07 16:14:00", 
        "title": "VERMONT!  (No activist judges required.)", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "Vermont became the first state to enact civil marriage for same-sex couples through the legislative process this morning. Requiring a 2/3 majority to over-ride Republican Governor Jim Douglas' veto, the Senate voted this morning 23 - 5. Less than 2 hours later Vermont's House of Representatives voted 100 - 49 to override the veto, just barely eking out the necessary margin. Thus, through a series of steps carefully choreographed between the governor and the General Assembly, the civil marriage bill, allowing same-sex couples to marry, was passed, vetoed, and the veto over-ridden in less than 24 hours. This is the first time that the Vermont legislature has overridden a veto by Governor Douglas in his seven years in office, which will change the tenor in the State House.", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "", 
        "reply": "Vermont became the first state to enact civil marriage for same-sex couples through the legislative process this morning. Requiring a 2/3 majority to over-ride Republican Governor Jim Douglas' veto, the Senate voted this morning 23 - 5. Less than 2 hours later Vermont's House of Representatives voted 100 - 49 to override the veto, just barely eking out the necessary margin. Thus, through a series of steps carefully choreographed between the governor and the General Assembly, the civil marriage bill, allowing same-sex couples to marry, was passed, vetoed, and the veto over-ridden in less than 24 hours. This is the first time that the Vermont legislature has overridden a veto by Governor Douglas in his seven years in office, which will change the tenor in the State House.", 
        "threadID": "27819558_8930080022001", 
        "time": "2009-04-07 16:22:00", 
        "title": "VERMONT!  (No activist judges required.)", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "We're working on it here in Maine, too (another nice civilized Blue state). My Senator, Dennis Damon, introduced the bill this session. Since the Maine Christian Civic League has almost self-destructed there's an excellent chance it'll pass. ...Alex", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "", 
        "reply": "We're working on it here in Maine, too (another nice civilized Blue state). My Senator, Dennis Damon, introduced the bill this session. Since the Maine Christian Civic League has almost self-destructed there's an excellent chance it'll pass. ...Alex", 
        "threadID": "27819558_8930080022001", 
        "time": "2009-04-07 18:04:00", 
        "title": "VERMONT!  (No activist judges required.)", 
        "userID": "jaluck"
    }, 
    {
        "content": "quote: Originally posted by jaluck: We're working on it here in Maine, too (another nice civilized Blue state). My Senator, Dennis Damon, introduced the bill this session. Since the Maine Christian Civic League has almost self-destructed there's an excellent chance it'll pass. ...Alex That's brilliant. I know that the bill for equal marriage rights in New Hampshire has passed the house, and I believe it's still waiting for its vote in the state senate. The governor is NOT pro-equal-marriage-rights, but he hasn't promised a veto either. I think New Hampshire will do it. Seeing as that's where I grew up, and that's where my wife and I had our wedding and civil union ceremony, we might go back for one of our anniversary celebrations in the future to renew our vows and get the actual marriage certificate.", 
        "intTime": 20090408, 
        "postID": 5, 
        "quote": "Originally posted by jaluck: We're working on it here in Maine, too (another nice civilized Blue state). My Senator, Dennis Damon, introduced the bill this session. Since the Maine Christian Civic League has almost self-destructed there's an excellent chance it'll pass. ...Alex", 
        "reply": " That's brilliant. I know that the bill for equal marriage rights in New Hampshire has passed the house, and I believe it's still waiting for its vote in the state senate. The governor is NOT pro-equal-marriage-rights, but he hasn't promised a veto either. I think New Hampshire will do it. Seeing as that's where I grew up, and that's where my wife and I had our wedding and civil union ceremony, we might go back for one of our anniversary celebrations in the future to renew our vows and get the actual marriage certificate.", 
        "threadID": "27819558_8930080022001", 
        "time": "2009-04-08 06:36:00", 
        "title": "VERMONT!  (No activist judges required.)", 
        "userID": "Whirled_Peas"
    }
]