[
    {
        "content": "President tries to change Dems’ image in military President Obama and Michelle Obama are attempting to forge a strong relationship with military leaders and their families, a move that could recast the Democratic Party’s current reputation for being weak on defense policy. Defense experts say the charm offensive is paying off and that Obama has gotten off to a much better start as commander in chief than his Democratic predecessor, President Clinton. Obama is considering allowing gays to serve openly in the military, but is starting the dialogue with military advisers to make sure they are involved early in the decision. Democrats familiar with Obama’s thinking on defense issues note that the president showed concern for military families well before he announced his presidential campaign. He made it one of his highest priorities in the Senate, where he served on the Veterans’ Affairs Committee. He surprised many on Election Day by winning the votes of an estimated 44 percent of people who had ever served in the military — particularly noteworthy, given that his opponent was a decorated veteran. Full article here > >http://thehill.com/leading-the-news/president-tries---to-change-dems-image-in-military-2009-03-09.html", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "President tries to change Dems’ image in military President Obama and Michelle Obama are attempting to forge a strong relationship with military leaders and their families, a move that could recast the Democratic Party’s current reputation for being weak on defense policy. Defense experts say the charm offensive is paying off and that Obama has gotten off to a much better start as commander in chief than his Democratic predecessor, President Clinton. Obama is considering allowing gays to serve openly in the military, but is starting the dialogue with military advisers to make sure they are involved early in the decision. Democrats familiar with Obama’s thinking on defense issues note that the president showed concern for military families well before he announced his presidential campaign. He made it one of his highest priorities in the Senate, where he served on the Veterans’ Affairs Committee. He surprised many on Election Day by winning the votes of an estimated 44 percent of people who had ever served in the military — particularly noteworthy, given that his opponent was a decorated veteran. Full article here > >http://thehill.com/leading-the-news/president-tries---to-change-dems-image-in-military-2009-03-09.html", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-10 18:25:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Now all he needs to do is find a new Secretary of State, and he'll have the military in his ... *** Wait! I think I heard sniper fire? ... nope, it was the baggage handlers taking the luggage off the plane. *** ... hip pocket! *** That's our President, slow and easy, the actions of a true organizational theorist!", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "Now all he needs to do is find a new Secretary of State, and he'll have the military in his ... *** Wait! I think I heard sniper fire? ... nope, it was the baggage handlers taking the luggage off the plane. *** ... hip pocket! *** That's our President, slow and easy, the actions of a true organizational theorist!", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-10 19:15:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: President tries to change Dems’ image in military President Obama and Michelle Obama are attempting to forge a strong relationship with military leaders and their families, a move that could recast the Democratic Party’s current reputation for being weak on defense policy. Defense experts say the charm offensive is paying off and that Obama has gotten off to a much better start as commander in chief than his Democratic predecessor, President Clinton. Obama is considering allowing gays to serve openly in the military, but is starting the dialogue with military advisers to make sure they are involved early in the decision. Democrats familiar with Obama’s thinking on defense issues note that the president showed concern for military families well before he announced his presidential campaign. He made it one of his highest priorities in the Senate, where he served on the Veterans’ Affairs Committee. He surprised many on Election Day by winning the votes of an estimated 44 percent of people who had ever served in the military — particularly noteworthy, given that his opponent was a decorated veteran. Full article here > >http://thehill.com/leading-the-news/president-tries---to-change-dems-image-in-military-2009-03-09.html I believe we got ourselves a pretty good President.", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "Originally posted by IHAWKER: President tries to change Dems’ image in military President Obama and Michelle Obama are attempting to forge a strong relationship with military leaders and their families, a move that could recast the Democratic Party’s current reputation for being weak on defense policy. Defense experts say the charm offensive is paying off and that Obama has gotten off to a much better start as commander in chief than his Democratic predecessor, President Clinton. Obama is considering allowing gays to serve openly in the military, but is starting the dialogue with military advisers to make sure they are involved early in the decision. Democrats familiar with Obama’s thinking on defense issues note that the president showed concern for military families well before he announced his presidential campaign. He made it one of his highest priorities in the Senate, where he served on the Veterans’ Affairs Committee. He surprised many on Election Day by winning the votes of an estimated 44 percent of people who had ever served in the military — particularly noteworthy, given that his opponent was a decorated veteran. Full article here > >http://thehill.com/leading-the-news/president-tries---to-change-dems-image-in-military-2009-03-09.html", 
        "reply": " I believe we got ourselves a pretty good President.", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-10 21:07:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: I believe we got ourselves a pretty good President. Yes, finally! More power to him!", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "I believe we got ourselves a pretty good President.", 
        "reply": " Yes, finally! More power to him!", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-10 21:36:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "reducetension"
    }, 
    {
        "content": "What do you mean, \"finally?\" Bush II was an excellent President. Economists - as will Historians - are already attributing our economic mess to Bill B.J. Clinton. Don't tell me some believe the Clinton-created hazardous-waste-clean-up conducted between 2000-2008 was Bush's fault? *** Anyhow, somewhat off topic but get serious. *** There is still legitimate speculation that President B. H. Obama II, is really just a front man for the Clinton-come-back team. If that is the case, nihilism is closer than we think, i.e., socialist theory, communism, Nietzsche, etc. *** I say, always beware of the tail wagging the dog like the Democrats are attempting to do with a number of issues.", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "", 
        "reply": "What do you mean, \"finally?\" Bush II was an excellent President. Economists - as will Historians - are already attributing our economic mess to Bill B.J. Clinton. Don't tell me some believe the Clinton-created hazardous-waste-clean-up conducted between 2000-2008 was Bush's fault? *** Anyhow, somewhat off topic but get serious. *** There is still legitimate speculation that President B. H. Obama II, is really just a front man for the Clinton-come-back team. If that is the case, nihilism is closer than we think, i.e., socialist theory, communism, Nietzsche, etc. *** I say, always beware of the tail wagging the dog like the Democrats are attempting to do with a number of issues.", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-10 22:33:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: I believe we got ourselves a pretty good President. Yes, finally! More power to him! He's the MAN!!!!", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by reducetension: quote: I believe we got ourselves a pretty good President. Yes, finally! More power to him!", 
        "reply": " He's the MAN!!!!", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-11 00:25:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "JimCrackCorn"
    }, 
    {
        "content": "quote: Originally posted by JimCrackCorn: quote: Originally posted by reducetension: quote: I believe we got ourselves a pretty good President. Yes, finally! More power to him! He's the MAN!!!! LOL...similar things were said about \"peanuts\" Carter and review what HE \"accomplished?\"", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "Originally posted by JimCrackCorn: quote: Originally posted by reducetension: quote: I believe we got ourselves a pretty good President. Yes, finally! More power to him! He's the MAN!!!!", 
        "reply": " LOL...similar things were said about \"peanuts\" Carter and review what HE \"accomplished?\"", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-11 08:58:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "19022583"
    }, 
    {
        "content": "Yes, but it took Ronnie to really kick the support out from under the economy. You remember Ronnie, the Hollywood actor giving his best performance as a B grade actor in the stage of the White House, Ronnie the conservative who consulted with astrologers and \"witches\".... I believe economist will finger him as the one who pushed the button on this disaster we are in now. (Remember how Bush I called his scheme 'Voodoo Economics'... I guest it was \"black magic\" for us today? The others just followed suit with bungling GWB dealing off the bottom of the deck. \"Be sure your sins will find you out\" (Numbers 32:23)", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yes, but it took Ronnie to really kick the support out from under the economy. You remember Ronnie, the Hollywood actor giving his best performance as a B grade actor in the stage of the White House, Ronnie the conservative who consulted with astrologers and \"witches\".... I believe economist will finger him as the one who pushed the button on this disaster we are in now. (Remember how Bush I called his scheme 'Voodoo Economics'... I guest it was \"black magic\" for us today? The others just followed suit with bungling GWB dealing off the bottom of the deck. \"Be sure your sins will find you out\" (Numbers 32:23)", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-11 12:12:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "reducetension"
    }, 
    {
        "content": "No, it's pretty clear Bill B.J. Clinton was in full, \"control,\" of the runaway economy of the 1990's, no need to try and drag it back to another Republican ... then we just go back to Carter like \"numbers,\" has already done and then we're on to bongo book sales, which is quite the trademark of the Democrats.", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "", 
        "reply": "No, it's pretty clear Bill B.J. Clinton was in full, \"control,\" of the runaway economy of the 1990's, no need to try and drag it back to another Republican ... then we just go back to Carter like \"numbers,\" has already done and then we're on to bongo book sales, which is quite the trademark of the Democrats.", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-11 20:47:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "EqualRightstoPrivacy"
    }, 
    {
        "content": "quote: Originally posted by EqualRightstoPrivacy: No, it's pretty clear Bill B.J. Clinton was in full, \"control,\" of the runaway economy of the 1990's, no need to try and drag it back to another Republican ... then we just go back to Carter like \"numbers,\" has already done and then we're on to bongo book sales, which is quite the trademark of the Democrats. Alright then, let's skip Ronnie (though it is a mistake not to forget his free handed deregulation moves.) What went wrong after him? Eight years wasn't enough to turn it around? Or was that not the intention of the GWB legacy?", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by EqualRightstoPrivacy: No, it's pretty clear Bill B.J. Clinton was in full, \"control,\" of the runaway economy of the 1990's, no need to try and drag it back to another Republican ... then we just go back to Carter like \"numbers,\" has already done and then we're on to bongo book sales, which is quite the trademark of the Democrats.", 
        "reply": " Alright then, let's skip Ronnie (though it is a mistake not to forget his free handed deregulation moves.) What went wrong after him? Eight years wasn't enough to turn it around? Or was that not the intention of the GWB legacy?", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-11 23:30:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by EqualRightstoPrivacy: No, it's pretty clear Bill B.J. Clinton was in full, \"control,\" of the runaway economy of the 1990's, no need to try and drag it back to another Republican ... then we just go back to Carter like \"numbers,\" has already done and then we're on to bongo book sales, which is quite the trademark of the Democrats. Alright then, let's skip Ronnie (though it is a mistake not to forget his free handed deregulation moves.) What went wrong after him? Eight years wasn't enough to turn it around? Or was that not the intention of the GWB legacy? You've apparently forgotten (or conveniently overlooked) the elimination of regulatory law that occurred during the Clinton years that permitted unsecured loans to be made by Fannie & Freddie? It was economists who coined the term \"misery index\" to apply to the policies of Carter that brought us double digit inflation, interest rates and unemployment. In 2 years, that movie actor (former governor of California when IT was solvent) reversed the economy with marginal tax rate reductions that brought about the greatest, longest period of prosperity this nation has known. During the last year of the Clinton administration(s), this country was again sliding into recession. Once again, federal tax reductions reversed the downward trend resulting in a stock market that topped 14,000. The housing bubble that has put us into our current economic crisis was brought about by the lifting of regulatory requirements during 1999 (Clinton year). Republicans share blame for it because they failed to prevent it.", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Originally posted by reducetension: quote: Originally posted by EqualRightstoPrivacy: No, it's pretty clear Bill B.J. Clinton was in full, \"control,\" of the runaway economy of the 1990's, no need to try and drag it back to another Republican ... then we just go back to Carter like \"numbers,\" has already done and then we're on to bongo book sales, which is quite the trademark of the Democrats. Alright then, let's skip Ronnie (though it is a mistake not to forget his free handed deregulation moves.) What went wrong after him? Eight years wasn't enough to turn it around? Or was that not the intention of the GWB legacy?", 
        "reply": " You've apparently forgotten (or conveniently overlooked) the elimination of regulatory law that occurred during the Clinton years that permitted unsecured loans to be made by Fannie & Freddie? It was economists who coined the term \"misery index\" to apply to the policies of Carter that brought us double digit inflation, interest rates and unemployment. In 2 years, that movie actor (former governor of California when IT was solvent) reversed the economy with marginal tax rate reductions that brought about the greatest, longest period of prosperity this nation has known. During the last year of the Clinton administration(s), this country was again sliding into recession. Once again, federal tax reductions reversed the downward trend resulting in a stock market that topped 14,000. The housing bubble that has put us into our current economic crisis was brought about by the lifting of regulatory requirements during 1999 (Clinton year). Republicans share blame for it because they failed to prevent it.", 
        "threadID": "27819558_4720094712001", 
        "time": "2009-03-12 11:48:00", 
        "title": "President tries to change Dems’ image in military", 
        "userID": "19022583"
    }
]