[
    {
        "content": "quote: Originally posted by Yooper_tj: Stop the presses! The world ends today! Hardly...more of those situational ethics and values we all have to possess to take care of our own families. quote: WASHINGTON (AP)– Former Vice President Dick Cheney said Monday he supports gays being able to marry but believes states, not the federal government, should make the decision. \"I think, you know, freedom means freedom for everyone,\" Cheney said in a speech at the National Press Club. \"I think people ought to be free to enter into any kind of union they wish, any kind of arrangement they wish...\" http://news.yahoo.com/s/ap/20090601/ap_on_re_us/us_cheney I believe the same too, its just that gays refuse to accept the term \"civil union\" with the rights and privleges of a traditional marriage just to impose their will and agenda on the general public.. Fug em..", 
        "intTime": 20090601, 
        "postID": 1, 
        "quote": "Originally posted by Yooper_tj: Stop the presses! The world ends today! Hardly...more of those situational ethics and values we all have to possess to take care of our own families. quote: WASHINGTON (AP)– Former Vice President Dick Cheney said Monday he supports gays being able to marry but believes states, not the federal government, should make the decision. \"I think, you know, freedom means freedom for everyone,\" Cheney said in a speech at the National Press Club. \"I think people ought to be free to enter into any kind of union they wish, any kind of arrangement they wish...\" http://news.yahoo.com/s/ap/20090601/ap_on_re_us/us_cheney", 
        "reply": " I believe the same too, its just that gays refuse to accept the term \"civil union\" with the rights and privleges of a traditional marriage just to impose their will and agenda on the general public.. Fug em..", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 17:40:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: Stop the presses! The world ends today! Hardly...more of those situational ethics and values we all have to possess to take care of our own families. quote: WASHINGTON (AP)– Former Vice President Dick Cheney said Monday he supports gays being able to marry but believes states, not the federal government, should make the decision. \"I think, you know, freedom means freedom for everyone,\" Cheney said in a speech at the National Press Club. \"I think people ought to be free to enter into any kind of union they wish, any kind of arrangement they wish...\" http://news.yahoo.com/s/ap/20090601/ap_on_re_us/us_cheney And just earlier today I was joking about the Apocalypse. So, since he believes the states should decide, would he urge Republicans to support the repeal of the ill-named, ill-conceived \"Defense of Marriage Act\"?", 
        "intTime": 20090601, 
        "postID": 2, 
        "quote": "Originally posted by Yooper_tj: Stop the presses! The world ends today! Hardly...more of those situational ethics and values we all have to possess to take care of our own families. quote: WASHINGTON (AP)– Former Vice President Dick Cheney said Monday he supports gays being able to marry but believes states, not the federal government, should make the decision. \"I think, you know, freedom means freedom for everyone,\" Cheney said in a speech at the National Press Club. \"I think people ought to be free to enter into any kind of union they wish, any kind of arrangement they wish...\" http://news.yahoo.com/s/ap/20090601/ap_on_re_us/us_cheney", 
        "reply": " And just earlier today I was joking about the Apocalypse. So, since he believes the states should decide, would he urge Republicans to support the repeal of the ill-named, ill-conceived \"Defense of Marriage Act\"?", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 17:49:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "It would be nice if more people would pick up on the fact that it is an issue for states and not federal.", 
        "intTime": 20090601, 
        "postID": 3, 
        "quote": "", 
        "reply": "It would be nice if more people would pick up on the fact that it is an issue for states and not federal.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 17:49:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: It would be nice if more people would pick up on the fact that it is an issue for states and not federal. I'm pretty sure the arrogant gay community will be ignorant enough to take this to the Supreme Court where the case will not even be heard....", 
        "intTime": 20090601, 
        "postID": 4, 
        "quote": "Originally posted by iamgonzo: It would be nice if more people would pick up on the fact that it is an issue for states and not federal.", 
        "reply": " I'm pretty sure the arrogant gay community will be ignorant enough to take this to the Supreme Court where the case will not even be heard....", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 17:57:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: DOMA doesn't prevent a state from allowing gay marriage. It prevents the legislature in California from forcing the judiciary in Wyoming to recognize those marriages allowed in Cali but not in Wyoming. It also prevents employees of the state of Wyoming from running off to California to get married and then requiring the state of Wyoming to afford the benefits guaranteed by California law. I suspect that the right balance of justices on SCOTUS will eventually throw DOMA out as violating the equal protection clause of the fourteenth amendment, though not by more than 5-4. Scalia won't live forever...or will he? Never know, that said, who knows if it's not a conservative in office next and he gets some picks. Could swing everything wild. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090601, 
        "postID": 5, 
        "quote": "Originally posted by Yooper_tj: DOMA doesn't prevent a state from allowing gay marriage. It prevents the legislature in California from forcing the judiciary in Wyoming to recognize those marriages allowed in Cali but not in Wyoming. It also prevents employees of the state of Wyoming from running off to California to get married and then requiring the state of Wyoming to afford the benefits guaranteed by California law. I suspect that the right balance of justices on SCOTUS will eventually throw DOMA out as violating the equal protection clause of the fourteenth amendment, though not by more than 5-4. Scalia won't live forever...or will he?", 
        "reply": " Never know, that said, who knows if it's not a conservative in office next and he gets some picks. Could swing everything wild. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 18:30:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: DOMA doesn't prevent a state from allowing gay marriage. It prevents the legislature in California from forcing the judiciary in Wyoming to recognize those marriages allowed in Cali but not in Wyoming. It also prevents employees of the state of Wyoming from running off to California to get married and then requiring the state of Wyoming to afford the benefits guaranteed by California law. I suspect that the right balance of justices on SCOTUS will eventually throw DOMA out as violating the equal protection clause of the fourteenth amendment, though not by more than 5-4. You are correct, with one exception. It is not 14th amendment grounds on which it should obviously fail, but, rather, full faith and credit clause. The federal government cannot make a law instructing the states to ignore the laws of other states with regard to interstate commerce. For those here who disingenuously grouse that gay people should be happy with civil unions that are equal, I might remind two things: Firstly, one of the two of you is also publicly against civil unions as well; and, secondly, the civil unions of which you speak are intentionally rendered unequal by the very same law I talked about earlier, the horribly mis-titled DOMA.", 
        "intTime": 20090601, 
        "postID": 6, 
        "quote": "Originally posted by Yooper_tj: DOMA doesn't prevent a state from allowing gay marriage. It prevents the legislature in California from forcing the judiciary in Wyoming to recognize those marriages allowed in Cali but not in Wyoming. It also prevents employees of the state of Wyoming from running off to California to get married and then requiring the state of Wyoming to afford the benefits guaranteed by California law. I suspect that the right balance of justices on SCOTUS will eventually throw DOMA out as violating the equal protection clause of the fourteenth amendment, though not by more than 5-4.", 
        "reply": " You are correct, with one exception. It is not 14th amendment grounds on which it should obviously fail, but, rather, full faith and credit clause. The federal government cannot make a law instructing the states to ignore the laws of other states with regard to interstate commerce. For those here who disingenuously grouse that gay people should be happy with civil unions that are equal, I might remind two things: Firstly, one of the two of you is also publicly against civil unions as well; and, secondly, the civil unions of which you speak are intentionally rendered unequal by the very same law I talked about earlier, the horribly mis-titled DOMA.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 19:19:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Bleah"
    }, 
    {
        "content": "This was hinted at in some news outlets last week. I have been expecting this. It is a sad reflection on the character of our president that the former vice president is actually ahead of him on this. Those gay people who voted for Obama on the assumption that he would help them should have listened harder when he spoke.", 
        "intTime": 20090601, 
        "postID": 7, 
        "quote": "", 
        "reply": "This was hinted at in some news outlets last week. I have been expecting this. It is a sad reflection on the character of our president that the former vice president is actually ahead of him on this. Those gay people who voted for Obama on the assumption that he would help them should have listened harder when he spoke.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 19:22:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: This was hinted at in some news outlets last week. I have been expecting this. It is a sad reflection on the character of our president that the former vice president is actually ahead of him on this. Those gay people who voted for Obama on the assumption that he would help them should have listened harder when he spoke. Well, bear in mind one thing... Cheney has a gay daughter who has been in a stable, long-term relationship with another woman. My guess is that Cheney's lesbian daughter finally had The Talk with dear old dad. But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. It's interesting, and I shall watch how it develops. All I know is that my marriage will still be there when my government finally decides to recognize it.", 
        "intTime": 20090601, 
        "postID": 8, 
        "quote": "Originally posted by Bleah: This was hinted at in some news outlets last week. I have been expecting this. It is a sad reflection on the character of our president that the former vice president is actually ahead of him on this. Those gay people who voted for Obama on the assumption that he would help them should have listened harder when he spoke.", 
        "reply": " Well, bear in mind one thing... Cheney has a gay daughter who has been in a stable, long-term relationship with another woman. My guess is that Cheney's lesbian daughter finally had The Talk with dear old dad. But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. It's interesting, and I shall watch how it develops. All I know is that my marriage will still be there when my government finally decides to recognize it.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 19:40:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen.", 
        "intTime": 20090601, 
        "postID": 9, 
        "quote": "But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month.", 
        "reply": " How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 19:55:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen. So do I. Forgive me... I was being tongue-in-cheek. Just got off the phone with my mother, who spent the evening with her French club back in New Hampshire. The club is mostly older Catholics (my mother is one of the youngest), and the issue of gay marriage in NH came up. One of the older ladies said she wasn't too sure about switching from Civil Unions to Gay Marriage in NH. (By \"older,\" we mean she was probably around 80.) Two of the \"younger\" ladies (just over 60) proceeded to explain to her exactly why gays should have the right to be married under the law. These are all devout Catholics, living in a moderate-to-conservative area of a moderate state. So the stuff Cheney said was on the discussion board, as was Obama's declaration. I just find it amusing that these statements from these two men coincided this way. Hang in there, Bleah. It's getting better. Nobody wants it more than I do, but we'll get there. I'm not giving Obama a free pass. One thing at a time. Speaking for myself, he's a definite improvement over the last guy who declared that Pagan service members shouldn't even be allowed to practice their religion on military bases, and who wouldn't even address the issue of DADT other than to say that it was good enough", 
        "intTime": 20090601, 
        "postID": 10, 
        "quote": "Originally posted by Bleah: quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen.", 
        "reply": " So do I. Forgive me... I was being tongue-in-cheek. Just got off the phone with my mother, who spent the evening with her French club back in New Hampshire. The club is mostly older Catholics (my mother is one of the youngest), and the issue of gay marriage in NH came up. One of the older ladies said she wasn't too sure about switching from Civil Unions to Gay Marriage in NH. (By \"older,\" we mean she was probably around 80.) Two of the \"younger\" ladies (just over 60) proceeded to explain to her exactly why gays should have the right to be married under the law. These are all devout Catholics, living in a moderate-to-conservative area of a moderate state. So the stuff Cheney said was on the discussion board, as was Obama's declaration. I just find it amusing that these statements from these two men coincided this way. Hang in there, Bleah. It's getting better. Nobody wants it more than I do, but we'll get there. I'm not giving Obama a free pass. One thing at a time. Speaking for myself, he's a definite improvement over the last guy who declared that Pagan service members shouldn't even be allowed to practice their religion on military bases, and who wouldn't even address the issue of DADT other than to say that it was good enough", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:22:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "It should be humiliating to him that Secretary Clinton has done a thousand times more for gay people in her position as Secretary than he has done in the vastly more powerful position of Chief Executive. He's just trying to shut us up because we've been making noise for a few weeks. He has zero intention of anything but dangling a carrot. It's like the promise of a port visit to Australia on the way home from a WESTPAC deployment...always promised, rarely seen. I'm just glad I didn't vote for the man. Now I can say, \"I told you so.\"", 
        "intTime": 20090601, 
        "postID": 11, 
        "quote": "", 
        "reply": "It should be humiliating to him that Secretary Clinton has done a thousand times more for gay people in her position as Secretary than he has done in the vastly more powerful position of Chief Executive. He's just trying to shut us up because we've been making noise for a few weeks. He has zero intention of anything but dangling a carrot. It's like the promise of a port visit to Australia on the way home from a WESTPAC deployment...always promised, rarely seen. I'm just glad I didn't vote for the man. Now I can say, \"I told you so.\"", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:26:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen. I always thought Hillary was the most \"gay friendly\" of the bunch. She certainly looked the most comfortable at the LOGO debates. I think she feels guilty about her husband throwing us under the bus too. DOMA needs to go, by hook or by crook.", 
        "intTime": 20090601, 
        "postID": 12, 
        "quote": "Originally posted by Bleah: quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen.", 
        "reply": " I always thought Hillary was the most \"gay friendly\" of the bunch. She certainly looked the most comfortable at the LOGO debates. I think she feels guilty about her husband throwing us under the bus too. DOMA needs to go, by hook or by crook.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:35:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over.", 
        "intTime": 20090601, 
        "postID": 13, 
        "quote": "", 
        "reply": "The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:38:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor?", 
        "intTime": 20090601, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over.", 
        "reply": " And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor?", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:52:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor? Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets.", 
        "intTime": 20090601, 
        "postID": 15, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor?", 
        "reply": " Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 21:35:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets. point to where the Constitution says a damn thing about pronography. or gays in the boy scouts. yet the SCOTUS has ruled on both subjects haven't they? then again...why am I bothering to talk to a known troll?", 
        "intTime": 20090601, 
        "postID": 16, 
        "quote": "Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets.", 
        "reply": " point to where the Constitution says a damn thing about pronography. or gays in the boy scouts. yet the SCOTUS has ruled on both subjects haven't they? then again...why am I bothering to talk to a known troll?", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 22:03:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Responding to: Irwin_R_Schyster Thread: Cheney on gay marriage: ‘Freedom for everyone’ Date/Time: Mon 01 June 2009 09:35 PM (Pacific) quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by SeaWitch1220: quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won’t even have the “Prerequisites” if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor? Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets. Well, the USSC ruled on the constitutionality of marriage in Loving v. Virginia and in Turner v. Safley. Those are the two that pop immediately to mind, I’m sure there are others. Is that what you were looking for?", 
        "intTime": 20090601, 
        "postID": 17, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by SeaWitch1220: quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won’t even have the “Prerequisites” if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor? Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets.", 
        "reply": "Responding to: Irwin_R_Schyster Thread: Cheney on gay marriage: ‘Freedom for everyone’ Date/Time: Mon 01 June 2009 09:35 PM (Pacific)  Well, the USSC ruled on the constitutionality of marriage in Loving v. Virginia and in Turner v. Safley. Those are the two that pop immediately to mind, I’m sure there are others. Is that what you were looking for?", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 22:05:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "DaleU"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: Stop the presses! The world ends today! Hardly...more of those situational ethics and values we all have to possess to take care of our own families. quote: WASHINGTON (AP)– Former Vice President Dick Cheney said Monday he supports gays being able to marry but believes states, not the federal government, should make the decision. \"I think, you know, freedom means freedom for everyone,\" Cheney said in a speech at the National Press Club. \"I think people ought to be free to enter into any kind of union they wish, any kind of arrangement they wish...\" http://news.yahoo.com/s/ap/20090601/ap_on_re_us/us_cheney I believe the same too, its just that gays refuse to accept the term \"civil union\" with the rights and privleges of a traditional marriage just to impose their will and agenda on the general public.. Fug em..", 
        "intTime": 20090601, 
        "postID": 26, 
        "quote": "Originally posted by Yooper_tj: Stop the presses! The world ends today! Hardly...more of those situational ethics and values we all have to possess to take care of our own families. quote: WASHINGTON (AP)– Former Vice President Dick Cheney said Monday he supports gays being able to marry but believes states, not the federal government, should make the decision. \"I think, you know, freedom means freedom for everyone,\" Cheney said in a speech at the National Press Club. \"I think people ought to be free to enter into any kind of union they wish, any kind of arrangement they wish...\" http://news.yahoo.com/s/ap/20090601/ap_on_re_us/us_cheney", 
        "reply": " I believe the same too, its just that gays refuse to accept the term \"civil union\" with the rights and privleges of a traditional marriage just to impose their will and agenda on the general public.. Fug em..", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 17:40:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: Stop the presses! The world ends today! Hardly...more of those situational ethics and values we all have to possess to take care of our own families. quote: WASHINGTON (AP)– Former Vice President Dick Cheney said Monday he supports gays being able to marry but believes states, not the federal government, should make the decision. \"I think, you know, freedom means freedom for everyone,\" Cheney said in a speech at the National Press Club. \"I think people ought to be free to enter into any kind of union they wish, any kind of arrangement they wish...\" http://news.yahoo.com/s/ap/20090601/ap_on_re_us/us_cheney And just earlier today I was joking about the Apocalypse. So, since he believes the states should decide, would he urge Republicans to support the repeal of the ill-named, ill-conceived \"Defense of Marriage Act\"?", 
        "intTime": 20090601, 
        "postID": 27, 
        "quote": "Originally posted by Yooper_tj: Stop the presses! The world ends today! Hardly...more of those situational ethics and values we all have to possess to take care of our own families. quote: WASHINGTON (AP)– Former Vice President Dick Cheney said Monday he supports gays being able to marry but believes states, not the federal government, should make the decision. \"I think, you know, freedom means freedom for everyone,\" Cheney said in a speech at the National Press Club. \"I think people ought to be free to enter into any kind of union they wish, any kind of arrangement they wish...\" http://news.yahoo.com/s/ap/20090601/ap_on_re_us/us_cheney", 
        "reply": " And just earlier today I was joking about the Apocalypse. So, since he believes the states should decide, would he urge Republicans to support the repeal of the ill-named, ill-conceived \"Defense of Marriage Act\"?", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 17:49:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "It would be nice if more people would pick up on the fact that it is an issue for states and not federal.", 
        "intTime": 20090601, 
        "postID": 28, 
        "quote": "", 
        "reply": "It would be nice if more people would pick up on the fact that it is an issue for states and not federal.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 17:49:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: It would be nice if more people would pick up on the fact that it is an issue for states and not federal. I'm pretty sure the arrogant gay community will be ignorant enough to take this to the Supreme Court where the case will not even be heard....", 
        "intTime": 20090601, 
        "postID": 29, 
        "quote": "Originally posted by iamgonzo: It would be nice if more people would pick up on the fact that it is an issue for states and not federal.", 
        "reply": " I'm pretty sure the arrogant gay community will be ignorant enough to take this to the Supreme Court where the case will not even be heard....", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 17:57:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: DOMA doesn't prevent a state from allowing gay marriage. It prevents the legislature in California from forcing the judiciary in Wyoming to recognize those marriages allowed in Cali but not in Wyoming. It also prevents employees of the state of Wyoming from running off to California to get married and then requiring the state of Wyoming to afford the benefits guaranteed by California law. I suspect that the right balance of justices on SCOTUS will eventually throw DOMA out as violating the equal protection clause of the fourteenth amendment, though not by more than 5-4. Scalia won't live forever...or will he? Never know, that said, who knows if it's not a conservative in office next and he gets some picks. Could swing everything wild. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090601, 
        "postID": 30, 
        "quote": "Originally posted by Yooper_tj: DOMA doesn't prevent a state from allowing gay marriage. It prevents the legislature in California from forcing the judiciary in Wyoming to recognize those marriages allowed in Cali but not in Wyoming. It also prevents employees of the state of Wyoming from running off to California to get married and then requiring the state of Wyoming to afford the benefits guaranteed by California law. I suspect that the right balance of justices on SCOTUS will eventually throw DOMA out as violating the equal protection clause of the fourteenth amendment, though not by more than 5-4. Scalia won't live forever...or will he?", 
        "reply": " Never know, that said, who knows if it's not a conservative in office next and he gets some picks. Could swing everything wild. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 18:30:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: DOMA doesn't prevent a state from allowing gay marriage. It prevents the legislature in California from forcing the judiciary in Wyoming to recognize those marriages allowed in Cali but not in Wyoming. It also prevents employees of the state of Wyoming from running off to California to get married and then requiring the state of Wyoming to afford the benefits guaranteed by California law. I suspect that the right balance of justices on SCOTUS will eventually throw DOMA out as violating the equal protection clause of the fourteenth amendment, though not by more than 5-4. You are correct, with one exception. It is not 14th amendment grounds on which it should obviously fail, but, rather, full faith and credit clause. The federal government cannot make a law instructing the states to ignore the laws of other states with regard to interstate commerce. For those here who disingenuously grouse that gay people should be happy with civil unions that are equal, I might remind two things: Firstly, one of the two of you is also publicly against civil unions as well; and, secondly, the civil unions of which you speak are intentionally rendered unequal by the very same law I talked about earlier, the horribly mis-titled DOMA.", 
        "intTime": 20090601, 
        "postID": 31, 
        "quote": "Originally posted by Yooper_tj: DOMA doesn't prevent a state from allowing gay marriage. It prevents the legislature in California from forcing the judiciary in Wyoming to recognize those marriages allowed in Cali but not in Wyoming. It also prevents employees of the state of Wyoming from running off to California to get married and then requiring the state of Wyoming to afford the benefits guaranteed by California law. I suspect that the right balance of justices on SCOTUS will eventually throw DOMA out as violating the equal protection clause of the fourteenth amendment, though not by more than 5-4.", 
        "reply": " You are correct, with one exception. It is not 14th amendment grounds on which it should obviously fail, but, rather, full faith and credit clause. The federal government cannot make a law instructing the states to ignore the laws of other states with regard to interstate commerce. For those here who disingenuously grouse that gay people should be happy with civil unions that are equal, I might remind two things: Firstly, one of the two of you is also publicly against civil unions as well; and, secondly, the civil unions of which you speak are intentionally rendered unequal by the very same law I talked about earlier, the horribly mis-titled DOMA.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 19:19:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Bleah"
    }, 
    {
        "content": "This was hinted at in some news outlets last week. I have been expecting this. It is a sad reflection on the character of our president that the former vice president is actually ahead of him on this. Those gay people who voted for Obama on the assumption that he would help them should have listened harder when he spoke.", 
        "intTime": 20090601, 
        "postID": 32, 
        "quote": "", 
        "reply": "This was hinted at in some news outlets last week. I have been expecting this. It is a sad reflection on the character of our president that the former vice president is actually ahead of him on this. Those gay people who voted for Obama on the assumption that he would help them should have listened harder when he spoke.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 19:22:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: This was hinted at in some news outlets last week. I have been expecting this. It is a sad reflection on the character of our president that the former vice president is actually ahead of him on this. Those gay people who voted for Obama on the assumption that he would help them should have listened harder when he spoke. Well, bear in mind one thing... Cheney has a gay daughter who has been in a stable, long-term relationship with another woman. My guess is that Cheney's lesbian daughter finally had The Talk with dear old dad. But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. It's interesting, and I shall watch how it develops. All I know is that my marriage will still be there when my government finally decides to recognize it.", 
        "intTime": 20090601, 
        "postID": 33, 
        "quote": "Originally posted by Bleah: This was hinted at in some news outlets last week. I have been expecting this. It is a sad reflection on the character of our president that the former vice president is actually ahead of him on this. Those gay people who voted for Obama on the assumption that he would help them should have listened harder when he spoke.", 
        "reply": " Well, bear in mind one thing... Cheney has a gay daughter who has been in a stable, long-term relationship with another woman. My guess is that Cheney's lesbian daughter finally had The Talk with dear old dad. But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. It's interesting, and I shall watch how it develops. All I know is that my marriage will still be there when my government finally decides to recognize it.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 19:40:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen.", 
        "intTime": 20090601, 
        "postID": 34, 
        "quote": "But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month.", 
        "reply": " How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 19:55:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen. So do I. Forgive me... I was being tongue-in-cheek. Just got off the phone with my mother, who spent the evening with her French club back in New Hampshire. The club is mostly older Catholics (my mother is one of the youngest), and the issue of gay marriage in NH came up. One of the older ladies said she wasn't too sure about switching from Civil Unions to Gay Marriage in NH. (By \"older,\" we mean she was probably around 80.) Two of the \"younger\" ladies (just over 60) proceeded to explain to her exactly why gays should have the right to be married under the law. These are all devout Catholics, living in a moderate-to-conservative area of a moderate state. So the stuff Cheney said was on the discussion board, as was Obama's declaration. I just find it amusing that these statements from these two men coincided this way. Hang in there, Bleah. It's getting better. Nobody wants it more than I do, but we'll get there. I'm not giving Obama a free pass. One thing at a time. Speaking for myself, he's a definite improvement over the last guy who declared that Pagan service members shouldn't even be allowed to practice their religion on military bases, and who wouldn't even address the issue of DADT other than to say that it was good enough", 
        "intTime": 20090601, 
        "postID": 35, 
        "quote": "Originally posted by Bleah: quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen.", 
        "reply": " So do I. Forgive me... I was being tongue-in-cheek. Just got off the phone with my mother, who spent the evening with her French club back in New Hampshire. The club is mostly older Catholics (my mother is one of the youngest), and the issue of gay marriage in NH came up. One of the older ladies said she wasn't too sure about switching from Civil Unions to Gay Marriage in NH. (By \"older,\" we mean she was probably around 80.) Two of the \"younger\" ladies (just over 60) proceeded to explain to her exactly why gays should have the right to be married under the law. These are all devout Catholics, living in a moderate-to-conservative area of a moderate state. So the stuff Cheney said was on the discussion board, as was Obama's declaration. I just find it amusing that these statements from these two men coincided this way. Hang in there, Bleah. It's getting better. Nobody wants it more than I do, but we'll get there. I'm not giving Obama a free pass. One thing at a time. Speaking for myself, he's a definite improvement over the last guy who declared that Pagan service members shouldn't even be allowed to practice their religion on military bases, and who wouldn't even address the issue of DADT other than to say that it was good enough", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:22:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "It should be humiliating to him that Secretary Clinton has done a thousand times more for gay people in her position as Secretary than he has done in the vastly more powerful position of Chief Executive. He's just trying to shut us up because we've been making noise for a few weeks. He has zero intention of anything but dangling a carrot. It's like the promise of a port visit to Australia on the way home from a WESTPAC deployment...always promised, rarely seen. I'm just glad I didn't vote for the man. Now I can say, \"I told you so.\"", 
        "intTime": 20090601, 
        "postID": 36, 
        "quote": "", 
        "reply": "It should be humiliating to him that Secretary Clinton has done a thousand times more for gay people in her position as Secretary than he has done in the vastly more powerful position of Chief Executive. He's just trying to shut us up because we've been making noise for a few weeks. He has zero intention of anything but dangling a carrot. It's like the promise of a port visit to Australia on the way home from a WESTPAC deployment...always promised, rarely seen. I'm just glad I didn't vote for the man. Now I can say, \"I told you so.\"", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:26:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen. I always thought Hillary was the most \"gay friendly\" of the bunch. She certainly looked the most comfortable at the LOGO debates. I think she feels guilty about her husband throwing us under the bus too. DOMA needs to go, by hook or by crook.", 
        "intTime": 20090601, 
        "postID": 37, 
        "quote": "Originally posted by Bleah: quote: But in case you missed it, Obama dropped his own bombshell today. He declared that June is National GLBT (Gay, Lesbian, Bisexual, Transsexual) Pride Month. How is that a bombshell? He is not the first president to do so. I don't care about getting a special month, or a special anything. I care about equal treatment under the laws of our nation. Thus far, only the Department of State has made positive moves within the Obama administration to make this happen.", 
        "reply": " I always thought Hillary was the most \"gay friendly\" of the bunch. She certainly looked the most comfortable at the LOGO debates. I think she feels guilty about her husband throwing us under the bus too. DOMA needs to go, by hook or by crook.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:35:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over.", 
        "intTime": 20090601, 
        "postID": 38, 
        "quote": "", 
        "reply": "The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:38:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor?", 
        "intTime": 20090601, 
        "postID": 39, 
        "quote": "Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over.", 
        "reply": " And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor?", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 20:52:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor? Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets.", 
        "intTime": 20090601, 
        "postID": 40, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won't even have the \"Prerequisites\" if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor?", 
        "reply": " Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets.", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 21:35:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets. point to where the Constitution says a damn thing about pronography. or gays in the boy scouts. yet the SCOTUS has ruled on both subjects haven't they? then again...why am I bothering to talk to a known troll?", 
        "intTime": 20090601, 
        "postID": 41, 
        "quote": "Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets.", 
        "reply": " point to where the Constitution says a damn thing about pronography. or gays in the boy scouts. yet the SCOTUS has ruled on both subjects haven't they? then again...why am I bothering to talk to a known troll?", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 22:03:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Responding to: Irwin_R_Schyster Thread: Cheney on gay marriage: ‘Freedom for everyone’ Date/Time: Mon 01 June 2009 09:35 PM (Pacific) quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by SeaWitch1220: quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won’t even have the “Prerequisites” if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor? Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets. Well, the USSC ruled on the constitutionality of marriage in Loving v. Virginia and in Turner v. Safley. Those are the two that pop immediately to mind, I’m sure there are others. Is that what you were looking for?", 
        "intTime": 20090601, 
        "postID": 42, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by SeaWitch1220: quote: Originally posted by Irwin_R_Schyster: The Supreme Court will not even hear a case that has to deal with gay marriage. In doing so, a statement will be made: The states have voted and their courts have ruled, accept the results or move. There is NOTHING for the Supreme Court to rule on. The gays won’t even have the “Prerequisites” if you will to present a case to the court... There is no compelling constitutional philosophy to discuss...The constitution does not outline who can or cannot get married..game over. And you got your Constitutional law degree where? When this issue does reach the Supreme Court, tell me...how they will rule on law and precedent Mr. Constitutional Law Professor? Point to where the Constitution says a damn thing about Marriage....you know, thats what the Supreme Court interprets.", 
        "reply": "Responding to: Irwin_R_Schyster Thread: Cheney on gay marriage: ‘Freedom for everyone’ Date/Time: Mon 01 June 2009 09:35 PM (Pacific)  Well, the USSC ruled on the constitutionality of marriage in Loving v. Virginia and in Turner v. Safley. Those are the two that pop immediately to mind, I’m sure there are others. Is that what you were looking for?", 
        "threadID": "409192893_2430048422001", 
        "time": "2009-06-01 22:05:00", 
        "title": "Cheney on gay marriage: 'Freedom for everyone'", 
        "userID": "DaleU"
    }
]