[
    {
        "content": "More great ethics by the ethically challenged speaker and her minions quote: Rep. Jane Harman (D-Calif.) accused the government of an \"abuse of power\" in wiretapping her conversations, following news reports that she had been recorded in 2006 on FBI wiretaps that officials at the time said raised questions of possible illegal conduct. quote: The National Security Agency briefed Speaker Nancy Pelosi (D-Calif.) “a few years ago” that they had wiretapped Rep. Jane Harman (D-Calif.), Pelosi revealed Wednesday. But Pelosi said she was not told what federal eavesdroppers picked up on the call — and never alerted Harman to it. “It was not my position to raise it with Jane Harman,” Pelosi told reporters at the Christian Science Monitor lunch. “In fact, I didn’t even know if what they were talking about was real. All they said was that she was wiretapped.” quote: The U.S. government may abandon espionage-law charges against two former lobbyists for a pro-Israel advocacy group, officials said yesterday, as a prominent House lawmaker denied new allegations that she offered to use her influence in their behalf. Rep. Jane Harman (D-Calif.) accused the government of an “abuse of power” in wiretapping her conversations, following news reports that she had been recorded in 2006 on FBI wiretaps that officials at the time said raised questions of possible illegal conduct. Harman’s expression of outrage added a political dimension to the prosecution of the two former lobbyists, who were charged in 2005 under a World War I-era espionage law with conspiring to give national defense information to journalists and Israeli Embassy officials. With the trial set to begin June 2, the Justice Department is reviewing whether to proceed as planned or withdraw the indictments after a series of adverse court rulings, according to law enforcement sources and lawyers close to the case. 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/21/AR2009042102602.html?wprss=rss_politics'", 
        "intTime": 20090422, 
        "postID": 1, 
        "quote": "Rep. Jane Harman (D-Calif.) accused the government of an \"abuse of power\" in wiretapping her conversations, following news reports that she had been recorded in 2006 on FBI wiretaps that officials at the time said raised questions of possible illegal conduct.", 
        "reply": "More great ethics by the ethically challenged speaker and her minions  quote: The National Security Agency briefed Speaker Nancy Pelosi (D-Calif.) “a few years ago” that they had wiretapped Rep. Jane Harman (D-Calif.), Pelosi revealed Wednesday. But Pelosi said she was not told what federal eavesdroppers picked up on the call — and never alerted Harman to it. “It was not my position to raise it with Jane Harman,” Pelosi told reporters at the Christian Science Monitor lunch. “In fact, I didn’t even know if what they were talking about was real. All they said was that she was wiretapped.” quote: The U.S. government may abandon espionage-law charges against two former lobbyists for a pro-Israel advocacy group, officials said yesterday, as a prominent House lawmaker denied new allegations that she offered to use her influence in their behalf. Rep. Jane Harman (D-Calif.) accused the government of an “abuse of power” in wiretapping her conversations, following news reports that she had been recorded in 2006 on FBI wiretaps that officials at the time said raised questions of possible illegal conduct. Harman’s expression of outrage added a political dimension to the prosecution of the two former lobbyists, who were charged in 2005 under a World War I-era espionage law with conspiring to give national defense information to journalists and Israeli Embassy officials. With the trial set to begin June 2, the Justice Department is reviewing whether to proceed as planned or withdraw the indictments after a series of adverse court rulings, according to law enforcement sources and lawyers close to the case. 'http://www.washingtonpost.com/wp-dyn/content/article/2009/04/21/AR2009042102602.html?wprss=rss_politics'", 
        "threadID": "409192893_7860064122001", 
        "time": "2009-04-22 12:38:00", 
        "title": "Pelosi Knew About Harman Wiretap", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "If Harman is guilty of what the wiretaps indicate, then prosecute her azz.", 
        "intTime": 20090422, 
        "postID": 2, 
        "quote": "", 
        "reply": "If Harman is guilty of what the wiretaps indicate, then prosecute her azz.", 
        "threadID": "409192893_7860064122001", 
        "time": "2009-04-22 13:51:00", 
        "title": "Pelosi Knew About Harman Wiretap", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: If Harman is guilty of what the wiretaps indicate, then prosecute her azz. I notice this excerpt of the Washington Post article did not mention that Ms Harman has demanded that the full transcripts and background of the call be released. quote: Harman further called on the department to release in full any transcripts and other material involving her that were collected during the federal probe, so she could make them public. This information about the Bush Admin Justice Department was also left out of the excerpt quote: The Justice Department decided not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and such cases are hard to prove, one former government official said yesterday.", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "Originally posted by PhoenixDark: If Harman is guilty of what the wiretaps indicate, then prosecute her azz.", 
        "reply": " I notice this excerpt of the Washington Post article did not mention that Ms Harman has demanded that the full transcripts and background of the call be released. quote: Harman further called on the department to release in full any transcripts and other material involving her that were collected during the federal probe, so she could make them public. This information about the Bush Admin Justice Department was also left out of the excerpt quote: The Justice Department decided not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and such cases are hard to prove, one former government official said yesterday.", 
        "threadID": "409192893_7860064122001", 
        "time": "2009-04-22 14:02:00", 
        "title": "Pelosi Knew About Harman Wiretap", 
        "userID": "rayld2"
    }, 
    {
        "content": ".. quote: Originally posted by rayld2: quote: Originally posted by PhoenixDark: If Harman is guilty of what the wiretaps indicate, then prosecute her azz. I notice this excerpt of the Washington Post article did not mention that Ms Harman has demanded that the full transcripts and background of the call be released. quote: Harman further called on the department to release in full any transcripts and other material involving her that were collected during the federal probe, so she could make them public. This information about the Bush Admin Justice Department was also left out of the excerpt quote: The Justice Department decided not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and such cases are hard to prove, one former government official said yesterday. This is huge! We'll call it RUSTYGATE!!! I smell a Pulitzer", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "Originally posted by rayld2: quote: Originally posted by PhoenixDark: If Harman is guilty of what the wiretaps indicate, then prosecute her azz. I notice this excerpt of the Washington Post article did not mention that Ms Harman has demanded that the full transcripts and background of the call be released. quote: Harman further called on the department to release in full any transcripts and other material involving her that were collected during the federal probe, so she could make them public. This information about the Bush Admin Justice Department was also left out of the excerpt quote: The Justice Department decided not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and such cases are hard to prove, one former government official said yesterday.", 
        "reply": "..  This is huge! We'll call it RUSTYGATE!!! I smell a Pulitzer", 
        "threadID": "409192893_7860064122001", 
        "time": "2009-04-22 14:52:00", 
        "title": "Pelosi Knew About Harman Wiretap", 
        "userID": "scottrj50"
    }, 
    {
        "content": "Just more Jew bashing of the worst kind from the far left....", 
        "intTime": 20090422, 
        "postID": 5, 
        "quote": "", 
        "reply": "Just more Jew bashing of the worst kind from the far left....", 
        "threadID": "409192893_7860064122001", 
        "time": "2009-04-22 14:53:00", 
        "title": "Pelosi Knew About Harman Wiretap", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by PhoenixDark: If Harman is guilty of what the wiretaps indicate, then prosecute her azz. I notice this excerpt of the Washington Post article did not mention that Ms Harman has demanded that the full transcripts and background of the call be released. quote: Harman further called on the department to release in full any transcripts and other material involving her that were collected during the federal probe, so she could make them public. This information about the Bush Admin Justice Department was also left out of the excerpt quote: The Justice Department decided not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and such cases are hard to prove, one former government official said yesterday. Possibly another example of the level of the type of incompetence within the Justice Department (and possibly NSA) during the last Administration? Remember - a case prosecuted against former Senator Ted Stevens was thrown out because of possible prosecutorial misconduct. After reading this story from several sources, including CNN, CQ.com, and NPR, it appears that a. She was speaking on the phone with a gentleman named Heim Saban, one of the wealthiest men in the world and supporter of Israel. b. The NSA was supposedly intercepting a communication that Harman was part of. However, she wasn't supposed to be the subject of that intercept. So, Saban would have had to be the subject. c. This information got to the Justice Department, who was going to launch an investigation. Somewhere along the line, they came to their senses and backed off. From what I can surmise, there are problems here. First, if NSA had gotten involved, it was because one of the persons had to be from outside the United States. Further, if the NSA was doing this, a FISA warrant would have been necessary under normal circumstances. Secondly, there was no foreign contact on this call if it were Saban. He's a Californian and an American citizen. NSA got its potentially illegally-acquired information and passed it to the Justice Department, and the FBI started an investigation based on it. However, they were ordered by former Attorney General Gonzales to stand down on the investigation of Harman because she was a supporter of the warrantless wiretapping program and her support was needed. Now, the cat's out of the bag. Did Harman break the law? Maybe she did - but once again, incompetence screwed up the case.", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "Originally posted by rayld2: quote: Originally posted by PhoenixDark: If Harman is guilty of what the wiretaps indicate, then prosecute her azz. I notice this excerpt of the Washington Post article did not mention that Ms Harman has demanded that the full transcripts and background of the call be released. quote: Harman further called on the department to release in full any transcripts and other material involving her that were collected during the federal probe, so she could make them public. This information about the Bush Admin Justice Department was also left out of the excerpt quote: The Justice Department decided not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and such cases are hard to prove, one former government official said yesterday.", 
        "reply": " Possibly another example of the level of the type of incompetence within the Justice Department (and possibly NSA) during the last Administration? Remember - a case prosecuted against former Senator Ted Stevens was thrown out because of possible prosecutorial misconduct. After reading this story from several sources, including CNN, CQ.com, and NPR, it appears that a. She was speaking on the phone with a gentleman named Heim Saban, one of the wealthiest men in the world and supporter of Israel. b. The NSA was supposedly intercepting a communication that Harman was part of. However, she wasn't supposed to be the subject of that intercept. So, Saban would have had to be the subject. c. This information got to the Justice Department, who was going to launch an investigation. Somewhere along the line, they came to their senses and backed off. From what I can surmise, there are problems here. First, if NSA had gotten involved, it was because one of the persons had to be from outside the United States. Further, if the NSA was doing this, a FISA warrant would have been necessary under normal circumstances. Secondly, there was no foreign contact on this call if it were Saban. He's a Californian and an American citizen. NSA got its potentially illegally-acquired information and passed it to the Justice Department, and the FBI started an investigation based on it. However, they were ordered by former Attorney General Gonzales to stand down on the investigation of Harman because she was a supporter of the warrantless wiretapping program and her support was needed. Now, the cat's out of the bag. Did Harman break the law? Maybe she did - but once again, incompetence screwed up the case.", 
        "threadID": "409192893_7860064122001", 
        "time": "2009-04-22 19:02:00", 
        "title": "Pelosi Knew About Harman Wiretap", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: .. quote: Originally posted by rayld2: quote: Originally posted by PhoenixDark: If Harman is guilty of what the wiretaps indicate, then prosecute her azz. I notice this excerpt of the Washington Post article did not mention that Ms Harman has demanded that the full transcripts and background of the call be released. quote: Harman further called on the department to release in full any transcripts and other material involving her that were collected during the federal probe, so she could make them public. This information about the Bush Admin Justice Department was also left out of the excerpt quote: The Justice Department decided not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and such cases are hard to prove, one former government official said yesterday. This is huge! We'll call it RUSTYGATE!!! I smell a Pulitzer I smell people who are swimming in the sewer pretending to find something so they can throw crap at the people that BEAT them in the election. Remember the BUSH Justice Department decided quote: not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and Ms Harman is asking for a full release of ALL the material related to this.", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "Originally posted by scottrj50: .. quote: Originally posted by rayld2: quote: Originally posted by PhoenixDark: If Harman is guilty of what the wiretaps indicate, then prosecute her azz. I notice this excerpt of the Washington Post article did not mention that Ms Harman has demanded that the full transcripts and background of the call be released. quote: Harman further called on the department to release in full any transcripts and other material involving her that were collected during the federal probe, so she could make them public. This information about the Bush Admin Justice Department was also left out of the excerpt quote: The Justice Department decided not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and such cases are hard to prove, one former government official said yesterday. This is huge! We'll call it RUSTYGATE!!! I smell a Pulitzer", 
        "reply": " I smell people who are swimming in the sewer pretending to find something so they can throw crap at the people that BEAT them in the election. Remember the BUSH Justice Department decided quote: not to proceed with a criminal case against Harman or to notify congressional leaders of the preliminary investigation because the evidence was at best murky and Ms Harman is asking for a full release of ALL the material related to this.", 
        "threadID": "409192893_7860064122001", 
        "time": "2009-04-22 19:59:00", 
        "title": "Pelosi Knew About Harman Wiretap", 
        "userID": "rayld2"
    }
]