[
    {
        "content": "But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 08:40:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by supporters of Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda?", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php", 
        "reply": " As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by supporters of Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda?", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 09:25:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim ot be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting.", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda?", 
        "reply": " Well, that depends. Seeing as how you claim ot be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 09:28:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim to be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting. Oh, you can be sure that I am a veteran. I wore the uniform proudly for 27 years, combined Active Army and Army Reserve. But since I was also a registered Democrat during that same 27 years (and continue to be), various Republican Presidential Administrations have considered me a danger to the nation (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive - according to the parts of my FBI file I received under a Freedom of Information request). You know what? I \"found it pretty damned insulting\" that my patriotism was questioned because I was a registered Democrat, rather than a registered Republican. Just as I \"find it pretty damned insulting\" when certain people imply that I really am not an Army veteran because I am not a registered Republican and I support the present President of the United States. Actually, I suspect that much of these reports, which were commissioned by the Bush Adminstration and just recently made public, have a lot of truth in them. If I am serving with a white supremicist in my unit, I would like to know about it so that he or she could be watched carefully and dishonorably discharged if they violate the Constitution and or the UCMJ. I would not allow them to hide behind a \"green wall of silence\", like the \"blue wall of silence\" where an honest policeman covers for a dishonest policeman because \"cops have to support fellow cops\". Soliders shouldn't support fellow soldiers if they know that fellow soldier has broken the law or is planning to break the law. I have had both white and black supremicists assigned to my units in the Active Army and in the Army Reserve - and I have done what I could to get them out of the military. But back to my original comment to the OP: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion.", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by transport1: quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim to be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting.", 
        "reply": " Oh, you can be sure that I am a veteran. I wore the uniform proudly for 27 years, combined Active Army and Army Reserve. But since I was also a registered Democrat during that same 27 years (and continue to be), various Republican Presidential Administrations have considered me a danger to the nation (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive - according to the parts of my FBI file I received under a Freedom of Information request). You know what? I \"found it pretty damned insulting\" that my patriotism was questioned because I was a registered Democrat, rather than a registered Republican. Just as I \"find it pretty damned insulting\" when certain people imply that I really am not an Army veteran because I am not a registered Republican and I support the present President of the United States. Actually, I suspect that much of these reports, which were commissioned by the Bush Adminstration and just recently made public, have a lot of truth in them. If I am serving with a white supremicist in my unit, I would like to know about it so that he or she could be watched carefully and dishonorably discharged if they violate the Constitution and or the UCMJ. I would not allow them to hide behind a \"green wall of silence\", like the \"blue wall of silence\" where an honest policeman covers for a dishonest policeman because \"cops have to support fellow cops\". Soliders shouldn't support fellow soldiers if they know that fellow soldier has broken the law or is planning to break the law. I have had both white and black supremicists assigned to my units in the Active Army and in the Army Reserve - and I have done what I could to get them out of the military. But back to my original comment to the OP: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 09:51:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by supporters of Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Ya, I'm not defending the site.", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by supporters of Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda?", 
        "reply": " Ya, I'm not defending the site.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:16:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by transport1: quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim to be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting. Oh, you can be sure that I am a veteran. I wore the uniform proudly for 27 years, combined Active Army and Army Reserve. But since I was also a registered Democrat during that same 27 years (and continue to be), various Republican Presidential Administrations have considered me a danger to the nation (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive - according to the parts of my FBI file I received under a Freedom of Information request). You know what? I \"found it pretty damned insulting\" that my patriotism was questioned because I was a registered Democrat, rather than a registered Republican. Just as I \"find it pretty damned insulting\" when certain people imply that I really am not an Army veteran because I am not a registered Republican and I support the present President of the United States. Actually, I suspect that much of these reports, which were commissioned by the Bush Adminstration and just recently made public, have a lot of truth in them. If I am serving with a white supremicist in my unit, I would like to know about it so that he or she could be watched carefully and dishonorably discharged if they violate the Constitution and or the UCMJ. I would not allow them to hide behind a \"green wall of silence\", like the \"blue wall of silence\" where an honest policeman covers for a dishonest policeman because \"cops have to support fellow cops\". Soliders shouldn't support fellow soldiers if they know that fellow soldier has broken the law or is planning to break the law. I have had both white and black supremicists assigned to my units in the Active Army and in the Army Reserve - and I have done what I could to get them out of the military. But back to my original comment to the OP: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion. I'd say the numbers in what I posted merit some thought. You can spin ideas..but facts are little tougher.", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by transport1: quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim to be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting. Oh, you can be sure that I am a veteran. I wore the uniform proudly for 27 years, combined Active Army and Army Reserve. But since I was also a registered Democrat during that same 27 years (and continue to be), various Republican Presidential Administrations have considered me a danger to the nation (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive - according to the parts of my FBI file I received under a Freedom of Information request). You know what? I \"found it pretty damned insulting\" that my patriotism was questioned because I was a registered Democrat, rather than a registered Republican. Just as I \"find it pretty damned insulting\" when certain people imply that I really am not an Army veteran because I am not a registered Republican and I support the present President of the United States. Actually, I suspect that much of these reports, which were commissioned by the Bush Adminstration and just recently made public, have a lot of truth in them. If I am serving with a white supremicist in my unit, I would like to know about it so that he or she could be watched carefully and dishonorably discharged if they violate the Constitution and or the UCMJ. I would not allow them to hide behind a \"green wall of silence\", like the \"blue wall of silence\" where an honest policeman covers for a dishonest policeman because \"cops have to support fellow cops\". Soliders shouldn't support fellow soldiers if they know that fellow soldier has broken the law or is planning to break the law. I have had both white and black supremicists assigned to my units in the Active Army and in the Army Reserve - and I have done what I could to get them out of the military. But back to my original comment to the OP: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion.", 
        "reply": " I'd say the numbers in what I posted merit some thought. You can spin ideas..but facts are little tougher.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:20:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion. The document stands on its own and I doubt any here arguing against it have even took the time to objectfully read it. It is a risk assessment that in my opinion is apolitical and does not target veterans, but merely points out that due to their combat training be actively recuited by radical extremist groups. Must be why SHE appologized to us Vets today. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "Originally posted by dmuhler: quote: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion. The document stands on its own and I doubt any here arguing against it have even took the time to objectfully read it. It is a risk assessment that in my opinion is apolitical and does not target veterans, but merely points out that due to their combat training be actively recuited by radical extremist groups.", 
        "reply": " Must be why SHE appologized to us Vets today. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:38:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive -. Well, duh, what kind of crack pot would vote for him,", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "Originally posted by Fightdirector: (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive -.", 
        "reply": " Well, duh, what kind of crack pot would vote for him,", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:42:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Did anyone catch Sec. Napilitano on Fox today? When questioned about this, she at fir4st claimed it was just a theory paper, then she said, well, it came out when she was out of the country, like that should absolve HER of the issue.", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "Did anyone catch Sec. Napilitano on Fox today? When questioned about this, she at fir4st claimed it was just a theory paper, then she said, well, it came out when she was out of the country, like that should absolve HER of the issue.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:43:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "billdawg24"
    }, 
    {
        "content": "So much for \"Thank you for your service\" What do you expect with a lib/socialist community organizer in the Whitehouse.", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "", 
        "reply": "So much for \"Thank you for your service\" What do you expect with a lib/socialist community organizer in the Whitehouse.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:46:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: Did anyone catch Sec. Napilitano on Fox today? When questioned about this, she at fir4st claimed it was just a theory paper, then she said, well, it came out when she was out of the country, like that should absolve HER of the issue. Yes, in the beginning she was trying some of the good ole \"redirect\" until finally she \"fessed up\" and said it was wrong and that an apology is owed to our VETs... This is what I got out of the interview...", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "Originally posted by billdawg24: Did anyone catch Sec. Napilitano on Fox today? When questioned about this, she at fir4st claimed it was just a theory paper, then she said, well, it came out when she was out of the country, like that should absolve HER of the issue.", 
        "reply": " Yes, in the beginning she was trying some of the good ole \"redirect\" until finally she \"fessed up\" and said it was wrong and that an apology is owed to our VETs... This is what I got out of the interview...", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:47:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "The political slant to this is a pile - the report was commissioned by the outgoing administration (which was decidedly Republican and right-wing if not definitively conservative) and was preceded by a similar report detailing left-wing groups. As to the soldiers, there are some valid points here. Considering the ideological make-up of the military, the change in \"ruling party\", and President Obama's race, I do not think it that far out to say that right-wing extremist groups will have an easier time recruiting from the military this year. I certainly have not seen anything that would make it harder. I am not saying 10% would join - probably more like 0.01% - but an increase seems likely. I do not think this is slanderous, as any group is likely to include at least 0.01% \"bad eggs\". Also, as an FBI agent or cop, who should I worry about (assuming both are in the extremist group) - the guy who weighs 300lb. and hunts from his truck, or the lean 180 fresh from the Afghanistan? Military personnel are in general more assertive, more directed, and already trained in a whole variety of destructive techniques - training that they can pass on to others. I do not read this report to say that Vets are overall any danger - it is just that when they go bad, they can cause a lot more damage.", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "", 
        "reply": "The political slant to this is a pile - the report was commissioned by the outgoing administration (which was decidedly Republican and right-wing if not definitively conservative) and was preceded by a similar report detailing left-wing groups. As to the soldiers, there are some valid points here. Considering the ideological make-up of the military, the change in \"ruling party\", and President Obama's race, I do not think it that far out to say that right-wing extremist groups will have an easier time recruiting from the military this year. I certainly have not seen anything that would make it harder. I am not saying 10% would join - probably more like 0.01% - but an increase seems likely. I do not think this is slanderous, as any group is likely to include at least 0.01% \"bad eggs\". Also, as an FBI agent or cop, who should I worry about (assuming both are in the extremist group) - the guy who weighs 300lb. and hunts from his truck, or the lean 180 fresh from the Afghanistan? Military personnel are in general more assertive, more directed, and already trained in a whole variety of destructive techniques - training that they can pass on to others. I do not read this report to say that Vets are overall any danger - it is just that when they go bad, they can cause a lot more damage.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:51:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "0.01% . . . Naw, I don't think so. How about 0.00001%, we have one hammerhead (T. McVeigh) go stupid..., and now its 0.01%!!! (1 out of 300M...) NOT", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "", 
        "reply": "0.01% . . . Naw, I don't think so. How about 0.00001%, we have one hammerhead (T. McVeigh) go stupid..., and now its 0.01%!!! (1 out of 300M...) NOT", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:58:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic.", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "", 
        "reply": "Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:59:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "When I attend a Vietnam Veterans dinner Saturday night I'll be sure ask what they think of Department of Homeland Security Sec. Napilitano's \"returning veterans are dangerous\" study.", 
        "intTime": 20090416, 
        "postID": 15, 
        "quote": "", 
        "reply": "When I attend a Vietnam Veterans dinner Saturday night I'll be sure ask what they think of Department of Homeland Security Sec. Napilitano's \"returning veterans are dangerous\" study.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 11:12:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic. That's kind of a dumb statement. You can say that about every walk of society. Some OIF/OEF vet with PTSD and freaking out, totally sucks, but to say it';s worse or more prevalent, then mainstream society is wrong, IMO.", 
        "intTime": 20090416, 
        "postID": 16, 
        "quote": "Originally posted by Killswitch_Engage: Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic.", 
        "reply": " That's kind of a dumb statement. You can say that about every walk of society. Some OIF/OEF vet with PTSD and freaking out, totally sucks, but to say it';s worse or more prevalent, then mainstream society is wrong, IMO.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 12:23:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "billdawg24"
    }, 
    {
        "content": "That's kind of a dumb reply, particularly if debate and two way conversation is something you value. Initiating an online conversation with an outright insult to the originator of a posting you quote is one way to make sure that never happens though. So right back at you...", 
        "intTime": 20090416, 
        "postID": 17, 
        "quote": "", 
        "reply": "That's kind of a dumb reply, particularly if debate and two way conversation is something you value. Initiating an online conversation with an outright insult to the originator of a posting you quote is one way to make sure that never happens though. So right back at you...", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 12:39:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: That's kind of a dumb reply, particularly if debate and two way conversation is something you value. Initiating an online conversation with an outright insult to the originator of a posting you quote is one way to make sure that never happens though. So right back at you... I wasn't trying to be insulting, but the way you put it is an illogical/silly/goofy point in the context you made it. Trying to say that vets going off is a bigger threat then anyone else erroneous and a knee jerk statement.", 
        "intTime": 20090416, 
        "postID": 18, 
        "quote": "Originally posted by Killswitch_Engage: That's kind of a dumb reply, particularly if debate and two way conversation is something you value. Initiating an online conversation with an outright insult to the originator of a posting you quote is one way to make sure that never happens though. So right back at you...", 
        "reply": " I wasn't trying to be insulting, but the way you put it is an illogical/silly/goofy point in the context you made it. Trying to say that vets going off is a bigger threat then anyone else erroneous and a knee jerk statement.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 12:57:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous. Well said. The DHS obamanites are a far greater danger to America than our returning veterans.", 
        "intTime": 20090416, 
        "postID": 19, 
        "quote": "Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous.", 
        "reply": " Well said. The DHS obamanites are a far greater danger to America than our returning veterans.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 12:57:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic. Your position takes them out of context relative to the DHS fiasco. Of those returning vets who struggle with psychological issues, joining a hard-right or hard-left extremist group hardly occurs.", 
        "intTime": 20090416, 
        "postID": 20, 
        "quote": "Originally posted by Killswitch_Engage: Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic.", 
        "reply": " Your position takes them out of context relative to the DHS fiasco. Of those returning vets who struggle with psychological issues, joining a hard-right or hard-left extremist group hardly occurs.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 13:00:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "RRR52"
    }, 
    {
        "content": "Just as I figured--total crap !! The primary problem is the news. Give them an inch and they'll take your last born child. I trust no one in the press. If there's no news, they'll create it, true or not. Second are their sources. Gawddd, someone gets their 10 minutes of fame to mention something which wasn't worth anything in the first place and the press takes over and fills in what was nothing. Vets a danger---no more than from WW1 through Iraq. If you knew even half of what I've seen, you'd know and the vets know.", 
        "intTime": 20090416, 
        "postID": 21, 
        "quote": "", 
        "reply": "Just as I figured--total crap !! The primary problem is the news. Give them an inch and they'll take your last born child. I trust no one in the press. If there's no news, they'll create it, true or not. Second are their sources. Gawddd, someone gets their 10 minutes of fame to mention something which wasn't worth anything in the first place and the press takes over and fills in what was nothing. Vets a danger---no more than from WW1 through Iraq. If you knew even half of what I've seen, you'd know and the vets know.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 13:49:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "JmacOSI"
    }, 
    {
        "content": "quote: Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php Hey family guy...", 
        "intTime": 20090416, 
        "postID": 22, 
        "quote": "Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php", 
        "reply": " Hey family guy...", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 14:37:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php Hey family guy... The SPC strikes again! Hey, maybe you can stop posting the same picture in every thread? Guess thats why you never made E-5.", 
        "intTime": 20090416, 
        "postID": 23, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php Hey family guy...", 
        "reply": " The SPC strikes again! Hey, maybe you can stop posting the same picture in every thread? Guess thats why you never made E-5.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 14:51:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "threerings"
    }, 
    {
        "content": "This has finally gone public. The Los Angeles Sheriff Department about 2 years ago labeled returning combat veterans as a significant threat to law enforcement. They cited the case of one Marine who was honorably discharged only to come home and ambush several police officers, killing 2 of them....that was is whole goal. A nut case but somehow this is what all vets are. Its BS, but \"they\" damn well know there are alot of ****ed off, patrotic, highly trained, highly motivated men who will not stand idly by...", 
        "intTime": 20090416, 
        "postID": 24, 
        "quote": "", 
        "reply": "This has finally gone public. The Los Angeles Sheriff Department about 2 years ago labeled returning combat veterans as a significant threat to law enforcement. They cited the case of one Marine who was honorably discharged only to come home and ambush several police officers, killing 2 of them....that was is whole goal. A nut case but somehow this is what all vets are. Its BS, but \"they\" damn well know there are alot of ****ed off, patrotic, highly trained, highly motivated men who will not stand idly by...", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 14:57:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Its BS, but \"they\" damn well know there are alot of ****ed off, patrotic, highly trained, highly motivated men who will not stand idly by... IRS, you are correct, we are a resource for some, a threat to others. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 25, 
        "quote": "Its BS, but \"they\" damn well know there are alot of ****ed off, patrotic, highly trained, highly motivated men who will not stand idly by...", 
        "reply": " IRS, you are correct, we are a resource for some, a threat to others. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 15:01:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "L0A1"
    }, 
    {
        "content": "But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php", 
        "intTime": 20090416, 
        "postID": 26, 
        "quote": "", 
        "reply": "But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 08:40:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by supporters of Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda?", 
        "intTime": 20090416, 
        "postID": 27, 
        "quote": "Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php", 
        "reply": " As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by supporters of Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda?", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 09:25:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim ot be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting.", 
        "intTime": 20090416, 
        "postID": 28, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda?", 
        "reply": " Well, that depends. Seeing as how you claim ot be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 09:28:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim to be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting. Oh, you can be sure that I am a veteran. I wore the uniform proudly for 27 years, combined Active Army and Army Reserve. But since I was also a registered Democrat during that same 27 years (and continue to be), various Republican Presidential Administrations have considered me a danger to the nation (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive - according to the parts of my FBI file I received under a Freedom of Information request). You know what? I \"found it pretty damned insulting\" that my patriotism was questioned because I was a registered Democrat, rather than a registered Republican. Just as I \"find it pretty damned insulting\" when certain people imply that I really am not an Army veteran because I am not a registered Republican and I support the present President of the United States. Actually, I suspect that much of these reports, which were commissioned by the Bush Adminstration and just recently made public, have a lot of truth in them. If I am serving with a white supremicist in my unit, I would like to know about it so that he or she could be watched carefully and dishonorably discharged if they violate the Constitution and or the UCMJ. I would not allow them to hide behind a \"green wall of silence\", like the \"blue wall of silence\" where an honest policeman covers for a dishonest policeman because \"cops have to support fellow cops\". Soliders shouldn't support fellow soldiers if they know that fellow soldier has broken the law or is planning to break the law. I have had both white and black supremicists assigned to my units in the Active Army and in the Army Reserve - and I have done what I could to get them out of the military. But back to my original comment to the OP: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion.", 
        "intTime": 20090416, 
        "postID": 29, 
        "quote": "Originally posted by transport1: quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim to be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting.", 
        "reply": " Oh, you can be sure that I am a veteran. I wore the uniform proudly for 27 years, combined Active Army and Army Reserve. But since I was also a registered Democrat during that same 27 years (and continue to be), various Republican Presidential Administrations have considered me a danger to the nation (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive - according to the parts of my FBI file I received under a Freedom of Information request). You know what? I \"found it pretty damned insulting\" that my patriotism was questioned because I was a registered Democrat, rather than a registered Republican. Just as I \"find it pretty damned insulting\" when certain people imply that I really am not an Army veteran because I am not a registered Republican and I support the present President of the United States. Actually, I suspect that much of these reports, which were commissioned by the Bush Adminstration and just recently made public, have a lot of truth in them. If I am serving with a white supremicist in my unit, I would like to know about it so that he or she could be watched carefully and dishonorably discharged if they violate the Constitution and or the UCMJ. I would not allow them to hide behind a \"green wall of silence\", like the \"blue wall of silence\" where an honest policeman covers for a dishonest policeman because \"cops have to support fellow cops\". Soliders shouldn't support fellow soldiers if they know that fellow soldier has broken the law or is planning to break the law. I have had both white and black supremicists assigned to my units in the Active Army and in the Army Reserve - and I have done what I could to get them out of the military. But back to my original comment to the OP: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 09:51:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by supporters of Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Ya, I'm not defending the site.", 
        "intTime": 20090416, 
        "postID": 30, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by supporters of Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda?", 
        "reply": " Ya, I'm not defending the site.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:16:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by transport1: quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim to be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting. Oh, you can be sure that I am a veteran. I wore the uniform proudly for 27 years, combined Active Army and Army Reserve. But since I was also a registered Democrat during that same 27 years (and continue to be), various Republican Presidential Administrations have considered me a danger to the nation (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive - according to the parts of my FBI file I received under a Freedom of Information request). You know what? I \"found it pretty damned insulting\" that my patriotism was questioned because I was a registered Democrat, rather than a registered Republican. Just as I \"find it pretty damned insulting\" when certain people imply that I really am not an Army veteran because I am not a registered Republican and I support the present President of the United States. Actually, I suspect that much of these reports, which were commissioned by the Bush Adminstration and just recently made public, have a lot of truth in them. If I am serving with a white supremicist in my unit, I would like to know about it so that he or she could be watched carefully and dishonorably discharged if they violate the Constitution and or the UCMJ. I would not allow them to hide behind a \"green wall of silence\", like the \"blue wall of silence\" where an honest policeman covers for a dishonest policeman because \"cops have to support fellow cops\". Soliders shouldn't support fellow soldiers if they know that fellow soldier has broken the law or is planning to break the law. I have had both white and black supremicists assigned to my units in the Active Army and in the Army Reserve - and I have done what I could to get them out of the military. But back to my original comment to the OP: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion. I'd say the numbers in what I posted merit some thought. You can spin ideas..but facts are little tougher.", 
        "intTime": 20090416, 
        "postID": 31, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by transport1: quote: Originally posted by Fightdirector: quote: Originally posted by threerings: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php As Arte Johnson would say on \"Rowan and Martin's Laugh-in\": \"Very interesting\" I took the liberty of clicking on the URL you cited - and found it to be a Right-wing blog site operated by Newt \"I have Christian values even though I've divorced two of my three wives because I wanted to marry my mistress at the time\" Gingrich. If someone was to post something to these Forums citing the Daily Kos, Crooks and Liars or Media matters, it would automatically be discounted as being anti-American Leftist propaganda. Considering your cited source, shouldn't we automatically discount your quote as Anti-American Rightist propaganda? Well, that depends. Seeing as how you claim to be a vet, that would automatically make you a right wing semi-oriented terrorist suspect. At least according to the way these people are portraying you. Legion says their wrong, VFW says no harm. As for me and the soldiers I work with around here, we find it pretty damned insulting. Oh, you can be sure that I am a veteran. I wore the uniform proudly for 27 years, combined Active Army and Army Reserve. But since I was also a registered Democrat during that same 27 years (and continue to be), various Republican Presidential Administrations have considered me a danger to the nation (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive - according to the parts of my FBI file I received under a Freedom of Information request). You know what? I \"found it pretty damned insulting\" that my patriotism was questioned because I was a registered Democrat, rather than a registered Republican. Just as I \"find it pretty damned insulting\" when certain people imply that I really am not an Army veteran because I am not a registered Republican and I support the present President of the United States. Actually, I suspect that much of these reports, which were commissioned by the Bush Adminstration and just recently made public, have a lot of truth in them. If I am serving with a white supremicist in my unit, I would like to know about it so that he or she could be watched carefully and dishonorably discharged if they violate the Constitution and or the UCMJ. I would not allow them to hide behind a \"green wall of silence\", like the \"blue wall of silence\" where an honest policeman covers for a dishonest policeman because \"cops have to support fellow cops\". Soliders shouldn't support fellow soldiers if they know that fellow soldier has broken the law or is planning to break the law. I have had both white and black supremicists assigned to my units in the Active Army and in the Army Reserve - and I have done what I could to get them out of the military. But back to my original comment to the OP: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion.", 
        "reply": " I'd say the numbers in what I posted merit some thought. You can spin ideas..but facts are little tougher.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:20:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion. The document stands on its own and I doubt any here arguing against it have even took the time to objectfully read it. It is a risk assessment that in my opinion is apolitical and does not target veterans, but merely points out that due to their combat training be actively recuited by radical extremist groups. Must be why SHE appologized to us Vets today. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 32, 
        "quote": "Originally posted by dmuhler: quote: if you can cite someone not from a Rightist or Leftist blog or website to back up your position - then it merits honest discussion. The document stands on its own and I doubt any here arguing against it have even took the time to objectfully read it. It is a risk assessment that in my opinion is apolitical and does not target veterans, but merely points out that due to their combat training be actively recuited by radical extremist groups.", 
        "reply": " Must be why SHE appologized to us Vets today. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:38:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive -. Well, duh, what kind of crack pot would vote for him,", 
        "intTime": 20090416, 
        "postID": 33, 
        "quote": "Originally posted by Fightdirector: (For example, I was put under surveillance during the Nixon-McGovern presidential election because I was supporting McGovern and therefore i was subversive -.", 
        "reply": " Well, duh, what kind of crack pot would vote for him,", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:42:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Did anyone catch Sec. Napilitano on Fox today? When questioned about this, she at fir4st claimed it was just a theory paper, then she said, well, it came out when she was out of the country, like that should absolve HER of the issue.", 
        "intTime": 20090416, 
        "postID": 34, 
        "quote": "", 
        "reply": "Did anyone catch Sec. Napilitano on Fox today? When questioned about this, she at fir4st claimed it was just a theory paper, then she said, well, it came out when she was out of the country, like that should absolve HER of the issue.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:43:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "billdawg24"
    }, 
    {
        "content": "So much for \"Thank you for your service\" What do you expect with a lib/socialist community organizer in the Whitehouse.", 
        "intTime": 20090416, 
        "postID": 35, 
        "quote": "", 
        "reply": "So much for \"Thank you for your service\" What do you expect with a lib/socialist community organizer in the Whitehouse.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:46:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: Did anyone catch Sec. Napilitano on Fox today? When questioned about this, she at fir4st claimed it was just a theory paper, then she said, well, it came out when she was out of the country, like that should absolve HER of the issue. Yes, in the beginning she was trying some of the good ole \"redirect\" until finally she \"fessed up\" and said it was wrong and that an apology is owed to our VETs... This is what I got out of the interview...", 
        "intTime": 20090416, 
        "postID": 36, 
        "quote": "Originally posted by billdawg24: Did anyone catch Sec. Napilitano on Fox today? When questioned about this, she at fir4st claimed it was just a theory paper, then she said, well, it came out when she was out of the country, like that should absolve HER of the issue.", 
        "reply": " Yes, in the beginning she was trying some of the good ole \"redirect\" until finally she \"fessed up\" and said it was wrong and that an apology is owed to our VETs... This is what I got out of the interview...", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:47:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "The political slant to this is a pile - the report was commissioned by the outgoing administration (which was decidedly Republican and right-wing if not definitively conservative) and was preceded by a similar report detailing left-wing groups. As to the soldiers, there are some valid points here. Considering the ideological make-up of the military, the change in \"ruling party\", and President Obama's race, I do not think it that far out to say that right-wing extremist groups will have an easier time recruiting from the military this year. I certainly have not seen anything that would make it harder. I am not saying 10% would join - probably more like 0.01% - but an increase seems likely. I do not think this is slanderous, as any group is likely to include at least 0.01% \"bad eggs\". Also, as an FBI agent or cop, who should I worry about (assuming both are in the extremist group) - the guy who weighs 300lb. and hunts from his truck, or the lean 180 fresh from the Afghanistan? Military personnel are in general more assertive, more directed, and already trained in a whole variety of destructive techniques - training that they can pass on to others. I do not read this report to say that Vets are overall any danger - it is just that when they go bad, they can cause a lot more damage.", 
        "intTime": 20090416, 
        "postID": 37, 
        "quote": "", 
        "reply": "The political slant to this is a pile - the report was commissioned by the outgoing administration (which was decidedly Republican and right-wing if not definitively conservative) and was preceded by a similar report detailing left-wing groups. As to the soldiers, there are some valid points here. Considering the ideological make-up of the military, the change in \"ruling party\", and President Obama's race, I do not think it that far out to say that right-wing extremist groups will have an easier time recruiting from the military this year. I certainly have not seen anything that would make it harder. I am not saying 10% would join - probably more like 0.01% - but an increase seems likely. I do not think this is slanderous, as any group is likely to include at least 0.01% \"bad eggs\". Also, as an FBI agent or cop, who should I worry about (assuming both are in the extremist group) - the guy who weighs 300lb. and hunts from his truck, or the lean 180 fresh from the Afghanistan? Military personnel are in general more assertive, more directed, and already trained in a whole variety of destructive techniques - training that they can pass on to others. I do not read this report to say that Vets are overall any danger - it is just that when they go bad, they can cause a lot more damage.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:51:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "0.01% . . . Naw, I don't think so. How about 0.00001%, we have one hammerhead (T. McVeigh) go stupid..., and now its 0.01%!!! (1 out of 300M...) NOT", 
        "intTime": 20090416, 
        "postID": 38, 
        "quote": "", 
        "reply": "0.01% . . . Naw, I don't think so. How about 0.00001%, we have one hammerhead (T. McVeigh) go stupid..., and now its 0.01%!!! (1 out of 300M...) NOT", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:58:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic.", 
        "intTime": 20090416, 
        "postID": 39, 
        "quote": "", 
        "reply": "Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 10:59:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "When I attend a Vietnam Veterans dinner Saturday night I'll be sure ask what they think of Department of Homeland Security Sec. Napilitano's \"returning veterans are dangerous\" study.", 
        "intTime": 20090416, 
        "postID": 40, 
        "quote": "", 
        "reply": "When I attend a Vietnam Veterans dinner Saturday night I'll be sure ask what they think of Department of Homeland Security Sec. Napilitano's \"returning veterans are dangerous\" study.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 11:12:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic. That's kind of a dumb statement. You can say that about every walk of society. Some OIF/OEF vet with PTSD and freaking out, totally sucks, but to say it';s worse or more prevalent, then mainstream society is wrong, IMO.", 
        "intTime": 20090416, 
        "postID": 41, 
        "quote": "Originally posted by Killswitch_Engage: Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic.", 
        "reply": " That's kind of a dumb statement. You can say that about every walk of society. Some OIF/OEF vet with PTSD and freaking out, totally sucks, but to say it';s worse or more prevalent, then mainstream society is wrong, IMO.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 12:23:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "billdawg24"
    }, 
    {
        "content": "That's kind of a dumb reply, particularly if debate and two way conversation is something you value. Initiating an online conversation with an outright insult to the originator of a posting you quote is one way to make sure that never happens though. So right back at you...", 
        "intTime": 20090416, 
        "postID": 42, 
        "quote": "", 
        "reply": "That's kind of a dumb reply, particularly if debate and two way conversation is something you value. Initiating an online conversation with an outright insult to the originator of a posting you quote is one way to make sure that never happens though. So right back at you...", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 12:39:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: That's kind of a dumb reply, particularly if debate and two way conversation is something you value. Initiating an online conversation with an outright insult to the originator of a posting you quote is one way to make sure that never happens though. So right back at you... I wasn't trying to be insulting, but the way you put it is an illogical/silly/goofy point in the context you made it. Trying to say that vets going off is a bigger threat then anyone else erroneous and a knee jerk statement.", 
        "intTime": 20090416, 
        "postID": 43, 
        "quote": "Originally posted by Killswitch_Engage: That's kind of a dumb reply, particularly if debate and two way conversation is something you value. Initiating an online conversation with an outright insult to the originator of a posting you quote is one way to make sure that never happens though. So right back at you...", 
        "reply": " I wasn't trying to be insulting, but the way you put it is an illogical/silly/goofy point in the context you made it. Trying to say that vets going off is a bigger threat then anyone else erroneous and a knee jerk statement.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 12:57:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous. Well said. The DHS obamanites are a far greater danger to America than our returning veterans.", 
        "intTime": 20090416, 
        "postID": 44, 
        "quote": "Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous.", 
        "reply": " Well said. The DHS obamanites are a far greater danger to America than our returning veterans.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 12:57:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic. Your position takes them out of context relative to the DHS fiasco. Of those returning vets who struggle with psychological issues, joining a hard-right or hard-left extremist group hardly occurs.", 
        "intTime": 20090416, 
        "postID": 45, 
        "quote": "Originally posted by Killswitch_Engage: Some ARE a danger to America. There have been cases reported where Vets have come home and hurt not just themselves but others. It sucks and I hate to see that, but it's true to some extent and it's one of the reasons I opposed going into Iraq in the first place, the toll it would take on some of our troops and the price we would all have to pay in the end. Tragic.", 
        "reply": " Your position takes them out of context relative to the DHS fiasco. Of those returning vets who struggle with psychological issues, joining a hard-right or hard-left extremist group hardly occurs.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 13:00:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "RRR52"
    }, 
    {
        "content": "Just as I figured--total crap !! The primary problem is the news. Give them an inch and they'll take your last born child. I trust no one in the press. If there's no news, they'll create it, true or not. Second are their sources. Gawddd, someone gets their 10 minutes of fame to mention something which wasn't worth anything in the first place and the press takes over and fills in what was nothing. Vets a danger---no more than from WW1 through Iraq. If you knew even half of what I've seen, you'd know and the vets know.", 
        "intTime": 20090416, 
        "postID": 46, 
        "quote": "", 
        "reply": "Just as I figured--total crap !! The primary problem is the news. Give them an inch and they'll take your last born child. I trust no one in the press. If there's no news, they'll create it, true or not. Second are their sources. Gawddd, someone gets their 10 minutes of fame to mention something which wasn't worth anything in the first place and the press takes over and fills in what was nothing. Vets a danger---no more than from WW1 through Iraq. If you knew even half of what I've seen, you'd know and the vets know.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 13:49:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "JmacOSI"
    }, 
    {
        "content": "quote: Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php Hey family guy...", 
        "intTime": 20090416, 
        "postID": 47, 
        "quote": "Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php", 
        "reply": " Hey family guy...", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 14:37:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php Hey family guy... The SPC strikes again! Hey, maybe you can stop posting the same picture in every thread? Guess thats why you never made E-5.", 
        "intTime": 20090416, 
        "postID": 48, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by threerings: But even this alleged statistic appears to be false. Barfield was a gang investigator, and what he actually said was: \"I have identified 320 soldiers as gang members from April 2002 to present.\" So we now have the Department of Homeland Security defaming our servicemen on the basis of a press release by a left-wing pressure group that misrepresented the principal empirical support for its claim. Nice. The Homeland Security report further supports its suspicion of returning veterans by referring to an FBI report released last year: The FBI noted in a 2008 report on the white supremacist movement that some returning military veterans from the wars in Iraq and Afghanistan have joined extremist groups. So, how many are \"some\"? You can read the FBI report, titled \"White Supremacist Recruitment of Military Personnel since 9/11,\" here. Notwithstanding the deliberate vagueness of the Homeland Security document, the FBI was actually very specific: A review of FBI white supremacist extremist cases from October 2001 to May 2008 identified 203 individuals with confirmed or claimed military service active in the extremist movement at some time during the reporting period. This number is minuscule in comparison with the projected US veteran population of 23,816,000 as of 2 May 2008, or the 1,416,037 active duty military personnel as of 30 April 2008. ... According to FBI information, an estimated 19 veterans (approximately 9 percent of the 203) have verified or unverified service in the ongoing wars in Iraq and Afghanistan. There you have it: a whopping 19 actual or alleged veterans of Iraq or Afghanistan have joined the \"extremist movement.\" (The FBI notes that some of these \"may have inflated their resumes with fictional military experience to impress others within the movement.\") It's hard to avoid the conclusion that this Homeland Security report is politically motivated, and reflects the authors' political prejudices more than an objective evaluation of a significant terrorist threat. In that context, the report's conclusion seems a bit ominous: From:+++http://www.powerlineblog.com/archives/2009/04/023329.php Hey family guy...", 
        "reply": " The SPC strikes again! Hey, maybe you can stop posting the same picture in every thread? Guess thats why you never made E-5.", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 14:51:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "threerings"
    }, 
    {
        "content": "This has finally gone public. The Los Angeles Sheriff Department about 2 years ago labeled returning combat veterans as a significant threat to law enforcement. They cited the case of one Marine who was honorably discharged only to come home and ambush several police officers, killing 2 of them....that was is whole goal. A nut case but somehow this is what all vets are. Its BS, but \"they\" damn well know there are alot of ****ed off, patrotic, highly trained, highly motivated men who will not stand idly by...", 
        "intTime": 20090416, 
        "postID": 49, 
        "quote": "", 
        "reply": "This has finally gone public. The Los Angeles Sheriff Department about 2 years ago labeled returning combat veterans as a significant threat to law enforcement. They cited the case of one Marine who was honorably discharged only to come home and ambush several police officers, killing 2 of them....that was is whole goal. A nut case but somehow this is what all vets are. Its BS, but \"they\" damn well know there are alot of ****ed off, patrotic, highly trained, highly motivated men who will not stand idly by...", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 14:57:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Its BS, but \"they\" damn well know there are alot of ****ed off, patrotic, highly trained, highly motivated men who will not stand idly by... IRS, you are correct, we are a resource for some, a threat to others. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 50, 
        "quote": "Its BS, but \"they\" damn well know there are alot of ****ed off, patrotic, highly trained, highly motivated men who will not stand idly by...", 
        "reply": " IRS, you are correct, we are a resource for some, a threat to others. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2880009022001", 
        "time": "2009-04-16 15:01:00", 
        "title": "Returning Vets a danger to America", 
        "userID": "L0A1"
    }
]