[
    {
        "content": "Finally, something I can support the President on. quote: WASHINGTON – The White House on Tuesday endorsed a bill to triple the size of the AmeriCorps program and expand service opportunities for students and seniors. The House is scheduled to vote Wednesday on the measure, which would increase AmeriCorps to 250,000 positions from the current 75,000 and create a new service corps in low-income communities focusing on education, clean energy, health and services for veterans. Supporters say the bill comes at a time when more people are interested in serving their communities and more citizens could use the help. -http://news.yahoo.com/s/ap/20090317/ap_on_go_co/congress_national_service", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "WASHINGTON – The White House on Tuesday endorsed a bill to triple the size of the AmeriCorps program and expand service opportunities for students and seniors. The House is scheduled to vote Wednesday on the measure, which would increase AmeriCorps to 250,000 positions from the current 75,000 and create a new service corps in low-income communities focusing on education, clean energy, health and services for veterans. Supporters say the bill comes at a time when more people are interested in serving their communities and more citizens could use the help.", 
        "reply": "Finally, something I can support the President on.  -http://news.yahoo.com/s/ap/20090317/ap_on_go_co/congress_national_service", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-18 05:19:00", 
        "title": "Its about Time", 
        "userID": "floersh"
    }, 
    {
        "content": "I quite agree. It's about time.", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "I quite agree. It's about time.", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-18 15:03:00", 
        "title": "Its about Time", 
        "userID": "Ruanne"
    }, 
    {
        "content": "That's all fine and good. Just as long as that thing Obama and Emmanuel were talking about with mandatory service for those aged 18-25 isn't part of this.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "", 
        "reply": "That's all fine and good. Just as long as that thing Obama and Emmanuel were talking about with mandatory service for those aged 18-25 isn't part of this.", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-18 15:14:00", 
        "title": "Its about Time", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Rumor is the O-bots are going to go house to house this weekend to drum up support for Obama's economic plan...I hope to god they show up at my house.", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "Rumor is the O-bots are going to go house to house this weekend to drum up support for Obama's economic plan...I hope to god they show up at my house.", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-18 15:52:00", 
        "title": "Its about Time", 
        "userID": "threerings"
    }, 
    {
        "content": "Yeah, floersh, this looks something like what I've been going on about, ad naseum, for years. I am a bit anxious about how it will be manifested by the O team but I applaud the beginnings. Now if they would just add the word Mandatory...", 
        "intTime": 20090319, 
        "postID": 5, 
        "quote": "", 
        "reply": "Yeah, floersh, this looks something like what I've been going on about, ad naseum, for years. I am a bit anxious about how it will be manifested by the O team but I applaud the beginnings. Now if they would just add the word Mandatory...", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-19 20:14:00", 
        "title": "Its about Time", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "Will these jobs be 'White House' controlled like the Census; Another ACORN project?", 
        "intTime": 20090319, 
        "postID": 6, 
        "quote": "", 
        "reply": "Will these jobs be 'White House' controlled like the Census; Another ACORN project?", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-19 20:51:00", 
        "title": "Its about Time", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "quote: Originally posted by floersh: Finally, something I can support the President on. quote: WASHINGTON – The White House on Tuesday endorsed a bill to triple the size of the AmeriCorps program and expand service opportunities for students and seniors. The House is scheduled to vote Wednesday on the measure, which would increase AmeriCorps to 250,000 positions from the current 75,000 and create a new service corps in low-income communities focusing on education, clean energy, health and services for veterans. Supporters say the bill comes at a time when more people are interested in serving their communities and more citizens could use the help. -http://news.yahoo.com/s/ap/20090317/ap_on_go_co/congress_national_service I wonder....could this expansion be little more than another government \"make work\" program designed to actually do....nothing? The military excells at this. Why not offer students a taste of military service, instead?", 
        "intTime": 20090320, 
        "postID": 7, 
        "quote": "Originally posted by floersh: Finally, something I can support the President on. quote: WASHINGTON – The White House on Tuesday endorsed a bill to triple the size of the AmeriCorps program and expand service opportunities for students and seniors. The House is scheduled to vote Wednesday on the measure, which would increase AmeriCorps to 250,000 positions from the current 75,000 and create a new service corps in low-income communities focusing on education, clean energy, health and services for veterans. Supporters say the bill comes at a time when more people are interested in serving their communities and more citizens could use the help. -http://news.yahoo.com/s/ap/20090317/ap_on_go_co/congress_national_service", 
        "reply": " I wonder....could this expansion be little more than another government \"make work\" program designed to actually do....nothing? The military excells at this. Why not offer students a taste of military service, instead?", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-20 09:19:00", 
        "title": "Its about Time", 
        "userID": "19022583"
    }, 
    {
        "content": "Here's a reply from my senator Sharrod Brown, D - Ohio. Everyone seems to get p rickley about the \"mandatory\" thing: Thank you for sharing your thoughts on legislation to expand volunteer service. I am proud to be a cosponsor of S.227, the Serve America Act. This legislation significantly expands national community service programs, strengthens key components of the AmeriCorps program, and aims to engage 250,000 volunteers in targeted service to areas of national need. The House of Representatives is considering similar legislation, the Generations Invigorating Volunteerism and Education (GIVE) Act. Neither the Serve America Act nor the GIVE Act require mandatory national service. Community service is more important than ever during tough economic times, and this bill will allow more Americans to help their neighbors who are struggling to obtain health care, afford energy costs, or feed their families. I appreciate hearing your thoughts on this issue, and I will certainly keep your views in mind as the Senate considers additional legislation on community service. Thank you again for writing.", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "", 
        "reply": "Here's a reply from my senator Sharrod Brown, D - Ohio. Everyone seems to get p rickley about the \"mandatory\" thing: Thank you for sharing your thoughts on legislation to expand volunteer service. I am proud to be a cosponsor of S.227, the Serve America Act. This legislation significantly expands national community service programs, strengthens key components of the AmeriCorps program, and aims to engage 250,000 volunteers in targeted service to areas of national need. The House of Representatives is considering similar legislation, the Generations Invigorating Volunteerism and Education (GIVE) Act. Neither the Serve America Act nor the GIVE Act require mandatory national service. Community service is more important than ever during tough economic times, and this bill will allow more Americans to help their neighbors who are struggling to obtain health care, afford energy costs, or feed their families. I appreciate hearing your thoughts on this issue, and I will certainly keep your views in mind as the Senate considers additional legislation on community service. Thank you again for writing.", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-20 15:29:00", 
        "title": "Its about Time", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "quote: Originally posted by 54D_Zippo: Will these jobs be 'White House' controlled like the Census; Another ACORN project?", 
        "intTime": 20090320, 
        "postID": 9, 
        "quote": "Originally posted by 54D_Zippo: Will these jobs be 'White House' controlled like the Census; Another ACORN project?", 
        "reply": "", 
        "threadID": "409192893_6340081812001", 
        "time": "2009-03-20 15:46:00", 
        "title": "Its about Time", 
        "userID": "JustanotherGI"
    }
]