[
    {
        "content": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "", 
        "reply": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:14:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important.", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html'", 
        "reply": " They make less than a four star. Why don't you worry about something important.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:20:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important. A 4 star General has a real job. Corruption, waste and hypocrisy is something to worry about with our honorable legislators. They are asking Americans to sacrifice but arent willing to do it themselves. We have these clowns railing against corporations and their jets and resorts but they do the same thing. We have the AFL-CIO heads meeting at resorts at unions members expense and being spoken to by the Prez via Video and the VP showing up at taxpayer expense. yeh, no problem. Change you can believe in. Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "intTime": 20090305, 
        "postID": 3, 
        "quote": "Originally posted by FrJohn1123: quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important.", 
        "reply": " A 4 star General has a real job. Corruption, waste and hypocrisy is something to worry about with our honorable legislators. They are asking Americans to sacrifice but arent willing to do it themselves. We have these clowns railing against corporations and their jets and resorts but they do the same thing. We have the AFL-CIO heads meeting at resorts at unions members expense and being spoken to by the Prez via Video and the VP showing up at taxpayer expense. yeh, no problem. Change you can believe in. Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:26:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "intTime": 20090305, 
        "postID": 4, 
        "quote": "Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "reply": " Gunny, your profile says alot about you , his doesn't..................", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:01:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don", 
        "intTime": 20090305, 
        "postID": 5, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "reply": " Ouch! Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:05:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "\"Do as I say, not as I do...\" - Congress", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"Do as I say, not as I do...\" - Congress", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:05:00", 
        "title": "No Leading By Example Here", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay! When you throw in their perpetual Medical and Retirement Benefits for what little we get out of many of them, and how much they rip off from us, there needs to be some citizen oversight and rebuttal of some kind - besides revolution... Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "reply": " When you throw in their perpetual Medical and Retirement Benefits for what little we get out of many of them, and how much they rip off from us, there needs to be some citizen oversight and rebuttal of some kind - besides revolution... Wandering and Wondering", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "intTime": 20090305, 
        "postID": 8, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don", 
        "reply": " Yes that was a real oucher. How old are you?", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:11:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you? Oh come on, ya gotta admit it was a little funny or a least a good volley. By the way, 45 as you can probably get an idea from my filled in profile. Don", 
        "intTime": 20090305, 
        "postID": 9, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "reply": " Oh come on, ya gotta admit it was a little funny or a least a good volley. By the way, 45 as you can probably get an idea from my filled in profile. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:16:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you? Oooooh, Owwwww, what a comeback. Just remember, age is not an indicator of wisdom.", 
        "intTime": 20090305, 
        "postID": 10, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "reply": " Oooooh, Owwwww, what a comeback. Just remember, age is not an indicator of wisdom.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:18:00", 
        "title": "No Leading By Example Here", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. A young person can have precocious intellect, rational thinking, and insight/inspiration (especially if you believe in religion or the supernatural), but technically \"wizdom\" takes a little longer... \"Out of the mouth of babes\" would suggest unseen forces at work, not wisdom - - Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 11, 
        "quote": "Just remember, age is not an indicator of wisdom.", 
        "reply": " Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. A young person can have precocious intellect, rational thinking, and insight/inspiration (especially if you believe in religion or the supernatural), but technically \"wizdom\" takes a little longer... \"Out of the mouth of babes\" would suggest unseen forces at work, not wisdom - - Wandering and Wondering", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:29:00", 
        "title": "No Leading By Example Here", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes.", 
        "intTime": 20090305, 
        "postID": 12, 
        "quote": "By the way, 45 as you can probably get an idea from my filled in profile.", 
        "reply": " I don't look at profiles. They are kinda like resumes.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:35:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. - Well I've had my fill of those. Don", 
        "intTime": 20090305, 
        "postID": 13, 
        "quote": "Originally posted by greywolfghost: quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. -", 
        "reply": " Well I've had my fill of those. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:43:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "intTime": 20090305, 
        "postID": 14, 
        "quote": "Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes.", 
        "reply": " It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:54:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. On me", 
        "intTime": 20090305, 
        "postID": 15, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "reply": " On me", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:02:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... If we were talking about military operations I would agree. We are not. His profile idicates nothing about the topic at hand. Oh and I walked for twenty. I don't need to prove it to you or anyone else for that matter.", 
        "intTime": 20090305, 
        "postID": 16, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "reply": " If we were talking about military operations I would agree. We are not. His profile idicates nothing about the topic at hand. Oh and I walked for twenty. I don't need to prove it to you or anyone else for that matter.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:02:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "intTime": 20090305, 
        "postID": 17, 
        "quote": "", 
        "reply": "Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:08:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "intTime": 20090305, 
        "postID": 18, 
        "quote": "Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter.", 
        "reply": " That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:08:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts. See Friar Tuck, gunny shows common sense.", 
        "intTime": 20090305, 
        "postID": 19, 
        "quote": "Originally posted by GunnyRet03: Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "reply": " See Friar Tuck, gunny shows common sense.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not. I highly doubt anything I could put in my profile would change that. Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "intTime": 20090305, 
        "postID": 20, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "reply": " I highly doubt anything I could put in my profile would change that. Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "intTime": 20090305, 
        "postID": 21, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "reply": " FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:12:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "intTime": 20090305, 
        "postID": 22, 
        "quote": "We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take.", 
        "reply": " You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:17:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don No problem. I learned a long time ago that until I see a noterized DD-214 from your county recorder, all we got is a good story.", 
        "intTime": 20090305, 
        "postID": 23, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "reply": " No problem. I learned a long time ago that until I see a noterized DD-214 from your county recorder, all we got is a good story.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:21:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that. It depends, profiles give time served and it tells some people that during their service was any ******* POTUS's/CinC he had to serve under. That's why I've always voted republican but civvies still seem to vote in Jimmy Carter's and Slick Willie Clintons. The military is a politician's pawn, a good soldier has no choice but to always be aware of any political issues.", 
        "intTime": 20090305, 
        "postID": 24, 
        "quote": "Originally posted by FrJohn1123: Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "reply": " It depends, profiles give time served and it tells some people that during their service was any ******* POTUS's/CinC he had to serve under. That's why I've always voted republican but civvies still seem to vote in Jimmy Carter's and Slick Willie Clintons. The military is a politician's pawn, a good soldier has no choice but to always be aware of any political issues.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:30:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I was on this site in 2001 when I was still in and never posted anything political then because I was a soldier. I worked for politicians. Now that I am out I say what ever I want. And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "intTime": 20090305, 
        "postID": 25, 
        "quote": "", 
        "reply": "I was on this site in 2001 when I was still in and never posted anything political then because I was a soldier. I worked for politicians. Now that I am out I say what ever I want. And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:37:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: And by the way, I know lots of ex-military that are democrats or independents that voted for the current president. That's their mis-fortune..........but their luck not to have experienced da Jimmy Era. If they did, then they must not have been on food stamps.", 
        "intTime": 20090305, 
        "postID": 26, 
        "quote": "Originally posted by FrJohn1123: And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "reply": " That's their mis-fortune..........but their luck not to have experienced da Jimmy Era. If they did, then they must not have been on food stamps.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:50:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "....they need to keep up with inflation and maintiaining two households....", 
        "intTime": 20090305, 
        "postID": 27, 
        "quote": "", 
        "reply": "....they need to keep up with inflation and maintiaining two households....", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:52:00", 
        "title": "No Leading By Example Here", 
        "userID": "VDoP"
    }, 
    {
        "content": "quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst.", 
        "intTime": 20090305, 
        "postID": 28, 
        "quote": "..........but their luck not to have experienced da Jimmy Era.", 
        "reply": " I lived through the Carter years. They were not the best years, but far from the worst.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:55:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst. As military or civvie? If they weren't the worse years for the military then I'd like to know when those years were.", 
        "intTime": 20090305, 
        "postID": 29, 
        "quote": "Originally posted by FrJohn1123: quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst.", 
        "reply": " As military or civvie? If they weren't the worse years for the military then I'd like to know when those years were.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 11:04:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits. Voting is hiring. Whiners= Citizens who want accountablity. 99.99% Mother humpin laughable!", 
        "intTime": 20090305, 
        "postID": 30, 
        "quote": "Originally posted by FrJohn1123: quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "reply": " Voting is hiring. Whiners= Citizens who want accountablity. 99.99% Mother humpin laughable!", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 11:11:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "intTime": 20090305, 
        "postID": 31, 
        "quote": "", 
        "reply": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:14:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important.", 
        "intTime": 20090305, 
        "postID": 32, 
        "quote": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html'", 
        "reply": " They make less than a four star. Why don't you worry about something important.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:20:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important. A 4 star General has a real job. Corruption, waste and hypocrisy is something to worry about with our honorable legislators. They are asking Americans to sacrifice but arent willing to do it themselves. We have these clowns railing against corporations and their jets and resorts but they do the same thing. We have the AFL-CIO heads meeting at resorts at unions members expense and being spoken to by the Prez via Video and the VP showing up at taxpayer expense. yeh, no problem. Change you can believe in. Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "intTime": 20090305, 
        "postID": 33, 
        "quote": "Originally posted by FrJohn1123: quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important.", 
        "reply": " A 4 star General has a real job. Corruption, waste and hypocrisy is something to worry about with our honorable legislators. They are asking Americans to sacrifice but arent willing to do it themselves. We have these clowns railing against corporations and their jets and resorts but they do the same thing. We have the AFL-CIO heads meeting at resorts at unions members expense and being spoken to by the Prez via Video and the VP showing up at taxpayer expense. yeh, no problem. Change you can believe in. Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:26:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "intTime": 20090305, 
        "postID": 34, 
        "quote": "Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "reply": " Gunny, your profile says alot about you , his doesn't..................", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:01:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don", 
        "intTime": 20090305, 
        "postID": 35, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "reply": " Ouch! Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:05:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "\"Do as I say, not as I do...\" - Congress", 
        "intTime": 20090305, 
        "postID": 36, 
        "quote": "", 
        "reply": "\"Do as I say, not as I do...\" - Congress", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:05:00", 
        "title": "No Leading By Example Here", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay! When you throw in their perpetual Medical and Retirement Benefits for what little we get out of many of them, and how much they rip off from us, there needs to be some citizen oversight and rebuttal of some kind - besides revolution... Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 37, 
        "quote": "Originally posted by GunnyRet03: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "reply": " When you throw in their perpetual Medical and Retirement Benefits for what little we get out of many of them, and how much they rip off from us, there needs to be some citizen oversight and rebuttal of some kind - besides revolution... Wandering and Wondering", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "intTime": 20090305, 
        "postID": 38, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don", 
        "reply": " Yes that was a real oucher. How old are you?", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:11:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you? Oh come on, ya gotta admit it was a little funny or a least a good volley. By the way, 45 as you can probably get an idea from my filled in profile. Don", 
        "intTime": 20090305, 
        "postID": 39, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "reply": " Oh come on, ya gotta admit it was a little funny or a least a good volley. By the way, 45 as you can probably get an idea from my filled in profile. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:16:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you? Oooooh, Owwwww, what a comeback. Just remember, age is not an indicator of wisdom.", 
        "intTime": 20090305, 
        "postID": 40, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "reply": " Oooooh, Owwwww, what a comeback. Just remember, age is not an indicator of wisdom.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:18:00", 
        "title": "No Leading By Example Here", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. A young person can have precocious intellect, rational thinking, and insight/inspiration (especially if you believe in religion or the supernatural), but technically \"wizdom\" takes a little longer... \"Out of the mouth of babes\" would suggest unseen forces at work, not wisdom - - Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 41, 
        "quote": "Just remember, age is not an indicator of wisdom.", 
        "reply": " Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. A young person can have precocious intellect, rational thinking, and insight/inspiration (especially if you believe in religion or the supernatural), but technically \"wizdom\" takes a little longer... \"Out of the mouth of babes\" would suggest unseen forces at work, not wisdom - - Wandering and Wondering", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:29:00", 
        "title": "No Leading By Example Here", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes.", 
        "intTime": 20090305, 
        "postID": 42, 
        "quote": "By the way, 45 as you can probably get an idea from my filled in profile.", 
        "reply": " I don't look at profiles. They are kinda like resumes.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:35:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. - Well I've had my fill of those. Don", 
        "intTime": 20090305, 
        "postID": 43, 
        "quote": "Originally posted by greywolfghost: quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. -", 
        "reply": " Well I've had my fill of those. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:43:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "intTime": 20090305, 
        "postID": 44, 
        "quote": "Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes.", 
        "reply": " It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:54:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. On me", 
        "intTime": 20090305, 
        "postID": 45, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "reply": " On me", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:02:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... If we were talking about military operations I would agree. We are not. His profile idicates nothing about the topic at hand. Oh and I walked for twenty. I don't need to prove it to you or anyone else for that matter.", 
        "intTime": 20090305, 
        "postID": 46, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "reply": " If we were talking about military operations I would agree. We are not. His profile idicates nothing about the topic at hand. Oh and I walked for twenty. I don't need to prove it to you or anyone else for that matter.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:02:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "intTime": 20090305, 
        "postID": 47, 
        "quote": "", 
        "reply": "Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:08:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "intTime": 20090305, 
        "postID": 48, 
        "quote": "Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter.", 
        "reply": " That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:08:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts. See Friar Tuck, gunny shows common sense.", 
        "intTime": 20090305, 
        "postID": 49, 
        "quote": "Originally posted by GunnyRet03: Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "reply": " See Friar Tuck, gunny shows common sense.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not. I highly doubt anything I could put in my profile would change that. Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "intTime": 20090305, 
        "postID": 50, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "reply": " I highly doubt anything I could put in my profile would change that. Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "intTime": 20090305, 
        "postID": 51, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "reply": " FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:12:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "intTime": 20090305, 
        "postID": 52, 
        "quote": "We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take.", 
        "reply": " You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:17:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don No problem. I learned a long time ago that until I see a noterized DD-214 from your county recorder, all we got is a good story.", 
        "intTime": 20090305, 
        "postID": 53, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "reply": " No problem. I learned a long time ago that until I see a noterized DD-214 from your county recorder, all we got is a good story.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:21:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that. It depends, profiles give time served and it tells some people that during their service was any ******* POTUS's/CinC he had to serve under. That's why I've always voted republican but civvies still seem to vote in Jimmy Carter's and Slick Willie Clintons. The military is a politician's pawn, a good soldier has no choice but to always be aware of any political issues.", 
        "intTime": 20090305, 
        "postID": 54, 
        "quote": "Originally posted by FrJohn1123: Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "reply": " It depends, profiles give time served and it tells some people that during their service was any ******* POTUS's/CinC he had to serve under. That's why I've always voted republican but civvies still seem to vote in Jimmy Carter's and Slick Willie Clintons. The military is a politician's pawn, a good soldier has no choice but to always be aware of any political issues.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:30:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I was on this site in 2001 when I was still in and never posted anything political then because I was a soldier. I worked for politicians. Now that I am out I say what ever I want. And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "intTime": 20090305, 
        "postID": 55, 
        "quote": "", 
        "reply": "I was on this site in 2001 when I was still in and never posted anything political then because I was a soldier. I worked for politicians. Now that I am out I say what ever I want. And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:37:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: And by the way, I know lots of ex-military that are democrats or independents that voted for the current president. That's their mis-fortune..........but their luck not to have experienced da Jimmy Era. If they did, then they must not have been on food stamps.", 
        "intTime": 20090305, 
        "postID": 56, 
        "quote": "Originally posted by FrJohn1123: And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "reply": " That's their mis-fortune..........but their luck not to have experienced da Jimmy Era. If they did, then they must not have been on food stamps.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:50:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "....they need to keep up with inflation and maintiaining two households....", 
        "intTime": 20090305, 
        "postID": 57, 
        "quote": "", 
        "reply": "....they need to keep up with inflation and maintiaining two households....", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:52:00", 
        "title": "No Leading By Example Here", 
        "userID": "VDoP"
    }, 
    {
        "content": "quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst.", 
        "intTime": 20090305, 
        "postID": 58, 
        "quote": "..........but their luck not to have experienced da Jimmy Era.", 
        "reply": " I lived through the Carter years. They were not the best years, but far from the worst.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:55:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst. As military or civvie? If they weren't the worse years for the military then I'd like to know when those years were.", 
        "intTime": 20090305, 
        "postID": 59, 
        "quote": "Originally posted by FrJohn1123: quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst.", 
        "reply": " As military or civvie? If they weren't the worse years for the military then I'd like to know when those years were.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 11:04:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits. Voting is hiring. Whiners= Citizens who want accountablity. 99.99% Mother humpin laughable!", 
        "intTime": 20090305, 
        "postID": 60, 
        "quote": "Originally posted by FrJohn1123: quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "reply": " Voting is hiring. Whiners= Citizens who want accountablity. 99.99% Mother humpin laughable!", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 11:11:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "intTime": 20090305, 
        "postID": 61, 
        "quote": "", 
        "reply": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:14:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important.", 
        "intTime": 20090305, 
        "postID": 62, 
        "quote": "'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html'", 
        "reply": " They make less than a four star. Why don't you worry about something important.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:20:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important. A 4 star General has a real job. Corruption, waste and hypocrisy is something to worry about with our honorable legislators. They are asking Americans to sacrifice but arent willing to do it themselves. We have these clowns railing against corporations and their jets and resorts but they do the same thing. We have the AFL-CIO heads meeting at resorts at unions members expense and being spoken to by the Prez via Video and the VP showing up at taxpayer expense. yeh, no problem. Change you can believe in. Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "intTime": 20090305, 
        "postID": 63, 
        "quote": "Originally posted by FrJohn1123: quote: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' They make less than a four star. Why don't you worry about something important.", 
        "reply": " A 4 star General has a real job. Corruption, waste and hypocrisy is something to worry about with our honorable legislators. They are asking Americans to sacrifice but arent willing to do it themselves. We have these clowns railing against corporations and their jets and resorts but they do the same thing. We have the AFL-CIO heads meeting at resorts at unions members expense and being spoken to by the Prez via Video and the VP showing up at taxpayer expense. yeh, no problem. Change you can believe in. Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 08:26:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "intTime": 20090305, 
        "postID": 64, 
        "quote": "Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along.", 
        "reply": " Gunny, your profile says alot about you , his doesn't..................", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:01:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don", 
        "intTime": 20090305, 
        "postID": 65, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "reply": " Ouch! Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:05:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "\"Do as I say, not as I do...\" - Congress", 
        "intTime": 20090305, 
        "postID": 66, 
        "quote": "", 
        "reply": "\"Do as I say, not as I do...\" - Congress", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:05:00", 
        "title": "No Leading By Example Here", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay! When you throw in their perpetual Medical and Retirement Benefits for what little we get out of many of them, and how much they rip off from us, there needs to be some citizen oversight and rebuttal of some kind - besides revolution... Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 67, 
        "quote": "Originally posted by GunnyRet03: 'http://gatewaypundit.blogspot.com/2009/03/congress-gives-itself-boost-in-spending.html' Shows us you're serious about this 'Crisis' Congress and cut your pay!", 
        "reply": " When you throw in their perpetual Medical and Retirement Benefits for what little we get out of many of them, and how much they rip off from us, there needs to be some citizen oversight and rebuttal of some kind - besides revolution... Wandering and Wondering", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "intTime": 20090305, 
        "postID": 68, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don", 
        "reply": " Yes that was a real oucher. How old are you?", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:11:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you? Oh come on, ya gotta admit it was a little funny or a least a good volley. By the way, 45 as you can probably get an idea from my filled in profile. Don", 
        "intTime": 20090305, 
        "postID": 69, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "reply": " Oh come on, ya gotta admit it was a little funny or a least a good volley. By the way, 45 as you can probably get an idea from my filled in profile. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:16:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you? Oooooh, Owwwww, what a comeback. Just remember, age is not an indicator of wisdom.", 
        "intTime": 20090305, 
        "postID": 70, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. Ouch! Don Yes that was a real oucher. How old are you?", 
        "reply": " Oooooh, Owwwww, what a comeback. Just remember, age is not an indicator of wisdom.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:18:00", 
        "title": "No Leading By Example Here", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. A young person can have precocious intellect, rational thinking, and insight/inspiration (especially if you believe in religion or the supernatural), but technically \"wizdom\" takes a little longer... \"Out of the mouth of babes\" would suggest unseen forces at work, not wisdom - - Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 71, 
        "quote": "Just remember, age is not an indicator of wisdom.", 
        "reply": " Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. A young person can have precocious intellect, rational thinking, and insight/inspiration (especially if you believe in religion or the supernatural), but technically \"wizdom\" takes a little longer... \"Out of the mouth of babes\" would suggest unseen forces at work, not wisdom - - Wandering and Wondering", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:29:00", 
        "title": "No Leading By Example Here", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes.", 
        "intTime": 20090305, 
        "postID": 72, 
        "quote": "By the way, 45 as you can probably get an idea from my filled in profile.", 
        "reply": " I don't look at profiles. They are kinda like resumes.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:35:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. - Well I've had my fill of those. Don", 
        "intTime": 20090305, 
        "postID": 73, 
        "quote": "Originally posted by greywolfghost: quote: Just remember, age is not an indicator of wisdom. Sorry, not true. \"Wisdom\" (Wiz - world, dom - domain, dominance) suggests knowledge gained by long ages of trial and error, failure, loss, success - experience, study, and observation. -", 
        "reply": " Well I've had my fill of those. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:43:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "intTime": 20090305, 
        "postID": 74, 
        "quote": "Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes.", 
        "reply": " It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 09:54:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't.................. On me", 
        "intTime": 20090305, 
        "postID": 75, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by GunnyRet03: Btw, it must have been important enough you showed up to this thread. Now run along. Gunny, your profile says alot about you , his doesn't..................", 
        "reply": " On me", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:02:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... If we were talking about military operations I would agree. We are not. His profile idicates nothing about the topic at hand. Oh and I walked for twenty. I don't need to prove it to you or anyone else for that matter.", 
        "intTime": 20090305, 
        "postID": 76, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "reply": " If we were talking about military operations I would agree. We are not. His profile idicates nothing about the topic at hand. Oh and I walked for twenty. I don't need to prove it to you or anyone else for that matter.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:02:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "intTime": 20090305, 
        "postID": 77, 
        "quote": "", 
        "reply": "Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:08:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "intTime": 20090305, 
        "postID": 78, 
        "quote": "Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter.", 
        "reply": " That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:08:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts. See Friar Tuck, gunny shows common sense.", 
        "intTime": 20090305, 
        "postID": 79, 
        "quote": "Originally posted by GunnyRet03: Back to the topic. So we shouldnt care wht they make or how much they show up for work or that they get 93k for expenses. And that their retirement makes the UAW's look like a Mil retirement. We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. OOO radical thoughts.", 
        "reply": " See Friar Tuck, gunny shows common sense.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not. I highly doubt anything I could put in my profile would change that. Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "intTime": 20090305, 
        "postID": 80, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: I don't need to prove it to you or anyone else for that matter. That's very true but until you do, I'll stick with gunny whether military related or not.", 
        "reply": " I highly doubt anything I could put in my profile would change that. Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:10:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "intTime": 20090305, 
        "postID": 81, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand...........", 
        "reply": " FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:12:00", 
        "title": "No Leading By Example Here", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "intTime": 20090305, 
        "postID": 82, 
        "quote": "We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take.", 
        "reply": " You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:17:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don No problem. I learned a long time ago that until I see a noterized DD-214 from your county recorder, all we got is a good story.", 
        "intTime": 20090305, 
        "postID": 83, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by FrJohn1123: quote: By the way, 45 as you can probably get an idea from my filled in profile. I don't look at profiles. They are kinda like resumes. It does help some to know if they are replying to those that have done the walk or those that haven't. Gunny shows me, he has. You on the other hand........... FrJohn, I think one of the other reasons that the regular posters get suspicious is because military.com has been bombarded lately with posters who don't fill out their profile, claim a rank and start in with pushing their politics. Some recent posters who do fill in their profiles are called on their claims by those who served in the same branch and find errors with their claimed ribbons and/or awards. This weeds out the \"posers\", again, which seem to have been flowing in here like some Springtime breeze. I'm not saying you aren't a retired Army E-8. I'm just trying to explain to you some of the reasons people can get suspicious. You only signed up a month ago so people aren't familiar with you. Sorry if I offended....I can be a wise guy at times while attempting humor. Don", 
        "reply": " No problem. I learned a long time ago that until I see a noterized DD-214 from your county recorder, all we got is a good story.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:21:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that. It depends, profiles give time served and it tells some people that during their service was any ******* POTUS's/CinC he had to serve under. That's why I've always voted republican but civvies still seem to vote in Jimmy Carter's and Slick Willie Clintons. The military is a politician's pawn, a good soldier has no choice but to always be aware of any political issues.", 
        "intTime": 20090305, 
        "postID": 84, 
        "quote": "Originally posted by FrJohn1123: Why aren't you honest and just say you don't like my politics. Profiles have zero to do with that.", 
        "reply": " It depends, profiles give time served and it tells some people that during their service was any ******* POTUS's/CinC he had to serve under. That's why I've always voted republican but civvies still seem to vote in Jimmy Carter's and Slick Willie Clintons. The military is a politician's pawn, a good soldier has no choice but to always be aware of any political issues.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:30:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I was on this site in 2001 when I was still in and never posted anything political then because I was a soldier. I worked for politicians. Now that I am out I say what ever I want. And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "intTime": 20090305, 
        "postID": 85, 
        "quote": "", 
        "reply": "I was on this site in 2001 when I was still in and never posted anything political then because I was a soldier. I worked for politicians. Now that I am out I say what ever I want. And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:37:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: And by the way, I know lots of ex-military that are democrats or independents that voted for the current president. That's their mis-fortune..........but their luck not to have experienced da Jimmy Era. If they did, then they must not have been on food stamps.", 
        "intTime": 20090305, 
        "postID": 86, 
        "quote": "Originally posted by FrJohn1123: And by the way, I know lots of ex-military that are democrats or independents that voted for the current president.", 
        "reply": " That's their mis-fortune..........but their luck not to have experienced da Jimmy Era. If they did, then they must not have been on food stamps.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:50:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "....they need to keep up with inflation and maintiaining two households....", 
        "intTime": 20090305, 
        "postID": 87, 
        "quote": "", 
        "reply": "....they need to keep up with inflation and maintiaining two households....", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:52:00", 
        "title": "No Leading By Example Here", 
        "userID": "VDoP"
    }, 
    {
        "content": "quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst.", 
        "intTime": 20090305, 
        "postID": 88, 
        "quote": "..........but their luck not to have experienced da Jimmy Era.", 
        "reply": " I lived through the Carter years. They were not the best years, but far from the worst.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 10:55:00", 
        "title": "No Leading By Example Here", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst. As military or civvie? If they weren't the worse years for the military then I'd like to know when those years were.", 
        "intTime": 20090305, 
        "postID": 89, 
        "quote": "Originally posted by FrJohn1123: quote: ..........but their luck not to have experienced da Jimmy Era. I lived through the Carter years. They were not the best years, but far from the worst.", 
        "reply": " As military or civvie? If they weren't the worse years for the military then I'd like to know when those years were.", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 11:04:00", 
        "title": "No Leading By Example Here", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits. Voting is hiring. Whiners= Citizens who want accountablity. 99.99% Mother humpin laughable!", 
        "intTime": 20090305, 
        "postID": 90, 
        "quote": "Originally posted by FrJohn1123: quote: We hired these azzholes and WE should have a say in their compensation, especially since these azzclowns are deciding what busnisses should be paid and not paid and what trips busnisses can take. You did not hire anyone. You may have voted for one or two, but that is it. As for the blanket characterization of all those in office, you are way off the mark. They have tough job having to please whiners like you. I would venture to guess 99.999 percent are honest and hard working and the only part of their benefit package that is questionable in my mind is the retirement benefits.", 
        "reply": " Voting is hiring. Whiners= Citizens who want accountablity. 99.99% Mother humpin laughable!", 
        "threadID": "409192893_2980079612001", 
        "time": "2009-03-05 11:11:00", 
        "title": "No Leading By Example Here", 
        "userID": "GunnyRet03"
    }
]