[
    {
        "content": "quote: Iran's top authority, Supreme Leader Ayatollah Ali Khamenei, blamed Tehran's old foes, the United States and Israel. \"The main suspects in this crime and crimes similar to that are American security and military forces,\" he said in a statement read on state radio on Saturday. He said U.S. forces, on the pretext of fighting terrorism, had occupied an Islamic country and \"killed tens of thousands of people there and increased insecurity there day after day.\" Clinton said she had not heard the comments. \"But I must say it is disappointing for anyone to make such a claim since it is clearly traced to the al Qaeda remnants and other violent groups,\" she said. Khamenei's criticism could bode poorly for U.S. President Barack Obama's moves to thaw relations between Washington and Iran, at odds over Tehran's nuclear programme. I'm sure the usual suspects will tell me how Iran is being isolated, and on one wants to be their friend, yet they fail to see how Iran couldn't careless because they are nearing their goal of aquiring Nuclear weapons.... The Obama Doctrine(Talk, Listen, Apologize) how effective can it be on Iran?", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "Iran's top authority, Supreme Leader Ayatollah Ali Khamenei, blamed Tehran's old foes, the United States and Israel. \"The main suspects in this crime and crimes similar to that are American security and military forces,\" he said in a statement read on state radio on Saturday. He said U.S. forces, on the pretext of fighting terrorism, had occupied an Islamic country and \"killed tens of thousands of people there and increased insecurity there day after day.\" Clinton said she had not heard the comments. \"But I must say it is disappointing for anyone to make such a claim since it is clearly traced to the al Qaeda remnants and other violent groups,\" she said. Khamenei's criticism could bode poorly for U.S. President Barack Obama's moves to thaw relations between Washington and Iran, at odds over Tehran's nuclear programme.", 
        "reply": " I'm sure the usual suspects will tell me how Iran is being isolated, and on one wants to be their friend, yet they fail to see how Iran couldn't careless because they are nearing their goal of aquiring Nuclear weapons.... The Obama Doctrine(Talk, Listen, Apologize) how effective can it be on Iran?", 
        "threadID": "409192893_8080067122001", 
        "time": "2009-04-25 16:21:00", 
        "title": "Iran SLAMS the United States, and new best friend...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Iran's top authority, Supreme Leader Ayatollah Ali Khamenei, blamed Tehran's old foes, the United States and Israel. \"The main suspects in this crime and crimes similar to that are American security and military forces,\" he said in a statement read on state radio on Saturday. He said U.S. forces, on the pretext of fighting terrorism, had occupied an Islamic country and \"killed tens of thousands of people there and increased insecurity there day after day.\" Clinton said she had not heard the comments. \"But I must say it is disappointing for anyone to make such a claim since it is clearly traced to the al Qaeda remnants and other violent groups,\" she said. Khamenei's criticism could bode poorly for U.S. President Barack Obama's moves to thaw relations between Washington and Iran, at odds over Tehran's nuclear programme. I'm sure the usual suspects will tell me how Iran is being isolated, and on one wants to be their friend, yet they fail to see how Iran couldn't careless because they are nearing their goal of aquiring Nuclear weapons.... The Obama Doctrine(Talk, Listen, Apologize) how effective can it be on Iran? We've been over this before. The Ayatollah might be trying to shore up because he might be running a little scared. He might be afraid that his population might like President Obama better than they like him. In fact, evidence suggests that many do. It's really not about Isolating Iran. It's about isolating the Ayatollah and his minions from Iran just as events have isolated Bush and the GOP from America. Of course, it probably won't be peaceful but that's Iran's huckleberry. It's only been 100 days. Strategy never runs in a straight line and the real mechanizations will be hidden to most of us. I'm sure you know that the essence of warfare is deception. President Obama is not about to knuckle under to anybody and that's my opinion but I think future events will illustrate that. We'll see how it shakes out.", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Iran's top authority, Supreme Leader Ayatollah Ali Khamenei, blamed Tehran's old foes, the United States and Israel. \"The main suspects in this crime and crimes similar to that are American security and military forces,\" he said in a statement read on state radio on Saturday. He said U.S. forces, on the pretext of fighting terrorism, had occupied an Islamic country and \"killed tens of thousands of people there and increased insecurity there day after day.\" Clinton said she had not heard the comments. \"But I must say it is disappointing for anyone to make such a claim since it is clearly traced to the al Qaeda remnants and other violent groups,\" she said. Khamenei's criticism could bode poorly for U.S. President Barack Obama's moves to thaw relations between Washington and Iran, at odds over Tehran's nuclear programme. I'm sure the usual suspects will tell me how Iran is being isolated, and on one wants to be their friend, yet they fail to see how Iran couldn't careless because they are nearing their goal of aquiring Nuclear weapons.... The Obama Doctrine(Talk, Listen, Apologize) how effective can it be on Iran?", 
        "reply": " We've been over this before. The Ayatollah might be trying to shore up because he might be running a little scared. He might be afraid that his population might like President Obama better than they like him. In fact, evidence suggests that many do. It's really not about Isolating Iran. It's about isolating the Ayatollah and his minions from Iran just as events have isolated Bush and the GOP from America. Of course, it probably won't be peaceful but that's Iran's huckleberry. It's only been 100 days. Strategy never runs in a straight line and the real mechanizations will be hidden to most of us. I'm sure you know that the essence of warfare is deception. President Obama is not about to knuckle under to anybody and that's my opinion but I think future events will illustrate that. We'll see how it shakes out.", 
        "threadID": "409192893_8080067122001", 
        "time": "2009-04-25 16:48:00", 
        "title": "Iran SLAMS the United States, and new best friend...", 
        "userID": "Thud357L"
    }
]