[
    {
        "content": "US Postal service exec gets top bonus but looses tons of money. I went to my mailbox today, had one bill (water) and five pieces of junk mail, all of it is buy me crap, and the first stop on the way to the door is trash bin.. if they want to raise rates then do so and do away with the special junk rate, it has to still be delivered, handled. why do bulk mailings get better rate, and the us postal service has record loss, btom", 
        "intTime": 20090328, 
        "postID": 1, 
        "quote": "", 
        "reply": "US Postal service exec gets top bonus but looses tons of money. I went to my mailbox today, had one bill (water) and five pieces of junk mail, all of it is buy me crap, and the first stop on the way to the door is trash bin.. if they want to raise rates then do so and do away with the special junk rate, it has to still be delivered, handled. why do bulk mailings get better rate, and the us postal service has record loss, btom", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-28 09:31:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "Ira1945"
    }, 
    {
        "content": "what have you never heard of a volume discount? pretty much every business everywhere will give you a discount for buying a ton of their product", 
        "intTime": 20090328, 
        "postID": 2, 
        "quote": "", 
        "reply": "what have you never heard of a volume discount? pretty much every business everywhere will give you a discount for buying a ton of their product", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-28 11:13:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: what have you never heard of a volume discount? pretty much every business everywhere will give you a discount for buying a ton of their product sure i have heard of it, but if the us postal service loses billions every year why have the rate, not working", 
        "intTime": 20090328, 
        "postID": 3, 
        "quote": "Originally posted by liberal90: what have you never heard of a volume discount? pretty much every business everywhere will give you a discount for buying a ton of their product", 
        "reply": " sure i have heard of it, but if the us postal service loses billions every year why have the rate, not working", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-28 11:56:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by liberal90: what have you never heard of a volume discount? pretty much every business everywhere will give you a discount for buying a ton of their product sure i have heard of it, but if the us postal service loses billions every year why have the rate, not working presumably if offering the rate was losing them more money than it gained them they would no longer offer it (and the postal service doesn't \"lose billions every year\", it made about $5 billion last year)", 
        "intTime": 20090328, 
        "postID": 4, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by liberal90: what have you never heard of a volume discount? pretty much every business everywhere will give you a discount for buying a ton of their product sure i have heard of it, but if the us postal service loses billions every year why have the rate, not working", 
        "reply": " presumably if offering the rate was losing them more money than it gained them they would no longer offer it (and the postal service doesn't \"lose billions every year\", it made about $5 billion last year)", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-28 13:24:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: (and the postal service doesn't \"lose billions every year\", it made about $5 billion last year) ?? not what is on internet By Jasmin Melvin WASHINGTON (Reuters) - The U.S. Postal Service reported a $2.8 billion net loss for its fiscal year that ended September 30, blaming the national economic slowdown and costly government mandates. Mail volume declined 4.5 percent from a year earlier to 202.7 billion pieces as problems in the financial and housing industries grew and more people turned to electronic mail, the Postal Service said. The Postal Act of 2006, which requires the agency to pre-fund retiree health benefits, also cut deeply into the service's finances. The legislation added $5.6 billion to the Postal Service's expenses, which totaled $77.8 billion. Revenue in fiscal 2008 was unchanged at $75 billion. At a meeting of the Postal Service Board of Governors on Thursday, Board Chairman Alan Kessler said the board was working with Congress to ease some of the financial pressure from the Postal Act. \"Legislative relief is only part of the solution to the problems facing the Postal Service,\" Kessler said. \"The Board and management will actively pursue the actions necessary to further reduce costs and grow revenue.\" The loss occurred despite more than $2 billion in cost-cutting measures that included 50 million fewer work hours compared to the previous year. The cuts helped offset higher expenses that included a $525 million increase in fuel costs and $562 million in cost-of-living adjustments for workers. \"As we continue to reduce work hours and other costs, our top priority remains providing excellent service to our customers,\" Postmaster General John Potter told Board members. Despite revenue losses, the Postal Service said it improved on-time mail delivery, reaching record performance levels in fiscal 2008. On-time delivery performance in the fourth quarter was 97 percent for overnight First-Class mail, 94 percent for two-day service and 93 percent for three-day service. \"We expect the new fiscal year to be another difficult one for the Postal Service and the entire mailing industry, as economic factors will continue to reduce mail volume and increase expenses,\" Potter said. The Postal Service, an independent federal agency, competes with FedEx (FDX.N) and United Parcel Service (UPS.N). Deutsche Post AG (DPWGn.DE) said this week it is halting U.S. domestic services at its DHL Express unit DHL.UL. (Reporting by Jasmin Melvin; Editing by Tim Dobbyn) gov mandates seem to be the main issue? not sure what precisely the mandates are, but that seems to be the main reason it along with every other us gov agency and it is a gov agency regardless of what they say runs on a loss", 
        "intTime": 20090328, 
        "postID": 5, 
        "quote": "(and the postal service doesn't \"lose billions every year\", it made about $5 billion last year)", 
        "reply": " ?? not what is on internet By Jasmin Melvin WASHINGTON (Reuters) - The U.S. Postal Service reported a $2.8 billion net loss for its fiscal year that ended September 30, blaming the national economic slowdown and costly government mandates. Mail volume declined 4.5 percent from a year earlier to 202.7 billion pieces as problems in the financial and housing industries grew and more people turned to electronic mail, the Postal Service said. The Postal Act of 2006, which requires the agency to pre-fund retiree health benefits, also cut deeply into the service's finances. The legislation added $5.6 billion to the Postal Service's expenses, which totaled $77.8 billion. Revenue in fiscal 2008 was unchanged at $75 billion. At a meeting of the Postal Service Board of Governors on Thursday, Board Chairman Alan Kessler said the board was working with Congress to ease some of the financial pressure from the Postal Act. \"Legislative relief is only part of the solution to the problems facing the Postal Service,\" Kessler said. \"The Board and management will actively pursue the actions necessary to further reduce costs and grow revenue.\" The loss occurred despite more than $2 billion in cost-cutting measures that included 50 million fewer work hours compared to the previous year. The cuts helped offset higher expenses that included a $525 million increase in fuel costs and $562 million in cost-of-living adjustments for workers. \"As we continue to reduce work hours and other costs, our top priority remains providing excellent service to our customers,\" Postmaster General John Potter told Board members. Despite revenue losses, the Postal Service said it improved on-time mail delivery, reaching record performance levels in fiscal 2008. On-time delivery performance in the fourth quarter was 97 percent for overnight First-Class mail, 94 percent for two-day service and 93 percent for three-day service. \"We expect the new fiscal year to be another difficult one for the Postal Service and the entire mailing industry, as economic factors will continue to reduce mail volume and increase expenses,\" Potter said. The Postal Service, an independent federal agency, competes with FedEx (FDX.N) and United Parcel Service (UPS.N). Deutsche Post AG (DPWGn.DE) said this week it is halting U.S. domestic services at its DHL Express unit DHL.UL. (Reporting by Jasmin Melvin; Editing by Tim Dobbyn) gov mandates seem to be the main issue? not sure what precisely the mandates are, but that seems to be the main reason it along with every other us gov agency and it is a gov agency regardless of what they say runs on a loss", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-28 16:30:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "Ira1945"
    }, 
    {
        "content": "sorry, by last year I meant fiscal year '07 also it's not a government agency precisely, it's a semiprivate entity. (the government mandates that are most likely to cause them to lose money are: universal delivery and daily delivery, as well as the pre-funding retirees thing)", 
        "intTime": 20090329, 
        "postID": 6, 
        "quote": "", 
        "reply": "sorry, by last year I meant fiscal year '07 also it's not a government agency precisely, it's a semiprivate entity. (the government mandates that are most likely to cause them to lose money are: universal delivery and daily delivery, as well as the pre-funding retirees thing)", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-29 00:33:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: the government mandates that are most likely to cause them to lose money are: universal delivery and daily delivery, as well as the pre-funding retirees thing And we all know that Ira believes this FY 08 is all Obama H's fault. SOMEBODY GET A TIME-LINE FOR IRA....please? Hey it passes the seawitch standard: If it happens on his watch!", 
        "intTime": 20090329, 
        "postID": 7, 
        "quote": "Originally posted by dmuhler: quote: the government mandates that are most likely to cause them to lose money are: universal delivery and daily delivery, as well as the pre-funding retirees thing And we all know that Ira believes this FY 08 is all Obama H's fault. SOMEBODY GET A TIME-LINE FOR IRA....please?", 
        "reply": " Hey it passes the seawitch standard: If it happens on his watch!", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-29 07:05:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: And we all know that Ira believes this FY 08 is all Obama H's fault. SOMEBODY GET A TIME-LINE FOR IRA....please? assume ass u me correction, Obama has nothing to do with the costly us postal service. they lose money, why give the top execs bonus's when they lose money but once again you blame me and or put words in other peoples mouths, sorry but aint gonna wash this is a long going problem paying people money to do bad jobs. should get rewards when the job is done better than is expected.. i suppose you support bonus payments to losers??", 
        "intTime": 20090329, 
        "postID": 8, 
        "quote": "And we all know that Ira believes this FY 08 is all Obama H's fault. SOMEBODY GET A TIME-LINE FOR IRA....please?", 
        "reply": " assume ass u me correction, Obama has nothing to do with the costly us postal service. they lose money, why give the top execs bonus's when they lose money but once again you blame me and or put words in other peoples mouths, sorry but aint gonna wash this is a long going problem paying people money to do bad jobs. should get rewards when the job is done better than is expected.. i suppose you support bonus payments to losers??", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-29 07:16:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: US Postal service exec gets top bonus but looses tons of money. I went to my mailbox today, had one bill (water) and five pieces of junk mail, all of it is buy me crap, and the first stop on the way to the door is trash bin.. if they want to raise rates then do so and do away with the special junk rate, it has to still be delivered, handled. why do bulk mailings get better rate, and the us postal service has record loss, btom What I don't understand is why is it perfectly ok for our paper mail boxes to get FLOODED with Junk but yet the email Spammers get put in prison for the same thing. Makes no since.", 
        "intTime": 20090329, 
        "postID": 9, 
        "quote": "Originally posted by Ira1945: US Postal service exec gets top bonus but looses tons of money. I went to my mailbox today, had one bill (water) and five pieces of junk mail, all of it is buy me crap, and the first stop on the way to the door is trash bin.. if they want to raise rates then do so and do away with the special junk rate, it has to still be delivered, handled. why do bulk mailings get better rate, and the us postal service has record loss, btom", 
        "reply": " What I don't understand is why is it perfectly ok for our paper mail boxes to get FLOODED with Junk but yet the email Spammers get put in prison for the same thing. Makes no since.", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-29 14:03:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: US Postal service exec gets top bonus but looses tons of money. I went to my mailbox today, had one bill (water) and five pieces of junk mail, all of it is buy me crap, and the first stop on the way to the door is trash bin.. if they want to raise rates then do so and do away with the special junk rate, it has to still be delivered, handled. why do bulk mailings get better rate, and the us postal service has record loss, btom Most government employees are over paidf anyway, not to mention the execs then toss in the bonus? How rediculous.", 
        "intTime": 20090329, 
        "postID": 10, 
        "quote": "Originally posted by Ira1945: US Postal service exec gets top bonus but looses tons of money. I went to my mailbox today, had one bill (water) and five pieces of junk mail, all of it is buy me crap, and the first stop on the way to the door is trash bin.. if they want to raise rates then do so and do away with the special junk rate, it has to still be delivered, handled. why do bulk mailings get better rate, and the us postal service has record loss, btom", 
        "reply": " Most government employees are over paidf anyway, not to mention the execs then toss in the bonus? How rediculous.", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-29 14:04:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Ira1945: quote: And we all know that Ira believes this FY 08 is all Obama H's fault. SOMEBODY GET A TIME-LINE FOR IRA....please? assume ass u me correction, Obama has nothing to do with the costly us postal service. they lose money, why give the top execs bonus's when they lose money but once again you blame me and or put words in other peoples mouths, sorry but aint gonna wash this is a long going problem paying people money to do bad jobs. should get rewards when the job is done better than is expected.. i suppose you support bonus payments to losers?? Oh I thought you just whine about Obama. My bad, you whine about everything. Carry on. thank you for your gracious kind comments, as always", 
        "intTime": 20090329, 
        "postID": 11, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Ira1945: quote: And we all know that Ira believes this FY 08 is all Obama H's fault. SOMEBODY GET A TIME-LINE FOR IRA....please? assume ass u me correction, Obama has nothing to do with the costly us postal service. they lose money, why give the top execs bonus's when they lose money but once again you blame me and or put words in other peoples mouths, sorry but aint gonna wash this is a long going problem paying people money to do bad jobs. should get rewards when the job is done better than is expected.. i suppose you support bonus payments to losers?? Oh I thought you just whine about Obama. My bad, you whine about everything. Carry on.", 
        "reply": " thank you for your gracious kind comments, as always", 
        "threadID": "409192893_4790061912001", 
        "time": "2009-03-29 17:13:00", 
        "title": "BONUS BONUS BONUS,  INCLUDE US POSTAL SERVICE IN THE LOSING DOLLAR AGENDA", 
        "userID": "Ira1945"
    }
]