[
    {
        "content": "I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid.", 
        "intTime": 20090317, 
        "postID": 1, 
        "quote": "", 
        "reply": "I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:12:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "gysgtwarren"
    }, 
    {
        "content": "By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:23:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "The Red Cross holds no credibility with me. Especially after what they did with the money they got for the victim's families on 9/11.", 
        "intTime": 20090317, 
        "postID": 3, 
        "quote": "", 
        "reply": "The Red Cross holds no credibility with me. Especially after what they did with the money they got for the victim's families on 9/11.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:26:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "This is a typical democrat miss-information campaign. Pure BS which has zero cred.", 
        "intTime": 20090317, 
        "postID": 4, 
        "quote": "", 
        "reply": "This is a typical democrat miss-information campaign. Pure BS which has zero cred.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:47:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "2571722"
    }, 
    {
        "content": "Anybody have a reference for this report? It DOESN'T come from the IRC - they never released a report, or, they claim, leaked it. So is this another Claghorn B. Leghorn exercise in concentrated BS, or what? \"Creds\" for the stoopid?", 
        "intTime": 20090317, 
        "postID": 5, 
        "quote": "", 
        "reply": "Anybody have a reference for this report? It DOESN'T come from the IRC - they never released a report, or, they claim, leaked it. So is this another Claghorn B. Leghorn exercise in concentrated BS, or what? \"Creds\" for the stoopid?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:54:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "popsiq"
    }, 
    {
        "content": "The allegations of ill-treatment of the detainees indicate that, in many cases, the ill-treatment to which they were subjected while held in the CIA program, either singly or in combination, constituted torture. In addition, many other elements of the ill-treatment, either singly or in combination, constituted cruel, inhuman or degrading treatment,\" states the report, according to Danner. A leaked 2003 ICRC report said that prisoners in U.S. custody in Iraq had been abused in ways that in some cases was tantamount to torture. Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this?", 
        "intTime": 20090317, 
        "postID": 6, 
        "quote": "", 
        "reply": "The allegations of ill-treatment of the detainees indicate that, in many cases, the ill-treatment to which they were subjected while held in the CIA program, either singly or in combination, constituted torture. In addition, many other elements of the ill-treatment, either singly or in combination, constituted cruel, inhuman or degrading treatment,\" states the report, according to Danner. A leaked 2003 ICRC report said that prisoners in U.S. custody in Iraq had been abused in ways that in some cases was tantamount to torture. Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:55:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "USSoldier1"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Anybody have a reference for this report? It DOESN'T come from the IRC - they never released a report, or, they claim, leaked it. So is this another Claghorn B. Leghorn exercise in concentrated BS, or what? \"Creds\" for the stoopid? ICRC officials would not confirm details of the report to The Associated Press and denied leaking it. \"We regret that information attributed to the ICRC has been made public. We share our observations and concerns related to U.S. detentions as part of the confidential dialogue we maintain with U.S. authorities and so we do not wish to comment on the substance of the article,\" said Simon Schorno, a spokesman for the Geneva headquarters of the International Committee of the Red Cross. +http://www.google.com/hostednews/ap/article/ALeqM5iPW0cuXBLSFZGuQtSV_0yX_xsGwwD96V9KG80", 
        "intTime": 20090317, 
        "postID": 7, 
        "quote": "Originally posted by popsiq: Anybody have a reference for this report? It DOESN'T come from the IRC - they never released a report, or, they claim, leaked it. So is this another Claghorn B. Leghorn exercise in concentrated BS, or what? \"Creds\" for the stoopid?", 
        "reply": " ICRC officials would not confirm details of the report to The Associated Press and denied leaking it. \"We regret that information attributed to the ICRC has been made public. We share our observations and concerns related to U.S. detentions as part of the confidential dialogue we maintain with U.S. authorities and so we do not wish to comment on the substance of the article,\" said Simon Schorno, a spokesman for the Geneva headquarters of the International Committee of the Red Cross. +http://www.google.com/hostednews/ap/article/ALeqM5iPW0cuXBLSFZGuQtSV_0yX_xsGwwD96V9KG80", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:57:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Knele"
    }, 
    {
        "content": "Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "intTime": 20090317, 
        "postID": 8, 
        "quote": "", 
        "reply": "Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 07:40:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave", 
        "intTime": 20090317, 
        "postID": 9, 
        "quote": "Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "reply": " Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 07:54:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by gysgtwarren: I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid. You have noticed that several of these \"SUSPECTS\" turned out to have NOTHING to do with ANY terrorist organization BEFORE they were picked up and tortured haven't you?", 
        "intTime": 20090317, 
        "postID": 10, 
        "quote": "Originally posted by gysgtwarren: I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid.", 
        "reply": " You have noticed that several of these \"SUSPECTS\" turned out to have NOTHING to do with ANY terrorist organization BEFORE they were picked up and tortured haven't you?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:00:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT!", 
        "intTime": 20090317, 
        "postID": 11, 
        "quote": "Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don", 
        "reply": " quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:05:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RCcav"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave I think torture is torture, nail pulling, fingers chocked, hung upside down and beat with a bat. Not: loud music, cold/hot, humiliation and yes water boarding. As far as America in the past. Yeh tarring and feathering someone wasnt kinder treatment.", 
        "intTime": 20090317, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave", 
        "reply": " I think torture is torture, nail pulling, fingers chocked, hung upside down and beat with a bat. Not: loud music, cold/hot, humiliation and yes water boarding. As far as America in the past. Yeh tarring and feathering someone wasnt kinder treatment.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:07:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke What Mr. Obama has done is changed the reason to hold terrorist to conform with US Law (including ratified treaties) and international law but they can still be held. The 'Enemy Combatant' status advocated by the Bush Admin stated that the US President (admin) could declare ANYONE (including US citzens and legal US residents in the US) as an 'Enemy Combatant' and they then had NO rights and could be held forever with NO way to challenge their status. Do you really want Mr. Obama to have the power to put anyone in jail forever with no legal recourse just on his admins decision?", 
        "intTime": 20090317, 
        "postID": 13, 
        "quote": "Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "reply": " What Mr. Obama has done is changed the reason to hold terrorist to conform with US Law (including ratified treaties) and international law but they can still be held. The 'Enemy Combatant' status advocated by the Bush Admin stated that the US President (admin) could declare ANYONE (including US citzens and legal US residents in the US) as an 'Enemy Combatant' and they then had NO rights and could be held forever with NO way to challenge their status. Do you really want Mr. Obama to have the power to put anyone in jail forever with no legal recourse just on his admins decision?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:07:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke What Mr. Obama has done is changed the reason to hold terrorist to conform with US Law (including ratified treaties) and international law but they can still be held. The 'Enemy Combatant' status advocated by the Bush Admin stated that the US President (admin) could declare ANYONE (including US citzens and legal US residents in the US) as an 'Enemy Combatant' and they then had NO rights and could be held forever with NO way to challenge their status. Do you really want Mr. Obama to have the power to put anyone in jail forever with no legal recourse just on his admins decision? Very rarely do we see eye to eye, but I agree with you 100% on this. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090317, 
        "postID": 14, 
        "quote": "Originally posted by rayld2: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke What Mr. Obama has done is changed the reason to hold terrorist to conform with US Law (including ratified treaties) and international law but they can still be held. The 'Enemy Combatant' status advocated by the Bush Admin stated that the US President (admin) could declare ANYONE (including US citzens and legal US residents in the US) as an 'Enemy Combatant' and they then had NO rights and could be held forever with NO way to challenge their status. Do you really want Mr. Obama to have the power to put anyone in jail forever with no legal recourse just on his admins decision?", 
        "reply": " Very rarely do we see eye to eye, but I agree with you 100% on this. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:23:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "L0A1"
    }, 
    {
        "content": "The ARC should be listened to like a priest who listens to confessions. In one ear and out the other.", 
        "intTime": 20090317, 
        "postID": 15, 
        "quote": "", 
        "reply": "The ARC should be listened to like a priest who listens to confessions. In one ear and out the other.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 09:25:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RonaldMoraca"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke probably call them Obama suporters, the Obama brigades, friends of the Obama campaign, death to infidels, 16 virgin wankers, and head loppers!", 
        "intTime": 20090317, 
        "postID": 16, 
        "quote": "Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "reply": " probably call them Obama suporters, the Obama brigades, friends of the Obama campaign, death to infidels, 16 virgin wankers, and head loppers!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 09:27:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke probably call them Obama suporters, the Obama brigades, friends of the Obama campaign, death to infidels, 16 virgin wankers, and head loppers! OK, so now the Red Cross are socialists, communists, terrorists...etc. Don't you guys ever get tired of demonizing people who disagree with you? Sorry, stupid question, of course not. If it weren't for fear and hate the far right would have nothing. Just look at your leadership, or lack there of. The best your leadership can do is say \"no\" and \"be very afraid\". Not a single rational suggestion.", 
        "intTime": 20090317, 
        "postID": 17, 
        "quote": "Originally posted by EAG154: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke probably call them Obama suporters, the Obama brigades, friends of the Obama campaign, death to infidels, 16 virgin wankers, and head loppers!", 
        "reply": " OK, so now the Red Cross are socialists, communists, terrorists...etc. Don't you guys ever get tired of demonizing people who disagree with you? Sorry, stupid question, of course not. If it weren't for fear and hate the far right would have nothing. Just look at your leadership, or lack there of. The best your leadership can do is say \"no\" and \"be very afraid\". Not a single rational suggestion.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 09:40:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "intTime": 20090317, 
        "postID": 18, 
        "quote": "Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT!", 
        "reply": " Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 10:45:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "USSoldier1"
    }, 
    {
        "content": "quote: Originally posted by USSoldier1: Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. Do you need somebody to point out that terrorists are bad?", 
        "intTime": 20090317, 
        "postID": 19, 
        "quote": "Originally posted by USSoldier1: Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "reply": " Do you need somebody to point out that terrorists are bad?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 10:50:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. That's why we're the good guys...we question our government's questionable acts.", 
        "intTime": 20090317, 
        "postID": 20, 
        "quote": "Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "reply": " That's why we're the good guys...we question our government's questionable acts.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 11:42:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. I think the outcry is present everyday - when it gets reported in the news that someone blew up a bunch of civilians, or the terrorists cut off someone's head. Doesn't the whole \"War on Terrorism\" equate to an outcry over what the terrorists are doing? I hate to agree with Knele, but doesn't the name terrorist indicate that we don't accept their methods? Of course there is going to be a significant outcry when we do something wrong. That comes with being 1) the aggressor, and 2) the party that claims to be on the side of righteousness. While I hate to see a soldier get dragged through the mud for some wrongdoing, or perceived wrongdoing, it is a necessary step to show that we do stand for righteousness and we can police ourselves. I always hope the soldier will be vindicated, but that is not always going to happen. We all know that soldiers are human and sometimes do things that require punishment. In those cases, we just have to hope the powers that be take into account the stress that we put on our soldiers every day and the situation in which they find themselves. Again, I am not digging on you as a person. I am just stating that when you present the \"but they do it to us\" argument, it appears that you are using that to justify us torturing the enemy even if that was not your intention. SCOUTS OUT!", 
        "intTime": 20090317, 
        "postID": 21, 
        "quote": "Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "reply": " I think the outcry is present everyday - when it gets reported in the news that someone blew up a bunch of civilians, or the terrorists cut off someone's head. Doesn't the whole \"War on Terrorism\" equate to an outcry over what the terrorists are doing? I hate to agree with Knele, but doesn't the name terrorist indicate that we don't accept their methods? Of course there is going to be a significant outcry when we do something wrong. That comes with being 1) the aggressor, and 2) the party that claims to be on the side of righteousness. While I hate to see a soldier get dragged through the mud for some wrongdoing, or perceived wrongdoing, it is a necessary step to show that we do stand for righteousness and we can police ourselves. I always hope the soldier will be vindicated, but that is not always going to happen. We all know that soldiers are human and sometimes do things that require punishment. In those cases, we just have to hope the powers that be take into account the stress that we put on our soldiers every day and the situation in which they find themselves. Again, I am not digging on you as a person. I am just stating that when you present the \"but they do it to us\" argument, it appears that you are using that to justify us torturing the enemy even if that was not your intention. SCOUTS OUT!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 11:51:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RCcav"
    }, 
    {
        "content": "quote: Originally posted by RonaldMoraca: The ARC should be listened to like a priest who listens to confessions. In one ear and out the other. Is that how they do that? Geez, another education! Thx! That was the I(nternational) RC not the A(merican) RC - which is too busy collecting money to be concerned with much else.", 
        "intTime": 20090317, 
        "postID": 22, 
        "quote": "Originally posted by RonaldMoraca: The ARC should be listened to like a priest who listens to confessions. In one ear and out the other.", 
        "reply": " Is that how they do that? Geez, another education! Thx! That was the I(nternational) RC not the A(merican) RC - which is too busy collecting money to be concerned with much else.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 12:56:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by RCcav: quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. I think the outcry is present everyday - when it gets reported in the news that someone blew up a bunch of civilians, or the terrorists cut off someone's head. Doesn't the whole \"War on Terrorism\" equate to an outcry over what the terrorists are doing? I hate to agree with Knele, but doesn't the name terrorist indicate that we don't accept their methods? Of course there is going to be a significant outcry when we do something wrong. That comes with being 1) the aggressor, and 2) the party that claims to be on the side of righteousness. While I hate to see a soldier get dragged through the mud for some wrongdoing, or perceived wrongdoing, it is a necessary step to show that we do stand for righteousness and we can police ourselves. I always hope the soldier will be vindicated, but that is not always going to happen. We all know that soldiers are human and sometimes do things that require punishment. In those cases, we just have to hope the powers that be take into account the stress that we put on our soldiers every day and the situation in which they find themselves. Again, I am not digging on you as a person. I am just stating that when you present the \"but they do it to us\" argument, it appears that you are using that to justify us torturing the enemy even if that was not your intention. SCOUTS OUT! What you call it is what you call it. The IRC and some other misguided types, call it 'torture'. To the last administration and the guys who were doing it, it was 'enhanced interrogation'. Little more than a frat house hazing for pete's sake! Compared to sawing off somebody's head with a bread knife or burning your lips trying to blow up a bus full of kindergarten kids.", 
        "intTime": 20090317, 
        "postID": 23, 
        "quote": "Originally posted by RCcav: quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. I think the outcry is present everyday - when it gets reported in the news that someone blew up a bunch of civilians, or the terrorists cut off someone's head. Doesn't the whole \"War on Terrorism\" equate to an outcry over what the terrorists are doing? I hate to agree with Knele, but doesn't the name terrorist indicate that we don't accept their methods? Of course there is going to be a significant outcry when we do something wrong. That comes with being 1) the aggressor, and 2) the party that claims to be on the side of righteousness. While I hate to see a soldier get dragged through the mud for some wrongdoing, or perceived wrongdoing, it is a necessary step to show that we do stand for righteousness and we can police ourselves. I always hope the soldier will be vindicated, but that is not always going to happen. We all know that soldiers are human and sometimes do things that require punishment. In those cases, we just have to hope the powers that be take into account the stress that we put on our soldiers every day and the situation in which they find themselves. Again, I am not digging on you as a person. I am just stating that when you present the \"but they do it to us\" argument, it appears that you are using that to justify us torturing the enemy even if that was not your intention. SCOUTS OUT!", 
        "reply": " What you call it is what you call it. The IRC and some other misguided types, call it 'torture'. To the last administration and the guys who were doing it, it was 'enhanced interrogation'. Little more than a frat house hazing for pete's sake! Compared to sawing off somebody's head with a bread knife or burning your lips trying to blow up a bus full of kindergarten kids.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 13:01:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "popsiq"
    }, 
    {
        "content": "Don't forget, the Red Cross are the guys who send your family messages. They helped Mike Durant when he was grievously injured and captured in Mogadishu. I am better than the terrorists. Having actually fought in Iraq, I am proud to say my conduct and the conduct of my fellow soldiers was in line with the Geneva Conventions (and that includes how we handled people we detained). A sure sign that you are on a slippery slope is when you start splitting hairs over torture. The North Vietnamese tortured our POW's in numerous ways and some of that included extreme isolation. If you don't think isolation, extreme hot and cold temperatures, and water boarding are torture; you probably just don't want to think about those things too deeply. Torture is more than pulling fingernails, prolonged mental torture is just as damaging. If these things truly are \"little more than frat house hazing\", then what purpose did they actually serve? You cannot split hairs over the law. It is written in black and white. In basic training I was taught that we didn't torture people because it was against everything we stood for, and because it invited reprisals. Now I know that terrorists don't respect the law. But we do, and some day, a future enemy is going to use Gitmo and Abu Ghraib as justification for their own torture programs. People often say \"Terrorists are evil, they don't respect the laws, so why should we?\" Well if you believe that, the flipside is also true. We can't very well hold anyone accountable for the mistreatment of our POW's if we don't treat enemy POW's any better.", 
        "intTime": 20090317, 
        "postID": 24, 
        "quote": "", 
        "reply": "Don't forget, the Red Cross are the guys who send your family messages. They helped Mike Durant when he was grievously injured and captured in Mogadishu. I am better than the terrorists. Having actually fought in Iraq, I am proud to say my conduct and the conduct of my fellow soldiers was in line with the Geneva Conventions (and that includes how we handled people we detained). A sure sign that you are on a slippery slope is when you start splitting hairs over torture. The North Vietnamese tortured our POW's in numerous ways and some of that included extreme isolation. If you don't think isolation, extreme hot and cold temperatures, and water boarding are torture; you probably just don't want to think about those things too deeply. Torture is more than pulling fingernails, prolonged mental torture is just as damaging. If these things truly are \"little more than frat house hazing\", then what purpose did they actually serve? You cannot split hairs over the law. It is written in black and white. In basic training I was taught that we didn't torture people because it was against everything we stood for, and because it invited reprisals. Now I know that terrorists don't respect the law. But we do, and some day, a future enemy is going to use Gitmo and Abu Ghraib as justification for their own torture programs. People often say \"Terrorists are evil, they don't respect the laws, so why should we?\" Well if you believe that, the flipside is also true. We can't very well hold anyone accountable for the mistreatment of our POW's if we don't treat enemy POW's any better.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 13:30:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Don't forget, the Red Cross are the guys who send your family messages. They helped Mike Durant when he was grievously injured and captured in Mogadishu. I am better than the terrorists. Having actually fought in Iraq, I am proud to say my conduct and the conduct of my fellow soldiers was in line with the Geneva Conventions (and that includes how we handled people we detained). A sure sign that you are on a slippery slope is when you start splitting hairs over torture. The North Vietnamese tortured our POW's in numerous ways and some of that included extreme isolation. If you don't think isolation, extreme hot and cold temperatures, and water boarding are torture; you probably just don't want to think about those things too deeply. Torture is more than pulling fingernails, prolonged mental torture is just as damaging. If these things truly are \"little more than frat house hazing\", then what purpose did they actually serve? You cannot split hairs over the law. It is written in black and white. In basic training I was taught that we didn't torture people because it was against everything we stood for, and because it invited reprisals. Now I know that terrorists don't respect the law. But we do, and some day, a future enemy is going to use Gitmo and Abu Ghraib as justification for their own torture programs. People often say \"Terrorists are evil, they don't respect the laws, so why should we?\" Well if you believe that, the flipside is also true. We can't very well hold anyone accountable for the mistreatment of our POW's if we don't treat enemy POW's any better. Very well stated. SCOUTS OUT!", 
        "intTime": 20090317, 
        "postID": 25, 
        "quote": "Originally posted by foxred03: Don't forget, the Red Cross are the guys who send your family messages. They helped Mike Durant when he was grievously injured and captured in Mogadishu. I am better than the terrorists. Having actually fought in Iraq, I am proud to say my conduct and the conduct of my fellow soldiers was in line with the Geneva Conventions (and that includes how we handled people we detained). A sure sign that you are on a slippery slope is when you start splitting hairs over torture. The North Vietnamese tortured our POW's in numerous ways and some of that included extreme isolation. If you don't think isolation, extreme hot and cold temperatures, and water boarding are torture; you probably just don't want to think about those things too deeply. Torture is more than pulling fingernails, prolonged mental torture is just as damaging. If these things truly are \"little more than frat house hazing\", then what purpose did they actually serve? You cannot split hairs over the law. It is written in black and white. In basic training I was taught that we didn't torture people because it was against everything we stood for, and because it invited reprisals. Now I know that terrorists don't respect the law. But we do, and some day, a future enemy is going to use Gitmo and Abu Ghraib as justification for their own torture programs. People often say \"Terrorists are evil, they don't respect the laws, so why should we?\" Well if you believe that, the flipside is also true. We can't very well hold anyone accountable for the mistreatment of our POW's if we don't treat enemy POW's any better.", 
        "reply": " Very well stated. SCOUTS OUT!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 13:52:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RCcav"
    }, 
    {
        "content": "And, who in the hell has appointed the IRC to be experts on torture let alone inspecting prison facilities. BTW ask them how our boys are kept in the terrorist confinements and if they were tortured before the remains were found. All this hue and cry began over a first visit by non-american IRC members based on what? Our Medical personnel was consulted on questioning combatants technique. I guess if we consulted their Cleric or their Mom we really would have caught hell. The reporting was confidential and the so called experts and their lawyers could say about anything they wanted without verification. Then the experts and various know it all including Durbin came out with accusations again couldn't be denied or verified. Icing on the cake when the FBI couldn't get results and the CIA took over hurting some feelings and that's when the hockey hit the fan. Now, we're back to square one and again they (Popsiq and fellow accusers) never list the dastardly deeds, just generalize how awful the Americans are. Far be it from me to say what a bunch of candy arses you are, but you are. Does saying CIA instead of FBI get browny points. No, but it got results. The report that started it all. I could give the hundred or so accusations of being tortured by murderers that had to sit in a chair, and flushing Qurans that didn't happen brought riots in lands of the non-educated, but this mamby pamby bs gets me ill at my stomach, plus shows many that believes the lies are not as advance as they are. \"http://www.nytimes.com/2004/11/30/politics/30gitmo.html?ex=1259470800&en=825f1aa04c65241f&ei=5088&partner=rssnyt", 
        "intTime": 20090317, 
        "postID": 26, 
        "quote": "", 
        "reply": "And, who in the hell has appointed the IRC to be experts on torture let alone inspecting prison facilities. BTW ask them how our boys are kept in the terrorist confinements and if they were tortured before the remains were found. All this hue and cry began over a first visit by non-american IRC members based on what? Our Medical personnel was consulted on questioning combatants technique. I guess if we consulted their Cleric or their Mom we really would have caught hell. The reporting was confidential and the so called experts and their lawyers could say about anything they wanted without verification. Then the experts and various know it all including Durbin came out with accusations again couldn't be denied or verified. Icing on the cake when the FBI couldn't get results and the CIA took over hurting some feelings and that's when the hockey hit the fan. Now, we're back to square one and again they (Popsiq and fellow accusers) never list the dastardly deeds, just generalize how awful the Americans are. Far be it from me to say what a bunch of candy arses you are, but you are. Does saying CIA instead of FBI get browny points. No, but it got results. The report that started it all. I could give the hundred or so accusations of being tortured by murderers that had to sit in a chair, and flushing Qurans that didn't happen brought riots in lands of the non-educated, but this mamby pamby bs gets me ill at my stomach, plus shows many that believes the lies are not as advance as they are. \"http://www.nytimes.com/2004/11/30/politics/30gitmo.html?ex=1259470800&en=825f1aa04c65241f&ei=5088&partner=rssnyt", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 16:44:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave I think torture is torture, nail pulling, fingers chocked, hung upside down and beat with a bat. Not: loud music, cold/hot, humiliation and yes water boarding. As far as America in the past. Yeh tarring and feathering someone wasnt kinder treatment. COMMENT: You do recall that Mr. McCain -- who was waterboarded -- emphatically declared during his candidacy as the Republican presidential nominee that waterboarding is torture.", 
        "intTime": 20090317, 
        "postID": 27, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave I think torture is torture, nail pulling, fingers chocked, hung upside down and beat with a bat. Not: loud music, cold/hot, humiliation and yes water boarding. As far as America in the past. Yeh tarring and feathering someone wasnt kinder treatment.", 
        "reply": " COMMENT: You do recall that Mr. McCain -- who was waterboarded -- emphatically declared during his candidacy as the Republican presidential nominee that waterboarding is torture.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 16:54:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by gysgtwarren: I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid. Don;t feel sorry for the terroist. But indeed feel sorry for a nation that was founded upon human rights, liberty and justice for ALL that is now dead.", 
        "intTime": 20090317, 
        "postID": 28, 
        "quote": "Originally posted by gysgtwarren: I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid.", 
        "reply": " Don;t feel sorry for the terroist. But indeed feel sorry for a nation that was founded upon human rights, liberty and justice for ALL that is now dead.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 16:59:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. There are some people that will screem if we are accused of torture guilty or not. These same people seem never to be concerned if our prople are being tortured!", 
        "intTime": 20090317, 
        "postID": 29, 
        "quote": "Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "reply": " There are some people that will screem if we are accused of torture guilty or not. These same people seem never to be concerned if our prople are being tortured!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 17:30:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. There are some people that will screem if we are accused of torture guilty or not. These same people seem never to be concerned if our prople are being tortured! I hope you are not implying that I am in that category of people (which is how I am reading your post). I am very concerned when our soldiers are captured that they will be tortured (especially since I am an active soldier who has deployed and will deploy again). Again, this is why the terrorists are the bad guys. Also, I stated that I would not accept this report as valid unless there is additional information. My point was simply that our soldiers being tortured does not justify us torturing the enemy. SCOUTS OUT!", 
        "intTime": 20090317, 
        "postID": 30, 
        "quote": "Originally posted by EAG154: quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. There are some people that will screem if we are accused of torture guilty or not. These same people seem never to be concerned if our prople are being tortured!", 
        "reply": " I hope you are not implying that I am in that category of people (which is how I am reading your post). I am very concerned when our soldiers are captured that they will be tortured (especially since I am an active soldier who has deployed and will deploy again). Again, this is why the terrorists are the bad guys. Also, I stated that I would not accept this report as valid unless there is additional information. My point was simply that our soldiers being tortured does not justify us torturing the enemy. SCOUTS OUT!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 18:30:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RCcav"
    }, 
    {
        "content": "I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid.", 
        "intTime": 20090317, 
        "postID": 31, 
        "quote": "", 
        "reply": "I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:12:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "gysgtwarren"
    }, 
    {
        "content": "By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don", 
        "intTime": 20090317, 
        "postID": 32, 
        "quote": "", 
        "reply": "By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:23:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "The Red Cross holds no credibility with me. Especially after what they did with the money they got for the victim's families on 9/11.", 
        "intTime": 20090317, 
        "postID": 33, 
        "quote": "", 
        "reply": "The Red Cross holds no credibility with me. Especially after what they did with the money they got for the victim's families on 9/11.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:26:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "This is a typical democrat miss-information campaign. Pure BS which has zero cred.", 
        "intTime": 20090317, 
        "postID": 34, 
        "quote": "", 
        "reply": "This is a typical democrat miss-information campaign. Pure BS which has zero cred.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:47:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "2571722"
    }, 
    {
        "content": "Anybody have a reference for this report? It DOESN'T come from the IRC - they never released a report, or, they claim, leaked it. So is this another Claghorn B. Leghorn exercise in concentrated BS, or what? \"Creds\" for the stoopid?", 
        "intTime": 20090317, 
        "postID": 35, 
        "quote": "", 
        "reply": "Anybody have a reference for this report? It DOESN'T come from the IRC - they never released a report, or, they claim, leaked it. So is this another Claghorn B. Leghorn exercise in concentrated BS, or what? \"Creds\" for the stoopid?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:54:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "popsiq"
    }, 
    {
        "content": "The allegations of ill-treatment of the detainees indicate that, in many cases, the ill-treatment to which they were subjected while held in the CIA program, either singly or in combination, constituted torture. In addition, many other elements of the ill-treatment, either singly or in combination, constituted cruel, inhuman or degrading treatment,\" states the report, according to Danner. A leaked 2003 ICRC report said that prisoners in U.S. custody in Iraq had been abused in ways that in some cases was tantamount to torture. Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this?", 
        "intTime": 20090317, 
        "postID": 36, 
        "quote": "", 
        "reply": "The allegations of ill-treatment of the detainees indicate that, in many cases, the ill-treatment to which they were subjected while held in the CIA program, either singly or in combination, constituted torture. In addition, many other elements of the ill-treatment, either singly or in combination, constituted cruel, inhuman or degrading treatment,\" states the report, according to Danner. A leaked 2003 ICRC report said that prisoners in U.S. custody in Iraq had been abused in ways that in some cases was tantamount to torture. Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:55:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "USSoldier1"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Anybody have a reference for this report? It DOESN'T come from the IRC - they never released a report, or, they claim, leaked it. So is this another Claghorn B. Leghorn exercise in concentrated BS, or what? \"Creds\" for the stoopid? ICRC officials would not confirm details of the report to The Associated Press and denied leaking it. \"We regret that information attributed to the ICRC has been made public. We share our observations and concerns related to U.S. detentions as part of the confidential dialogue we maintain with U.S. authorities and so we do not wish to comment on the substance of the article,\" said Simon Schorno, a spokesman for the Geneva headquarters of the International Committee of the Red Cross. +http://www.google.com/hostednews/ap/article/ALeqM5iPW0cuXBLSFZGuQtSV_0yX_xsGwwD96V9KG80", 
        "intTime": 20090317, 
        "postID": 37, 
        "quote": "Originally posted by popsiq: Anybody have a reference for this report? It DOESN'T come from the IRC - they never released a report, or, they claim, leaked it. So is this another Claghorn B. Leghorn exercise in concentrated BS, or what? \"Creds\" for the stoopid?", 
        "reply": " ICRC officials would not confirm details of the report to The Associated Press and denied leaking it. \"We regret that information attributed to the ICRC has been made public. We share our observations and concerns related to U.S. detentions as part of the confidential dialogue we maintain with U.S. authorities and so we do not wish to comment on the substance of the article,\" said Simon Schorno, a spokesman for the Geneva headquarters of the International Committee of the Red Cross. +http://www.google.com/hostednews/ap/article/ALeqM5iPW0cuXBLSFZGuQtSV_0yX_xsGwwD96V9KG80", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 06:57:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Knele"
    }, 
    {
        "content": "Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "intTime": 20090317, 
        "postID": 38, 
        "quote": "", 
        "reply": "Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 07:40:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave", 
        "intTime": 20090317, 
        "postID": 39, 
        "quote": "Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "reply": " Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 07:54:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by gysgtwarren: I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid. You have noticed that several of these \"SUSPECTS\" turned out to have NOTHING to do with ANY terrorist organization BEFORE they were picked up and tortured haven't you?", 
        "intTime": 20090317, 
        "postID": 40, 
        "quote": "Originally posted by gysgtwarren: I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid.", 
        "reply": " You have noticed that several of these \"SUSPECTS\" turned out to have NOTHING to do with ANY terrorist organization BEFORE they were picked up and tortured haven't you?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:00:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT!", 
        "intTime": 20090317, 
        "postID": 41, 
        "quote": "Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don", 
        "reply": " quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:05:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RCcav"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave I think torture is torture, nail pulling, fingers chocked, hung upside down and beat with a bat. Not: loud music, cold/hot, humiliation and yes water boarding. As far as America in the past. Yeh tarring and feathering someone wasnt kinder treatment.", 
        "intTime": 20090317, 
        "postID": 42, 
        "quote": "Originally posted by Grachus: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave", 
        "reply": " I think torture is torture, nail pulling, fingers chocked, hung upside down and beat with a bat. Not: loud music, cold/hot, humiliation and yes water boarding. As far as America in the past. Yeh tarring and feathering someone wasnt kinder treatment.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:07:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke What Mr. Obama has done is changed the reason to hold terrorist to conform with US Law (including ratified treaties) and international law but they can still be held. The 'Enemy Combatant' status advocated by the Bush Admin stated that the US President (admin) could declare ANYONE (including US citzens and legal US residents in the US) as an 'Enemy Combatant' and they then had NO rights and could be held forever with NO way to challenge their status. Do you really want Mr. Obama to have the power to put anyone in jail forever with no legal recourse just on his admins decision?", 
        "intTime": 20090317, 
        "postID": 43, 
        "quote": "Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "reply": " What Mr. Obama has done is changed the reason to hold terrorist to conform with US Law (including ratified treaties) and international law but they can still be held. The 'Enemy Combatant' status advocated by the Bush Admin stated that the US President (admin) could declare ANYONE (including US citzens and legal US residents in the US) as an 'Enemy Combatant' and they then had NO rights and could be held forever with NO way to challenge their status. Do you really want Mr. Obama to have the power to put anyone in jail forever with no legal recourse just on his admins decision?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:07:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke What Mr. Obama has done is changed the reason to hold terrorist to conform with US Law (including ratified treaties) and international law but they can still be held. The 'Enemy Combatant' status advocated by the Bush Admin stated that the US President (admin) could declare ANYONE (including US citzens and legal US residents in the US) as an 'Enemy Combatant' and they then had NO rights and could be held forever with NO way to challenge their status. Do you really want Mr. Obama to have the power to put anyone in jail forever with no legal recourse just on his admins decision? Very rarely do we see eye to eye, but I agree with you 100% on this. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090317, 
        "postID": 44, 
        "quote": "Originally posted by rayld2: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke What Mr. Obama has done is changed the reason to hold terrorist to conform with US Law (including ratified treaties) and international law but they can still be held. The 'Enemy Combatant' status advocated by the Bush Admin stated that the US President (admin) could declare ANYONE (including US citzens and legal US residents in the US) as an 'Enemy Combatant' and they then had NO rights and could be held forever with NO way to challenge their status. Do you really want Mr. Obama to have the power to put anyone in jail forever with no legal recourse just on his admins decision?", 
        "reply": " Very rarely do we see eye to eye, but I agree with you 100% on this. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 08:23:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "L0A1"
    }, 
    {
        "content": "The ARC should be listened to like a priest who listens to confessions. In one ear and out the other.", 
        "intTime": 20090317, 
        "postID": 45, 
        "quote": "", 
        "reply": "The ARC should be listened to like a priest who listens to confessions. In one ear and out the other.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 09:25:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RonaldMoraca"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke probably call them Obama suporters, the Obama brigades, friends of the Obama campaign, death to infidels, 16 virgin wankers, and head loppers!", 
        "intTime": 20090317, 
        "postID": 46, 
        "quote": "Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke", 
        "reply": " probably call them Obama suporters, the Obama brigades, friends of the Obama campaign, death to infidels, 16 virgin wankers, and head loppers!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 09:27:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke probably call them Obama suporters, the Obama brigades, friends of the Obama campaign, death to infidels, 16 virgin wankers, and head loppers! OK, so now the Red Cross are socialists, communists, terrorists...etc. Don't you guys ever get tired of demonizing people who disagree with you? Sorry, stupid question, of course not. If it weren't for fear and hate the far right would have nothing. Just look at your leadership, or lack there of. The best your leadership can do is say \"no\" and \"be very afraid\". Not a single rational suggestion.", 
        "intTime": 20090317, 
        "postID": 47, 
        "quote": "Originally posted by EAG154: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke probably call them Obama suporters, the Obama brigades, friends of the Obama campaign, death to infidels, 16 virgin wankers, and head loppers!", 
        "reply": " OK, so now the Red Cross are socialists, communists, terrorists...etc. Don't you guys ever get tired of demonizing people who disagree with you? Sorry, stupid question, of course not. If it weren't for fear and hate the far right would have nothing. Just look at your leadership, or lack there of. The best your leadership can do is say \"no\" and \"be very afraid\". Not a single rational suggestion.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 09:40:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "intTime": 20090317, 
        "postID": 48, 
        "quote": "Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT!", 
        "reply": " Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 10:45:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "USSoldier1"
    }, 
    {
        "content": "quote: Originally posted by USSoldier1: Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. Do you need somebody to point out that terrorists are bad?", 
        "intTime": 20090317, 
        "postID": 49, 
        "quote": "Originally posted by USSoldier1: Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "reply": " Do you need somebody to point out that terrorists are bad?", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 10:50:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. That's why we're the good guys...we question our government's questionable acts.", 
        "intTime": 20090317, 
        "postID": 50, 
        "quote": "Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "reply": " That's why we're the good guys...we question our government's questionable acts.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 11:42:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. I think the outcry is present everyday - when it gets reported in the news that someone blew up a bunch of civilians, or the terrorists cut off someone's head. Doesn't the whole \"War on Terrorism\" equate to an outcry over what the terrorists are doing? I hate to agree with Knele, but doesn't the name terrorist indicate that we don't accept their methods? Of course there is going to be a significant outcry when we do something wrong. That comes with being 1) the aggressor, and 2) the party that claims to be on the side of righteousness. While I hate to see a soldier get dragged through the mud for some wrongdoing, or perceived wrongdoing, it is a necessary step to show that we do stand for righteousness and we can police ourselves. I always hope the soldier will be vindicated, but that is not always going to happen. We all know that soldiers are human and sometimes do things that require punishment. In those cases, we just have to hope the powers that be take into account the stress that we put on our soldiers every day and the situation in which they find themselves. Again, I am not digging on you as a person. I am just stating that when you present the \"but they do it to us\" argument, it appears that you are using that to justify us torturing the enemy even if that was not your intention. SCOUTS OUT!", 
        "intTime": 20090317, 
        "postID": 51, 
        "quote": "Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "reply": " I think the outcry is present everyday - when it gets reported in the news that someone blew up a bunch of civilians, or the terrorists cut off someone's head. Doesn't the whole \"War on Terrorism\" equate to an outcry over what the terrorists are doing? I hate to agree with Knele, but doesn't the name terrorist indicate that we don't accept their methods? Of course there is going to be a significant outcry when we do something wrong. That comes with being 1) the aggressor, and 2) the party that claims to be on the side of righteousness. While I hate to see a soldier get dragged through the mud for some wrongdoing, or perceived wrongdoing, it is a necessary step to show that we do stand for righteousness and we can police ourselves. I always hope the soldier will be vindicated, but that is not always going to happen. We all know that soldiers are human and sometimes do things that require punishment. In those cases, we just have to hope the powers that be take into account the stress that we put on our soldiers every day and the situation in which they find themselves. Again, I am not digging on you as a person. I am just stating that when you present the \"but they do it to us\" argument, it appears that you are using that to justify us torturing the enemy even if that was not your intention. SCOUTS OUT!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 11:51:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RCcav"
    }, 
    {
        "content": "quote: Originally posted by RonaldMoraca: The ARC should be listened to like a priest who listens to confessions. In one ear and out the other. Is that how they do that? Geez, another education! Thx! That was the I(nternational) RC not the A(merican) RC - which is too busy collecting money to be concerned with much else.", 
        "intTime": 20090317, 
        "postID": 52, 
        "quote": "Originally posted by RonaldMoraca: The ARC should be listened to like a priest who listens to confessions. In one ear and out the other.", 
        "reply": " Is that how they do that? Geez, another education! Thx! That was the I(nternational) RC not the A(merican) RC - which is too busy collecting money to be concerned with much else.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 12:56:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by RCcav: quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. I think the outcry is present everyday - when it gets reported in the news that someone blew up a bunch of civilians, or the terrorists cut off someone's head. Doesn't the whole \"War on Terrorism\" equate to an outcry over what the terrorists are doing? I hate to agree with Knele, but doesn't the name terrorist indicate that we don't accept their methods? Of course there is going to be a significant outcry when we do something wrong. That comes with being 1) the aggressor, and 2) the party that claims to be on the side of righteousness. While I hate to see a soldier get dragged through the mud for some wrongdoing, or perceived wrongdoing, it is a necessary step to show that we do stand for righteousness and we can police ourselves. I always hope the soldier will be vindicated, but that is not always going to happen. We all know that soldiers are human and sometimes do things that require punishment. In those cases, we just have to hope the powers that be take into account the stress that we put on our soldiers every day and the situation in which they find themselves. Again, I am not digging on you as a person. I am just stating that when you present the \"but they do it to us\" argument, it appears that you are using that to justify us torturing the enemy even if that was not your intention. SCOUTS OUT! What you call it is what you call it. The IRC and some other misguided types, call it 'torture'. To the last administration and the guys who were doing it, it was 'enhanced interrogation'. Little more than a frat house hazing for pete's sake! Compared to sawing off somebody's head with a bread knife or burning your lips trying to blow up a bus full of kindergarten kids.", 
        "intTime": 20090317, 
        "postID": 53, 
        "quote": "Originally posted by RCcav: quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. I think the outcry is present everyday - when it gets reported in the news that someone blew up a bunch of civilians, or the terrorists cut off someone's head. Doesn't the whole \"War on Terrorism\" equate to an outcry over what the terrorists are doing? I hate to agree with Knele, but doesn't the name terrorist indicate that we don't accept their methods? Of course there is going to be a significant outcry when we do something wrong. That comes with being 1) the aggressor, and 2) the party that claims to be on the side of righteousness. While I hate to see a soldier get dragged through the mud for some wrongdoing, or perceived wrongdoing, it is a necessary step to show that we do stand for righteousness and we can police ourselves. I always hope the soldier will be vindicated, but that is not always going to happen. We all know that soldiers are human and sometimes do things that require punishment. In those cases, we just have to hope the powers that be take into account the stress that we put on our soldiers every day and the situation in which they find themselves. Again, I am not digging on you as a person. I am just stating that when you present the \"but they do it to us\" argument, it appears that you are using that to justify us torturing the enemy even if that was not your intention. SCOUTS OUT!", 
        "reply": " What you call it is what you call it. The IRC and some other misguided types, call it 'torture'. To the last administration and the guys who were doing it, it was 'enhanced interrogation'. Little more than a frat house hazing for pete's sake! Compared to sawing off somebody's head with a bread knife or burning your lips trying to blow up a bus full of kindergarten kids.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 13:01:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "popsiq"
    }, 
    {
        "content": "Don't forget, the Red Cross are the guys who send your family messages. They helped Mike Durant when he was grievously injured and captured in Mogadishu. I am better than the terrorists. Having actually fought in Iraq, I am proud to say my conduct and the conduct of my fellow soldiers was in line with the Geneva Conventions (and that includes how we handled people we detained). A sure sign that you are on a slippery slope is when you start splitting hairs over torture. The North Vietnamese tortured our POW's in numerous ways and some of that included extreme isolation. If you don't think isolation, extreme hot and cold temperatures, and water boarding are torture; you probably just don't want to think about those things too deeply. Torture is more than pulling fingernails, prolonged mental torture is just as damaging. If these things truly are \"little more than frat house hazing\", then what purpose did they actually serve? You cannot split hairs over the law. It is written in black and white. In basic training I was taught that we didn't torture people because it was against everything we stood for, and because it invited reprisals. Now I know that terrorists don't respect the law. But we do, and some day, a future enemy is going to use Gitmo and Abu Ghraib as justification for their own torture programs. People often say \"Terrorists are evil, they don't respect the laws, so why should we?\" Well if you believe that, the flipside is also true. We can't very well hold anyone accountable for the mistreatment of our POW's if we don't treat enemy POW's any better.", 
        "intTime": 20090317, 
        "postID": 54, 
        "quote": "", 
        "reply": "Don't forget, the Red Cross are the guys who send your family messages. They helped Mike Durant when he was grievously injured and captured in Mogadishu. I am better than the terrorists. Having actually fought in Iraq, I am proud to say my conduct and the conduct of my fellow soldiers was in line with the Geneva Conventions (and that includes how we handled people we detained). A sure sign that you are on a slippery slope is when you start splitting hairs over torture. The North Vietnamese tortured our POW's in numerous ways and some of that included extreme isolation. If you don't think isolation, extreme hot and cold temperatures, and water boarding are torture; you probably just don't want to think about those things too deeply. Torture is more than pulling fingernails, prolonged mental torture is just as damaging. If these things truly are \"little more than frat house hazing\", then what purpose did they actually serve? You cannot split hairs over the law. It is written in black and white. In basic training I was taught that we didn't torture people because it was against everything we stood for, and because it invited reprisals. Now I know that terrorists don't respect the law. But we do, and some day, a future enemy is going to use Gitmo and Abu Ghraib as justification for their own torture programs. People often say \"Terrorists are evil, they don't respect the laws, so why should we?\" Well if you believe that, the flipside is also true. We can't very well hold anyone accountable for the mistreatment of our POW's if we don't treat enemy POW's any better.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 13:30:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Don't forget, the Red Cross are the guys who send your family messages. They helped Mike Durant when he was grievously injured and captured in Mogadishu. I am better than the terrorists. Having actually fought in Iraq, I am proud to say my conduct and the conduct of my fellow soldiers was in line with the Geneva Conventions (and that includes how we handled people we detained). A sure sign that you are on a slippery slope is when you start splitting hairs over torture. The North Vietnamese tortured our POW's in numerous ways and some of that included extreme isolation. If you don't think isolation, extreme hot and cold temperatures, and water boarding are torture; you probably just don't want to think about those things too deeply. Torture is more than pulling fingernails, prolonged mental torture is just as damaging. If these things truly are \"little more than frat house hazing\", then what purpose did they actually serve? You cannot split hairs over the law. It is written in black and white. In basic training I was taught that we didn't torture people because it was against everything we stood for, and because it invited reprisals. Now I know that terrorists don't respect the law. But we do, and some day, a future enemy is going to use Gitmo and Abu Ghraib as justification for their own torture programs. People often say \"Terrorists are evil, they don't respect the laws, so why should we?\" Well if you believe that, the flipside is also true. We can't very well hold anyone accountable for the mistreatment of our POW's if we don't treat enemy POW's any better. Very well stated. SCOUTS OUT!", 
        "intTime": 20090317, 
        "postID": 55, 
        "quote": "Originally posted by foxred03: Don't forget, the Red Cross are the guys who send your family messages. They helped Mike Durant when he was grievously injured and captured in Mogadishu. I am better than the terrorists. Having actually fought in Iraq, I am proud to say my conduct and the conduct of my fellow soldiers was in line with the Geneva Conventions (and that includes how we handled people we detained). A sure sign that you are on a slippery slope is when you start splitting hairs over torture. The North Vietnamese tortured our POW's in numerous ways and some of that included extreme isolation. If you don't think isolation, extreme hot and cold temperatures, and water boarding are torture; you probably just don't want to think about those things too deeply. Torture is more than pulling fingernails, prolonged mental torture is just as damaging. If these things truly are \"little more than frat house hazing\", then what purpose did they actually serve? You cannot split hairs over the law. It is written in black and white. In basic training I was taught that we didn't torture people because it was against everything we stood for, and because it invited reprisals. Now I know that terrorists don't respect the law. But we do, and some day, a future enemy is going to use Gitmo and Abu Ghraib as justification for their own torture programs. People often say \"Terrorists are evil, they don't respect the laws, so why should we?\" Well if you believe that, the flipside is also true. We can't very well hold anyone accountable for the mistreatment of our POW's if we don't treat enemy POW's any better.", 
        "reply": " Very well stated. SCOUTS OUT!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 13:52:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RCcav"
    }, 
    {
        "content": "And, who in the hell has appointed the IRC to be experts on torture let alone inspecting prison facilities. BTW ask them how our boys are kept in the terrorist confinements and if they were tortured before the remains were found. All this hue and cry began over a first visit by non-american IRC members based on what? Our Medical personnel was consulted on questioning combatants technique. I guess if we consulted their Cleric or their Mom we really would have caught hell. The reporting was confidential and the so called experts and their lawyers could say about anything they wanted without verification. Then the experts and various know it all including Durbin came out with accusations again couldn't be denied or verified. Icing on the cake when the FBI couldn't get results and the CIA took over hurting some feelings and that's when the hockey hit the fan. Now, we're back to square one and again they (Popsiq and fellow accusers) never list the dastardly deeds, just generalize how awful the Americans are. Far be it from me to say what a bunch of candy arses you are, but you are. Does saying CIA instead of FBI get browny points. No, but it got results. The report that started it all. I could give the hundred or so accusations of being tortured by murderers that had to sit in a chair, and flushing Qurans that didn't happen brought riots in lands of the non-educated, but this mamby pamby bs gets me ill at my stomach, plus shows many that believes the lies are not as advance as they are. \"http://www.nytimes.com/2004/11/30/politics/30gitmo.html?ex=1259470800&en=825f1aa04c65241f&ei=5088&partner=rssnyt", 
        "intTime": 20090317, 
        "postID": 56, 
        "quote": "", 
        "reply": "And, who in the hell has appointed the IRC to be experts on torture let alone inspecting prison facilities. BTW ask them how our boys are kept in the terrorist confinements and if they were tortured before the remains were found. All this hue and cry began over a first visit by non-american IRC members based on what? Our Medical personnel was consulted on questioning combatants technique. I guess if we consulted their Cleric or their Mom we really would have caught hell. The reporting was confidential and the so called experts and their lawyers could say about anything they wanted without verification. Then the experts and various know it all including Durbin came out with accusations again couldn't be denied or verified. Icing on the cake when the FBI couldn't get results and the CIA took over hurting some feelings and that's when the hockey hit the fan. Now, we're back to square one and again they (Popsiq and fellow accusers) never list the dastardly deeds, just generalize how awful the Americans are. Far be it from me to say what a bunch of candy arses you are, but you are. Does saying CIA instead of FBI get browny points. No, but it got results. The report that started it all. I could give the hundred or so accusations of being tortured by murderers that had to sit in a chair, and flushing Qurans that didn't happen brought riots in lands of the non-educated, but this mamby pamby bs gets me ill at my stomach, plus shows many that believes the lies are not as advance as they are. \"http://www.nytimes.com/2004/11/30/politics/30gitmo.html?ex=1259470800&en=825f1aa04c65241f&ei=5088&partner=rssnyt", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 16:44:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave I think torture is torture, nail pulling, fingers chocked, hung upside down and beat with a bat. Not: loud music, cold/hot, humiliation and yes water boarding. As far as America in the past. Yeh tarring and feathering someone wasnt kinder treatment. COMMENT: You do recall that Mr. McCain -- who was waterboarded -- emphatically declared during his candidacy as the Republican presidential nominee that waterboarding is torture.", 
        "intTime": 20090317, 
        "postID": 57, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Grachus: quote: Originally posted by GunnyRet03: Well, thank god this Adm has done away with 'Enemy Combatant' can you imagine how many feelings that hurt poor tortured souls. What to call them now??? 'Misguided Combatants'? The red cross is becoming a joke Were their reports detailing Vietnamese abuses of Americans also a joke? Democratic propaganda? Liberal left wing lies? Well, by this time it's all academic since we're defacto on record as supporting Vietnamese actions. The wonderful spectacle of Khalid Sheik Mohammad confessing to crimes he could not have possibly commited should be eddifying to everyone. We've come a long way from the day when we rejected torture out of hand... Do we really need to copy our enemies in order to beat them? This will be news to those who founded America - But I forget, they were all pansy liberals who lived in a kindler gentler age where such things were unimaginable... Dave I think torture is torture, nail pulling, fingers chocked, hung upside down and beat with a bat. Not: loud music, cold/hot, humiliation and yes water boarding. As far as America in the past. Yeh tarring and feathering someone wasnt kinder treatment.", 
        "reply": " COMMENT: You do recall that Mr. McCain -- who was waterboarded -- emphatically declared during his candidacy as the Republican presidential nominee that waterboarding is torture.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 16:54:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by gysgtwarren: I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid. Don;t feel sorry for the terroist. But indeed feel sorry for a nation that was founded upon human rights, liberty and justice for ALL that is now dead.", 
        "intTime": 20090317, 
        "postID": 58, 
        "quote": "Originally posted by gysgtwarren: I hope no one actually expects me to feel sorry for the terrorists!!! Terrorists are being terrorized and people are screaming human rights??? Now that's just stupid.", 
        "reply": " Don;t feel sorry for the terroist. But indeed feel sorry for a nation that was founded upon human rights, liberty and justice for ALL that is now dead.", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 16:59:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. There are some people that will screem if we are accused of torture guilty or not. These same people seem never to be concerned if our prople are being tortured!", 
        "intTime": 20090317, 
        "postID": 59, 
        "quote": "Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of.", 
        "reply": " There are some people that will screem if we are accused of torture guilty or not. These same people seem never to be concerned if our prople are being tortured!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 17:30:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. There are some people that will screem if we are accused of torture guilty or not. These same people seem never to be concerned if our prople are being tortured! I hope you are not implying that I am in that category of people (which is how I am reading your post). I am very concerned when our soldiers are captured that they will be tortured (especially since I am an active soldier who has deployed and will deploy again). Again, this is why the terrorists are the bad guys. Also, I stated that I would not accept this report as valid unless there is additional information. My point was simply that our soldiers being tortured does not justify us torturing the enemy. SCOUTS OUT!", 
        "intTime": 20090317, 
        "postID": 60, 
        "quote": "Originally posted by EAG154: quote: Originally posted by USSoldier1: quote: Originally posted by RCcav: quote: Originally posted by 21yrsUSCGUSCS: By chance does the Red Cross have anyone doing anything about the suicide bombers blowing up bus loads or cafes crammed with women and kids??? Don quote: Originally posted by USSoldier1: Is getting your head cut off in front of a camera tantamount to or constituted torture? Or is it just considered to be ill-treatment. How come the Red Cross isn’t concerned with this? I get so sick and tired of the \"well they do it, and worse, to us\" argument to justify why we should torture the enemy. Nothing could be further from the truth. We are the good guys because we actually follow rules (the Law of War and the Geneva Conventions). Although it might temporarily make you feel better, stooping to their level is not the way to do business. It makes us no better than they are. There are other arguments in favor of limited \"torture\" which have more merit than the above irrational argument. Even though I don't agree with those either, at least you could have an intelligent debate over them. Now, I am not placing any validity on this \"report\" until it can be seen in its entirety and the information contained therein verified. Just please do not try and justify us torturing the enemy based on the \"well they do it, and worse, to us\" argument. SCOUTS OUT! Sorry to disappoint you but I am not justifying us \"torturing\" the enemy. My point is that we (the good guys) receive all this whinnig, crying and finger pointing when we do something but when the enemy (the bad guys) do something there is no outcry as if what they did is OK. That is what I am sick and tired of. There are some people that will screem if we are accused of torture guilty or not. These same people seem never to be concerned if our prople are being tortured!", 
        "reply": " I hope you are not implying that I am in that category of people (which is how I am reading your post). I am very concerned when our soldiers are captured that they will be tortured (especially since I am an active soldier who has deployed and will deploy again). Again, this is why the terrorists are the bad guys. Also, I stated that I would not accept this report as valid unless there is additional information. My point was simply that our soldiers being tortured does not justify us torturing the enemy. SCOUTS OUT!", 
        "threadID": "409192893_3690070812001", 
        "time": "2009-03-17 18:30:00", 
        "title": "Red Cross Report: CIA Tortured Terror Suspects", 
        "userID": "RCcav"
    }
]