[
    {
        "content": "I recently had the honor and privilege of meeting several WWII veterans, one of whom fought on Iwo Jima, one of whom fought at Guadalcanal. As I listened to their stories and tales, and shared a few of my own experiences, I began to feel that military service today is somehow different than it was back then. I have been in for 7 years now, and I always try to see the best in people and in this organization. But maybe I am starting to get a bit jaded. I get so frustrated at all the privileges that have now become RIGHTS. You can't punish a knucklehead without making sure his feelings don't get hurt. You can't PT your Marines without making sure a Corpsman is present and that you have ORM'd the whole thing to death. You can't call a spade a spade without making sure that someone's feathers don't get ruffled. I have always said that there is a fine line between a bureaucrat and a public servant. I think many of today's \"professional soldiers\" are much closer to the bureaucrat side of the house. The men and women of WWI and WWII (and Korea and Vietnam to a great extent too) understood the value of sacrifice, and what it meant to be a servant. They didn't do it for the pay, the benefits, the privileges, or the glory. They did it because it had to be done and done well. I try to PME my young troops by teaching them about their Marine ancestors. Hopefully, one or two of them will \"get it\". [/Soap Box] \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "I recently had the honor and privilege of meeting several WWII veterans, one of whom fought on Iwo Jima, one of whom fought at Guadalcanal. As I listened to their stories and tales, and shared a few of my own experiences, I began to feel that military service today is somehow different than it was back then. I have been in for 7 years now, and I always try to see the best in people and in this organization. But maybe I am starting to get a bit jaded. I get so frustrated at all the privileges that have now become RIGHTS. You can't punish a knucklehead without making sure his feelings don't get hurt. You can't PT your Marines without making sure a Corpsman is present and that you have ORM'd the whole thing to death. You can't call a spade a spade without making sure that someone's feathers don't get ruffled. I have always said that there is a fine line between a bureaucrat and a public servant. I think many of today's \"professional soldiers\" are much closer to the bureaucrat side of the house. The men and women of WWI and WWII (and Korea and Vietnam to a great extent too) understood the value of sacrifice, and what it meant to be a servant. They didn't do it for the pay, the benefits, the privileges, or the glory. They did it because it had to be done and done well. I try to PME my young troops by teaching them about their Marine ancestors. Hopefully, one or two of them will \"get it\". [/Soap Box] \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 05:18:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: I recently had the honor and privilege of meeting several WWII veterans, one of whom fought on Iwo Jima, one of whom fought at Guadalcanal. As I listened to their stories and tales, and shared a few of my own experiences, I began to feel that military service today is somehow different than it was back then. I have been in for 7 years now, and I always try to see the best in people and in this organization. But maybe I am starting to get a bit jaded. I get so frustrated at all the privileges that have now become RIGHTS. You can't punish a knucklehead without making sure his feelings don't get hurt. You can't PT your Marines without making sure a Corpsman is present and that you have ORM'd the whole thing to death. You can't call a spade a spade without making sure that someone's feathers don't get ruffled. I have always said that there is a fine line between a bureaucrat and a public servant. I think many of today's \"professional soldiers\" are much closer to the bureaucrat side of the house. The men and women of WWI and WWII (and Korea and Vietnam to a great extent too) understood the value of sacrifice, and what it meant to be a servant. They didn't do it for the pay, the benefits, the privileges, or the glory. They did it because it had to be done and done well. I try to PME my young troops by teaching them about their Marine ancestors. Hopefully, one or two of them will \"get it\". [/Soap Box] The people that fought in the previous wars you mention had no choice but to join and fight. The people of today are all volunteers. Getting people to volunteer requires incentives and different treatment than drafting people. I think the issues you mentioned are directly related to an all volunteer force and the desire to make the military an attractive option for people.", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "Originally posted by QuanticoBornMarine: I recently had the honor and privilege of meeting several WWII veterans, one of whom fought on Iwo Jima, one of whom fought at Guadalcanal. As I listened to their stories and tales, and shared a few of my own experiences, I began to feel that military service today is somehow different than it was back then. I have been in for 7 years now, and I always try to see the best in people and in this organization. But maybe I am starting to get a bit jaded. I get so frustrated at all the privileges that have now become RIGHTS. You can't punish a knucklehead without making sure his feelings don't get hurt. You can't PT your Marines without making sure a Corpsman is present and that you have ORM'd the whole thing to death. You can't call a spade a spade without making sure that someone's feathers don't get ruffled. I have always said that there is a fine line between a bureaucrat and a public servant. I think many of today's \"professional soldiers\" are much closer to the bureaucrat side of the house. The men and women of WWI and WWII (and Korea and Vietnam to a great extent too) understood the value of sacrifice, and what it meant to be a servant. They didn't do it for the pay, the benefits, the privileges, or the glory. They did it because it had to be done and done well. I try to PME my young troops by teaching them about their Marine ancestors. Hopefully, one or two of them will \"get it\". [/Soap Box]", 
        "reply": " The people that fought in the previous wars you mention had no choice but to join and fight. The people of today are all volunteers. Getting people to volunteer requires incentives and different treatment than drafting people. I think the issues you mentioned are directly related to an all volunteer force and the desire to make the military an attractive option for people.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 05:53:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now.", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "", 
        "reply": "How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:13:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Weps, I understand that, but what ever happened to serving for the sake of serving? What has happened to the American sense of civic duty? Granted, I was thrilled to learn of all the little perks and benefits that come with government service, but I don't truly need any of it. I sometimes have to shake my head when I hear all this talk of our \"warrior ethos\" and how we are modern day Spartans or Centurions. *sigh* I suppose I have to accept it. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "", 
        "reply": "Weps, I understand that, but what ever happened to serving for the sake of serving? What has happened to the American sense of civic duty? Granted, I was thrilled to learn of all the little perks and benefits that come with government service, but I don't truly need any of it. I sometimes have to shake my head when I hear all this talk of our \"warrior ethos\" and how we are modern day Spartans or Centurions. *sigh* I suppose I have to accept it. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:15:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: Weps, I understand that, but what ever happened to serving for the sake of serving? What has happened to the American sense of civic duty? Granted, I was thrilled to learn of all the little perks and benefits that come with government service, but I don't truly need any of it. I sometimes have to shake my head when I hear all this talk of our \"warrior ethos\" and how we are modern day Spartans or Centurions. *sigh* I suppose I have to accept it. What evidence do you have that the majority of people that were drafted and fought in previous wars did it for patriotic reasons or a sence of \"civic duty\"? Could be they had no choice. There are still some folks joining the military for patriotic reasons rather than just the desire to have a job and enjoy the benefits. I would say job security, incentives and training are the main reasons people join though. Patriotism is further done the list.", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "Originally posted by QuanticoBornMarine: Weps, I understand that, but what ever happened to serving for the sake of serving? What has happened to the American sense of civic duty? Granted, I was thrilled to learn of all the little perks and benefits that come with government service, but I don't truly need any of it. I sometimes have to shake my head when I hear all this talk of our \"warrior ethos\" and how we are modern day Spartans or Centurions. *sigh* I suppose I have to accept it.", 
        "reply": " What evidence do you have that the majority of people that were drafted and fought in previous wars did it for patriotic reasons or a sence of \"civic duty\"? Could be they had no choice. There are still some folks joining the military for patriotic reasons rather than just the desire to have a job and enjoy the benefits. I would say job security, incentives and training are the main reasons people join though. Patriotism is further done the list.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:21:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now. Of course war is not attractive. Very few join for the \"lure of battle\". I serve because I believe it is honorable to do so. The day I feel that my government makes it impossible for me to serve with honor, I will drop papers. I just don't understand people like 1LT Watada, who \"volunteered\" for military service, and then refuses to deploy because, as he claims, he was duped into service by his recruiter with promises of free college education and GI Bill benefits. What a disgrace. Those who know me personally know my disdain for the many young (i.e. in their late teens early twenties) Marines I see daily who are so out of shape, they have to have a chit from medical in order to PT. They get a sprained ankle and they're out for weeks. They sit behind the desk downing sodas and fast food (the only food available on base don't get me started on that one) and wonder why they haven't recovered and have gained 10 lbs in the process. I'm not asking for Terminators or PT machines, I'm just wondering aloud why we do this to ourselves. I am grateful for their service, but I don't feel that the American public owes us anything special. I feel weird when people thank me for my service. I have it sooooo easy. Go to a nursing home or the local VFW and thank those guys. They made real sacrifices for us. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 6, 
        "quote": "Originally posted by SignalSgtWilliams: How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now.", 
        "reply": " Of course war is not attractive. Very few join for the \"lure of battle\". I serve because I believe it is honorable to do so. The day I feel that my government makes it impossible for me to serve with honor, I will drop papers. I just don't understand people like 1LT Watada, who \"volunteered\" for military service, and then refuses to deploy because, as he claims, he was duped into service by his recruiter with promises of free college education and GI Bill benefits. What a disgrace. Those who know me personally know my disdain for the many young (i.e. in their late teens early twenties) Marines I see daily who are so out of shape, they have to have a chit from medical in order to PT. They get a sprained ankle and they're out for weeks. They sit behind the desk downing sodas and fast food (the only food available on base don't get me started on that one) and wonder why they haven't recovered and have gained 10 lbs in the process. I'm not asking for Terminators or PT machines, I'm just wondering aloud why we do this to ourselves. I am grateful for their service, but I don't feel that the American public owes us anything special. I feel weird when people thank me for my service. I have it sooooo easy. Go to a nursing home or the local VFW and thank those guys. They made real sacrifices for us. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:25:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "I'm not sure the urge to serve has ever been all that great in this country, at least not to the extent your post suggests. Look back at our history and you'll find very, very few people who volunteered for military service for that reason and that was often a family matter. Some families provide huge numbers of soldiers, some never do, and most only during a time of extreme crisis, such as the Civil War or WWII. Every major conflict we ever fought required our citizens to be compelled to serve, except for this one. Typically, there was a surge of voluntary enlistments at the beginning, but that rapidly tapered off and a draft became necessary. Even then, men went to extreme lengths to avoid being drafted. In periods of our history when there was no draft, enlistees were typically on the run from the law and hiding out in the service. The latter day Indian wars, for instance, were almost exclusively fought by the dregs of society who were either forced into the Army or running from something. Even as far back as the War of 1812, we had militia troops who flat refused to follow Winfield Scott into Canada because that wasn't what they signed up to do. And, nobody made them go either! In the Revolution, Washington had trouble keeping his Army manned because when their enlistment was up, they tended to go home. The bottom line is this: Don't judge American soldiers by today's standards. The modern version of the all volunteer force is unique in our history and probably doomed to failure for the very reason that, as in all things American, we do what suits us best, personally, and service to our fellow man isn't, and never has been, a high priority for most of us.", 
        "intTime": 20090511, 
        "postID": 7, 
        "quote": "", 
        "reply": "I'm not sure the urge to serve has ever been all that great in this country, at least not to the extent your post suggests. Look back at our history and you'll find very, very few people who volunteered for military service for that reason and that was often a family matter. Some families provide huge numbers of soldiers, some never do, and most only during a time of extreme crisis, such as the Civil War or WWII. Every major conflict we ever fought required our citizens to be compelled to serve, except for this one. Typically, there was a surge of voluntary enlistments at the beginning, but that rapidly tapered off and a draft became necessary. Even then, men went to extreme lengths to avoid being drafted. In periods of our history when there was no draft, enlistees were typically on the run from the law and hiding out in the service. The latter day Indian wars, for instance, were almost exclusively fought by the dregs of society who were either forced into the Army or running from something. Even as far back as the War of 1812, we had militia troops who flat refused to follow Winfield Scott into Canada because that wasn't what they signed up to do. And, nobody made them go either! In the Revolution, Washington had trouble keeping his Army manned because when their enlistment was up, they tended to go home. The bottom line is this: Don't judge American soldiers by today's standards. The modern version of the all volunteer force is unique in our history and probably doomed to failure for the very reason that, as in all things American, we do what suits us best, personally, and service to our fellow man isn't, and never has been, a high priority for most of us.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:45:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: quote: Originally posted by SignalSgtWilliams: How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now. Of course war is not attractive. Very few join for the \"lure of battle\". I serve because I believe it is honorable to do so. The day I feel that my government makes it impossible for me to serve with honor, I will drop papers. I just don't understand people like 1LT Watada, who \"volunteered\" for military service, and then refuses to deploy because, as he claims, he was duped into service by his recruiter with promises of free college education and GI Bill benefits. What a disgrace. Those who know me personally know my disdain for the many young (i.e. in their late teens early twenties) Marines I see daily who are so out of shape, they have to have a chit from medical in order to PT. They get a sprained ankle and they're out for weeks. They sit behind the desk downing sodas and fast food (the only food available on base don't get me started on that one) and wonder why they haven't recovered and have gained 10 lbs in the process. I'm not asking for Terminators or PT machines, I'm just wondering aloud why we do this to ourselves. I am grateful for their service, but I don't feel that the American public owes us anything special. I feel weird when people thank me for my service. I have it sooooo easy. Go to a nursing home or the local VFW and thank those guys. They made real sacrifices for us. Just because you don't characterize your service as \"sacrifice\", don't lump the rest of us in that category. The members of the service represent the general public. The general public seems to have a problem with excessive weight so I would expect a percentage of those in the military to have the same issues. As a leader, the fat people that can't pass the physical performance criteria or maintain themselves within weight standards are a pain in the butt. But I, like you, applaud them for joining. Most Americans, you know, the real patriotic ones, just don't have the time to join and serve their country. Some of the more \"patriotic ones\" find themselves on these boards or with lucrative radio shows telling us serving how things are.", 
        "intTime": 20090511, 
        "postID": 8, 
        "quote": "Originally posted by QuanticoBornMarine: quote: Originally posted by SignalSgtWilliams: How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now. Of course war is not attractive. Very few join for the \"lure of battle\". I serve because I believe it is honorable to do so. The day I feel that my government makes it impossible for me to serve with honor, I will drop papers. I just don't understand people like 1LT Watada, who \"volunteered\" for military service, and then refuses to deploy because, as he claims, he was duped into service by his recruiter with promises of free college education and GI Bill benefits. What a disgrace. Those who know me personally know my disdain for the many young (i.e. in their late teens early twenties) Marines I see daily who are so out of shape, they have to have a chit from medical in order to PT. They get a sprained ankle and they're out for weeks. They sit behind the desk downing sodas and fast food (the only food available on base don't get me started on that one) and wonder why they haven't recovered and have gained 10 lbs in the process. I'm not asking for Terminators or PT machines, I'm just wondering aloud why we do this to ourselves. I am grateful for their service, but I don't feel that the American public owes us anything special. I feel weird when people thank me for my service. I have it sooooo easy. Go to a nursing home or the local VFW and thank those guys. They made real sacrifices for us.", 
        "reply": " Just because you don't characterize your service as \"sacrifice\", don't lump the rest of us in that category. The members of the service represent the general public. The general public seems to have a problem with excessive weight so I would expect a percentage of those in the military to have the same issues. As a leader, the fat people that can't pass the physical performance criteria or maintain themselves within weight standards are a pain in the butt. But I, like you, applaud them for joining. Most Americans, you know, the real patriotic ones, just don't have the time to join and serve their country. Some of the more \"patriotic ones\" find themselves on these boards or with lucrative radio shows telling us serving how things are.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:49:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "I should clarify that my beef is not so much with the individual servicemember, but more with the system that creates a sense of entitlement and perpetuates the problem. I don't think the military should mirror society as much as it does. We should be different. I do think that aspects of my service demand sacrifice. Being away from my loved ones for 10 months, exposed to danger, was certainly sacrifice. But I also understand that I reaped some nice rewards for that sacrifice. When I hear stories about people going without butter, silk, oil, etc during WWII for the benefit of the nation, compared with some today who can't live without cable and cell phones, I don't know what to think. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 9, 
        "quote": "", 
        "reply": "I should clarify that my beef is not so much with the individual servicemember, but more with the system that creates a sense of entitlement and perpetuates the problem. I don't think the military should mirror society as much as it does. We should be different. I do think that aspects of my service demand sacrifice. Being away from my loved ones for 10 months, exposed to danger, was certainly sacrifice. But I also understand that I reaped some nice rewards for that sacrifice. When I hear stories about people going without butter, silk, oil, etc during WWII for the benefit of the nation, compared with some today who can't live without cable and cell phones, I don't know what to think. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 07:08:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "I'm curious. Just what do you feel will improve with a draft? Keep in mind, the practical differences between the draft and the all volunteer force disappear after E-5 and in the Officer Corps. The leadership ranks have nearly always been 'voluntary' service, except in rare cases of rapid expansion. Mainly because there is no such thing as 'involuntary leadership'. Sullivan013", 
        "intTime": 20090511, 
        "postID": 10, 
        "quote": "", 
        "reply": "I'm curious. Just what do you feel will improve with a draft? Keep in mind, the practical differences between the draft and the all volunteer force disappear after E-5 and in the Officer Corps. The leadership ranks have nearly always been 'voluntary' service, except in rare cases of rapid expansion. Mainly because there is no such thing as 'involuntary leadership'. Sullivan013", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 07:24:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "I'm not making an argument for or against a draft. I suppose I am just questioning whether or not it would be possible to create and demand higher standards of conduct, appearance, proficiency, etc. of our servicemembers and still achieve our national security/defense mission. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 11, 
        "quote": "", 
        "reply": "I'm not making an argument for or against a draft. I suppose I am just questioning whether or not it would be possible to create and demand higher standards of conduct, appearance, proficiency, etc. of our servicemembers and still achieve our national security/defense mission. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 07:44:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: I'm not making an argument for or against a draft. I suppose I am just questioning whether or not it would be possible to create and demand higher standards of conduct, appearance, proficiency, etc. of our servicemembers and still achieve our national security/defense mission. It is possible, but it would require letting many people go to enforce the standard. With the military fighting two wars and trying to expand at the same time that is not something that is easy to do. I hear a lot of whining about the quality of Soldiers today, compared to what they were in WWII or Vietnam and I don't buy it. My father was an NCO in the Army in the early 70s, and have heard those horror stories. I have E-4s that have spent 2.5 years of 4 year enlistments in Iraq and are still stop-lossed. My entire platoon except for myself, the PSG, and a couple of the senior SSGs all enlisted after 9/11. There is a huge difference in the military now over 10 years ago, the difference is the men and women that enlist today know they are going to war.", 
        "intTime": 20090511, 
        "postID": 12, 
        "quote": "Originally posted by QuanticoBornMarine: I'm not making an argument for or against a draft. I suppose I am just questioning whether or not it would be possible to create and demand higher standards of conduct, appearance, proficiency, etc. of our servicemembers and still achieve our national security/defense mission.", 
        "reply": " It is possible, but it would require letting many people go to enforce the standard. With the military fighting two wars and trying to expand at the same time that is not something that is easy to do. I hear a lot of whining about the quality of Soldiers today, compared to what they were in WWII or Vietnam and I don't buy it. My father was an NCO in the Army in the early 70s, and have heard those horror stories. I have E-4s that have spent 2.5 years of 4 year enlistments in Iraq and are still stop-lossed. My entire platoon except for myself, the PSG, and a couple of the senior SSGs all enlisted after 9/11. There is a huge difference in the military now over 10 years ago, the difference is the men and women that enlist today know they are going to war.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 08:06:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "The Army's Ranger Regiment is where the \"old Military\" is still alive and well....", 
        "intTime": 20090511, 
        "postID": 13, 
        "quote": "", 
        "reply": "The Army's Ranger Regiment is where the \"old Military\" is still alive and well....", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 08:53:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The Army's Ranger Regiment is where the \"old Military\" is still alive and well.... YIP!!!!!!!! Thank God.........", 
        "intTime": 20090511, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: The Army's Ranger Regiment is where the \"old Military\" is still alive and well....", 
        "reply": " YIP!!!!!!!! Thank God.........", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 09:13:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder.", 
        "intTime": 20090511, 
        "postID": 15, 
        "quote": "", 
        "reply": "Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 09:16:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I don't think they were \"bashing\" us. I think they are just showing genuine (and well-deserved) pride in their service. This was never meant to be a old-timers vs. newbies thread. That's why I said today's service is \"different\". I emphasize the service and not the individual, because it all starts with the institutional culture. As a leader, I have to put my money where my mouth is and demand more of my guys. Small unit is where the rubber hits the road. That is where most of my frustration lies though. I think that our institution coddles and hand-holds a bit too much. There is not enough allowance for individual responsibility and accountability. Has anyone sat through a safety brief recently? Holy smokes. You'd think we were trying to go on a space walk instead of a weekend liberty. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 16, 
        "quote": "Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder.", 
        "reply": " I don't think they were \"bashing\" us. I think they are just showing genuine (and well-deserved) pride in their service. This was never meant to be a old-timers vs. newbies thread. That's why I said today's service is \"different\". I emphasize the service and not the individual, because it all starts with the institutional culture. As a leader, I have to put my money where my mouth is and demand more of my guys. Small unit is where the rubber hits the road. That is where most of my frustration lies though. I think that our institution coddles and hand-holds a bit too much. There is not enough allowance for individual responsibility and accountability. Has anyone sat through a safety brief recently? Holy smokes. You'd think we were trying to go on a space walk instead of a weekend liberty. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:08:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "Perhaps if you give us some more information about the nature of your unit, its mission and the quality of your comamnd structure we might get a better grasp on what you're talking about. Is this a combat unit? Combat support? Service support? How long have you been in the unit? With your unit? What are the NCO's like? Do you have their support in this? I could venture a guess by your title, but rather than assume, I thought I'd ask. Sullivan013", 
        "intTime": 20090511, 
        "postID": 17, 
        "quote": "", 
        "reply": "Perhaps if you give us some more information about the nature of your unit, its mission and the quality of your comamnd structure we might get a better grasp on what you're talking about. Is this a combat unit? Combat support? Service support? How long have you been in the unit? With your unit? What are the NCO's like? Do you have their support in this? I could venture a guess by your title, but rather than assume, I thought I'd ask. Sullivan013", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:36:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: Perhaps if you give us some more information about the nature of your unit, its mission and the quality of your comamnd structure we might get a better grasp on what you're talking about. Is this a combat unit? Combat support? Service support? How long have you been in the unit? With your unit? What are the NCO's like? Do you have their support in this? I could venture a guess by your title, but rather than assume, I thought I'd ask. Sullivan013 This is all rhetorical/hypothetical. I've seen this in the 3 units I've been with (artillery, infantry, and support). (EDIT: This may or may not come as a suprise, but the unit where I observed the least issues was the grunt Bn...strong leadership). It's not specific to a particular unit. I'm not the proverbial postal worker about to lose it or anything remotely close. Just wondering if others have similar observations. I'd be particularly interested to hear from other branches and veterans from different eras. I am willing to bet that this \"complaint\" has existed since 1776, when the Marines of 1775 complained about the boot privates they saw ruining their Marine Corps. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 18, 
        "quote": "Originally posted by sullivan013: Perhaps if you give us some more information about the nature of your unit, its mission and the quality of your comamnd structure we might get a better grasp on what you're talking about. Is this a combat unit? Combat support? Service support? How long have you been in the unit? With your unit? What are the NCO's like? Do you have their support in this? I could venture a guess by your title, but rather than assume, I thought I'd ask. Sullivan013", 
        "reply": " This is all rhetorical/hypothetical. I've seen this in the 3 units I've been with (artillery, infantry, and support). (EDIT: This may or may not come as a suprise, but the unit where I observed the least issues was the grunt Bn...strong leadership). It's not specific to a particular unit. I'm not the proverbial postal worker about to lose it or anything remotely close. Just wondering if others have similar observations. I'd be particularly interested to hear from other branches and veterans from different eras. I am willing to bet that this \"complaint\" has existed since 1776, when the Marines of 1775 complained about the boot privates they saw ruining their Marine Corps. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:44:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war.", 
        "intTime": 20090511, 
        "postID": 19, 
        "quote": "Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder.", 
        "reply": " I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:56:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Keep in mind that WW-II is beginning on the heels of the Great Depression, and opportunities are slim (college is not available for many as it is today), the nation was divided over isolationism... many facts shaped the minds and attitudes of young men then, including the draft and very heavy propaganda (very different from today.) My father jointed in 1940, he figured he'd get drafted anyhow, and he was at Pearl Harbor when it was attacked and stayed in after the war into the 1950s. When he would visit me in the 1960s in the service he noted it was a world of difference (I didn't think so, but he could see it.) For the past 15 years I have been a civilian instructor in the military. Frequently I hear the senior NCO's lament \"What's wrong with these young people today?\"... year after year. The basic difference is that people born after 1960s have little to no memory of \"authority\". It's neither good nor bad but it does 'color' the mind set of service members. Would I want us to gallop back to the 1940s mentality or the 1950s? No, those were not the \"perfect\" times and we have actually progressed. As far as noticing the difference between my service time 45+ years ago and today, I feel there is more for military members and their ability to advance themselves. Much better deal than in my days. IMHO", 
        "intTime": 20090511, 
        "postID": 20, 
        "quote": "", 
        "reply": "Keep in mind that WW-II is beginning on the heels of the Great Depression, and opportunities are slim (college is not available for many as it is today), the nation was divided over isolationism... many facts shaped the minds and attitudes of young men then, including the draft and very heavy propaganda (very different from today.) My father jointed in 1940, he figured he'd get drafted anyhow, and he was at Pearl Harbor when it was attacked and stayed in after the war into the 1950s. When he would visit me in the 1960s in the service he noted it was a world of difference (I didn't think so, but he could see it.) For the past 15 years I have been a civilian instructor in the military. Frequently I hear the senior NCO's lament \"What's wrong with these young people today?\"... year after year. The basic difference is that people born after 1960s have little to no memory of \"authority\". It's neither good nor bad but it does 'color' the mind set of service members. Would I want us to gallop back to the 1940s mentality or the 1950s? No, those were not the \"perfect\" times and we have actually progressed. As far as noticing the difference between my service time 45+ years ago and today, I feel there is more for military members and their ability to advance themselves. Much better deal than in my days. IMHO", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:57:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: The basic difference is that people born after 1960s have little to no memory of \"authority\". It's neither good nor bad but it does 'color' the mind set of service members. I concur.......... After WWI the military downsized considerable to almost nothing, after all, it was the War to end all Wars. No need of any draft now. Just before Pearl Harbor happened, the draft was active again but it didn't take the draft to fill the need. Lines were blocks long. I enjoyed the 60s but that was then and I was a part of it but now that I'm older and look back, morals, discipline and the lack of, got their roots from the 60s.", 
        "intTime": 20090511, 
        "postID": 21, 
        "quote": "Originally posted by reducetension: The basic difference is that people born after 1960s have little to no memory of \"authority\". It's neither good nor bad but it does 'color' the mind set of service members.", 
        "reply": " I concur.......... After WWI the military downsized considerable to almost nothing, after all, it was the War to end all Wars. No need of any draft now. Just before Pearl Harbor happened, the draft was active again but it didn't take the draft to fill the need. Lines were blocks long. I enjoyed the 60s but that was then and I was a part of it but now that I'm older and look back, morals, discipline and the lack of, got their roots from the 60s.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:04:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war. There is no doubt conditions have gotten easier as time goes on, but discipline is another matter. I wasn't there so I just have to go on what I have been told, but would you really say the Army in the 70s was a more disciplined force than the one today. Iraq has some decent MWR places, and we still get that combat pay except it has gone up to a whole $225 a month now.", 
        "intTime": 20090511, 
        "postID": 22, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war.", 
        "reply": " There is no doubt conditions have gotten easier as time goes on, but discipline is another matter. I wasn't there so I just have to go on what I have been told, but would you really say the Army in the 70s was a more disciplined force than the one today. Iraq has some decent MWR places, and we still get that combat pay except it has gone up to a whole $225 a month now.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:06:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I entered the U.S. Army in 1969, enlisting to avoid the draft and the 50% chance I could be involutarily put in the Marine Corps. I left active service in 1975 and entered the Army Reserves, retiring in 1995. So I can only speak to what I experienced during that period. The Army of 1995 was very different from the Army of 1969. The draft made it more racialy and regionally diverse, and it was not unusual to have some highly educated men serving their two years service (via the draft) in combat arms while the draft was in effect. When the draft ended, the Army became less Caucasian, less educated and more from either the Deep South and the Rust Belt of Ohio, Indiana, etc. The more blatant examples of racism that I has seen in 1969 started to fade away as the percentage of non-Caucasians increased, but as the percentage of Jews and Catholics decreased after the draft, anti-semitism and anti-Catholicism within the military increased. (For example, a Fundamentalist Protestant 1SG in my battalion [circa 1975] always skewed his company's duty roster so that the two Jewish enlisted in his company always seem to get duty [guard, CQ, etc.] on Friday nights so that they couldn't attend temple. But he would always ensure that the fundamentalist Protestants in his unit were never on duty Wednesday nights so that they could go with him to fundamentalist Protestant prayer meetings.) The power of the Pass was a great club that NCO's had over their enlisted men - but it was often abused. (For those who don't remember, a service member had to have a Pass to get off the Base on evenings or on weekends, and access to that Pass was controlled by your NCO or Officer.) I can't say how things have changed since I retired 13 years ago - I hope they have improved for the better. This message has been edited. Last edited by: Fightdirector, Mon 11 May 2009 11:41 AM", 
        "intTime": 20090511, 
        "postID": 23, 
        "quote": "", 
        "reply": "I entered the U.S. Army in 1969, enlisting to avoid the draft and the 50% chance I could be involutarily put in the Marine Corps. I left active service in 1975 and entered the Army Reserves, retiring in 1995. So I can only speak to what I experienced during that period. The Army of 1995 was very different from the Army of 1969. The draft made it more racialy and regionally diverse, and it was not unusual to have some highly educated men serving their two years service (via the draft) in combat arms while the draft was in effect. When the draft ended, the Army became less Caucasian, less educated and more from either the Deep South and the Rust Belt of Ohio, Indiana, etc. The more blatant examples of racism that I has seen in 1969 started to fade away as the percentage of non-Caucasians increased, but as the percentage of Jews and Catholics decreased after the draft, anti-semitism and anti-Catholicism within the military increased. (For example, a Fundamentalist Protestant 1SG in my battalion [circa 1975] always skewed his company's duty roster so that the two Jewish enlisted in his company always seem to get duty [guard, CQ, etc.] on Friday nights so that they couldn't attend temple. But he would always ensure that the fundamentalist Protestants in his unit were never on duty Wednesday nights so that they could go with him to fundamentalist Protestant prayer meetings.) The power of the Pass was a great club that NCO's had over their enlisted men - but it was often abused. (For those who don't remember, a service member had to have a Pass to get off the Base on evenings or on weekends, and access to that Pass was controlled by your NCO or Officer.) I can't say how things have changed since I retired 13 years ago - I hope they have improved for the better. This message has been edited. Last edited by: Fightdirector, Mon 11 May 2009 11:41 AM", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:21:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Interesting points from all. Hearing things from different perspective certainly helps and probably will help me ease up a bit. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 24, 
        "quote": "", 
        "reply": "Interesting points from all. Hearing things from different perspective certainly helps and probably will help me ease up a bit. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:23:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war. There is no doubt conditions have gotten easier as time goes on, but discipline is another matter. I wasn't there so I just have to go on what I have been told, but would you really say the Army in the 70s was a more disciplined force than the one today. Iraq has some decent MWR places, and we still get that combat pay except it has gone up to a whole $225 a month now. 60s was better than the 70s, the 80s was better than the 70s. I can only go on today about today from what I read on these forums and in the news and I draw my conclusions for my opinions and I must say, I'm overwhelmed with surprise that so much is getting away with, whinning and unhappiness about something that so many in the past has endured and accepted. But when I read of the heroism, the missions and extended time in combat...I see, some things will never change. I think my displeasure comes from service support units and it usually rear's it's ugly head when a NG Latrine and Laundry unit returns to the media, parades, kisses and hugs and medals galore.", 
        "intTime": 20090511, 
        "postID": 25, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war. There is no doubt conditions have gotten easier as time goes on, but discipline is another matter. I wasn't there so I just have to go on what I have been told, but would you really say the Army in the 70s was a more disciplined force than the one today. Iraq has some decent MWR places, and we still get that combat pay except it has gone up to a whole $225 a month now.", 
        "reply": " 60s was better than the 70s, the 80s was better than the 70s. I can only go on today about today from what I read on these forums and in the news and I draw my conclusions for my opinions and I must say, I'm overwhelmed with surprise that so much is getting away with, whinning and unhappiness about something that so many in the past has endured and accepted. But when I read of the heroism, the missions and extended time in combat...I see, some things will never change. I think my displeasure comes from service support units and it usually rear's it's ugly head when a NG Latrine and Laundry unit returns to the media, parades, kisses and hugs and medals galore.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:36:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I wondered about the \"new\" Army too, until I visited my son at Ft. Benning back in 1996, where he was undergoing Infantry OSUT. The first thing I noticed was that the Drill's looked just like the Drill's I had in 1969 and just like the ones I served with as a Drill in the 70's. They didn't cuss the troops like we did and abuse them, but they were training them and training them well. The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. Some were dedicated soldiers, some were lost without Mommy and some would push their boundries just as far as they could. Nothing new there; move on. The final straw occured while I was talking to my son during a break in training at his Starship. Over his shoulder, I saw the Senior Drill step out of the orderly room and put a whistle in his mouth. When he blew that thing, my son vaporized right in front of me, leaving words hanging in mid-air, and he was in formation before I knew what was happening. \"YES!\" I said to myself. That was EXACTLY what I wanted to see! Ever since then, I have no qualms or trepidations about putting the security of our country in the hands of the current generation. They are receiving excellent training and are as motivated and tough as any soldiers I've ever seen. Yeah, they may look funny off duty, with their tatoos and baggy pants, but when the time comes, they're there and doing a magnificent job.", 
        "intTime": 20090511, 
        "postID": 26, 
        "quote": "", 
        "reply": "I wondered about the \"new\" Army too, until I visited my son at Ft. Benning back in 1996, where he was undergoing Infantry OSUT. The first thing I noticed was that the Drill's looked just like the Drill's I had in 1969 and just like the ones I served with as a Drill in the 70's. They didn't cuss the troops like we did and abuse them, but they were training them and training them well. The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. Some were dedicated soldiers, some were lost without Mommy and some would push their boundries just as far as they could. Nothing new there; move on. The final straw occured while I was talking to my son during a break in training at his Starship. Over his shoulder, I saw the Senior Drill step out of the orderly room and put a whistle in his mouth. When he blew that thing, my son vaporized right in front of me, leaving words hanging in mid-air, and he was in formation before I knew what was happening. \"YES!\" I said to myself. That was EXACTLY what I wanted to see! Ever since then, I have no qualms or trepidations about putting the security of our country in the hands of the current generation. They are receiving excellent training and are as motivated and tough as any soldiers I've ever seen. Yeah, they may look funny off duty, with their tatoos and baggy pants, but when the time comes, they're there and doing a magnificent job.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 14:02:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change.", 
        "intTime": 20090511, 
        "postID": 27, 
        "quote": "Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. .", 
        "reply": " I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 14:12:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change. I laughed when I thought of it too because I've always suspected the Army has a trainee factory somewhere which only turns out about 10 basic models. In every cycle, and every generation, you see the same guys over and over: The fat kid with a red face who will never be able to do pushups; the short, wiry Hispanic kid who can do anything but take orders; the sleazy, big city con man who will swindle his whole platoon if he can and make pogey runs after midnight for a profit; the dork who cries in his bed at night and moans about how he \"just can't take it any more;\" the black kid with an attitude who's more trouble than he's worth UNTIL you make him a squad leader. The list goes on and I'm sure you can fill in the blanks.", 
        "intTime": 20090511, 
        "postID": 28, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change.", 
        "reply": " I laughed when I thought of it too because I've always suspected the Army has a trainee factory somewhere which only turns out about 10 basic models. In every cycle, and every generation, you see the same guys over and over: The fat kid with a red face who will never be able to do pushups; the short, wiry Hispanic kid who can do anything but take orders; the sleazy, big city con man who will swindle his whole platoon if he can and make pogey runs after midnight for a profit; the dork who cries in his bed at night and moans about how he \"just can't take it any more;\" the black kid with an attitude who's more trouble than he's worth UNTIL you make him a squad leader. The list goes on and I'm sure you can fill in the blanks.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 14:23:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change. I laughed when I thought of it too because I've always suspected the Army has a trainee factory somewhere which only turns out about 10 basic models. In every cycle, and every generation, you see the same guys over and over: The fat kid with a red face who will never be able to do pushups; the short, wiry Hispanic kid who can do anything but take orders; the sleazy, big city con man who will swindle his whole platoon if he can and make pogey runs after midnight for a profit; the dork who cries in his bed at night and moans about how he \"just can't take it any more;\" the black kid with an attitude who's more trouble than he's worth UNTIL you make him a squad leader. The list goes on and I'm sure you can fill in the blanks. ...and I'm sure you got to the point when drop off day arrived and they were broke down into plts and squads, you walked through your ranks and said nothing but knew who would and who would not make it without alot of extra time and training on your part. BTW...1969-2009. Happy Anniversary.", 
        "intTime": 20090511, 
        "postID": 29, 
        "quote": "Originally posted by stillkit: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change. I laughed when I thought of it too because I've always suspected the Army has a trainee factory somewhere which only turns out about 10 basic models. In every cycle, and every generation, you see the same guys over and over: The fat kid with a red face who will never be able to do pushups; the short, wiry Hispanic kid who can do anything but take orders; the sleazy, big city con man who will swindle his whole platoon if he can and make pogey runs after midnight for a profit; the dork who cries in his bed at night and moans about how he \"just can't take it any more;\" the black kid with an attitude who's more trouble than he's worth UNTIL you make him a squad leader. The list goes on and I'm sure you can fill in the blanks.", 
        "reply": " ...and I'm sure you got to the point when drop off day arrived and they were broke down into plts and squads, you walked through your ranks and said nothing but knew who would and who would not make it without alot of extra time and training on your part. BTW...1969-2009. Happy Anniversary.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 14:50:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I recently had the honor and privilege of meeting several WWII veterans, one of whom fought on Iwo Jima, one of whom fought at Guadalcanal. As I listened to their stories and tales, and shared a few of my own experiences, I began to feel that military service today is somehow different than it was back then. I have been in for 7 years now, and I always try to see the best in people and in this organization. But maybe I am starting to get a bit jaded. I get so frustrated at all the privileges that have now become RIGHTS. You can't punish a knucklehead without making sure his feelings don't get hurt. You can't PT your Marines without making sure a Corpsman is present and that you have ORM'd the whole thing to death. You can't call a spade a spade without making sure that someone's feathers don't get ruffled. I have always said that there is a fine line between a bureaucrat and a public servant. I think many of today's \"professional soldiers\" are much closer to the bureaucrat side of the house. The men and women of WWI and WWII (and Korea and Vietnam to a great extent too) understood the value of sacrifice, and what it meant to be a servant. They didn't do it for the pay, the benefits, the privileges, or the glory. They did it because it had to be done and done well. I try to PME my young troops by teaching them about their Marine ancestors. Hopefully, one or two of them will \"get it\". [/Soap Box] \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 30, 
        "quote": "", 
        "reply": "I recently had the honor and privilege of meeting several WWII veterans, one of whom fought on Iwo Jima, one of whom fought at Guadalcanal. As I listened to their stories and tales, and shared a few of my own experiences, I began to feel that military service today is somehow different than it was back then. I have been in for 7 years now, and I always try to see the best in people and in this organization. But maybe I am starting to get a bit jaded. I get so frustrated at all the privileges that have now become RIGHTS. You can't punish a knucklehead without making sure his feelings don't get hurt. You can't PT your Marines without making sure a Corpsman is present and that you have ORM'd the whole thing to death. You can't call a spade a spade without making sure that someone's feathers don't get ruffled. I have always said that there is a fine line between a bureaucrat and a public servant. I think many of today's \"professional soldiers\" are much closer to the bureaucrat side of the house. The men and women of WWI and WWII (and Korea and Vietnam to a great extent too) understood the value of sacrifice, and what it meant to be a servant. They didn't do it for the pay, the benefits, the privileges, or the glory. They did it because it had to be done and done well. I try to PME my young troops by teaching them about their Marine ancestors. Hopefully, one or two of them will \"get it\". [/Soap Box] \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 05:18:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: I recently had the honor and privilege of meeting several WWII veterans, one of whom fought on Iwo Jima, one of whom fought at Guadalcanal. As I listened to their stories and tales, and shared a few of my own experiences, I began to feel that military service today is somehow different than it was back then. I have been in for 7 years now, and I always try to see the best in people and in this organization. But maybe I am starting to get a bit jaded. I get so frustrated at all the privileges that have now become RIGHTS. You can't punish a knucklehead without making sure his feelings don't get hurt. You can't PT your Marines without making sure a Corpsman is present and that you have ORM'd the whole thing to death. You can't call a spade a spade without making sure that someone's feathers don't get ruffled. I have always said that there is a fine line between a bureaucrat and a public servant. I think many of today's \"professional soldiers\" are much closer to the bureaucrat side of the house. The men and women of WWI and WWII (and Korea and Vietnam to a great extent too) understood the value of sacrifice, and what it meant to be a servant. They didn't do it for the pay, the benefits, the privileges, or the glory. They did it because it had to be done and done well. I try to PME my young troops by teaching them about their Marine ancestors. Hopefully, one or two of them will \"get it\". [/Soap Box] The people that fought in the previous wars you mention had no choice but to join and fight. The people of today are all volunteers. Getting people to volunteer requires incentives and different treatment than drafting people. I think the issues you mentioned are directly related to an all volunteer force and the desire to make the military an attractive option for people.", 
        "intTime": 20090511, 
        "postID": 31, 
        "quote": "Originally posted by QuanticoBornMarine: I recently had the honor and privilege of meeting several WWII veterans, one of whom fought on Iwo Jima, one of whom fought at Guadalcanal. As I listened to their stories and tales, and shared a few of my own experiences, I began to feel that military service today is somehow different than it was back then. I have been in for 7 years now, and I always try to see the best in people and in this organization. But maybe I am starting to get a bit jaded. I get so frustrated at all the privileges that have now become RIGHTS. You can't punish a knucklehead without making sure his feelings don't get hurt. You can't PT your Marines without making sure a Corpsman is present and that you have ORM'd the whole thing to death. You can't call a spade a spade without making sure that someone's feathers don't get ruffled. I have always said that there is a fine line between a bureaucrat and a public servant. I think many of today's \"professional soldiers\" are much closer to the bureaucrat side of the house. The men and women of WWI and WWII (and Korea and Vietnam to a great extent too) understood the value of sacrifice, and what it meant to be a servant. They didn't do it for the pay, the benefits, the privileges, or the glory. They did it because it had to be done and done well. I try to PME my young troops by teaching them about their Marine ancestors. Hopefully, one or two of them will \"get it\". [/Soap Box]", 
        "reply": " The people that fought in the previous wars you mention had no choice but to join and fight. The people of today are all volunteers. Getting people to volunteer requires incentives and different treatment than drafting people. I think the issues you mentioned are directly related to an all volunteer force and the desire to make the military an attractive option for people.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 05:53:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now.", 
        "intTime": 20090511, 
        "postID": 32, 
        "quote": "", 
        "reply": "How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:13:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Weps, I understand that, but what ever happened to serving for the sake of serving? What has happened to the American sense of civic duty? Granted, I was thrilled to learn of all the little perks and benefits that come with government service, but I don't truly need any of it. I sometimes have to shake my head when I hear all this talk of our \"warrior ethos\" and how we are modern day Spartans or Centurions. *sigh* I suppose I have to accept it. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 33, 
        "quote": "", 
        "reply": "Weps, I understand that, but what ever happened to serving for the sake of serving? What has happened to the American sense of civic duty? Granted, I was thrilled to learn of all the little perks and benefits that come with government service, but I don't truly need any of it. I sometimes have to shake my head when I hear all this talk of our \"warrior ethos\" and how we are modern day Spartans or Centurions. *sigh* I suppose I have to accept it. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:15:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: Weps, I understand that, but what ever happened to serving for the sake of serving? What has happened to the American sense of civic duty? Granted, I was thrilled to learn of all the little perks and benefits that come with government service, but I don't truly need any of it. I sometimes have to shake my head when I hear all this talk of our \"warrior ethos\" and how we are modern day Spartans or Centurions. *sigh* I suppose I have to accept it. What evidence do you have that the majority of people that were drafted and fought in previous wars did it for patriotic reasons or a sence of \"civic duty\"? Could be they had no choice. There are still some folks joining the military for patriotic reasons rather than just the desire to have a job and enjoy the benefits. I would say job security, incentives and training are the main reasons people join though. Patriotism is further done the list.", 
        "intTime": 20090511, 
        "postID": 34, 
        "quote": "Originally posted by QuanticoBornMarine: Weps, I understand that, but what ever happened to serving for the sake of serving? What has happened to the American sense of civic duty? Granted, I was thrilled to learn of all the little perks and benefits that come with government service, but I don't truly need any of it. I sometimes have to shake my head when I hear all this talk of our \"warrior ethos\" and how we are modern day Spartans or Centurions. *sigh* I suppose I have to accept it.", 
        "reply": " What evidence do you have that the majority of people that were drafted and fought in previous wars did it for patriotic reasons or a sence of \"civic duty\"? Could be they had no choice. There are still some folks joining the military for patriotic reasons rather than just the desire to have a job and enjoy the benefits. I would say job security, incentives and training are the main reasons people join though. Patriotism is further done the list.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:21:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now. Of course war is not attractive. Very few join for the \"lure of battle\". I serve because I believe it is honorable to do so. The day I feel that my government makes it impossible for me to serve with honor, I will drop papers. I just don't understand people like 1LT Watada, who \"volunteered\" for military service, and then refuses to deploy because, as he claims, he was duped into service by his recruiter with promises of free college education and GI Bill benefits. What a disgrace. Those who know me personally know my disdain for the many young (i.e. in their late teens early twenties) Marines I see daily who are so out of shape, they have to have a chit from medical in order to PT. They get a sprained ankle and they're out for weeks. They sit behind the desk downing sodas and fast food (the only food available on base don't get me started on that one) and wonder why they haven't recovered and have gained 10 lbs in the process. I'm not asking for Terminators or PT machines, I'm just wondering aloud why we do this to ourselves. I am grateful for their service, but I don't feel that the American public owes us anything special. I feel weird when people thank me for my service. I have it sooooo easy. Go to a nursing home or the local VFW and thank those guys. They made real sacrifices for us. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 35, 
        "quote": "Originally posted by SignalSgtWilliams: How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now.", 
        "reply": " Of course war is not attractive. Very few join for the \"lure of battle\". I serve because I believe it is honorable to do so. The day I feel that my government makes it impossible for me to serve with honor, I will drop papers. I just don't understand people like 1LT Watada, who \"volunteered\" for military service, and then refuses to deploy because, as he claims, he was duped into service by his recruiter with promises of free college education and GI Bill benefits. What a disgrace. Those who know me personally know my disdain for the many young (i.e. in their late teens early twenties) Marines I see daily who are so out of shape, they have to have a chit from medical in order to PT. They get a sprained ankle and they're out for weeks. They sit behind the desk downing sodas and fast food (the only food available on base don't get me started on that one) and wonder why they haven't recovered and have gained 10 lbs in the process. I'm not asking for Terminators or PT machines, I'm just wondering aloud why we do this to ourselves. I am grateful for their service, but I don't feel that the American public owes us anything special. I feel weird when people thank me for my service. I have it sooooo easy. Go to a nursing home or the local VFW and thank those guys. They made real sacrifices for us. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:25:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "I'm not sure the urge to serve has ever been all that great in this country, at least not to the extent your post suggests. Look back at our history and you'll find very, very few people who volunteered for military service for that reason and that was often a family matter. Some families provide huge numbers of soldiers, some never do, and most only during a time of extreme crisis, such as the Civil War or WWII. Every major conflict we ever fought required our citizens to be compelled to serve, except for this one. Typically, there was a surge of voluntary enlistments at the beginning, but that rapidly tapered off and a draft became necessary. Even then, men went to extreme lengths to avoid being drafted. In periods of our history when there was no draft, enlistees were typically on the run from the law and hiding out in the service. The latter day Indian wars, for instance, were almost exclusively fought by the dregs of society who were either forced into the Army or running from something. Even as far back as the War of 1812, we had militia troops who flat refused to follow Winfield Scott into Canada because that wasn't what they signed up to do. And, nobody made them go either! In the Revolution, Washington had trouble keeping his Army manned because when their enlistment was up, they tended to go home. The bottom line is this: Don't judge American soldiers by today's standards. The modern version of the all volunteer force is unique in our history and probably doomed to failure for the very reason that, as in all things American, we do what suits us best, personally, and service to our fellow man isn't, and never has been, a high priority for most of us.", 
        "intTime": 20090511, 
        "postID": 36, 
        "quote": "", 
        "reply": "I'm not sure the urge to serve has ever been all that great in this country, at least not to the extent your post suggests. Look back at our history and you'll find very, very few people who volunteered for military service for that reason and that was often a family matter. Some families provide huge numbers of soldiers, some never do, and most only during a time of extreme crisis, such as the Civil War or WWII. Every major conflict we ever fought required our citizens to be compelled to serve, except for this one. Typically, there was a surge of voluntary enlistments at the beginning, but that rapidly tapered off and a draft became necessary. Even then, men went to extreme lengths to avoid being drafted. In periods of our history when there was no draft, enlistees were typically on the run from the law and hiding out in the service. The latter day Indian wars, for instance, were almost exclusively fought by the dregs of society who were either forced into the Army or running from something. Even as far back as the War of 1812, we had militia troops who flat refused to follow Winfield Scott into Canada because that wasn't what they signed up to do. And, nobody made them go either! In the Revolution, Washington had trouble keeping his Army manned because when their enlistment was up, they tended to go home. The bottom line is this: Don't judge American soldiers by today's standards. The modern version of the all volunteer force is unique in our history and probably doomed to failure for the very reason that, as in all things American, we do what suits us best, personally, and service to our fellow man isn't, and never has been, a high priority for most of us.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:45:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: quote: Originally posted by SignalSgtWilliams: How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now. Of course war is not attractive. Very few join for the \"lure of battle\". I serve because I believe it is honorable to do so. The day I feel that my government makes it impossible for me to serve with honor, I will drop papers. I just don't understand people like 1LT Watada, who \"volunteered\" for military service, and then refuses to deploy because, as he claims, he was duped into service by his recruiter with promises of free college education and GI Bill benefits. What a disgrace. Those who know me personally know my disdain for the many young (i.e. in their late teens early twenties) Marines I see daily who are so out of shape, they have to have a chit from medical in order to PT. They get a sprained ankle and they're out for weeks. They sit behind the desk downing sodas and fast food (the only food available on base don't get me started on that one) and wonder why they haven't recovered and have gained 10 lbs in the process. I'm not asking for Terminators or PT machines, I'm just wondering aloud why we do this to ourselves. I am grateful for their service, but I don't feel that the American public owes us anything special. I feel weird when people thank me for my service. I have it sooooo easy. Go to a nursing home or the local VFW and thank those guys. They made real sacrifices for us. Just because you don't characterize your service as \"sacrifice\", don't lump the rest of us in that category. The members of the service represent the general public. The general public seems to have a problem with excessive weight so I would expect a percentage of those in the military to have the same issues. As a leader, the fat people that can't pass the physical performance criteria or maintain themselves within weight standards are a pain in the butt. But I, like you, applaud them for joining. Most Americans, you know, the real patriotic ones, just don't have the time to join and serve their country. Some of the more \"patriotic ones\" find themselves on these boards or with lucrative radio shows telling us serving how things are.", 
        "intTime": 20090511, 
        "postID": 37, 
        "quote": "Originally posted by QuanticoBornMarine: quote: Originally posted by SignalSgtWilliams: How can going to war be \"attractive\"? It's not. With providing incentitives, higher pay; etc etc, to join a military force, is it not the same as a mercenary force? Now if the question pertains to military training, equipment, personel....yes, it has changed. War scenarios, who, how and why we fight a war today is alot different. Before it was pretty cut and dry on who and why we were fighting in a war. Seems political reasons are hidden/masked from the american people now. Of course war is not attractive. Very few join for the \"lure of battle\". I serve because I believe it is honorable to do so. The day I feel that my government makes it impossible for me to serve with honor, I will drop papers. I just don't understand people like 1LT Watada, who \"volunteered\" for military service, and then refuses to deploy because, as he claims, he was duped into service by his recruiter with promises of free college education and GI Bill benefits. What a disgrace. Those who know me personally know my disdain for the many young (i.e. in their late teens early twenties) Marines I see daily who are so out of shape, they have to have a chit from medical in order to PT. They get a sprained ankle and they're out for weeks. They sit behind the desk downing sodas and fast food (the only food available on base don't get me started on that one) and wonder why they haven't recovered and have gained 10 lbs in the process. I'm not asking for Terminators or PT machines, I'm just wondering aloud why we do this to ourselves. I am grateful for their service, but I don't feel that the American public owes us anything special. I feel weird when people thank me for my service. I have it sooooo easy. Go to a nursing home or the local VFW and thank those guys. They made real sacrifices for us.", 
        "reply": " Just because you don't characterize your service as \"sacrifice\", don't lump the rest of us in that category. The members of the service represent the general public. The general public seems to have a problem with excessive weight so I would expect a percentage of those in the military to have the same issues. As a leader, the fat people that can't pass the physical performance criteria or maintain themselves within weight standards are a pain in the butt. But I, like you, applaud them for joining. Most Americans, you know, the real patriotic ones, just don't have the time to join and serve their country. Some of the more \"patriotic ones\" find themselves on these boards or with lucrative radio shows telling us serving how things are.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 06:49:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "WepsFP"
    }, 
    {
        "content": "I should clarify that my beef is not so much with the individual servicemember, but more with the system that creates a sense of entitlement and perpetuates the problem. I don't think the military should mirror society as much as it does. We should be different. I do think that aspects of my service demand sacrifice. Being away from my loved ones for 10 months, exposed to danger, was certainly sacrifice. But I also understand that I reaped some nice rewards for that sacrifice. When I hear stories about people going without butter, silk, oil, etc during WWII for the benefit of the nation, compared with some today who can't live without cable and cell phones, I don't know what to think. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 38, 
        "quote": "", 
        "reply": "I should clarify that my beef is not so much with the individual servicemember, but more with the system that creates a sense of entitlement and perpetuates the problem. I don't think the military should mirror society as much as it does. We should be different. I do think that aspects of my service demand sacrifice. Being away from my loved ones for 10 months, exposed to danger, was certainly sacrifice. But I also understand that I reaped some nice rewards for that sacrifice. When I hear stories about people going without butter, silk, oil, etc during WWII for the benefit of the nation, compared with some today who can't live without cable and cell phones, I don't know what to think. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 07:08:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "I'm curious. Just what do you feel will improve with a draft? Keep in mind, the practical differences between the draft and the all volunteer force disappear after E-5 and in the Officer Corps. The leadership ranks have nearly always been 'voluntary' service, except in rare cases of rapid expansion. Mainly because there is no such thing as 'involuntary leadership'. Sullivan013", 
        "intTime": 20090511, 
        "postID": 39, 
        "quote": "", 
        "reply": "I'm curious. Just what do you feel will improve with a draft? Keep in mind, the practical differences between the draft and the all volunteer force disappear after E-5 and in the Officer Corps. The leadership ranks have nearly always been 'voluntary' service, except in rare cases of rapid expansion. Mainly because there is no such thing as 'involuntary leadership'. Sullivan013", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 07:24:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "I'm not making an argument for or against a draft. I suppose I am just questioning whether or not it would be possible to create and demand higher standards of conduct, appearance, proficiency, etc. of our servicemembers and still achieve our national security/defense mission. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 40, 
        "quote": "", 
        "reply": "I'm not making an argument for or against a draft. I suppose I am just questioning whether or not it would be possible to create and demand higher standards of conduct, appearance, proficiency, etc. of our servicemembers and still achieve our national security/defense mission. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 07:44:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: I'm not making an argument for or against a draft. I suppose I am just questioning whether or not it would be possible to create and demand higher standards of conduct, appearance, proficiency, etc. of our servicemembers and still achieve our national security/defense mission. It is possible, but it would require letting many people go to enforce the standard. With the military fighting two wars and trying to expand at the same time that is not something that is easy to do. I hear a lot of whining about the quality of Soldiers today, compared to what they were in WWII or Vietnam and I don't buy it. My father was an NCO in the Army in the early 70s, and have heard those horror stories. I have E-4s that have spent 2.5 years of 4 year enlistments in Iraq and are still stop-lossed. My entire platoon except for myself, the PSG, and a couple of the senior SSGs all enlisted after 9/11. There is a huge difference in the military now over 10 years ago, the difference is the men and women that enlist today know they are going to war.", 
        "intTime": 20090511, 
        "postID": 41, 
        "quote": "Originally posted by QuanticoBornMarine: I'm not making an argument for or against a draft. I suppose I am just questioning whether or not it would be possible to create and demand higher standards of conduct, appearance, proficiency, etc. of our servicemembers and still achieve our national security/defense mission.", 
        "reply": " It is possible, but it would require letting many people go to enforce the standard. With the military fighting two wars and trying to expand at the same time that is not something that is easy to do. I hear a lot of whining about the quality of Soldiers today, compared to what they were in WWII or Vietnam and I don't buy it. My father was an NCO in the Army in the early 70s, and have heard those horror stories. I have E-4s that have spent 2.5 years of 4 year enlistments in Iraq and are still stop-lossed. My entire platoon except for myself, the PSG, and a couple of the senior SSGs all enlisted after 9/11. There is a huge difference in the military now over 10 years ago, the difference is the men and women that enlist today know they are going to war.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 08:06:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "The Army's Ranger Regiment is where the \"old Military\" is still alive and well....", 
        "intTime": 20090511, 
        "postID": 42, 
        "quote": "", 
        "reply": "The Army's Ranger Regiment is where the \"old Military\" is still alive and well....", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 08:53:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: The Army's Ranger Regiment is where the \"old Military\" is still alive and well.... YIP!!!!!!!! Thank God.........", 
        "intTime": 20090511, 
        "postID": 43, 
        "quote": "Originally posted by Irwin_R_Schyster: The Army's Ranger Regiment is where the \"old Military\" is still alive and well....", 
        "reply": " YIP!!!!!!!! Thank God.........", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 09:13:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder.", 
        "intTime": 20090511, 
        "postID": 44, 
        "quote": "", 
        "reply": "Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 09:16:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I don't think they were \"bashing\" us. I think they are just showing genuine (and well-deserved) pride in their service. This was never meant to be a old-timers vs. newbies thread. That's why I said today's service is \"different\". I emphasize the service and not the individual, because it all starts with the institutional culture. As a leader, I have to put my money where my mouth is and demand more of my guys. Small unit is where the rubber hits the road. That is where most of my frustration lies though. I think that our institution coddles and hand-holds a bit too much. There is not enough allowance for individual responsibility and accountability. Has anyone sat through a safety brief recently? Holy smokes. You'd think we were trying to go on a space walk instead of a weekend liberty. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 45, 
        "quote": "Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder.", 
        "reply": " I don't think they were \"bashing\" us. I think they are just showing genuine (and well-deserved) pride in their service. This was never meant to be a old-timers vs. newbies thread. That's why I said today's service is \"different\". I emphasize the service and not the individual, because it all starts with the institutional culture. As a leader, I have to put my money where my mouth is and demand more of my guys. Small unit is where the rubber hits the road. That is where most of my frustration lies though. I think that our institution coddles and hand-holds a bit too much. There is not enough allowance for individual responsibility and accountability. Has anyone sat through a safety brief recently? Holy smokes. You'd think we were trying to go on a space walk instead of a weekend liberty. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:08:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "Perhaps if you give us some more information about the nature of your unit, its mission and the quality of your comamnd structure we might get a better grasp on what you're talking about. Is this a combat unit? Combat support? Service support? How long have you been in the unit? With your unit? What are the NCO's like? Do you have their support in this? I could venture a guess by your title, but rather than assume, I thought I'd ask. Sullivan013", 
        "intTime": 20090511, 
        "postID": 46, 
        "quote": "", 
        "reply": "Perhaps if you give us some more information about the nature of your unit, its mission and the quality of your comamnd structure we might get a better grasp on what you're talking about. Is this a combat unit? Combat support? Service support? How long have you been in the unit? With your unit? What are the NCO's like? Do you have their support in this? I could venture a guess by your title, but rather than assume, I thought I'd ask. Sullivan013", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:36:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: Perhaps if you give us some more information about the nature of your unit, its mission and the quality of your comamnd structure we might get a better grasp on what you're talking about. Is this a combat unit? Combat support? Service support? How long have you been in the unit? With your unit? What are the NCO's like? Do you have their support in this? I could venture a guess by your title, but rather than assume, I thought I'd ask. Sullivan013 This is all rhetorical/hypothetical. I've seen this in the 3 units I've been with (artillery, infantry, and support). (EDIT: This may or may not come as a suprise, but the unit where I observed the least issues was the grunt Bn...strong leadership). It's not specific to a particular unit. I'm not the proverbial postal worker about to lose it or anything remotely close. Just wondering if others have similar observations. I'd be particularly interested to hear from other branches and veterans from different eras. I am willing to bet that this \"complaint\" has existed since 1776, when the Marines of 1775 complained about the boot privates they saw ruining their Marine Corps. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 47, 
        "quote": "Originally posted by sullivan013: Perhaps if you give us some more information about the nature of your unit, its mission and the quality of your comamnd structure we might get a better grasp on what you're talking about. Is this a combat unit? Combat support? Service support? How long have you been in the unit? With your unit? What are the NCO's like? Do you have their support in this? I could venture a guess by your title, but rather than assume, I thought I'd ask. Sullivan013", 
        "reply": " This is all rhetorical/hypothetical. I've seen this in the 3 units I've been with (artillery, infantry, and support). (EDIT: This may or may not come as a suprise, but the unit where I observed the least issues was the grunt Bn...strong leadership). It's not specific to a particular unit. I'm not the proverbial postal worker about to lose it or anything remotely close. Just wondering if others have similar observations. I'd be particularly interested to hear from other branches and veterans from different eras. I am willing to bet that this \"complaint\" has existed since 1776, when the Marines of 1775 complained about the boot privates they saw ruining their Marine Corps. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:44:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war.", 
        "intTime": 20090511, 
        "postID": 48, 
        "quote": "Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder.", 
        "reply": " I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:56:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Keep in mind that WW-II is beginning on the heels of the Great Depression, and opportunities are slim (college is not available for many as it is today), the nation was divided over isolationism... many facts shaped the minds and attitudes of young men then, including the draft and very heavy propaganda (very different from today.) My father jointed in 1940, he figured he'd get drafted anyhow, and he was at Pearl Harbor when it was attacked and stayed in after the war into the 1950s. When he would visit me in the 1960s in the service he noted it was a world of difference (I didn't think so, but he could see it.) For the past 15 years I have been a civilian instructor in the military. Frequently I hear the senior NCO's lament \"What's wrong with these young people today?\"... year after year. The basic difference is that people born after 1960s have little to no memory of \"authority\". It's neither good nor bad but it does 'color' the mind set of service members. Would I want us to gallop back to the 1940s mentality or the 1950s? No, those were not the \"perfect\" times and we have actually progressed. As far as noticing the difference between my service time 45+ years ago and today, I feel there is more for military members and their ability to advance themselves. Much better deal than in my days. IMHO", 
        "intTime": 20090511, 
        "postID": 49, 
        "quote": "", 
        "reply": "Keep in mind that WW-II is beginning on the heels of the Great Depression, and opportunities are slim (college is not available for many as it is today), the nation was divided over isolationism... many facts shaped the minds and attitudes of young men then, including the draft and very heavy propaganda (very different from today.) My father jointed in 1940, he figured he'd get drafted anyhow, and he was at Pearl Harbor when it was attacked and stayed in after the war into the 1950s. When he would visit me in the 1960s in the service he noted it was a world of difference (I didn't think so, but he could see it.) For the past 15 years I have been a civilian instructor in the military. Frequently I hear the senior NCO's lament \"What's wrong with these young people today?\"... year after year. The basic difference is that people born after 1960s have little to no memory of \"authority\". It's neither good nor bad but it does 'color' the mind set of service members. Would I want us to gallop back to the 1940s mentality or the 1950s? No, those were not the \"perfect\" times and we have actually progressed. As far as noticing the difference between my service time 45+ years ago and today, I feel there is more for military members and their ability to advance themselves. Much better deal than in my days. IMHO", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 10:57:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: The basic difference is that people born after 1960s have little to no memory of \"authority\". It's neither good nor bad but it does 'color' the mind set of service members. I concur.......... After WWI the military downsized considerable to almost nothing, after all, it was the War to end all Wars. No need of any draft now. Just before Pearl Harbor happened, the draft was active again but it didn't take the draft to fill the need. Lines were blocks long. I enjoyed the 60s but that was then and I was a part of it but now that I'm older and look back, morals, discipline and the lack of, got their roots from the 60s.", 
        "intTime": 20090511, 
        "postID": 50, 
        "quote": "Originally posted by reducetension: The basic difference is that people born after 1960s have little to no memory of \"authority\". It's neither good nor bad but it does 'color' the mind set of service members.", 
        "reply": " I concur.......... After WWI the military downsized considerable to almost nothing, after all, it was the War to end all Wars. No need of any draft now. Just before Pearl Harbor happened, the draft was active again but it didn't take the draft to fill the need. Lines were blocks long. I enjoyed the 60s but that was then and I was a part of it but now that I'm older and look back, morals, discipline and the lack of, got their roots from the 60s.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:04:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war. There is no doubt conditions have gotten easier as time goes on, but discipline is another matter. I wasn't there so I just have to go on what I have been told, but would you really say the Army in the 70s was a more disciplined force than the one today. Iraq has some decent MWR places, and we still get that combat pay except it has gone up to a whole $225 a month now.", 
        "intTime": 20090511, 
        "postID": 51, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war.", 
        "reply": " There is no doubt conditions have gotten easier as time goes on, but discipline is another matter. I wasn't there so I just have to go on what I have been told, but would you really say the Army in the 70s was a more disciplined force than the one today. Iraq has some decent MWR places, and we still get that combat pay except it has gone up to a whole $225 a month now.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:06:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I entered the U.S. Army in 1969, enlisting to avoid the draft and the 50% chance I could be involutarily put in the Marine Corps. I left active service in 1975 and entered the Army Reserves, retiring in 1995. So I can only speak to what I experienced during that period. The Army of 1995 was very different from the Army of 1969. The draft made it more racialy and regionally diverse, and it was not unusual to have some highly educated men serving their two years service (via the draft) in combat arms while the draft was in effect. When the draft ended, the Army became less Caucasian, less educated and more from either the Deep South and the Rust Belt of Ohio, Indiana, etc. The more blatant examples of racism that I has seen in 1969 started to fade away as the percentage of non-Caucasians increased, but as the percentage of Jews and Catholics decreased after the draft, anti-semitism and anti-Catholicism within the military increased. (For example, a Fundamentalist Protestant 1SG in my battalion [circa 1975] always skewed his company's duty roster so that the two Jewish enlisted in his company always seem to get duty [guard, CQ, etc.] on Friday nights so that they couldn't attend temple. But he would always ensure that the fundamentalist Protestants in his unit were never on duty Wednesday nights so that they could go with him to fundamentalist Protestant prayer meetings.) The power of the Pass was a great club that NCO's had over their enlisted men - but it was often abused. (For those who don't remember, a service member had to have a Pass to get off the Base on evenings or on weekends, and access to that Pass was controlled by your NCO or Officer.) I can't say how things have changed since I retired 13 years ago - I hope they have improved for the better. This message has been edited. Last edited by: Fightdirector, Mon 11 May 2009 11:41 AM", 
        "intTime": 20090511, 
        "postID": 52, 
        "quote": "", 
        "reply": "I entered the U.S. Army in 1969, enlisting to avoid the draft and the 50% chance I could be involutarily put in the Marine Corps. I left active service in 1975 and entered the Army Reserves, retiring in 1995. So I can only speak to what I experienced during that period. The Army of 1995 was very different from the Army of 1969. The draft made it more racialy and regionally diverse, and it was not unusual to have some highly educated men serving their two years service (via the draft) in combat arms while the draft was in effect. When the draft ended, the Army became less Caucasian, less educated and more from either the Deep South and the Rust Belt of Ohio, Indiana, etc. The more blatant examples of racism that I has seen in 1969 started to fade away as the percentage of non-Caucasians increased, but as the percentage of Jews and Catholics decreased after the draft, anti-semitism and anti-Catholicism within the military increased. (For example, a Fundamentalist Protestant 1SG in my battalion [circa 1975] always skewed his company's duty roster so that the two Jewish enlisted in his company always seem to get duty [guard, CQ, etc.] on Friday nights so that they couldn't attend temple. But he would always ensure that the fundamentalist Protestants in his unit were never on duty Wednesday nights so that they could go with him to fundamentalist Protestant prayer meetings.) The power of the Pass was a great club that NCO's had over their enlisted men - but it was often abused. (For those who don't remember, a service member had to have a Pass to get off the Base on evenings or on weekends, and access to that Pass was controlled by your NCO or Officer.) I can't say how things have changed since I retired 13 years ago - I hope they have improved for the better. This message has been edited. Last edited by: Fightdirector, Mon 11 May 2009 11:41 AM", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:21:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Interesting points from all. Hearing things from different perspective certainly helps and probably will help me ease up a bit. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090511, 
        "postID": 53, 
        "quote": "", 
        "reply": "Interesting points from all. Hearing things from different perspective certainly helps and probably will help me ease up a bit. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:23:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war. There is no doubt conditions have gotten easier as time goes on, but discipline is another matter. I wasn't there so I just have to go on what I have been told, but would you really say the Army in the 70s was a more disciplined force than the one today. Iraq has some decent MWR places, and we still get that combat pay except it has gone up to a whole $225 a month now. 60s was better than the 70s, the 80s was better than the 70s. I can only go on today about today from what I read on these forums and in the news and I draw my conclusions for my opinions and I must say, I'm overwhelmed with surprise that so much is getting away with, whinning and unhappiness about something that so many in the past has endured and accepted. But when I read of the heroism, the missions and extended time in combat...I see, some things will never change. I think my displeasure comes from service support units and it usually rear's it's ugly head when a NG Latrine and Laundry unit returns to the media, parades, kisses and hugs and medals galore.", 
        "intTime": 20090511, 
        "postID": 54, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by nspreitler: Thank you for your service, but there is no need to bash the service of those of us serving today because you think you had it harder. I think it's a substanciated conclusion as wars progress things, living conditions, equipment; etc etc; get better. WWI WWII vets had to endure the duration of the war, no rotation, Korea the same. Nam, we didn't, one year, mostly but not always, some went back two three four times. But the conditions didn't change. We had the same Doughnut Dollies has our dad's had. No Pizza Hut, MickeyDs on base camp, maybe a PX. No trailers for married servicemembers to live in, no telephones, especially cell phones but we did have MARS, no had held video games but we might have had pool or Ping Pong. Alot of combat pay though, if you consider $110.00 a month alot. Cartons is smokes were only ten years old coming out of a Sundry box. Better than those 15 year old five packs coming out of C boxes from WWII and Korea. But....that was the military and that was 'that' war. New century, new wars, different but still...war. There is no doubt conditions have gotten easier as time goes on, but discipline is another matter. I wasn't there so I just have to go on what I have been told, but would you really say the Army in the 70s was a more disciplined force than the one today. Iraq has some decent MWR places, and we still get that combat pay except it has gone up to a whole $225 a month now.", 
        "reply": " 60s was better than the 70s, the 80s was better than the 70s. I can only go on today about today from what I read on these forums and in the news and I draw my conclusions for my opinions and I must say, I'm overwhelmed with surprise that so much is getting away with, whinning and unhappiness about something that so many in the past has endured and accepted. But when I read of the heroism, the missions and extended time in combat...I see, some things will never change. I think my displeasure comes from service support units and it usually rear's it's ugly head when a NG Latrine and Laundry unit returns to the media, parades, kisses and hugs and medals galore.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 11:36:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I wondered about the \"new\" Army too, until I visited my son at Ft. Benning back in 1996, where he was undergoing Infantry OSUT. The first thing I noticed was that the Drill's looked just like the Drill's I had in 1969 and just like the ones I served with as a Drill in the 70's. They didn't cuss the troops like we did and abuse them, but they were training them and training them well. The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. Some were dedicated soldiers, some were lost without Mommy and some would push their boundries just as far as they could. Nothing new there; move on. The final straw occured while I was talking to my son during a break in training at his Starship. Over his shoulder, I saw the Senior Drill step out of the orderly room and put a whistle in his mouth. When he blew that thing, my son vaporized right in front of me, leaving words hanging in mid-air, and he was in formation before I knew what was happening. \"YES!\" I said to myself. That was EXACTLY what I wanted to see! Ever since then, I have no qualms or trepidations about putting the security of our country in the hands of the current generation. They are receiving excellent training and are as motivated and tough as any soldiers I've ever seen. Yeah, they may look funny off duty, with their tatoos and baggy pants, but when the time comes, they're there and doing a magnificent job.", 
        "intTime": 20090511, 
        "postID": 55, 
        "quote": "", 
        "reply": "I wondered about the \"new\" Army too, until I visited my son at Ft. Benning back in 1996, where he was undergoing Infantry OSUT. The first thing I noticed was that the Drill's looked just like the Drill's I had in 1969 and just like the ones I served with as a Drill in the 70's. They didn't cuss the troops like we did and abuse them, but they were training them and training them well. The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. Some were dedicated soldiers, some were lost without Mommy and some would push their boundries just as far as they could. Nothing new there; move on. The final straw occured while I was talking to my son during a break in training at his Starship. Over his shoulder, I saw the Senior Drill step out of the orderly room and put a whistle in his mouth. When he blew that thing, my son vaporized right in front of me, leaving words hanging in mid-air, and he was in formation before I knew what was happening. \"YES!\" I said to myself. That was EXACTLY what I wanted to see! Ever since then, I have no qualms or trepidations about putting the security of our country in the hands of the current generation. They are receiving excellent training and are as motivated and tough as any soldiers I've ever seen. Yeah, they may look funny off duty, with their tatoos and baggy pants, but when the time comes, they're there and doing a magnificent job.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 14:02:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change.", 
        "intTime": 20090511, 
        "postID": 56, 
        "quote": "Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. .", 
        "reply": " I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 14:12:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change. I laughed when I thought of it too because I've always suspected the Army has a trainee factory somewhere which only turns out about 10 basic models. In every cycle, and every generation, you see the same guys over and over: The fat kid with a red face who will never be able to do pushups; the short, wiry Hispanic kid who can do anything but take orders; the sleazy, big city con man who will swindle his whole platoon if he can and make pogey runs after midnight for a profit; the dork who cries in his bed at night and moans about how he \"just can't take it any more;\" the black kid with an attitude who's more trouble than he's worth UNTIL you make him a squad leader. The list goes on and I'm sure you can fill in the blanks.", 
        "intTime": 20090511, 
        "postID": 57, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change.", 
        "reply": " I laughed when I thought of it too because I've always suspected the Army has a trainee factory somewhere which only turns out about 10 basic models. In every cycle, and every generation, you see the same guys over and over: The fat kid with a red face who will never be able to do pushups; the short, wiry Hispanic kid who can do anything but take orders; the sleazy, big city con man who will swindle his whole platoon if he can and make pogey runs after midnight for a profit; the dork who cries in his bed at night and moans about how he \"just can't take it any more;\" the black kid with an attitude who's more trouble than he's worth UNTIL you make him a squad leader. The list goes on and I'm sure you can fill in the blanks.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 14:23:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change. I laughed when I thought of it too because I've always suspected the Army has a trainee factory somewhere which only turns out about 10 basic models. In every cycle, and every generation, you see the same guys over and over: The fat kid with a red face who will never be able to do pushups; the short, wiry Hispanic kid who can do anything but take orders; the sleazy, big city con man who will swindle his whole platoon if he can and make pogey runs after midnight for a profit; the dork who cries in his bed at night and moans about how he \"just can't take it any more;\" the black kid with an attitude who's more trouble than he's worth UNTIL you make him a squad leader. The list goes on and I'm sure you can fill in the blanks. ...and I'm sure you got to the point when drop off day arrived and they were broke down into plts and squads, you walked through your ranks and said nothing but knew who would and who would not make it without alot of extra time and training on your part. BTW...1969-2009. Happy Anniversary.", 
        "intTime": 20090511, 
        "postID": 58, 
        "quote": "Originally posted by stillkit: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stillkit: The next thing I noticed was that the trainees looked just like the ones I'd known before too. They each had that deer in the headlights look and didn't appear to be any brighter, or dumber, than the ones I'd pushed a generation before. . I had to chuckle a bit with flashbacks.....some things do stay consistant and will never change. I laughed when I thought of it too because I've always suspected the Army has a trainee factory somewhere which only turns out about 10 basic models. In every cycle, and every generation, you see the same guys over and over: The fat kid with a red face who will never be able to do pushups; the short, wiry Hispanic kid who can do anything but take orders; the sleazy, big city con man who will swindle his whole platoon if he can and make pogey runs after midnight for a profit; the dork who cries in his bed at night and moans about how he \"just can't take it any more;\" the black kid with an attitude who's more trouble than he's worth UNTIL you make him a squad leader. The list goes on and I'm sure you can fill in the blanks.", 
        "reply": " ...and I'm sure you got to the point when drop off day arrived and they were broke down into plts and squads, you walked through your ranks and said nothing but knew who would and who would not make it without alot of extra time and training on your part. BTW...1969-2009. Happy Anniversary.", 
        "threadID": "409192893_6350020322001", 
        "time": "2009-05-11 14:50:00", 
        "title": "Is military service \"different\" today?", 
        "userID": "SignalSgtWilliams"
    }
]