[
    {
        "content": "+++http://online.wsj.com/article/SB123604419092515347.html As 2009 opened, three weeks before Barack Obama took office, the Dow Jones Industrial Average closed at 9034 on January 2, its highest level since the autumn panic. Yesterday the Dow fell another 4.24% to 6763, for an overall decline of 25% in two months and to its lowest level since 1997. The dismaying message here is that President Obama's policies have become part of the economy's problem. Americans have welcomed the Obama era in the same spirit of hope the President campaigned on. But after five weeks in office, it's become clear that Mr. Obama's policies are slowing, if not stopping, what would otherwise be the normal process of economic recovery. From punishing business to squandering scarce national public resources, Team Obama is creating more uncertainty and less confidence -- and thus a longer period of recession or subpar growth. The Democrats who now run Washington don't want to hear this, because they benefit from blaming all bad economic news on President Bush. And Mr. Obama has inherited an unusual recession deepened by credit problems, both of which will take time to climb out of. But it's also true that the economy has fallen far enough, and long enough, that much of the excess that led to recession is being worked off. Already 15 months old, the current recession will soon match the average length -- and average job loss -- of the last three postwar downturns. What goes down will come up -- unless destructive policies interfere with the sources of potential recovery. And those sources have been forming for some time. The price of oil and other commodities have fallen by two-thirds since their 2008 summer peak, which has the effect of a major tax cut. The world is awash in liquidity, thanks to monetary ease by the Federal Reserve and other central banks. Monetary policy operates with a lag, but last year's easing will eventually stir economic activity. Housing prices have fallen 27% from their Case-Shiller peak, or some two-thirds of the way back to their historical trend. While still high, credit spreads are far from their peaks during the panic, and corporate borrowers are again able to tap the credit markets. As equities were signaling with their late 2008 rally and January top, growth should under normal circumstances begin to appear in the second half of this year. So what has happened in the last two months? The economy has received no great new outside shock. Exchange rates and other prices have been stable, and there are no security crises of note. The reality of a sharp recession has been known and built into stock prices since last year's fourth quarter. What is new is the unveiling of Mr. Obama's agenda and his approach to governance. Every new President has a finite stock of capital -- financial and political -- to deploy, and amid recession Mr. Obama has more than most. But one negative revelation has been the way he has chosen to spend his scarce resources on income transfers rather than growth promotion. Most of his \"stimulus\" spending was devoted to social programs, rather than public works, and nearly all of the tax cuts were devoted to income maintenance rather than to improving incentives to work or invest. His Treasury has been making a similar mistake with its financial bailout plans. The banking system needs to work through its losses, and one necessary use of public capital is to assist in burning down those bad assets as fast as possible. Yet most of Team Obama's ministrations so far have gone toward triage and life support, rather than repair and recovery. AIG yesterday received its fourth \"rescue,\" including $70 billion in Troubled Asset Relief Program cash, without any clear business direction. (See here.) Citigroup's restructuring last week added not a dollar of new capital, and also no clear direction. Perhaps the imminent Treasury \"stress tests\" will clear the decks, but until they do the banks are all living in fear of becoming the next AIG. All of this squanders public money that could better go toward burning down bank debt. The market has notably plunged since Mr. Obama introduced his budget last week, and that should be no surprise. The document was a declaration of hostility toward capitalists across the economy. Health-care stocks have dived on fears of new government mandates and price controls. Private lenders to students have been told they're no longer wanted. Anyone who uses carbon energy has been warned to expect a huge tax increase from cap and trade. And every risk-taker and investor now knows that another tax increase will slam the economy in 2011, unless Mr. Obama lets Speaker Nancy Pelosi impose one even earlier. Meanwhile, Congress demands more bank lending even as it assails lenders and threatens to let judges rewrite mortgage contracts. The powers in Congress -- unrebuked by Mr. Obama -- are ridiculing and punishing the very capitalists who are essential to a sustainable recovery. The result has been a capital strike, and the return of the fear from last year that we could face a far deeper downturn. This is no way to nurture a wounded economy back to health. Listening to Mr. Obama and his chief of staff, Rahm Emanuel, on the weekend, we couldn't help but wonder if they appreciate any of this. They seem preoccupied with going to the barricades against Republicans who wield little power, or picking a fight with Rush Limbaugh, as if this is the kind of economic leadership Americans want. Perhaps they're reading the polls and figure they have two or three years before voters stop blaming Republicans and Mr. Bush for the economy. Even if that's right in the long run, in the meantime their assault on business and investors is delaying a recovery and ensuring that the expansion will be weaker than it should be when it finally does arrive.", 
        "intTime": 20090303, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://online.wsj.com/article/SB123604419092515347.html As 2009 opened, three weeks before Barack Obama took office, the Dow Jones Industrial Average closed at 9034 on January 2, its highest level since the autumn panic. Yesterday the Dow fell another 4.24% to 6763, for an overall decline of 25% in two months and to its lowest level since 1997. The dismaying message here is that President Obama's policies have become part of the economy's problem. Americans have welcomed the Obama era in the same spirit of hope the President campaigned on. But after five weeks in office, it's become clear that Mr. Obama's policies are slowing, if not stopping, what would otherwise be the normal process of economic recovery. From punishing business to squandering scarce national public resources, Team Obama is creating more uncertainty and less confidence -- and thus a longer period of recession or subpar growth. The Democrats who now run Washington don't want to hear this, because they benefit from blaming all bad economic news on President Bush. And Mr. Obama has inherited an unusual recession deepened by credit problems, both of which will take time to climb out of. But it's also true that the economy has fallen far enough, and long enough, that much of the excess that led to recession is being worked off. Already 15 months old, the current recession will soon match the average length -- and average job loss -- of the last three postwar downturns. What goes down will come up -- unless destructive policies interfere with the sources of potential recovery. And those sources have been forming for some time. The price of oil and other commodities have fallen by two-thirds since their 2008 summer peak, which has the effect of a major tax cut. The world is awash in liquidity, thanks to monetary ease by the Federal Reserve and other central banks. Monetary policy operates with a lag, but last year's easing will eventually stir economic activity. Housing prices have fallen 27% from their Case-Shiller peak, or some two-thirds of the way back to their historical trend. While still high, credit spreads are far from their peaks during the panic, and corporate borrowers are again able to tap the credit markets. As equities were signaling with their late 2008 rally and January top, growth should under normal circumstances begin to appear in the second half of this year. So what has happened in the last two months? The economy has received no great new outside shock. Exchange rates and other prices have been stable, and there are no security crises of note. The reality of a sharp recession has been known and built into stock prices since last year's fourth quarter. What is new is the unveiling of Mr. Obama's agenda and his approach to governance. Every new President has a finite stock of capital -- financial and political -- to deploy, and amid recession Mr. Obama has more than most. But one negative revelation has been the way he has chosen to spend his scarce resources on income transfers rather than growth promotion. Most of his \"stimulus\" spending was devoted to social programs, rather than public works, and nearly all of the tax cuts were devoted to income maintenance rather than to improving incentives to work or invest. His Treasury has been making a similar mistake with its financial bailout plans. The banking system needs to work through its losses, and one necessary use of public capital is to assist in burning down those bad assets as fast as possible. Yet most of Team Obama's ministrations so far have gone toward triage and life support, rather than repair and recovery. AIG yesterday received its fourth \"rescue,\" including $70 billion in Troubled Asset Relief Program cash, without any clear business direction. (See here.) Citigroup's restructuring last week added not a dollar of new capital, and also no clear direction. Perhaps the imminent Treasury \"stress tests\" will clear the decks, but until they do the banks are all living in fear of becoming the next AIG. All of this squanders public money that could better go toward burning down bank debt. The market has notably plunged since Mr. Obama introduced his budget last week, and that should be no surprise. The document was a declaration of hostility toward capitalists across the economy. Health-care stocks have dived on fears of new government mandates and price controls. Private lenders to students have been told they're no longer wanted. Anyone who uses carbon energy has been warned to expect a huge tax increase from cap and trade. And every risk-taker and investor now knows that another tax increase will slam the economy in 2011, unless Mr. Obama lets Speaker Nancy Pelosi impose one even earlier. Meanwhile, Congress demands more bank lending even as it assails lenders and threatens to let judges rewrite mortgage contracts. The powers in Congress -- unrebuked by Mr. Obama -- are ridiculing and punishing the very capitalists who are essential to a sustainable recovery. The result has been a capital strike, and the return of the fear from last year that we could face a far deeper downturn. This is no way to nurture a wounded economy back to health. Listening to Mr. Obama and his chief of staff, Rahm Emanuel, on the weekend, we couldn't help but wonder if they appreciate any of this. They seem preoccupied with going to the barricades against Republicans who wield little power, or picking a fight with Rush Limbaugh, as if this is the kind of economic leadership Americans want. Perhaps they're reading the polls and figure they have two or three years before voters stop blaming Republicans and Mr. Bush for the economy. Even if that's right in the long run, in the meantime their assault on business and investors is delaying a recovery and ensuring that the expansion will be weaker than it should be when it finally does arrive.", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 05:30:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "threerings"
    }, 
    {
        "content": "They're still running a campaign. Just dog and pony shows. They are just using this situation to push a socialist/liberal agenda. And wallstreet knws it.", 
        "intTime": 20090303, 
        "postID": 2, 
        "quote": "", 
        "reply": "They're still running a campaign. Just dog and pony shows. They are just using this situation to push a socialist/liberal agenda. And wallstreet knws it.", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 06:01:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: They're still running a campaign. Just dog and pony shows. They are just using this situation to push a socialist/liberal agenda. And wallstreet knws it. COMMENT: ... or could it just be that the economy is in such dire straits that there's virtually no confidence at this time without some glimmer of hope rising from the continued bad news of spiraling unemployment, dismal corporate news, an inelastic lending system, et al? This crisis clearly transcends partisan labeling at this point, but if your \"dying words\" as you're drowning is to condemn one political party or another, then enjoy it, I suppose, since that solitary satisfaction is meaningless and won't save you anyway.", 
        "intTime": 20090303, 
        "postID": 3, 
        "quote": "Originally posted by GunnyRet03: They're still running a campaign. Just dog and pony shows. They are just using this situation to push a socialist/liberal agenda. And wallstreet knws it.", 
        "reply": " COMMENT: ... or could it just be that the economy is in such dire straits that there's virtually no confidence at this time without some glimmer of hope rising from the continued bad news of spiraling unemployment, dismal corporate news, an inelastic lending system, et al? This crisis clearly transcends partisan labeling at this point, but if your \"dying words\" as you're drowning is to condemn one political party or another, then enjoy it, I suppose, since that solitary satisfaction is meaningless and won't save you anyway.", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 06:16:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "Obama must scare the asian and european markets too...", 
        "intTime": 20090303, 
        "postID": 4, 
        "quote": "", 
        "reply": "Obama must scare the asian and european markets too...", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 06:22:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "BO is scaring anybody/everybody with any intelligence. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "", 
        "reply": "BO is scaring anybody/everybody with any intelligence. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 06:47:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by GunnyRet03: They're still running a campaign. Just dog and pony shows. They are just using this situation to push a socialist/liberal agenda. And wallstreet knws it. COMMENT: ... or could it just be that the economy is in such dire straits that there's virtually no confidence at this time without some glimmer of hope rising from the continued bad news of spiraling unemployment, dismal corporate news, an inelastic lending system, et al? This crisis clearly transcends partisan labeling at this point, but if your \"dying words\" as you're drowning is to condemn one political party or another, then enjoy it, I suppose, since that solitary satisfaction is meaningless and won't save you anyway. If you cant see that this Adm has an agenda I cant help you. And that fact is not helping the markets. The last bill was a joke and everyone knows it or there would have been debate on it, not a cramming down of throats and the market forecasts on future and obviously wallstreet knows the baby is ugly. I have mutauals and I watch the money shows on all networks and the editorial below is what they are saying. Yes, I am a conservative and I am not happy at what is going on and I take no joy in watching my hard earned money disappear. I didnt agree with the first bailout by gb2 and the Dems nothing has changed except worse, Thank god I have a retirement check I feel sorry for people who have been putting money in 401k's and thats all they have co'z SS wont be there, hoepfully they will have enough shares and make up for some when the market goes back up. But for Seniors that are taking money out now co'z of fed law they are truly screwed they dont have time to wait it out. So, keep the social engineering and expansion of govt out of these 'economic' bills and we might be better off. It's unfortunate that the market is partisan. 'http://www.ibdeditorials.com/IBDArticles.aspx?id=320892987513114' In the three months since the election, the broadest measure of the stock market's value, the Wilshire 5000 Index, has plunged more than 30%, slicing over $3 trillion from Americans' wealth. Investors have walked away from investing, while businesses shut down factories and offices and slash jobs. This is both highly significant and dangerous. Capital, bluntly put, has gone on strike. Those who own wealth are pushing it to the sidelines, as a young and inexperienced president tries to jam through the most sweeping economic changes in over 70 years. The prospect of these changes becoming law has already radically altered our nation's economy. Entrepreneurs and CEOs who once created new products, new services, jobs and trillions in wealth for America's workers and retirees now find themselves vilified and punished for their success. ABC News reported this week that many upper-income taxpayers already are planning to cut back on work and investments to stay under $250,000 in income — the point where Obama's punitive taxes kick in. No one wins from this, yet Obama seems oblivious. This isn't the only warning sign. A new study asserts that some 100,000 highly educated, well-trained Indians now living in the U.S. will return home in the next few years. Ditto China. Immigrant entrepreneurs are highly sensitive bellwethers of economic and social conditions. They know where the opportunities are — and where they aren't. They're voting with their feet. The economy shrank 6.2% in the fourth quarter, worse than first expected. Home sales continue to fall, unemployment is rising sharply, and business investment is prostrate. Such an economy cries out for tax cuts, but we get none. Just punishment of those with wealth who might be able to pull us out of the slump. An estimated $1.4 trillion in new taxes planned by the new administration over the next decade explicitly target the people President Teddy Roosevelt once derided as the \"malefactors of great wealth\" — those in the top 5% of the income spectrum. Yet, they're the ones who've made our economy the envy of the world. By the way, under Obama's plan the rich won't pick up the whole tab. New energy taxes of $646 billion will hit the middle-class hard. Meanwhile, in just eight years, our national debt will double to $20 trillion, as nondefense federal spending jumps from the long-term average of 16.5% of GDP to above 23%. You — or your children — face higher taxes for decades to come. As our stock markets melt under a barrage of new taxes on incomes, estates, capital gains, dividends and energy, it's good to recall that more than 100 million people own stocks or mutual funds. And that the stock market is the main wealth- and growth-creating mechanism in our capitalist society. But when taxes go up, regulations proliferate and the rule of law and private property protections are weakened, the economy will invariably suffer. This is a universal lesson of economic history, one we ignore at our peril. And yes, this is what's happening now. No, we don't blame all our current ills on President Obama. He came in at a tough time, when many bad decisions had already been made. But he is responsible for what he's done since. His stimulus package is little more than a down payment on a socialist economy. It raises taxes on the successful, brings back the welfare state, hands out favors and cash to friends of one political party, while imposing government control over the entire free market in ways that just a year ago would have seemed unimaginable. Another one: 'http://online.wsj.com/article/SB123604419092515347.html?mod=rss_opinion_main' quote: As 2009 opened, three weeks before Barack Obama took office, the Dow Jones Industrial Average closed at 9034 on January 2, its highest level since the autumn panic. Yesterday the Dow fell another 4.24% to 6763, for an overall decline of 25% in two months and to its lowest level since 1997. The dismaying message here is that President Obama's policies have become part of the economy's problem. Americans have welcomed the Obama era in the same spirit of hope the President campaigned on. But after five weeks in office, it's become clear that Mr. Obama's policies are slowing, if not stopping, what would otherwise be the normal process of economic recovery. From punishing business to squandering scarce national public resources, Team Obama is creating more uncertainty and less confidence -- and thus a longer period of recession or subpar growth. The Democrats who now run Washington don't want to hear this, because they benefit from blaming all bad economic news on President Bush. And Mr. Obama has inherited an unusual recession deepened by credit problems, both of which will take time to climb out of. But it's also true that the economy has fallen far enough, and long enough, that much of the excess that led to recession is being worked off. Already 15 months old, the current recession will soon match the average length -- and average job loss -- of the last three postwar downturns. What goes down will come up -- unless destructive policies interfere with the sources of potential recovery.", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by GunnyRet03: They're still running a campaign. Just dog and pony shows. They are just using this situation to push a socialist/liberal agenda. And wallstreet knws it. COMMENT: ... or could it just be that the economy is in such dire straits that there's virtually no confidence at this time without some glimmer of hope rising from the continued bad news of spiraling unemployment, dismal corporate news, an inelastic lending system, et al? This crisis clearly transcends partisan labeling at this point, but if your \"dying words\" as you're drowning is to condemn one political party or another, then enjoy it, I suppose, since that solitary satisfaction is meaningless and won't save you anyway.", 
        "reply": " If you cant see that this Adm has an agenda I cant help you. And that fact is not helping the markets. The last bill was a joke and everyone knows it or there would have been debate on it, not a cramming down of throats and the market forecasts on future and obviously wallstreet knows the baby is ugly. I have mutauals and I watch the money shows on all networks and the editorial below is what they are saying. Yes, I am a conservative and I am not happy at what is going on and I take no joy in watching my hard earned money disappear. I didnt agree with the first bailout by gb2 and the Dems nothing has changed except worse, Thank god I have a retirement check I feel sorry for people who have been putting money in 401k's and thats all they have co'z SS wont be there, hoepfully they will have enough shares and make up for some when the market goes back up. But for Seniors that are taking money out now co'z of fed law they are truly screwed they dont have time to wait it out. So, keep the social engineering and expansion of govt out of these 'economic' bills and we might be better off. It's unfortunate that the market is partisan. 'http://www.ibdeditorials.com/IBDArticles.aspx?id=320892987513114' In the three months since the election, the broadest measure of the stock market's value, the Wilshire 5000 Index, has plunged more than 30%, slicing over $3 trillion from Americans' wealth. Investors have walked away from investing, while businesses shut down factories and offices and slash jobs. This is both highly significant and dangerous. Capital, bluntly put, has gone on strike. Those who own wealth are pushing it to the sidelines, as a young and inexperienced president tries to jam through the most sweeping economic changes in over 70 years. The prospect of these changes becoming law has already radically altered our nation's economy. Entrepreneurs and CEOs who once created new products, new services, jobs and trillions in wealth for America's workers and retirees now find themselves vilified and punished for their success. ABC News reported this week that many upper-income taxpayers already are planning to cut back on work and investments to stay under $250,000 in income — the point where Obama's punitive taxes kick in. No one wins from this, yet Obama seems oblivious. This isn't the only warning sign. A new study asserts that some 100,000 highly educated, well-trained Indians now living in the U.S. will return home in the next few years. Ditto China. Immigrant entrepreneurs are highly sensitive bellwethers of economic and social conditions. They know where the opportunities are — and where they aren't. They're voting with their feet. The economy shrank 6.2% in the fourth quarter, worse than first expected. Home sales continue to fall, unemployment is rising sharply, and business investment is prostrate. Such an economy cries out for tax cuts, but we get none. Just punishment of those with wealth who might be able to pull us out of the slump. An estimated $1.4 trillion in new taxes planned by the new administration over the next decade explicitly target the people President Teddy Roosevelt once derided as the \"malefactors of great wealth\" — those in the top 5% of the income spectrum. Yet, they're the ones who've made our economy the envy of the world. By the way, under Obama's plan the rich won't pick up the whole tab. New energy taxes of $646 billion will hit the middle-class hard. Meanwhile, in just eight years, our national debt will double to $20 trillion, as nondefense federal spending jumps from the long-term average of 16.5% of GDP to above 23%. You — or your children — face higher taxes for decades to come. As our stock markets melt under a barrage of new taxes on incomes, estates, capital gains, dividends and energy, it's good to recall that more than 100 million people own stocks or mutual funds. And that the stock market is the main wealth- and growth-creating mechanism in our capitalist society. But when taxes go up, regulations proliferate and the rule of law and private property protections are weakened, the economy will invariably suffer. This is a universal lesson of economic history, one we ignore at our peril. And yes, this is what's happening now. No, we don't blame all our current ills on President Obama. He came in at a tough time, when many bad decisions had already been made. But he is responsible for what he's done since. His stimulus package is little more than a down payment on a socialist economy. It raises taxes on the successful, brings back the welfare state, hands out favors and cash to friends of one political party, while imposing government control over the entire free market in ways that just a year ago would have seemed unimaginable. Another one: 'http://online.wsj.com/article/SB123604419092515347.html?mod=rss_opinion_main' quote: As 2009 opened, three weeks before Barack Obama took office, the Dow Jones Industrial Average closed at 9034 on January 2, its highest level since the autumn panic. Yesterday the Dow fell another 4.24% to 6763, for an overall decline of 25% in two months and to its lowest level since 1997. The dismaying message here is that President Obama's policies have become part of the economy's problem. Americans have welcomed the Obama era in the same spirit of hope the President campaigned on. But after five weeks in office, it's become clear that Mr. Obama's policies are slowing, if not stopping, what would otherwise be the normal process of economic recovery. From punishing business to squandering scarce national public resources, Team Obama is creating more uncertainty and less confidence -- and thus a longer period of recession or subpar growth. The Democrats who now run Washington don't want to hear this, because they benefit from blaming all bad economic news on President Bush. And Mr. Obama has inherited an unusual recession deepened by credit problems, both of which will take time to climb out of. But it's also true that the economy has fallen far enough, and long enough, that much of the excess that led to recession is being worked off. Already 15 months old, the current recession will soon match the average length -- and average job loss -- of the last three postwar downturns. What goes down will come up -- unless destructive policies interfere with the sources of potential recovery.", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 07:29:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by NOVAMarine: quote: Originally posted by GunnyRet03: They're still running a campaign. Just dog and pony shows. They are just using this situation to push a socialist/liberal agenda. And wallstreet knws it. COMMENT: ... or could it just be that the economy is in such dire straits that there's virtually no confidence at this time without some glimmer of hope rising from the continued bad news of spiraling unemployment, dismal corporate news, an inelastic lending system, et al? This crisis clearly transcends partisan labeling at this point, but if your \"dying words\" as you're drowning is to condemn one political party or another, then enjoy it, I suppose, since that solitary satisfaction is meaningless and won't save you anyway. If you cant see that this Adm has an agenda I cant help you. And that fact is not helping the markets. The last bill was a joke and everyone knows it or there would have been debate on it, not a cramming down of throats and the market forecasts on future and obviously wallstreet knows the baby is ugly. I have mutauals and I watch the money shows on all networks and the editorial below is what they are saying. Yes, I am a conservative and I am not happy at what is going on and I take no joy in watching my hard earned money disappear. I didnt agree with the first bailout by gb2 and the Dems nothing has changed except worse, Thank god I have a retirement check I feel sorry for people who have been putting money in 401k's and thats all they have co'z SS wont be there, hoepfully they will have enough shares and make up for some when the market goes back up. But for Seniors that are taking money out now co'z of fed law they are truly screwed they dont have time to wait it out. So, keep the social engineering and expansion of govt out of these 'economic' bills and we might be better off. It's unfortunate that the market is partisan. 'http://www.ibdeditorials.com/IBDArticles.aspx?id=320892987513114' In the three months since the election, the broadest measure of the stock market's value, the Wilshire 5000 Index, has plunged more than 30%, slicing over $3 trillion from Americans' wealth. Investors have walked away from investing, while businesses shut down factories and offices and slash jobs. This is both highly significant and dangerous. Capital, bluntly put, has gone on strike. Those who own wealth are pushing it to the sidelines, as a young and inexperienced president tries to jam through the most sweeping economic changes in over 70 years. The prospect of these changes becoming law has already radically altered our nation's economy. Entrepreneurs and CEOs who once created new products, new services, jobs and trillions in wealth for America's workers and retirees now find themselves vilified and punished for their success. ABC News reported this week that many upper-income taxpayers already are planning to cut back on work and investments to stay under $250,000 in income — the point where Obama's punitive taxes kick in. No one wins from this, yet Obama seems oblivious. This isn't the only warning sign. A new study asserts that some 100,000 highly educated, well-trained Indians now living in the U.S. will return home in the next few years. Ditto China. Immigrant entrepreneurs are highly sensitive bellwethers of economic and social conditions. They know where the opportunities are — and where they aren't. They're voting with their feet. The economy shrank 6.2% in the fourth quarter, worse than first expected. Home sales continue to fall, unemployment is rising sharply, and business investment is prostrate. Such an economy cries out for tax cuts, but we get none. Just punishment of those with wealth who might be able to pull us out of the slump. An estimated $1.4 trillion in new taxes planned by the new administration over the next decade explicitly target the people President Teddy Roosevelt once derided as the \"malefactors of great wealth\" — those in the top 5% of the income spectrum. Yet, they're the ones who've made our economy the envy of the world. By the way, under Obama's plan the rich won't pick up the whole tab. New energy taxes of $646 billion will hit the middle-class hard. Meanwhile, in just eight years, our national debt will double to $20 trillion, as nondefense federal spending jumps from the long-term average of 16.5% of GDP to above 23%. You — or your children — face higher taxes for decades to come. As our stock markets melt under a barrage of new taxes on incomes, estates, capital gains, dividends and energy, it's good to recall that more than 100 million people own stocks or mutual funds. And that the stock market is the main wealth- and growth-creating mechanism in our capitalist society. But when taxes go up, regulations proliferate and the rule of law and private property protections are weakened, the economy will invariably suffer. This is a universal lesson of economic history, one we ignore at our peril. And yes, this is what's happening now. No, we don't blame all our current ills on President Obama. He came in at a tough time, when many bad decisions had already been made. But he is responsible for what he's done since. His stimulus package is little more than a down payment on a socialist economy. It raises taxes on the successful, brings back the welfare state, hands out favors and cash to friends of one political party, while imposing government control over the entire free market in ways that just a year ago would have seemed unimaginable. Another one: 'http://online.wsj.com/article/SB123604419092515347.html?mod=rss_opinion_main' quote: As 2009 opened, three weeks before Barack Obama took office, the Dow Jones Industrial Average closed at 9034 on January 2, its highest level since the autumn panic. Yesterday the Dow fell another 4.24% to 6763, for an overall decline of 25% in two months and to its lowest level since 1997. The dismaying message here is that President Obama's policies have become part of the economy's problem. Americans have welcomed the Obama era in the same spirit of hope the President campaigned on. But after five weeks in office, it's become clear that Mr. Obama's policies are slowing, if not stopping, what would otherwise be the normal process of economic recovery. From punishing business to squandering scarce national public resources, Team Obama is creating more uncertainty and less confidence -- and thus a longer period of recession or subpar growth. The Democrats who now run Washington don't want to hear this, because they benefit from blaming all bad economic news on President Bush. And Mr. Obama has inherited an unusual recession deepened by credit problems, both of which will take time to climb out of. But it's also true that the economy has fallen far enough, and long enough, that much of the excess that led to recession is being worked off. Already 15 months old, the current recession will soon match the average length -- and average job loss -- of the last three postwar downturns. What goes down will come up -- unless destructive policies interfere with the sources of potential recovery. Very well said. Anyone who thinks Barry and Company are doing a good job needs their heads examined!", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by NOVAMarine: quote: Originally posted by GunnyRet03: They're still running a campaign. Just dog and pony shows. They are just using this situation to push a socialist/liberal agenda. And wallstreet knws it. COMMENT: ... or could it just be that the economy is in such dire straits that there's virtually no confidence at this time without some glimmer of hope rising from the continued bad news of spiraling unemployment, dismal corporate news, an inelastic lending system, et al? This crisis clearly transcends partisan labeling at this point, but if your \"dying words\" as you're drowning is to condemn one political party or another, then enjoy it, I suppose, since that solitary satisfaction is meaningless and won't save you anyway. If you cant see that this Adm has an agenda I cant help you. And that fact is not helping the markets. The last bill was a joke and everyone knows it or there would have been debate on it, not a cramming down of throats and the market forecasts on future and obviously wallstreet knows the baby is ugly. I have mutauals and I watch the money shows on all networks and the editorial below is what they are saying. Yes, I am a conservative and I am not happy at what is going on and I take no joy in watching my hard earned money disappear. I didnt agree with the first bailout by gb2 and the Dems nothing has changed except worse, Thank god I have a retirement check I feel sorry for people who have been putting money in 401k's and thats all they have co'z SS wont be there, hoepfully they will have enough shares and make up for some when the market goes back up. But for Seniors that are taking money out now co'z of fed law they are truly screwed they dont have time to wait it out. So, keep the social engineering and expansion of govt out of these 'economic' bills and we might be better off. It's unfortunate that the market is partisan. 'http://www.ibdeditorials.com/IBDArticles.aspx?id=320892987513114' In the three months since the election, the broadest measure of the stock market's value, the Wilshire 5000 Index, has plunged more than 30%, slicing over $3 trillion from Americans' wealth. Investors have walked away from investing, while businesses shut down factories and offices and slash jobs. This is both highly significant and dangerous. Capital, bluntly put, has gone on strike. Those who own wealth are pushing it to the sidelines, as a young and inexperienced president tries to jam through the most sweeping economic changes in over 70 years. The prospect of these changes becoming law has already radically altered our nation's economy. Entrepreneurs and CEOs who once created new products, new services, jobs and trillions in wealth for America's workers and retirees now find themselves vilified and punished for their success. ABC News reported this week that many upper-income taxpayers already are planning to cut back on work and investments to stay under $250,000 in income — the point where Obama's punitive taxes kick in. No one wins from this, yet Obama seems oblivious. This isn't the only warning sign. A new study asserts that some 100,000 highly educated, well-trained Indians now living in the U.S. will return home in the next few years. Ditto China. Immigrant entrepreneurs are highly sensitive bellwethers of economic and social conditions. They know where the opportunities are — and where they aren't. They're voting with their feet. The economy shrank 6.2% in the fourth quarter, worse than first expected. Home sales continue to fall, unemployment is rising sharply, and business investment is prostrate. Such an economy cries out for tax cuts, but we get none. Just punishment of those with wealth who might be able to pull us out of the slump. An estimated $1.4 trillion in new taxes planned by the new administration over the next decade explicitly target the people President Teddy Roosevelt once derided as the \"malefactors of great wealth\" — those in the top 5% of the income spectrum. Yet, they're the ones who've made our economy the envy of the world. By the way, under Obama's plan the rich won't pick up the whole tab. New energy taxes of $646 billion will hit the middle-class hard. Meanwhile, in just eight years, our national debt will double to $20 trillion, as nondefense federal spending jumps from the long-term average of 16.5% of GDP to above 23%. You — or your children — face higher taxes for decades to come. As our stock markets melt under a barrage of new taxes on incomes, estates, capital gains, dividends and energy, it's good to recall that more than 100 million people own stocks or mutual funds. And that the stock market is the main wealth- and growth-creating mechanism in our capitalist society. But when taxes go up, regulations proliferate and the rule of law and private property protections are weakened, the economy will invariably suffer. This is a universal lesson of economic history, one we ignore at our peril. And yes, this is what's happening now. No, we don't blame all our current ills on President Obama. He came in at a tough time, when many bad decisions had already been made. But he is responsible for what he's done since. His stimulus package is little more than a down payment on a socialist economy. It raises taxes on the successful, brings back the welfare state, hands out favors and cash to friends of one political party, while imposing government control over the entire free market in ways that just a year ago would have seemed unimaginable. Another one: 'http://online.wsj.com/article/SB123604419092515347.html?mod=rss_opinion_main' quote: As 2009 opened, three weeks before Barack Obama took office, the Dow Jones Industrial Average closed at 9034 on January 2, its highest level since the autumn panic. Yesterday the Dow fell another 4.24% to 6763, for an overall decline of 25% in two months and to its lowest level since 1997. The dismaying message here is that President Obama's policies have become part of the economy's problem. Americans have welcomed the Obama era in the same spirit of hope the President campaigned on. But after five weeks in office, it's become clear that Mr. Obama's policies are slowing, if not stopping, what would otherwise be the normal process of economic recovery. From punishing business to squandering scarce national public resources, Team Obama is creating more uncertainty and less confidence -- and thus a longer period of recession or subpar growth. The Democrats who now run Washington don't want to hear this, because they benefit from blaming all bad economic news on President Bush. And Mr. Obama has inherited an unusual recession deepened by credit problems, both of which will take time to climb out of. But it's also true that the economy has fallen far enough, and long enough, that much of the excess that led to recession is being worked off. Already 15 months old, the current recession will soon match the average length -- and average job loss -- of the last three postwar downturns. What goes down will come up -- unless destructive policies interfere with the sources of potential recovery.", 
        "reply": " Very well said. Anyone who thinks Barry and Company are doing a good job needs their heads examined!", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 16:24:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Now he is telling people what stocks to buy?", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "", 
        "reply": "Now he is telling people what stocks to buy?", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 18:08:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "In my opinion, the market views President Obama as the Anti-Reagan and will not only end deregulation, he will move in the opposite directon. The result, at best, will be a stagnant economy. This thought came to me while reading a history of the trucking industry in the USA, Big Rigs of the 1950s by Ron Adams. At the top of page 7 Mr. Adams wrote something that caught my eye: \"It's likely that more new trucking companies were formed in the first five years following WWII than at any other time except the period following deregulation in the 1980s.\" I added the emphasis, but the wording comes directly from the source. The point is that deregulation got the economy moving and created jobs. The first thing that must be done to get the economy moving is to get the lending industry squared away. With that done, the economy will begin to improve. And while some oversites of banking and industry will always be necessary, reversing what President Reagan would be a huge mistake.", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "", 
        "reply": "In my opinion, the market views President Obama as the Anti-Reagan and will not only end deregulation, he will move in the opposite directon. The result, at best, will be a stagnant economy. This thought came to me while reading a history of the trucking industry in the USA, Big Rigs of the 1950s by Ron Adams. At the top of page 7 Mr. Adams wrote something that caught my eye: \"It's likely that more new trucking companies were formed in the first five years following WWII than at any other time except the period following deregulation in the 1980s.\" I added the emphasis, but the wording comes directly from the source. The point is that deregulation got the economy moving and created jobs. The first thing that must be done to get the economy moving is to get the lending industry squared away. With that done, the economy will begin to improve. And while some oversites of banking and industry will always be necessary, reversing what President Reagan would be a huge mistake.", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 23:12:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Very well said. Anyone who thinks Barry and Company are doing a good job needs their heads examined!", 
        "intTime": 20090303, 
        "postID": 10, 
        "quote": "Originally posted by Mom2APAJ: Very well said. Anyone who thinks Barry and Company are doing a good job needs their heads examined!", 
        "reply": "", 
        "threadID": "409192893_7000077612001", 
        "time": "2009-03-03 23:24:00", 
        "title": "Obama part of the economic problem ?!", 
        "userID": "samh32"
    }
]