[
    {
        "content": "this is the man he needs to talk to, or maybe Hillary should talk to him, what a deal they can make \"http://www.copticnews.ca/video/feb262009_nafisi.wmv\"", 
        "intTime": 20090317, 
        "postID": 1, 
        "quote": "", 
        "reply": "this is the man he needs to talk to, or maybe Hillary should talk to him, what a deal they can make \"http://www.copticnews.ca/video/feb262009_nafisi.wmv\"", 
        "threadID": "409192893_6080080812001", 
        "time": "2009-03-17 08:19:00", 
        "title": "A PERFECT CANDIDATE FOR PBHO TO MEET FOR NEGOTIATIONS FOR PEACE WITH ISLAMISTS", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Obama or Hillary? Maybe you should talk to George Bush about that. Abdulla F. Alnafisi is currently a Professor at the University of Kuwait (You remember Kuwait, don't you? The country G.H.W. Bush sent American troops in to liberate and currently the linchpin of our efforts in Iraq?). He also appears to be a partner in First Dubai Real Estate Development Company, a subsidiary of Al Mazaya, who is heavily involved in developing real estate projects in the UAE, in partnership with the Carlisle Group, among others. You're familiar with the Carlisle Group, aren't you?", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "Obama or Hillary? Maybe you should talk to George Bush about that. Abdulla F. Alnafisi is currently a Professor at the University of Kuwait (You remember Kuwait, don't you? The country G.H.W. Bush sent American troops in to liberate and currently the linchpin of our efforts in Iraq?). He also appears to be a partner in First Dubai Real Estate Development Company, a subsidiary of Al Mazaya, who is heavily involved in developing real estate projects in the UAE, in partnership with the Carlisle Group, among others. You're familiar with the Carlisle Group, aren't you?", 
        "threadID": "409192893_6080080812001", 
        "time": "2009-03-17 08:47:00", 
        "title": "A PERFECT CANDIDATE FOR PBHO TO MEET FOR NEGOTIATIONS FOR PEACE WITH ISLAMISTS", 
        "userID": "stillkit"
    }, 
    {
        "content": "I think, after listening to this morning news, they should start with the Islamic Saudi Academy in Alexandria, VA. Seems there has been a request for them to change the extremist language of their textbooks since 2004, right here in the good ole US of A.", 
        "intTime": 20090317, 
        "postID": 3, 
        "quote": "", 
        "reply": "I think, after listening to this morning news, they should start with the Islamic Saudi Academy in Alexandria, VA. Seems there has been a request for them to change the extremist language of their textbooks since 2004, right here in the good ole US of A.", 
        "threadID": "409192893_6080080812001", 
        "time": "2009-03-17 09:42:00", 
        "title": "A PERFECT CANDIDATE FOR PBHO TO MEET FOR NEGOTIATIONS FOR PEACE WITH ISLAMISTS", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Obama or Hillary? Maybe you should talk to George Bush about that. Abdulla F. Alnafisi is currently a Professor at the University of Kuwait (You remember Kuwait, don't you? The country G.H.W. Bush sent American troops in to liberate and currently the linchpin of our efforts in Iraq?). He also appears to be a partner in First Dubai Real Estate Development Company, a subsidiary of Al Mazaya, who is heavily involved in developing real estate projects in the UAE, in partnership with the Carlisle Group, among others. You're familiar with the Carlisle Group, aren't you? what in the hell does bush 41 or 43 have to do with it now, this is one individual that needs to be taken care of, the only president we have is the one we got, unfortunately and he is the one that wants to discuss and or meet with terrorists, this would be a good place. and i could give rats behind where this guy came from, comes from.", 
        "intTime": 20090317, 
        "postID": 4, 
        "quote": "Originally posted by stillkit: Obama or Hillary? Maybe you should talk to George Bush about that. Abdulla F. Alnafisi is currently a Professor at the University of Kuwait (You remember Kuwait, don't you? The country G.H.W. Bush sent American troops in to liberate and currently the linchpin of our efforts in Iraq?). He also appears to be a partner in First Dubai Real Estate Development Company, a subsidiary of Al Mazaya, who is heavily involved in developing real estate projects in the UAE, in partnership with the Carlisle Group, among others. You're familiar with the Carlisle Group, aren't you?", 
        "reply": " what in the hell does bush 41 or 43 have to do with it now, this is one individual that needs to be taken care of, the only president we have is the one we got, unfortunately and he is the one that wants to discuss and or meet with terrorists, this would be a good place. and i could give rats behind where this guy came from, comes from.", 
        "threadID": "409192893_6080080812001", 
        "time": "2009-03-17 11:29:00", 
        "title": "A PERFECT CANDIDATE FOR PBHO TO MEET FOR NEGOTIATIONS FOR PEACE WITH ISLAMISTS", 
        "userID": "Ira1945"
    }
]