[
    {
        "content": "Huffington Post WASHINGTON — The Senate's top Democrat on Thursday proposed new federal authority to build special power lines that carry renewable energy _ like solar and wind power _ from remote places. The Federal government would be able override states and direct where the lines would go and who would pay for them. In unveiling the proposal, Senate Majority Leader Harry Reid of Nevada said an increased federal role in locating power lines was needed to encourage greater availability of electricity produced from wind, solar, geothermal and other renewable energy sources. While states and the federal government would jointly develop \"green\" transmission plans for such areas, the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue Senator Reid may be looking for a new career move after this term. He probably doesn't really care, after his questionable land deal in Nevada, he will probably set for life when the rail system goes through from L.A. to Vegas.", 
        "intTime": 20090307, 
        "postID": 1, 
        "quote": "", 
        "reply": "Huffington Post WASHINGTON — The Senate's top Democrat on Thursday proposed new federal authority to build special power lines that carry renewable energy _ like solar and wind power _ from remote places. The Federal government would be able override states and direct where the lines would go and who would pay for them. In unveiling the proposal, Senate Majority Leader Harry Reid of Nevada said an increased federal role in locating power lines was needed to encourage greater availability of electricity produced from wind, solar, geothermal and other renewable energy sources. While states and the federal government would jointly develop \"green\" transmission plans for such areas, the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue Senator Reid may be looking for a new career move after this term. He probably doesn't really care, after his questionable land deal in Nevada, he will probably set for life when the rail system goes through from L.A. to Vegas.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 07:05:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "airwing1"
    }, 
    {
        "content": "I think it is time that all State Governments sign off on the Declaration of State Sovereignty. 31 State Legislatures have already or are in the process of passing such Declarations as noted in another thread. Then all Fifty State should completely ignore the federal government's dictates. All fifty Stats need to refuse to take federal government monie's and deal the best as they can. Yes it will be hard on the States and us, things will not get done, sevices will not be performed, so they will have to cut back. However in the long run I believe it will better for all. The Imperial federal government needs to be put in it's place as to what it can and cannot do per the U.S. Constitution. Frisco", 
        "intTime": 20090307, 
        "postID": 2, 
        "quote": "", 
        "reply": "I think it is time that all State Governments sign off on the Declaration of State Sovereignty. 31 State Legislatures have already or are in the process of passing such Declarations as noted in another thread. Then all Fifty State should completely ignore the federal government's dictates. All fifty Stats need to refuse to take federal government monie's and deal the best as they can. Yes it will be hard on the States and us, things will not get done, sevices will not be performed, so they will have to cut back. However in the long run I believe it will better for all. The Imperial federal government needs to be put in it's place as to what it can and cannot do per the U.S. Constitution. Frisco", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 07:22:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "quote: Originally posted by airwing1: Huffington Post WASHINGTON — The Senate's top Democrat on Thursday proposed new federal authority to build special power lines that carry renewable energy _ like solar and wind power _ from remote places. The Federal government would be able override states and direct where the lines would go and who would pay for them. In unveiling the proposal, Senate Majority Leader Harry Reid of Nevada said an increased federal role in locating power lines was needed to encourage greater availability of electricity produced from wind, solar, geothermal and other renewable energy sources. While states and the federal government would jointly develop \"green\" transmission plans for such areas, the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue Senator Reid may be looking for a new career move after this term. He probably doesn't really care, after his questionable land deal in Nevada, he will probably set for life when the rail system goes through from L.A. to Vegas. Does that mean that wind turbines will finally be put off the coast of Massachusetts regardless of what teddy says? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090307, 
        "postID": 3, 
        "quote": "Originally posted by airwing1: Huffington Post WASHINGTON — The Senate's top Democrat on Thursday proposed new federal authority to build special power lines that carry renewable energy _ like solar and wind power _ from remote places. The Federal government would be able override states and direct where the lines would go and who would pay for them. In unveiling the proposal, Senate Majority Leader Harry Reid of Nevada said an increased federal role in locating power lines was needed to encourage greater availability of electricity produced from wind, solar, geothermal and other renewable energy sources. While states and the federal government would jointly develop \"green\" transmission plans for such areas, the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue Senator Reid may be looking for a new career move after this term. He probably doesn't really care, after his questionable land deal in Nevada, he will probably set for life when the rail system goes through from L.A. to Vegas.", 
        "reply": " Does that mean that wind turbines will finally be put off the coast of Massachusetts regardless of what teddy says? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 08:10:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by airwing1: Huffington Post WASHINGTON — The Senate's top Democrat on Thursday proposed new federal authority to build special power lines that carry renewable energy _ like solar and wind power _ from remote places. The Federal government would be able override states and direct where the lines would go and who would pay for them. In unveiling the proposal, Senate Majority Leader Harry Reid of Nevada said an increased federal role in locating power lines was needed to encourage greater availability of electricity produced from wind, solar, geothermal and other renewable energy sources. While states and the federal government would jointly develop \"green\" transmission plans for such areas, the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue Senator Reid may be looking for a new career move after this term. He probably doesn't really care, after his questionable land deal in Nevada, he will probably set for life when the rail system goes through from L.A. to Vegas. Does that mean that wind turbines will finally be put off the coast of Massachusetts regardless of what teddy says? Aaahh! Probably not, Senator Kennedy and the Kennedy Clan have eminent domain in Mass.", 
        "intTime": 20090307, 
        "postID": 4, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by airwing1: Huffington Post WASHINGTON — The Senate's top Democrat on Thursday proposed new federal authority to build special power lines that carry renewable energy _ like solar and wind power _ from remote places. The Federal government would be able override states and direct where the lines would go and who would pay for them. In unveiling the proposal, Senate Majority Leader Harry Reid of Nevada said an increased federal role in locating power lines was needed to encourage greater availability of electricity produced from wind, solar, geothermal and other renewable energy sources. While states and the federal government would jointly develop \"green\" transmission plans for such areas, the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue Senator Reid may be looking for a new career move after this term. He probably doesn't really care, after his questionable land deal in Nevada, he will probably set for life when the rail system goes through from L.A. to Vegas. Does that mean that wind turbines will finally be put off the coast of Massachusetts regardless of what teddy says?", 
        "reply": " Aaahh! Probably not, Senator Kennedy and the Kennedy Clan have eminent domain in Mass.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 08:20:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "airwing1"
    }, 
    {
        "content": "As long as they are in a control area and away from national parks.", 
        "intTime": 20090307, 
        "postID": 5, 
        "quote": "", 
        "reply": "As long as they are in a control area and away from national parks.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 08:26:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "world_king377"
    }, 
    {
        "content": "Generally speaking, I like the notion of \"renewable\" and \"alternative\" energy. I think something like that's gotta happen. I just chafe at it being mandated from the top down rather than grown from the bottom up.", 
        "intTime": 20090307, 
        "postID": 6, 
        "quote": "", 
        "reply": "Generally speaking, I like the notion of \"renewable\" and \"alternative\" energy. I think something like that's gotta happen. I just chafe at it being mandated from the top down rather than grown from the bottom up.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 08:38:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "quote: Originally posted by cheapthrills: Generally speaking, I like the notion of \"renewable\" and \"alternative\" energy. I think something like that's gotta happen. I just chafe at it being mandated from the top down rather than grown from the bottom up. I agree to a point. The grid needs to be upgraded but there always needs to be a back-up system in place. Why not upgrade the system we have while doing this grand scheme slowly? We're already going to charge power companies for producing clean fuel, that cost will be passed on. The total cost in the final analysis will be passed on to the consumer. As of today this is the national total debt. $10,959,703,310,893.60 The taxpayers are being bled to death by a thousand cuts.", 
        "intTime": 20090307, 
        "postID": 7, 
        "quote": "Originally posted by cheapthrills: Generally speaking, I like the notion of \"renewable\" and \"alternative\" energy. I think something like that's gotta happen. I just chafe at it being mandated from the top down rather than grown from the bottom up.", 
        "reply": " I agree to a point. The grid needs to be upgraded but there always needs to be a back-up system in place. Why not upgrade the system we have while doing this grand scheme slowly? We're already going to charge power companies for producing clean fuel, that cost will be passed on. The total cost in the final analysis will be passed on to the consumer. As of today this is the national total debt. $10,959,703,310,893.60 The taxpayers are being bled to death by a thousand cuts.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 09:24:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "airwing1"
    }, 
    {
        "content": "You have to remember that when the wind don't blow and the sun don't glow, stuff run by \"alternative energy\" don't go. This is another power grab (no pun intended) by the fed. At this rate we'll be completely under their thumbs before long (like we aren't already).", 
        "intTime": 20090307, 
        "postID": 8, 
        "quote": "", 
        "reply": "You have to remember that when the wind don't blow and the sun don't glow, stuff run by \"alternative energy\" don't go. This is another power grab (no pun intended) by the fed. At this rate we'll be completely under their thumbs before long (like we aren't already).", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 09:27:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by cheapthrills: Generally speaking, I like the notion of \"renewable\" and \"alternative\" energy. I think something like that's gotta happen. I just chafe at it being mandated from the top down rather than grown from the bottom up. Some things (like civil rights for women, minorities, the handicapped for example) don't happen unless they're mandated from the top down.", 
        "intTime": 20090307, 
        "postID": 9, 
        "quote": "Originally posted by cheapthrills: Generally speaking, I like the notion of \"renewable\" and \"alternative\" energy. I think something like that's gotta happen. I just chafe at it being mandated from the top down rather than grown from the bottom up.", 
        "reply": " Some things (like civil rights for women, minorities, the handicapped for example) don't happen unless they're mandated from the top down.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 09:29:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "liberal90"
    }, 
    {
        "content": "I'll bet Harry bypasses EPA studies, wildlife studies, etc. with this new Federal authority, if he gets this proposal through. What do rights matter when one party is in power anyway. Regulations? Not for these Feds to follow.", 
        "intTime": 20090307, 
        "postID": 10, 
        "quote": "", 
        "reply": "I'll bet Harry bypasses EPA studies, wildlife studies, etc. with this new Federal authority, if he gets this proposal through. What do rights matter when one party is in power anyway. Regulations? Not for these Feds to follow.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 09:32:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "The electric power grid as it is now is a hodge-podge of privately and publically owned transmission lines and generation facilities. You've got everyone from Duke Power to the TVA to various cities generating and moving power from one place to another. Virtually the same thing can be said of the natural gas system. Electric power is also bought and sold on the market with very little regulation. That's how Enron was able to screw over the customers in California. Overall, it's a system in dire need of not only an overhaul, but a central, guiding hand. As I understand it, the so-called \"smart grid\" which Obama's plan will likely be based upon, uses computers to control and direct power generation and distribution. Those computers will constantly monitor power demand and shift production and distribution from one place to another to meet the local demand. While that may include a necessity for the main trunk lines, or even the whole distribution system, to be owned by the government, it doesn't necessarily require the government to own the means of production. However, it may very well mean that your local generating station, whether privately or publically owned, will be at the beck and call of the smart grid. Since there is no way to store excess electricity, the smart grid will keep a watch over the entire country and bring production facilities on-line to meet demand or, take them off-line when demand is reduced. IF it is programmed to favor clean production, that means the coal and natural gas-fired plants will see their production time, and profit, decrease as clean sources are built, ultimately fading away for good. That's the real foundation of their opposition to Obama's projected plans, in spite of how often they say it will increase your electicity bill by X number of dollars. The only thing holding up more clean production is transmission lines, which don't go where the best wind or solar conditions prevail. New lines must be built to accomodate the wind turbines in Texas or Iowa or offshore and the solar generators in California and Nevada. That's what they are talking about here. Remember, the current grid is set up to accomodate coal or gas-fired plants which can be built just about anywhere. Building those new transmission lines will be a problem UNLESS the federal government, which will presumably own the lines, has the authority to over-rule local and/or state objections. Without that authority, it could take decades to build as each new line has to fight it's way through hundreds of NIMBY lawsuits. The bottom line is this: Do you WANT to have clean power available as soon as possible? If you do, support this idea. And, it's nothing new. The same fight was fought over the interstate highway system and I'm betting few now object to that.", 
        "intTime": 20090307, 
        "postID": 11, 
        "quote": "", 
        "reply": "The electric power grid as it is now is a hodge-podge of privately and publically owned transmission lines and generation facilities. You've got everyone from Duke Power to the TVA to various cities generating and moving power from one place to another. Virtually the same thing can be said of the natural gas system. Electric power is also bought and sold on the market with very little regulation. That's how Enron was able to screw over the customers in California. Overall, it's a system in dire need of not only an overhaul, but a central, guiding hand. As I understand it, the so-called \"smart grid\" which Obama's plan will likely be based upon, uses computers to control and direct power generation and distribution. Those computers will constantly monitor power demand and shift production and distribution from one place to another to meet the local demand. While that may include a necessity for the main trunk lines, or even the whole distribution system, to be owned by the government, it doesn't necessarily require the government to own the means of production. However, it may very well mean that your local generating station, whether privately or publically owned, will be at the beck and call of the smart grid. Since there is no way to store excess electricity, the smart grid will keep a watch over the entire country and bring production facilities on-line to meet demand or, take them off-line when demand is reduced. IF it is programmed to favor clean production, that means the coal and natural gas-fired plants will see their production time, and profit, decrease as clean sources are built, ultimately fading away for good. That's the real foundation of their opposition to Obama's projected plans, in spite of how often they say it will increase your electicity bill by X number of dollars. The only thing holding up more clean production is transmission lines, which don't go where the best wind or solar conditions prevail. New lines must be built to accomodate the wind turbines in Texas or Iowa or offshore and the solar generators in California and Nevada. That's what they are talking about here. Remember, the current grid is set up to accomodate coal or gas-fired plants which can be built just about anywhere. Building those new transmission lines will be a problem UNLESS the federal government, which will presumably own the lines, has the authority to over-rule local and/or state objections. Without that authority, it could take decades to build as each new line has to fight it's way through hundreds of NIMBY lawsuits. The bottom line is this: Do you WANT to have clean power available as soon as possible? If you do, support this idea. And, it's nothing new. The same fight was fought over the interstate highway system and I'm betting few now object to that.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 10:45:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue This is what I don't like. Where does the revenue go? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090307, 
        "postID": 12, 
        "quote": "the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue", 
        "reply": " This is what I don't like. Where does the revenue go? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 10:49:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue This is what I don't like. It goes the land-owner. And, besides, how is this any different or any worse than private companies having the same power? Don't think they do? Just wait until PG&E or Duke or Mesa or some other company wants to build a power line or bury a gas line across your property.", 
        "intTime": 20090307, 
        "postID": 13, 
        "quote": "Originally posted by aggie_swife: quote: the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue This is what I don't like.", 
        "reply": " It goes the land-owner. And, besides, how is this any different or any worse than private companies having the same power? Don't think they do? Just wait until PG&E or Duke or Mesa or some other company wants to build a power line or bury a gas line across your property.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 10:52:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "stillkit"
    }, 
    {
        "content": "My personal hesistancy for the Federal Government running anything is the control factor. They get to determine how much is used, when you can use it and we become more and more the servant of the government. We have become so complacent because the government bureacrats do it so incrementally we don't even see it happening. A smart grid will eventually be able to monitor personal consumption, you will start being fined if you don't use this or that type of appliance. It may not be today or tomorrow but ultimately the government will gain complete control. I may not live to see it but due to complacency and the populace ever dependency on government, it will occur.", 
        "intTime": 20090307, 
        "postID": 14, 
        "quote": "", 
        "reply": "My personal hesistancy for the Federal Government running anything is the control factor. They get to determine how much is used, when you can use it and we become more and more the servant of the government. We have become so complacent because the government bureacrats do it so incrementally we don't even see it happening. A smart grid will eventually be able to monitor personal consumption, you will start being fined if you don't use this or that type of appliance. It may not be today or tomorrow but ultimately the government will gain complete control. I may not live to see it but due to complacency and the populace ever dependency on government, it will occur.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-07 12:53:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "airwing1"
    }, 
    {
        "content": "One single bi-partisan issue that could speak very loudly for the American people, if American people got behind it...to take back your country. \"www.fairtax.org\"", 
        "intTime": 20090308, 
        "postID": 15, 
        "quote": "", 
        "reply": "One single bi-partisan issue that could speak very loudly for the American people, if American people got behind it...to take back your country. \"www.fairtax.org\"", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-08 13:22:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by airwing1: quote: Originally posted by aggie_swife: quote: Originally posted by airwing1: Huffington Post WASHINGTON — The Senate's top Democrat on Thursday proposed new federal authority to build special power lines that carry renewable energy _ like solar and wind power _ from remote places. The Federal government would be able override states and direct where the lines would go and who would pay for them. In unveiling the proposal, Senate Majority Leader Harry Reid of Nevada said an increased federal role in locating power lines was needed to encourage greater availability of electricity produced from wind, solar, geothermal and other renewable energy sources. While states and the federal government would jointly develop \"green\" transmission plans for such areas, the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue Senator Reid may be looking for a new career move after this term. He probably doesn't really care, after his questionable land deal in Nevada, he will probably set for life when the rail system goes through from L.A. to Vegas. Does that mean that wind turbines will finally be put off the coast of Massachusetts regardless of what teddy says? Aaahh! Probably not, Senator Kennedy and the Kennedy Clan have eminent domain in Mass. Both Massachusetts and its 49 colonies now: Sir Edward, Earl of Kennedy, Duke of Boston - - Wandering and Wondering", 
        "intTime": 20090308, 
        "postID": 16, 
        "quote": "Originally posted by airwing1: quote: Originally posted by aggie_swife: quote: Originally posted by airwing1: Huffington Post WASHINGTON — The Senate's top Democrat on Thursday proposed new federal authority to build special power lines that carry renewable energy _ like solar and wind power _ from remote places. The Federal government would be able override states and direct where the lines would go and who would pay for them. In unveiling the proposal, Senate Majority Leader Harry Reid of Nevada said an increased federal role in locating power lines was needed to encourage greater availability of electricity produced from wind, solar, geothermal and other renewable energy sources. While states and the federal government would jointly develop \"green\" transmission plans for such areas, the proposal gives final say to the Federal Energy Regulatory Commission to take land under eminent domain and issue Senator Reid may be looking for a new career move after this term. He probably doesn't really care, after his questionable land deal in Nevada, he will probably set for life when the rail system goes through from L.A. to Vegas. Does that mean that wind turbines will finally be put off the coast of Massachusetts regardless of what teddy says? Aaahh! Probably not, Senator Kennedy and the Kennedy Clan have eminent domain in Mass.", 
        "reply": " Both Massachusetts and its 49 colonies now: Sir Edward, Earl of Kennedy, Duke of Boston - - Wandering and Wondering", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-08 13:27:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by airwing1: quote: Originally posted by cheapthrills: Generally speaking, I like the notion of \"renewable\" and \"alternative\" energy. I think something like that's gotta happen. I just chafe at it being mandated from the top down rather than grown from the bottom up. I agree to a point. The grid needs to be upgraded but there always needs to be a back-up system in place. Why not upgrade the system we have while doing this grand scheme slowly? We're already going to charge power companies for producing clean fuel, that cost will be passed on. The total cost in the final analysis will be passed on to the consumer. As of today this is the national total debt. $10,959,703,310,893.60 The taxpayers are being bled to death by a thousand cuts. Or ten trillion cuts", 
        "intTime": 20090308, 
        "postID": 17, 
        "quote": "Originally posted by airwing1: quote: Originally posted by cheapthrills: Generally speaking, I like the notion of \"renewable\" and \"alternative\" energy. I think something like that's gotta happen. I just chafe at it being mandated from the top down rather than grown from the bottom up. I agree to a point. The grid needs to be upgraded but there always needs to be a back-up system in place. Why not upgrade the system we have while doing this grand scheme slowly? We're already going to charge power companies for producing clean fuel, that cost will be passed on. The total cost in the final analysis will be passed on to the consumer. As of today this is the national total debt. $10,959,703,310,893.60 The taxpayers are being bled to death by a thousand cuts. Or ten trillion cuts", 
        "reply": "", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-08 14:18:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: I think it is time that all State Governments sign off on the Declaration of State Sovereignty. 31 State Legislatures have already or are in the process of passing such Declarations as noted in another thread. Then all Fifty State should completely ignore the federal government's dictates. All fifty Stats need to refuse to take federal government monie's and deal the best as they can. Yes it will be hard on the States and us, things will not get done, sevices will not be performed, so they will have to cut back. However in the long run I believe it will better for all. The Imperial federal government needs to be put in it's place as to what it can and cannot do per the U.S. Constitution. Frisco I agree with you but I fear the politicos, b'crats, and public have been sucking on the federal teat for too long. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090308, 
        "postID": 18, 
        "quote": "Originally posted by FriscoLady01: I think it is time that all State Governments sign off on the Declaration of State Sovereignty. 31 State Legislatures have already or are in the process of passing such Declarations as noted in another thread. Then all Fifty State should completely ignore the federal government's dictates. All fifty Stats need to refuse to take federal government monie's and deal the best as they can. Yes it will be hard on the States and us, things will not get done, sevices will not be performed, so they will have to cut back. However in the long run I believe it will better for all. The Imperial federal government needs to be put in it's place as to what it can and cannot do per the U.S. Constitution. Frisco", 
        "reply": " I agree with you but I fear the politicos, b'crats, and public have been sucking on the federal teat for too long. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_7730081712001", 
        "time": "2009-03-08 14:34:00", 
        "title": "Federal Government vs States Rights", 
        "userID": "Drmwvr"
    }
]