[
    {
        "content": "Who's the priority? Democrats and Poor Kids Sitting on evidence of voucher success, and the battle of New York. 'http://online.wsj.com/article/SB123897492702491091.html#printMode' Education Secretary Arne Duncan did a public service last week when he visited New York City and spoke up for charter schools and mayoral control of education. That was the reformer talking. The status quo Mr. Duncan was on display last month when he let Congress kill a District of Columbia voucher program even as he was sitting on evidence of its success. <edit> In New York City with its 1.1 million students, mayoral control has resulted in better test scores and graduation rates, while expanding charter schools, which means more and better education choices for low-income families. But mayoral control expires in June unless state lawmakers renew it, and the United Federation of Teachers is working with Assembly Speaker Sheldon Silver to weaken or kill it. President Obama's stimulus is sending some $100 billion to the nation's school districts. What will he demand in return? The state budget passed by the New York legislature last week freezes funding for charters but increases it by more that $400 million for other public schools. Perhaps a visit to a charter school in Harlem would help Mr. Obama honor his reform pledge. \"I'm looking at the data here in front of me,\" Mr. Duncan told the New York Post. \"Graduation rates are up. Test scores are up. Teacher salaries are up. Social promotion was eliminated. Dramatically increasing parental choice. That's real progress.\" Mr. Duncan's help in New York is in stark contrast to his department's decision to sit on a performance review of the D.C. voucher program while Congress debated its future in March. The latest annual evaluation was finally released Friday, and it shows measurable academic gains. The Opportunity Scholarship Program provides $7,500 vouchers to 1,700 low-income families in D.C. to send their children to private schools. Ninety-nine percent of the children are black or Hispanic, and there are more than four applicants for each scholarship. The 2008 report demonstrated progress among certain subgroups of children but not everyone. This year's report shows statistically significant academic gains for the entire voucher-receiving population. Children attending private schools with the aid of the scholarships are reading nearly a half-grade ahead of their peers who did not receive vouchers. Voucher recipients are doing no better in math but they're doing no worse. Which means that no voucher participant is in worse academic shape than before, and many students are much better off. \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" It's bad enough that Democrats are killing a program that parents love and is closing the achievement gap between poor minorities and whites. But as scandalous is that the Education Department almost certainly knew the results of this evaluation for months. Voucher recipients were tested last spring. The scores were analyzed in the late summer and early fall, and in November preliminary results were presented to a team of advisers who work with the Education Department to produce the annual evaluation. Since Education officials are intimately involved in this process, they had to know what was in this evaluation even as Democrats passed (and Mr. Obama signed) language that ends the program after next year. Opponents of school choice for poor children have long claimed they'd support vouchers if there was evidence that they work. While running for President last year, Mr. Obama told the Milwaukee Journal-Sentinel that if he saw more proof that they were successful, he would \"not allow my predisposition to stand in the way of making sure that our kids can learn . . . You do what works for the kids.\" Except, apparently, when what works is opposed by unions. Mr. Duncan's office spurned our repeated calls and emails asking what and when he and his aides knew about these results. We do know the Administration prohibited anyone involved with the evaluation from discussing it publicly. You'd think we were talking about nuclear secrets, not about a taxpayer-funded pilot program. A reasonable conclusion is that Mr. Duncan's department didn't want proof of voucher success to interfere with Senator Dick Durbin's campaign to kill vouchers at the behest of the teachers unions. The decision to let 1,700 poor kids get tossed from private schools is a moral disgrace. It also exposes the ugly politics that lies beneath union and liberal efforts across the country to undermine mayoral control, charter schools, vouchers or any reform that threatens their monopoly over public education dollars and jobs. The Sheldon Silver-Dick Durbin Democrats aren't worried that school choice doesn't work. They're worried that it does, and if Messrs. Obama and Duncan want to succeed as reformers they need to say so consistently.", 
        "intTime": 20090406, 
        "postID": 1, 
        "quote": "", 
        "reply": "Who's the priority? Democrats and Poor Kids Sitting on evidence of voucher success, and the battle of New York. 'http://online.wsj.com/article/SB123897492702491091.html#printMode' Education Secretary Arne Duncan did a public service last week when he visited New York City and spoke up for charter schools and mayoral control of education. That was the reformer talking. The status quo Mr. Duncan was on display last month when he let Congress kill a District of Columbia voucher program even as he was sitting on evidence of its success. <edit> In New York City with its 1.1 million students, mayoral control has resulted in better test scores and graduation rates, while expanding charter schools, which means more and better education choices for low-income families. But mayoral control expires in June unless state lawmakers renew it, and the United Federation of Teachers is working with Assembly Speaker Sheldon Silver to weaken or kill it. President Obama's stimulus is sending some $100 billion to the nation's school districts. What will he demand in return? The state budget passed by the New York legislature last week freezes funding for charters but increases it by more that $400 million for other public schools. Perhaps a visit to a charter school in Harlem would help Mr. Obama honor his reform pledge. \"I'm looking at the data here in front of me,\" Mr. Duncan told the New York Post. \"Graduation rates are up. Test scores are up. Teacher salaries are up. Social promotion was eliminated. Dramatically increasing parental choice. That's real progress.\" Mr. Duncan's help in New York is in stark contrast to his department's decision to sit on a performance review of the D.C. voucher program while Congress debated its future in March. The latest annual evaluation was finally released Friday, and it shows measurable academic gains. The Opportunity Scholarship Program provides $7,500 vouchers to 1,700 low-income families in D.C. to send their children to private schools. Ninety-nine percent of the children are black or Hispanic, and there are more than four applicants for each scholarship. The 2008 report demonstrated progress among certain subgroups of children but not everyone. This year's report shows statistically significant academic gains for the entire voucher-receiving population. Children attending private schools with the aid of the scholarships are reading nearly a half-grade ahead of their peers who did not receive vouchers. Voucher recipients are doing no better in math but they're doing no worse. Which means that no voucher participant is in worse academic shape than before, and many students are much better off. \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" It's bad enough that Democrats are killing a program that parents love and is closing the achievement gap between poor minorities and whites. But as scandalous is that the Education Department almost certainly knew the results of this evaluation for months. Voucher recipients were tested last spring. The scores were analyzed in the late summer and early fall, and in November preliminary results were presented to a team of advisers who work with the Education Department to produce the annual evaluation. Since Education officials are intimately involved in this process, they had to know what was in this evaluation even as Democrats passed (and Mr. Obama signed) language that ends the program after next year. Opponents of school choice for poor children have long claimed they'd support vouchers if there was evidence that they work. While running for President last year, Mr. Obama told the Milwaukee Journal-Sentinel that if he saw more proof that they were successful, he would \"not allow my predisposition to stand in the way of making sure that our kids can learn . . . You do what works for the kids.\" Except, apparently, when what works is opposed by unions. Mr. Duncan's office spurned our repeated calls and emails asking what and when he and his aides knew about these results. We do know the Administration prohibited anyone involved with the evaluation from discussing it publicly. You'd think we were talking about nuclear secrets, not about a taxpayer-funded pilot program. A reasonable conclusion is that Mr. Duncan's department didn't want proof of voucher success to interfere with Senator Dick Durbin's campaign to kill vouchers at the behest of the teachers unions. The decision to let 1,700 poor kids get tossed from private schools is a moral disgrace. It also exposes the ugly politics that lies beneath union and liberal efforts across the country to undermine mayoral control, charter schools, vouchers or any reform that threatens their monopoly over public education dollars and jobs. The Sheldon Silver-Dick Durbin Democrats aren't worried that school choice doesn't work. They're worried that it does, and if Messrs. Obama and Duncan want to succeed as reformers they need to say so consistently.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 07:51:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The Democrats ONLY cause is to keep the poor, poor, the illiterate, illiterate and the Unions happy.", 
        "intTime": 20090406, 
        "postID": 2, 
        "quote": "", 
        "reply": "The Democrats ONLY cause is to keep the poor, poor, the illiterate, illiterate and the Unions happy.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 08:00:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" Wow, what a concept .... it would seem these alien concepts weren't being taught in the public schools BO thinks other peoples children ought to attend.", 
        "intTime": 20090406, 
        "postID": 3, 
        "quote": "\"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\"", 
        "reply": " Wow, what a concept .... it would seem these alien concepts weren't being taught in the public schools BO thinks other peoples children ought to attend.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 17:47:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "intTime": 20090406, 
        "postID": 4, 
        "quote": "", 
        "reply": "School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:07:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "intTime": 20090406, 
        "postID": 5, 
        "quote": "Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "reply": " That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:12:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "The education of our Children...is on parity with the successful future of this Great Nation... Let the dollar votes \"vouchers\" count..the parents and children will cast their lots where they count most...", 
        "intTime": 20090406, 
        "postID": 6, 
        "quote": "", 
        "reply": "The education of our Children...is on parity with the successful future of this Great Nation... Let the dollar votes \"vouchers\" count..the parents and children will cast their lots where they count most...", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:20:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? Also, the definition of a private school is one that does not receive any tax-based funding so your comparing them in the context of a current double layered government bureaucracy is incorrect. Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "intTime": 20090406, 
        "postID": 7, 
        "quote": "Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "reply": " Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? Also, the definition of a private school is one that does not receive any tax-based funding so your comparing them in the context of a current double layered government bureaucracy is incorrect. Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "intTime": 20090406, 
        "postID": 8, 
        "quote": "", 
        "reply": "Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 19:57:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "OldDoc"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? I do not believe that safety is the issue. When one doesn't want to do something one can always find excuses not to do it. BO didn't enroll his kids in public school in Chicago either. Do you think they're sweating over safety concerns at Sidwell Friends?", 
        "intTime": 20090406, 
        "postID": 9, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids?", 
        "reply": " I do not believe that safety is the issue. When one doesn't want to do something one can always find excuses not to do it. BO didn't enroll his kids in public school in Chicago either. Do you think they're sweating over safety concerns at Sidwell Friends?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 20:38:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "intTime": 20090406, 
        "postID": 10, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work.", 
        "reply": " That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:24:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now. Gotta laugh at this one .... BO puts the guy who was formerly in charge of the schools he wouldn't send his own kids to in charge of all of ours. I predict a continuing bright future for homeschooling ....", 
        "intTime": 20090406, 
        "postID": 11, 
        "quote": "Originally posted by OldDoc: Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "reply": " Gotta laugh at this one .... BO puts the guy who was formerly in charge of the schools he wouldn't send his own kids to in charge of all of ours. I predict a continuing bright future for homeschooling ....", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:26:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do. Why would private institutions bother? There is no study anyone could come up with that would convince BO that vouchers were effective.", 
        "intTime": 20090406, 
        "postID": 12, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "reply": " Why would private institutions bother? There is no study anyone could come up with that would convince BO that vouchers were effective.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:30:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux.", 
        "intTime": 20090408, 
        "postID": 13, 
        "quote": "Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "reply": " He is probably an NEA member. And competition sux.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-08 05:54:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Kids are not going to learn in todays environment by maintaing the status quo.... Discipline has been broken, motiviation is non-existent, and no one wants to hurt others feelings....We have to change the environment, too many stupid hippie tree huggers ruining what should be a rigid place... We should segregate genders, that would make a big difference in middle school/high school. At the end of the day, if people are just to stupid to see the opportunities this nation provides fug em.", 
        "intTime": 20090408, 
        "postID": 14, 
        "quote": "", 
        "reply": "Kids are not going to learn in todays environment by maintaing the status quo.... Discipline has been broken, motiviation is non-existent, and no one wants to hurt others feelings....We have to change the environment, too many stupid hippie tree huggers ruining what should be a rigid place... We should segregate genders, that would make a big difference in middle school/high school. At the end of the day, if people are just to stupid to see the opportunities this nation provides fug em.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-08 08:36:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: [/QUOTE] That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?[/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] Yep, heaven forbid the public schools have to compete for students against better-performing private schools. OTOH if we're going to have people continuing to retionalize and excuse poor performing public schools why should they bother to improve? It's a lot of work to do that.", 
        "intTime": 20090409, 
        "postID": 15, 
        "quote": "Originally posted by GunnyRet03: quote:", 
        "reply": " [/QUOTE] That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?[/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] Yep, heaven forbid the public schools have to compete for students against better-performing private schools. OTOH if we're going to have people continuing to retionalize and excuse poor performing public schools why should they bother to improve? It's a lot of work to do that.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 08:19:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "intTime": 20090409, 
        "postID": 16, 
        "quote": "", 
        "reply": "Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 08:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO. Well as my DD is 12 I'd say she's a bit young to attempt to get into ROTC. But the private school she attends charges several thousnad dollars less per year tuition than the per pupil cost of educating a student in the public schools. It might be interesting to find out why they can do the job for less money.", 
        "intTime": 20090409, 
        "postID": 17, 
        "quote": "Originally posted by Duster6: Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "reply": " Well as my DD is 12 I'd say she's a bit young to attempt to get into ROTC. But the private school she attends charges several thousnad dollars less per year tuition than the per pupil cost of educating a student in the public schools. It might be interesting to find out why they can do the job for less money.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 12:32:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090409, 
        "postID": 18, 
        "quote": "Originally posted by Boospar: It might be interesting to find out why they can do the job for less money.", 
        "reply": " Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 12:49:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "intTime": 20090409, 
        "postID": 19, 
        "quote": "Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism.", 
        "reply": " Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 20:51:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux. I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! Also, the most significant issue to come from vouchers is the issue of religious indoctrination at tax-payer expenses. The more, \"successful voucher systems,\" are almost exclusively religious institutions, they do not have to take in any child that registers, they do not have to demonstrate that their teachers are highly qualified, they do not have to demonstrate how the voucher funds are spent, they do not have to comply with the local, state, and federal minimum public education standards, and therefore, their so called, \"superiority,\" cannot be independently verified.", 
        "intTime": 20090410, 
        "postID": 20, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux.", 
        "reply": " I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! Also, the most significant issue to come from vouchers is the issue of religious indoctrination at tax-payer expenses. The more, \"successful voucher systems,\" are almost exclusively religious institutions, they do not have to take in any child that registers, they do not have to demonstrate that their teachers are highly qualified, they do not have to demonstrate how the voucher funds are spent, they do not have to comply with the local, state, and federal minimum public education standards, and therefore, their so called, \"superiority,\" cannot be independently verified.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 10:03:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science. I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "intTime": 20090410, 
        "postID": 21, 
        "quote": "Originally posted by RRR52: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "reply": " I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 10:13:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "I am a public school teacher and I think that parents should be given the choice with vouchers. (Actually I have worked at both private and public schools.) It is awful that some children have no choice other than to attend schools where they worry every minute, for their own safety. Why force these kids to continue going to these schools? People just assume that every private school is just going to take these vouchers. With vouchers come accountability and government intrusion into the private school system. The private Catholic school where I taught would not be so quick to take this option. The school has it's rules and requirements. If you didn't want to be there you could leave. The school didn't have to take everyone. If a student disrupted the school and the students, the parents would be asked to find another place to educate that student. We also had students of other faiths enrolled in our school, and it was not the school's purpose to indoctrinate them into its faith. (Actually I had more religious harassment at the public school I had left prior to teaching at the private school.) Also, think logistics....how will these new students get to a private school? Not every community has a local private school and how would the student get to school. I just can't see every private school investing in mass transportation nor every parent able to drive these children to school across a city. Would the vouchers cover the cost of the transportation, too? Will the vouchers cover the cost of uniforms? Class supplies? The parents at private school do not grumble about the fact that they have to provide their children with pencils, pens, notebooks, lab fees, etc. It is expected and generally stated in the enrollment application. Oh, and remember, not all who send their children to private or parochial schools are rich. Many families make great sacrifices to make this education available to their children; but it is a matter of choice. In another post, someone mentioned that private schools can educate children much cheaper. This may well be the case. In our private school, parents would volunteer to clean (didn't have to hire a janitorial service). Need an electrician.....oh so and so's dad will help out. We had parents and some students that worked over the summer to sand and varnish all old hardwood floors of the elementary building. The school raised money to pay for the supplies and equipment needed. They did a beautiful job. The students took ownership of their facility and due to this no graffiti or property damage. Of course, there were some students that would also get to clean the bathroom or hallway with a toothbrush. (Parental support) So after a few times, these students, too, began to care about the appearance of the school. Yes, and many teachers work for much less because the working conditions are often times more desirable than some public schools, as well as class size much smaller. Students are for the most part polite and are there to learn. Now that is not to say that ALL public schools are less desirable than a public school. Right now I teach in a very nice public school that is in a higher socio-economic area with a majority of college educated parents. Parents are involved in their child's education and have high expectations. Communication is done readily by email and grades are all on-line. Vouchers would not take away our student population. Maybe, the real problem, is with those schools that have no control, have huge student populations (in which students have to have security and metal detectors), and have no discipline/high expectations. Perhaps reducing school size would be a part of the answer. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090410, 
        "postID": 22, 
        "quote": "", 
        "reply": "I am a public school teacher and I think that parents should be given the choice with vouchers. (Actually I have worked at both private and public schools.) It is awful that some children have no choice other than to attend schools where they worry every minute, for their own safety. Why force these kids to continue going to these schools? People just assume that every private school is just going to take these vouchers. With vouchers come accountability and government intrusion into the private school system. The private Catholic school where I taught would not be so quick to take this option. The school has it's rules and requirements. If you didn't want to be there you could leave. The school didn't have to take everyone. If a student disrupted the school and the students, the parents would be asked to find another place to educate that student. We also had students of other faiths enrolled in our school, and it was not the school's purpose to indoctrinate them into its faith. (Actually I had more religious harassment at the public school I had left prior to teaching at the private school.) Also, think logistics....how will these new students get to a private school? Not every community has a local private school and how would the student get to school. I just can't see every private school investing in mass transportation nor every parent able to drive these children to school across a city. Would the vouchers cover the cost of the transportation, too? Will the vouchers cover the cost of uniforms? Class supplies? The parents at private school do not grumble about the fact that they have to provide their children with pencils, pens, notebooks, lab fees, etc. It is expected and generally stated in the enrollment application. Oh, and remember, not all who send their children to private or parochial schools are rich. Many families make great sacrifices to make this education available to their children; but it is a matter of choice. In another post, someone mentioned that private schools can educate children much cheaper. This may well be the case. In our private school, parents would volunteer to clean (didn't have to hire a janitorial service). Need an electrician.....oh so and so's dad will help out. We had parents and some students that worked over the summer to sand and varnish all old hardwood floors of the elementary building. The school raised money to pay for the supplies and equipment needed. They did a beautiful job. The students took ownership of their facility and due to this no graffiti or property damage. Of course, there were some students that would also get to clean the bathroom or hallway with a toothbrush. (Parental support) So after a few times, these students, too, began to care about the appearance of the school. Yes, and many teachers work for much less because the working conditions are often times more desirable than some public schools, as well as class size much smaller. Students are for the most part polite and are there to learn. Now that is not to say that ALL public schools are less desirable than a public school. Right now I teach in a very nice public school that is in a higher socio-economic area with a majority of college educated parents. Parents are involved in their child's education and have high expectations. Communication is done readily by email and grades are all on-line. Vouchers would not take away our student population. Maybe, the real problem, is with those schools that have no control, have huge student populations (in which students have to have security and metal detectors), and have no discipline/high expectations. Perhaps reducing school size would be a part of the answer. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:21:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: [/QUOTE] [/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! [/QUOTE] Well now we're getting somewhere .... you have now acknowledged that some improvements have been obtained by use of vouchers. Your claim is that if we'd just spent the money in the public sector we'd have gotten the same result. How exactly did you determine this? Also, please define \"full transparency.\"", 
        "intTime": 20090410, 
        "postID": 23, 
        "quote": "Originally posted by skinman13: quote:", 
        "reply": " [/QUOTE] [/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! [/QUOTE] Well now we're getting somewhere .... you have now acknowledged that some improvements have been obtained by use of vouchers. Your claim is that if we'd just spent the money in the public sector we'd have gotten the same result. How exactly did you determine this? Also, please define \"full transparency.\"", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:43:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "intTime": 20090410, 
        "postID": 24, 
        "quote": "", 
        "reply": "I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by RRR52: quote: Originally posted by skinman13: I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both. Define a \"voucher school.\" How about you give us an example of one?", 
        "intTime": 20090410, 
        "postID": 25, 
        "quote": "Originally posted by skinman13: quote: Originally posted by RRR52: quote: Originally posted by skinman13: I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "reply": " Define a \"voucher school.\" How about you give us an example of one?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:47:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "intTime": 20090410, 
        "postID": 26, 
        "quote": "Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one?", 
        "reply": " You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 23:42:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by threerings: I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools. Name one, and compare it to a public school in the areas of teacher certification, student assessment, student population and enrollment criteria. Don't tell me it works if you are not prepared to prove it. aggie_wife's post obviously comes from experience but even her pro-voucher arguments are full of holes. Yes, there are some serious issues with some public schools, and yes, voucher and charter schools have demonstrated success in these areas, but the reason that voucher and or charter schools can sometimes present a better academic picture in these cases is because these schools can cherry-pick their students and therefore can manipulate their success statistics. They can choose the best students, the public school is left with the rest, then the public schools get less money to educate those students the voucher and charter schools deem as undesirable but now with less resources because their resources have been siphoned off for vouchers and charter campuses. So the question is, can voucher schools and charter schools still present the same success stories if they were forced to take in any student that shows up at their campus regardless of their academic or discipline problems? I doubt it, and besides, that has never happened and is not the way voucher and or charter schools work, and therefore any comparison to public schools is skewed right from the start.", 
        "intTime": 20090410, 
        "postID": 27, 
        "quote": "Originally posted by threerings: I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "reply": " Name one, and compare it to a public school in the areas of teacher certification, student assessment, student population and enrollment criteria. Don't tell me it works if you are not prepared to prove it. aggie_wife's post obviously comes from experience but even her pro-voucher arguments are full of holes. Yes, there are some serious issues with some public schools, and yes, voucher and charter schools have demonstrated success in these areas, but the reason that voucher and or charter schools can sometimes present a better academic picture in these cases is because these schools can cherry-pick their students and therefore can manipulate their success statistics. They can choose the best students, the public school is left with the rest, then the public schools get less money to educate those students the voucher and charter schools deem as undesirable but now with less resources because their resources have been siphoned off for vouchers and charter campuses. So the question is, can voucher schools and charter schools still present the same success stories if they were forced to take in any student that shows up at their campus regardless of their academic or discipline problems? I doubt it, and besides, that has never happened and is not the way voucher and or charter schools work, and therefore any comparison to public schools is skewed right from the start.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 23:50:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "Private schools are awsome. I sent all three of my kids to private schools. They surpass public schools hands down. I didn't want my kids to be assimilated into the \"Borg\" by second rate \"teachers\"!", 
        "intTime": 20090411, 
        "postID": 28, 
        "quote": "", 
        "reply": "Private schools are awsome. I sent all three of my kids to private schools. They surpass public schools hands down. I didn't want my kids to be assimilated into the \"Borg\" by second rate \"teachers\"!", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 08:59:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools. So you can not define a \"voucher school\". Nor can you describe exactly what \"full transparency\" is. When you can do that, get back to us. Now about how you wish your tax dollars spent .... by chance are the public schools in your area broken. The ones in mine are failing, have been for years. Federal, state and local governments pour millions of dollars into my failing public schools and they continue to fail. Why should I continue to support failure with my tax dollars?", 
        "intTime": 20090411, 
        "postID": 29, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "reply": " So you can not define a \"voucher school\". Nor can you describe exactly what \"full transparency\" is. When you can do that, get back to us. Now about how you wish your tax dollars spent .... by chance are the public schools in your area broken. The ones in mine are failing, have been for years. Federal, state and local governments pour millions of dollars into my failing public schools and they continue to fail. Why should I continue to support failure with my tax dollars?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 10:21:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Spot on regarding all the things my DD's school doesn't have to deal with. They seem, however, to do a better job teaching her.", 
        "intTime": 20090411, 
        "postID": 30, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22.", 
        "reply": " Spot on regarding all the things my DD's school doesn't have to deal with. They seem, however, to do a better job teaching her.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 10:42:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "Who's the priority? Democrats and Poor Kids Sitting on evidence of voucher success, and the battle of New York. 'http://online.wsj.com/article/SB123897492702491091.html#printMode' Education Secretary Arne Duncan did a public service last week when he visited New York City and spoke up for charter schools and mayoral control of education. That was the reformer talking. The status quo Mr. Duncan was on display last month when he let Congress kill a District of Columbia voucher program even as he was sitting on evidence of its success. <edit> In New York City with its 1.1 million students, mayoral control has resulted in better test scores and graduation rates, while expanding charter schools, which means more and better education choices for low-income families. But mayoral control expires in June unless state lawmakers renew it, and the United Federation of Teachers is working with Assembly Speaker Sheldon Silver to weaken or kill it. President Obama's stimulus is sending some $100 billion to the nation's school districts. What will he demand in return? The state budget passed by the New York legislature last week freezes funding for charters but increases it by more that $400 million for other public schools. Perhaps a visit to a charter school in Harlem would help Mr. Obama honor his reform pledge. \"I'm looking at the data here in front of me,\" Mr. Duncan told the New York Post. \"Graduation rates are up. Test scores are up. Teacher salaries are up. Social promotion was eliminated. Dramatically increasing parental choice. That's real progress.\" Mr. Duncan's help in New York is in stark contrast to his department's decision to sit on a performance review of the D.C. voucher program while Congress debated its future in March. The latest annual evaluation was finally released Friday, and it shows measurable academic gains. The Opportunity Scholarship Program provides $7,500 vouchers to 1,700 low-income families in D.C. to send their children to private schools. Ninety-nine percent of the children are black or Hispanic, and there are more than four applicants for each scholarship. The 2008 report demonstrated progress among certain subgroups of children but not everyone. This year's report shows statistically significant academic gains for the entire voucher-receiving population. Children attending private schools with the aid of the scholarships are reading nearly a half-grade ahead of their peers who did not receive vouchers. Voucher recipients are doing no better in math but they're doing no worse. Which means that no voucher participant is in worse academic shape than before, and many students are much better off. \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" It's bad enough that Democrats are killing a program that parents love and is closing the achievement gap between poor minorities and whites. But as scandalous is that the Education Department almost certainly knew the results of this evaluation for months. Voucher recipients were tested last spring. The scores were analyzed in the late summer and early fall, and in November preliminary results were presented to a team of advisers who work with the Education Department to produce the annual evaluation. Since Education officials are intimately involved in this process, they had to know what was in this evaluation even as Democrats passed (and Mr. Obama signed) language that ends the program after next year. Opponents of school choice for poor children have long claimed they'd support vouchers if there was evidence that they work. While running for President last year, Mr. Obama told the Milwaukee Journal-Sentinel that if he saw more proof that they were successful, he would \"not allow my predisposition to stand in the way of making sure that our kids can learn . . . You do what works for the kids.\" Except, apparently, when what works is opposed by unions. Mr. Duncan's office spurned our repeated calls and emails asking what and when he and his aides knew about these results. We do know the Administration prohibited anyone involved with the evaluation from discussing it publicly. You'd think we were talking about nuclear secrets, not about a taxpayer-funded pilot program. A reasonable conclusion is that Mr. Duncan's department didn't want proof of voucher success to interfere with Senator Dick Durbin's campaign to kill vouchers at the behest of the teachers unions. The decision to let 1,700 poor kids get tossed from private schools is a moral disgrace. It also exposes the ugly politics that lies beneath union and liberal efforts across the country to undermine mayoral control, charter schools, vouchers or any reform that threatens their monopoly over public education dollars and jobs. The Sheldon Silver-Dick Durbin Democrats aren't worried that school choice doesn't work. They're worried that it does, and if Messrs. Obama and Duncan want to succeed as reformers they need to say so consistently.", 
        "intTime": 20090406, 
        "postID": 31, 
        "quote": "", 
        "reply": "Who's the priority? Democrats and Poor Kids Sitting on evidence of voucher success, and the battle of New York. 'http://online.wsj.com/article/SB123897492702491091.html#printMode' Education Secretary Arne Duncan did a public service last week when he visited New York City and spoke up for charter schools and mayoral control of education. That was the reformer talking. The status quo Mr. Duncan was on display last month when he let Congress kill a District of Columbia voucher program even as he was sitting on evidence of its success. <edit> In New York City with its 1.1 million students, mayoral control has resulted in better test scores and graduation rates, while expanding charter schools, which means more and better education choices for low-income families. But mayoral control expires in June unless state lawmakers renew it, and the United Federation of Teachers is working with Assembly Speaker Sheldon Silver to weaken or kill it. President Obama's stimulus is sending some $100 billion to the nation's school districts. What will he demand in return? The state budget passed by the New York legislature last week freezes funding for charters but increases it by more that $400 million for other public schools. Perhaps a visit to a charter school in Harlem would help Mr. Obama honor his reform pledge. \"I'm looking at the data here in front of me,\" Mr. Duncan told the New York Post. \"Graduation rates are up. Test scores are up. Teacher salaries are up. Social promotion was eliminated. Dramatically increasing parental choice. That's real progress.\" Mr. Duncan's help in New York is in stark contrast to his department's decision to sit on a performance review of the D.C. voucher program while Congress debated its future in March. The latest annual evaluation was finally released Friday, and it shows measurable academic gains. The Opportunity Scholarship Program provides $7,500 vouchers to 1,700 low-income families in D.C. to send their children to private schools. Ninety-nine percent of the children are black or Hispanic, and there are more than four applicants for each scholarship. The 2008 report demonstrated progress among certain subgroups of children but not everyone. This year's report shows statistically significant academic gains for the entire voucher-receiving population. Children attending private schools with the aid of the scholarships are reading nearly a half-grade ahead of their peers who did not receive vouchers. Voucher recipients are doing no better in math but they're doing no worse. Which means that no voucher participant is in worse academic shape than before, and many students are much better off. \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" It's bad enough that Democrats are killing a program that parents love and is closing the achievement gap between poor minorities and whites. But as scandalous is that the Education Department almost certainly knew the results of this evaluation for months. Voucher recipients were tested last spring. The scores were analyzed in the late summer and early fall, and in November preliminary results were presented to a team of advisers who work with the Education Department to produce the annual evaluation. Since Education officials are intimately involved in this process, they had to know what was in this evaluation even as Democrats passed (and Mr. Obama signed) language that ends the program after next year. Opponents of school choice for poor children have long claimed they'd support vouchers if there was evidence that they work. While running for President last year, Mr. Obama told the Milwaukee Journal-Sentinel that if he saw more proof that they were successful, he would \"not allow my predisposition to stand in the way of making sure that our kids can learn . . . You do what works for the kids.\" Except, apparently, when what works is opposed by unions. Mr. Duncan's office spurned our repeated calls and emails asking what and when he and his aides knew about these results. We do know the Administration prohibited anyone involved with the evaluation from discussing it publicly. You'd think we were talking about nuclear secrets, not about a taxpayer-funded pilot program. A reasonable conclusion is that Mr. Duncan's department didn't want proof of voucher success to interfere with Senator Dick Durbin's campaign to kill vouchers at the behest of the teachers unions. The decision to let 1,700 poor kids get tossed from private schools is a moral disgrace. It also exposes the ugly politics that lies beneath union and liberal efforts across the country to undermine mayoral control, charter schools, vouchers or any reform that threatens their monopoly over public education dollars and jobs. The Sheldon Silver-Dick Durbin Democrats aren't worried that school choice doesn't work. They're worried that it does, and if Messrs. Obama and Duncan want to succeed as reformers they need to say so consistently.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 07:51:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The Democrats ONLY cause is to keep the poor, poor, the illiterate, illiterate and the Unions happy.", 
        "intTime": 20090406, 
        "postID": 32, 
        "quote": "", 
        "reply": "The Democrats ONLY cause is to keep the poor, poor, the illiterate, illiterate and the Unions happy.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 08:00:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" Wow, what a concept .... it would seem these alien concepts weren't being taught in the public schools BO thinks other peoples children ought to attend.", 
        "intTime": 20090406, 
        "postID": 33, 
        "quote": "\"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\"", 
        "reply": " Wow, what a concept .... it would seem these alien concepts weren't being taught in the public schools BO thinks other peoples children ought to attend.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 17:47:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "intTime": 20090406, 
        "postID": 34, 
        "quote": "", 
        "reply": "School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:07:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "intTime": 20090406, 
        "postID": 35, 
        "quote": "Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "reply": " That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:12:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "The education of our Children...is on parity with the successful future of this Great Nation... Let the dollar votes \"vouchers\" count..the parents and children will cast their lots where they count most...", 
        "intTime": 20090406, 
        "postID": 36, 
        "quote": "", 
        "reply": "The education of our Children...is on parity with the successful future of this Great Nation... Let the dollar votes \"vouchers\" count..the parents and children will cast their lots where they count most...", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:20:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? Also, the definition of a private school is one that does not receive any tax-based funding so your comparing them in the context of a current double layered government bureaucracy is incorrect. Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "intTime": 20090406, 
        "postID": 37, 
        "quote": "Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "reply": " Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? Also, the definition of a private school is one that does not receive any tax-based funding so your comparing them in the context of a current double layered government bureaucracy is incorrect. Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "intTime": 20090406, 
        "postID": 38, 
        "quote": "", 
        "reply": "Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 19:57:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "OldDoc"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? I do not believe that safety is the issue. When one doesn't want to do something one can always find excuses not to do it. BO didn't enroll his kids in public school in Chicago either. Do you think they're sweating over safety concerns at Sidwell Friends?", 
        "intTime": 20090406, 
        "postID": 39, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids?", 
        "reply": " I do not believe that safety is the issue. When one doesn't want to do something one can always find excuses not to do it. BO didn't enroll his kids in public school in Chicago either. Do you think they're sweating over safety concerns at Sidwell Friends?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 20:38:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "intTime": 20090406, 
        "postID": 40, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work.", 
        "reply": " That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:24:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now. Gotta laugh at this one .... BO puts the guy who was formerly in charge of the schools he wouldn't send his own kids to in charge of all of ours. I predict a continuing bright future for homeschooling ....", 
        "intTime": 20090406, 
        "postID": 41, 
        "quote": "Originally posted by OldDoc: Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "reply": " Gotta laugh at this one .... BO puts the guy who was formerly in charge of the schools he wouldn't send his own kids to in charge of all of ours. I predict a continuing bright future for homeschooling ....", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:26:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do. Why would private institutions bother? There is no study anyone could come up with that would convince BO that vouchers were effective.", 
        "intTime": 20090406, 
        "postID": 42, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "reply": " Why would private institutions bother? There is no study anyone could come up with that would convince BO that vouchers were effective.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:30:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux.", 
        "intTime": 20090408, 
        "postID": 43, 
        "quote": "Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "reply": " He is probably an NEA member. And competition sux.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-08 05:54:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Kids are not going to learn in todays environment by maintaing the status quo.... Discipline has been broken, motiviation is non-existent, and no one wants to hurt others feelings....We have to change the environment, too many stupid hippie tree huggers ruining what should be a rigid place... We should segregate genders, that would make a big difference in middle school/high school. At the end of the day, if people are just to stupid to see the opportunities this nation provides fug em.", 
        "intTime": 20090408, 
        "postID": 44, 
        "quote": "", 
        "reply": "Kids are not going to learn in todays environment by maintaing the status quo.... Discipline has been broken, motiviation is non-existent, and no one wants to hurt others feelings....We have to change the environment, too many stupid hippie tree huggers ruining what should be a rigid place... We should segregate genders, that would make a big difference in middle school/high school. At the end of the day, if people are just to stupid to see the opportunities this nation provides fug em.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-08 08:36:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: [/QUOTE] That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?[/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] Yep, heaven forbid the public schools have to compete for students against better-performing private schools. OTOH if we're going to have people continuing to retionalize and excuse poor performing public schools why should they bother to improve? It's a lot of work to do that.", 
        "intTime": 20090409, 
        "postID": 45, 
        "quote": "Originally posted by GunnyRet03: quote:", 
        "reply": " [/QUOTE] That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?[/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] Yep, heaven forbid the public schools have to compete for students against better-performing private schools. OTOH if we're going to have people continuing to retionalize and excuse poor performing public schools why should they bother to improve? It's a lot of work to do that.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 08:19:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "intTime": 20090409, 
        "postID": 46, 
        "quote": "", 
        "reply": "Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 08:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO. Well as my DD is 12 I'd say she's a bit young to attempt to get into ROTC. But the private school she attends charges several thousnad dollars less per year tuition than the per pupil cost of educating a student in the public schools. It might be interesting to find out why they can do the job for less money.", 
        "intTime": 20090409, 
        "postID": 47, 
        "quote": "Originally posted by Duster6: Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "reply": " Well as my DD is 12 I'd say she's a bit young to attempt to get into ROTC. But the private school she attends charges several thousnad dollars less per year tuition than the per pupil cost of educating a student in the public schools. It might be interesting to find out why they can do the job for less money.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 12:32:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090409, 
        "postID": 48, 
        "quote": "Originally posted by Boospar: It might be interesting to find out why they can do the job for less money.", 
        "reply": " Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 12:49:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "intTime": 20090409, 
        "postID": 49, 
        "quote": "Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism.", 
        "reply": " Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 20:51:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux. I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! Also, the most significant issue to come from vouchers is the issue of religious indoctrination at tax-payer expenses. The more, \"successful voucher systems,\" are almost exclusively religious institutions, they do not have to take in any child that registers, they do not have to demonstrate that their teachers are highly qualified, they do not have to demonstrate how the voucher funds are spent, they do not have to comply with the local, state, and federal minimum public education standards, and therefore, their so called, \"superiority,\" cannot be independently verified.", 
        "intTime": 20090410, 
        "postID": 50, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux.", 
        "reply": " I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! Also, the most significant issue to come from vouchers is the issue of religious indoctrination at tax-payer expenses. The more, \"successful voucher systems,\" are almost exclusively religious institutions, they do not have to take in any child that registers, they do not have to demonstrate that their teachers are highly qualified, they do not have to demonstrate how the voucher funds are spent, they do not have to comply with the local, state, and federal minimum public education standards, and therefore, their so called, \"superiority,\" cannot be independently verified.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 10:03:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science. I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "intTime": 20090410, 
        "postID": 51, 
        "quote": "Originally posted by RRR52: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "reply": " I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 10:13:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "I am a public school teacher and I think that parents should be given the choice with vouchers. (Actually I have worked at both private and public schools.) It is awful that some children have no choice other than to attend schools where they worry every minute, for their own safety. Why force these kids to continue going to these schools? People just assume that every private school is just going to take these vouchers. With vouchers come accountability and government intrusion into the private school system. The private Catholic school where I taught would not be so quick to take this option. The school has it's rules and requirements. If you didn't want to be there you could leave. The school didn't have to take everyone. If a student disrupted the school and the students, the parents would be asked to find another place to educate that student. We also had students of other faiths enrolled in our school, and it was not the school's purpose to indoctrinate them into its faith. (Actually I had more religious harassment at the public school I had left prior to teaching at the private school.) Also, think logistics....how will these new students get to a private school? Not every community has a local private school and how would the student get to school. I just can't see every private school investing in mass transportation nor every parent able to drive these children to school across a city. Would the vouchers cover the cost of the transportation, too? Will the vouchers cover the cost of uniforms? Class supplies? The parents at private school do not grumble about the fact that they have to provide their children with pencils, pens, notebooks, lab fees, etc. It is expected and generally stated in the enrollment application. Oh, and remember, not all who send their children to private or parochial schools are rich. Many families make great sacrifices to make this education available to their children; but it is a matter of choice. In another post, someone mentioned that private schools can educate children much cheaper. This may well be the case. In our private school, parents would volunteer to clean (didn't have to hire a janitorial service). Need an electrician.....oh so and so's dad will help out. We had parents and some students that worked over the summer to sand and varnish all old hardwood floors of the elementary building. The school raised money to pay for the supplies and equipment needed. They did a beautiful job. The students took ownership of their facility and due to this no graffiti or property damage. Of course, there were some students that would also get to clean the bathroom or hallway with a toothbrush. (Parental support) So after a few times, these students, too, began to care about the appearance of the school. Yes, and many teachers work for much less because the working conditions are often times more desirable than some public schools, as well as class size much smaller. Students are for the most part polite and are there to learn. Now that is not to say that ALL public schools are less desirable than a public school. Right now I teach in a very nice public school that is in a higher socio-economic area with a majority of college educated parents. Parents are involved in their child's education and have high expectations. Communication is done readily by email and grades are all on-line. Vouchers would not take away our student population. Maybe, the real problem, is with those schools that have no control, have huge student populations (in which students have to have security and metal detectors), and have no discipline/high expectations. Perhaps reducing school size would be a part of the answer. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090410, 
        "postID": 52, 
        "quote": "", 
        "reply": "I am a public school teacher and I think that parents should be given the choice with vouchers. (Actually I have worked at both private and public schools.) It is awful that some children have no choice other than to attend schools where they worry every minute, for their own safety. Why force these kids to continue going to these schools? People just assume that every private school is just going to take these vouchers. With vouchers come accountability and government intrusion into the private school system. The private Catholic school where I taught would not be so quick to take this option. The school has it's rules and requirements. If you didn't want to be there you could leave. The school didn't have to take everyone. If a student disrupted the school and the students, the parents would be asked to find another place to educate that student. We also had students of other faiths enrolled in our school, and it was not the school's purpose to indoctrinate them into its faith. (Actually I had more religious harassment at the public school I had left prior to teaching at the private school.) Also, think logistics....how will these new students get to a private school? Not every community has a local private school and how would the student get to school. I just can't see every private school investing in mass transportation nor every parent able to drive these children to school across a city. Would the vouchers cover the cost of the transportation, too? Will the vouchers cover the cost of uniforms? Class supplies? The parents at private school do not grumble about the fact that they have to provide their children with pencils, pens, notebooks, lab fees, etc. It is expected and generally stated in the enrollment application. Oh, and remember, not all who send their children to private or parochial schools are rich. Many families make great sacrifices to make this education available to their children; but it is a matter of choice. In another post, someone mentioned that private schools can educate children much cheaper. This may well be the case. In our private school, parents would volunteer to clean (didn't have to hire a janitorial service). Need an electrician.....oh so and so's dad will help out. We had parents and some students that worked over the summer to sand and varnish all old hardwood floors of the elementary building. The school raised money to pay for the supplies and equipment needed. They did a beautiful job. The students took ownership of their facility and due to this no graffiti or property damage. Of course, there were some students that would also get to clean the bathroom or hallway with a toothbrush. (Parental support) So after a few times, these students, too, began to care about the appearance of the school. Yes, and many teachers work for much less because the working conditions are often times more desirable than some public schools, as well as class size much smaller. Students are for the most part polite and are there to learn. Now that is not to say that ALL public schools are less desirable than a public school. Right now I teach in a very nice public school that is in a higher socio-economic area with a majority of college educated parents. Parents are involved in their child's education and have high expectations. Communication is done readily by email and grades are all on-line. Vouchers would not take away our student population. Maybe, the real problem, is with those schools that have no control, have huge student populations (in which students have to have security and metal detectors), and have no discipline/high expectations. Perhaps reducing school size would be a part of the answer. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:21:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: [/QUOTE] [/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! [/QUOTE] Well now we're getting somewhere .... you have now acknowledged that some improvements have been obtained by use of vouchers. Your claim is that if we'd just spent the money in the public sector we'd have gotten the same result. How exactly did you determine this? Also, please define \"full transparency.\"", 
        "intTime": 20090410, 
        "postID": 53, 
        "quote": "Originally posted by skinman13: quote:", 
        "reply": " [/QUOTE] [/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! [/QUOTE] Well now we're getting somewhere .... you have now acknowledged that some improvements have been obtained by use of vouchers. Your claim is that if we'd just spent the money in the public sector we'd have gotten the same result. How exactly did you determine this? Also, please define \"full transparency.\"", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:43:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "intTime": 20090410, 
        "postID": 54, 
        "quote": "", 
        "reply": "I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by RRR52: quote: Originally posted by skinman13: I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both. Define a \"voucher school.\" How about you give us an example of one?", 
        "intTime": 20090410, 
        "postID": 55, 
        "quote": "Originally posted by skinman13: quote: Originally posted by RRR52: quote: Originally posted by skinman13: I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "reply": " Define a \"voucher school.\" How about you give us an example of one?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:47:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "intTime": 20090410, 
        "postID": 56, 
        "quote": "Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one?", 
        "reply": " You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 23:42:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by threerings: I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools. Name one, and compare it to a public school in the areas of teacher certification, student assessment, student population and enrollment criteria. Don't tell me it works if you are not prepared to prove it. aggie_wife's post obviously comes from experience but even her pro-voucher arguments are full of holes. Yes, there are some serious issues with some public schools, and yes, voucher and charter schools have demonstrated success in these areas, but the reason that voucher and or charter schools can sometimes present a better academic picture in these cases is because these schools can cherry-pick their students and therefore can manipulate their success statistics. They can choose the best students, the public school is left with the rest, then the public schools get less money to educate those students the voucher and charter schools deem as undesirable but now with less resources because their resources have been siphoned off for vouchers and charter campuses. So the question is, can voucher schools and charter schools still present the same success stories if they were forced to take in any student that shows up at their campus regardless of their academic or discipline problems? I doubt it, and besides, that has never happened and is not the way voucher and or charter schools work, and therefore any comparison to public schools is skewed right from the start.", 
        "intTime": 20090410, 
        "postID": 57, 
        "quote": "Originally posted by threerings: I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "reply": " Name one, and compare it to a public school in the areas of teacher certification, student assessment, student population and enrollment criteria. Don't tell me it works if you are not prepared to prove it. aggie_wife's post obviously comes from experience but even her pro-voucher arguments are full of holes. Yes, there are some serious issues with some public schools, and yes, voucher and charter schools have demonstrated success in these areas, but the reason that voucher and or charter schools can sometimes present a better academic picture in these cases is because these schools can cherry-pick their students and therefore can manipulate their success statistics. They can choose the best students, the public school is left with the rest, then the public schools get less money to educate those students the voucher and charter schools deem as undesirable but now with less resources because their resources have been siphoned off for vouchers and charter campuses. So the question is, can voucher schools and charter schools still present the same success stories if they were forced to take in any student that shows up at their campus regardless of their academic or discipline problems? I doubt it, and besides, that has never happened and is not the way voucher and or charter schools work, and therefore any comparison to public schools is skewed right from the start.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 23:50:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "Private schools are awsome. I sent all three of my kids to private schools. They surpass public schools hands down. I didn't want my kids to be assimilated into the \"Borg\" by second rate \"teachers\"!", 
        "intTime": 20090411, 
        "postID": 58, 
        "quote": "", 
        "reply": "Private schools are awsome. I sent all three of my kids to private schools. They surpass public schools hands down. I didn't want my kids to be assimilated into the \"Borg\" by second rate \"teachers\"!", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 08:59:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools. So you can not define a \"voucher school\". Nor can you describe exactly what \"full transparency\" is. When you can do that, get back to us. Now about how you wish your tax dollars spent .... by chance are the public schools in your area broken. The ones in mine are failing, have been for years. Federal, state and local governments pour millions of dollars into my failing public schools and they continue to fail. Why should I continue to support failure with my tax dollars?", 
        "intTime": 20090411, 
        "postID": 59, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "reply": " So you can not define a \"voucher school\". Nor can you describe exactly what \"full transparency\" is. When you can do that, get back to us. Now about how you wish your tax dollars spent .... by chance are the public schools in your area broken. The ones in mine are failing, have been for years. Federal, state and local governments pour millions of dollars into my failing public schools and they continue to fail. Why should I continue to support failure with my tax dollars?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 10:21:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Spot on regarding all the things my DD's school doesn't have to deal with. They seem, however, to do a better job teaching her.", 
        "intTime": 20090411, 
        "postID": 60, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22.", 
        "reply": " Spot on regarding all the things my DD's school doesn't have to deal with. They seem, however, to do a better job teaching her.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 10:42:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "Who's the priority? Democrats and Poor Kids Sitting on evidence of voucher success, and the battle of New York. 'http://online.wsj.com/article/SB123897492702491091.html#printMode' Education Secretary Arne Duncan did a public service last week when he visited New York City and spoke up for charter schools and mayoral control of education. That was the reformer talking. The status quo Mr. Duncan was on display last month when he let Congress kill a District of Columbia voucher program even as he was sitting on evidence of its success. <edit> In New York City with its 1.1 million students, mayoral control has resulted in better test scores and graduation rates, while expanding charter schools, which means more and better education choices for low-income families. But mayoral control expires in June unless state lawmakers renew it, and the United Federation of Teachers is working with Assembly Speaker Sheldon Silver to weaken or kill it. President Obama's stimulus is sending some $100 billion to the nation's school districts. What will he demand in return? The state budget passed by the New York legislature last week freezes funding for charters but increases it by more that $400 million for other public schools. Perhaps a visit to a charter school in Harlem would help Mr. Obama honor his reform pledge. \"I'm looking at the data here in front of me,\" Mr. Duncan told the New York Post. \"Graduation rates are up. Test scores are up. Teacher salaries are up. Social promotion was eliminated. Dramatically increasing parental choice. That's real progress.\" Mr. Duncan's help in New York is in stark contrast to his department's decision to sit on a performance review of the D.C. voucher program while Congress debated its future in March. The latest annual evaluation was finally released Friday, and it shows measurable academic gains. The Opportunity Scholarship Program provides $7,500 vouchers to 1,700 low-income families in D.C. to send their children to private schools. Ninety-nine percent of the children are black or Hispanic, and there are more than four applicants for each scholarship. The 2008 report demonstrated progress among certain subgroups of children but not everyone. This year's report shows statistically significant academic gains for the entire voucher-receiving population. Children attending private schools with the aid of the scholarships are reading nearly a half-grade ahead of their peers who did not receive vouchers. Voucher recipients are doing no better in math but they're doing no worse. Which means that no voucher participant is in worse academic shape than before, and many students are much better off. \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" It's bad enough that Democrats are killing a program that parents love and is closing the achievement gap between poor minorities and whites. But as scandalous is that the Education Department almost certainly knew the results of this evaluation for months. Voucher recipients were tested last spring. The scores were analyzed in the late summer and early fall, and in November preliminary results were presented to a team of advisers who work with the Education Department to produce the annual evaluation. Since Education officials are intimately involved in this process, they had to know what was in this evaluation even as Democrats passed (and Mr. Obama signed) language that ends the program after next year. Opponents of school choice for poor children have long claimed they'd support vouchers if there was evidence that they work. While running for President last year, Mr. Obama told the Milwaukee Journal-Sentinel that if he saw more proof that they were successful, he would \"not allow my predisposition to stand in the way of making sure that our kids can learn . . . You do what works for the kids.\" Except, apparently, when what works is opposed by unions. Mr. Duncan's office spurned our repeated calls and emails asking what and when he and his aides knew about these results. We do know the Administration prohibited anyone involved with the evaluation from discussing it publicly. You'd think we were talking about nuclear secrets, not about a taxpayer-funded pilot program. A reasonable conclusion is that Mr. Duncan's department didn't want proof of voucher success to interfere with Senator Dick Durbin's campaign to kill vouchers at the behest of the teachers unions. The decision to let 1,700 poor kids get tossed from private schools is a moral disgrace. It also exposes the ugly politics that lies beneath union and liberal efforts across the country to undermine mayoral control, charter schools, vouchers or any reform that threatens their monopoly over public education dollars and jobs. The Sheldon Silver-Dick Durbin Democrats aren't worried that school choice doesn't work. They're worried that it does, and if Messrs. Obama and Duncan want to succeed as reformers they need to say so consistently.", 
        "intTime": 20090406, 
        "postID": 61, 
        "quote": "", 
        "reply": "Who's the priority? Democrats and Poor Kids Sitting on evidence of voucher success, and the battle of New York. 'http://online.wsj.com/article/SB123897492702491091.html#printMode' Education Secretary Arne Duncan did a public service last week when he visited New York City and spoke up for charter schools and mayoral control of education. That was the reformer talking. The status quo Mr. Duncan was on display last month when he let Congress kill a District of Columbia voucher program even as he was sitting on evidence of its success. <edit> In New York City with its 1.1 million students, mayoral control has resulted in better test scores and graduation rates, while expanding charter schools, which means more and better education choices for low-income families. But mayoral control expires in June unless state lawmakers renew it, and the United Federation of Teachers is working with Assembly Speaker Sheldon Silver to weaken or kill it. President Obama's stimulus is sending some $100 billion to the nation's school districts. What will he demand in return? The state budget passed by the New York legislature last week freezes funding for charters but increases it by more that $400 million for other public schools. Perhaps a visit to a charter school in Harlem would help Mr. Obama honor his reform pledge. \"I'm looking at the data here in front of me,\" Mr. Duncan told the New York Post. \"Graduation rates are up. Test scores are up. Teacher salaries are up. Social promotion was eliminated. Dramatically increasing parental choice. That's real progress.\" Mr. Duncan's help in New York is in stark contrast to his department's decision to sit on a performance review of the D.C. voucher program while Congress debated its future in March. The latest annual evaluation was finally released Friday, and it shows measurable academic gains. The Opportunity Scholarship Program provides $7,500 vouchers to 1,700 low-income families in D.C. to send their children to private schools. Ninety-nine percent of the children are black or Hispanic, and there are more than four applicants for each scholarship. The 2008 report demonstrated progress among certain subgroups of children but not everyone. This year's report shows statistically significant academic gains for the entire voucher-receiving population. Children attending private schools with the aid of the scholarships are reading nearly a half-grade ahead of their peers who did not receive vouchers. Voucher recipients are doing no better in math but they're doing no worse. Which means that no voucher participant is in worse academic shape than before, and many students are much better off. \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" It's bad enough that Democrats are killing a program that parents love and is closing the achievement gap between poor minorities and whites. But as scandalous is that the Education Department almost certainly knew the results of this evaluation for months. Voucher recipients were tested last spring. The scores were analyzed in the late summer and early fall, and in November preliminary results were presented to a team of advisers who work with the Education Department to produce the annual evaluation. Since Education officials are intimately involved in this process, they had to know what was in this evaluation even as Democrats passed (and Mr. Obama signed) language that ends the program after next year. Opponents of school choice for poor children have long claimed they'd support vouchers if there was evidence that they work. While running for President last year, Mr. Obama told the Milwaukee Journal-Sentinel that if he saw more proof that they were successful, he would \"not allow my predisposition to stand in the way of making sure that our kids can learn . . . You do what works for the kids.\" Except, apparently, when what works is opposed by unions. Mr. Duncan's office spurned our repeated calls and emails asking what and when he and his aides knew about these results. We do know the Administration prohibited anyone involved with the evaluation from discussing it publicly. You'd think we were talking about nuclear secrets, not about a taxpayer-funded pilot program. A reasonable conclusion is that Mr. Duncan's department didn't want proof of voucher success to interfere with Senator Dick Durbin's campaign to kill vouchers at the behest of the teachers unions. The decision to let 1,700 poor kids get tossed from private schools is a moral disgrace. It also exposes the ugly politics that lies beneath union and liberal efforts across the country to undermine mayoral control, charter schools, vouchers or any reform that threatens their monopoly over public education dollars and jobs. The Sheldon Silver-Dick Durbin Democrats aren't worried that school choice doesn't work. They're worried that it does, and if Messrs. Obama and Duncan want to succeed as reformers they need to say so consistently.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 07:51:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "The Democrats ONLY cause is to keep the poor, poor, the illiterate, illiterate and the Unions happy.", 
        "intTime": 20090406, 
        "postID": 62, 
        "quote": "", 
        "reply": "The Democrats ONLY cause is to keep the poor, poor, the illiterate, illiterate and the Unions happy.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 08:00:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: \"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\" Wow, what a concept .... it would seem these alien concepts weren't being taught in the public schools BO thinks other peoples children ought to attend.", 
        "intTime": 20090406, 
        "postID": 63, 
        "quote": "\"There are transition difficulties, a culture shock upon entering a school where you're expected to pay attention, learn, do homework,\" says Jay Greene, an education scholar at the Manhattan Institute. \"But these results fit a pattern that we've seen in other evaluations of vouchers. Benefits compound over time.\"", 
        "reply": " Wow, what a concept .... it would seem these alien concepts weren't being taught in the public schools BO thinks other peoples children ought to attend.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 17:47:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "intTime": 20090406, 
        "postID": 64, 
        "quote": "", 
        "reply": "School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:07:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "intTime": 20090406, 
        "postID": 65, 
        "quote": "Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools.", 
        "reply": " That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:12:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "The education of our Children...is on parity with the successful future of this Great Nation... Let the dollar votes \"vouchers\" count..the parents and children will cast their lots where they count most...", 
        "intTime": 20090406, 
        "postID": 66, 
        "quote": "", 
        "reply": "The education of our Children...is on parity with the successful future of this Great Nation... Let the dollar votes \"vouchers\" count..the parents and children will cast their lots where they count most...", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:20:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? Also, the definition of a private school is one that does not receive any tax-based funding so your comparing them in the context of a current double layered government bureaucracy is incorrect. Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "intTime": 20090406, 
        "postID": 67, 
        "quote": "Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools?", 
        "reply": " Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? Also, the definition of a private school is one that does not receive any tax-based funding so your comparing them in the context of a current double layered government bureaucracy is incorrect. Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 18:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "intTime": 20090406, 
        "postID": 68, 
        "quote": "", 
        "reply": "Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 19:57:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "OldDoc"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids? I do not believe that safety is the issue. When one doesn't want to do something one can always find excuses not to do it. BO didn't enroll his kids in public school in Chicago either. Do you think they're sweating over safety concerns at Sidwell Friends?", 
        "intTime": 20090406, 
        "postID": 69, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Get real! I don't their decision has as much to do with quality of education as much as their safety. Do you think that the president's kids would be safe in a public school? Do you think that their presence in a public school would make it safe for the other kids?", 
        "reply": " I do not believe that safety is the issue. When one doesn't want to do something one can always find excuses not to do it. BO didn't enroll his kids in public school in Chicago either. Do you think they're sweating over safety concerns at Sidwell Friends?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 20:38:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "intTime": 20090406, 
        "postID": 70, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work.", 
        "reply": " That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:24:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by OldDoc: Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now. Gotta laugh at this one .... BO puts the guy who was formerly in charge of the schools he wouldn't send his own kids to in charge of all of ours. I predict a continuing bright future for homeschooling ....", 
        "intTime": 20090406, 
        "postID": 71, 
        "quote": "Originally posted by OldDoc: Ah yes, Arne Duncan who came from the Chicago public schools now has the chance to foist his ideas nationally, too bad. Anyway the Chicago school system should improve now.", 
        "reply": " Gotta laugh at this one .... BO puts the guy who was formerly in charge of the schools he wouldn't send his own kids to in charge of all of ours. I predict a continuing bright future for homeschooling ....", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:26:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do. Why would private institutions bother? There is no study anyone could come up with that would convince BO that vouchers were effective.", 
        "intTime": 20090406, 
        "postID": 72, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? The only way any voucher system can prove that it is superior to public schools is for the receiving institution to provide the exact same transparency that is required by the public school systems to their education process, from the qualifications of their teachers, their academic assessment process, and exactly how and where they use the voucher funds, something that private institutions will not do.", 
        "reply": " Why would private institutions bother? There is no study anyone could come up with that would convince BO that vouchers were effective.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-06 21:30:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux.", 
        "intTime": 20090408, 
        "postID": 73, 
        "quote": "Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?", 
        "reply": " He is probably an NEA member. And competition sux.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-08 05:54:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Kids are not going to learn in todays environment by maintaing the status quo.... Discipline has been broken, motiviation is non-existent, and no one wants to hurt others feelings....We have to change the environment, too many stupid hippie tree huggers ruining what should be a rigid place... We should segregate genders, that would make a big difference in middle school/high school. At the end of the day, if people are just to stupid to see the opportunities this nation provides fug em.", 
        "intTime": 20090408, 
        "postID": 74, 
        "quote": "", 
        "reply": "Kids are not going to learn in todays environment by maintaing the status quo.... Discipline has been broken, motiviation is non-existent, and no one wants to hurt others feelings....We have to change the environment, too many stupid hippie tree huggers ruining what should be a rigid place... We should segregate genders, that would make a big difference in middle school/high school. At the end of the day, if people are just to stupid to see the opportunities this nation provides fug em.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-08 08:36:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: [/QUOTE] That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?[/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] Yep, heaven forbid the public schools have to compete for students against better-performing private schools. OTOH if we're going to have people continuing to retionalize and excuse poor performing public schools why should they bother to improve? It's a lot of work to do that.", 
        "intTime": 20090409, 
        "postID": 75, 
        "quote": "Originally posted by GunnyRet03: quote:", 
        "reply": " [/QUOTE] That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass?[/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] Yep, heaven forbid the public schools have to compete for students against better-performing private schools. OTOH if we're going to have people continuing to retionalize and excuse poor performing public schools why should they bother to improve? It's a lot of work to do that.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 08:19:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "intTime": 20090409, 
        "postID": 76, 
        "quote": "", 
        "reply": "Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 08:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO. Well as my DD is 12 I'd say she's a bit young to attempt to get into ROTC. But the private school she attends charges several thousnad dollars less per year tuition than the per pupil cost of educating a student in the public schools. It might be interesting to find out why they can do the job for less money.", 
        "intTime": 20090409, 
        "postID": 77, 
        "quote": "Originally posted by Duster6: Every time I hear someone, especially a politician talk about giving more money to our kids for their education I want to vomit. That is just an excuse to divert the money somewhere else when needed. Kids suck. If they want a good education let them join ROTC and then go to a military academy. Its free. No all they want to do is go to school, drink beer, have sex, and then complain about why they can't get a job. Why can't we use the same math books over and over again. Does 2 + 2 not equal 4? Why is it that every new semester students have to fork out more money for new books? Do you smell rip off? You want kids to get a good education? Then start putting masked gun men into the class room and every time a kid falls asleep or disrupts the class or skips school, shoot them. Thats my opinion on that matter. Oh we need more money for education. My Ash butt. Take the kids to the slums of India or Pakistan and let give them $5 a month for food and they will learn. American kids are punks. Just like their punk parents. IMO.", 
        "reply": " Well as my DD is 12 I'd say she's a bit young to attempt to get into ROTC. But the private school she attends charges several thousnad dollars less per year tuition than the per pupil cost of educating a student in the public schools. It might be interesting to find out why they can do the job for less money.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 12:32:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090409, 
        "postID": 78, 
        "quote": "Originally posted by Boospar: It might be interesting to find out why they can do the job for less money.", 
        "reply": " Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 12:49:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "intTime": 20090409, 
        "postID": 79, 
        "quote": "Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism.", 
        "reply": " Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-09 20:51:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux. I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! Also, the most significant issue to come from vouchers is the issue of religious indoctrination at tax-payer expenses. The more, \"successful voucher systems,\" are almost exclusively religious institutions, they do not have to take in any child that registers, they do not have to demonstrate that their teachers are highly qualified, they do not have to demonstrate how the voucher funds are spent, they do not have to comply with the local, state, and federal minimum public education standards, and therefore, their so called, \"superiority,\" cannot be independently verified.", 
        "intTime": 20090410, 
        "postID": 80, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Boospar: quote: Originally posted by skinman13: quote: Originally posted by Boospar: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers only serve to take away much needed funds from an already struggling public education system. It does nothing more but create a parallel publicly funded education system with resulting double layered bureaucracy and accomplishes nothing positive that would not be accomplished just as easily if these same people were to put as much energy and attention into improving their local schools. That \"parallel publicly funded education system with resulting double layered bureaucracy\" already exists .... it consists of the many private schools available to those who can afford them. BO sends his kids to one ... do you think he and Michelle ought to be putting their energy and attention inot improving their local public schools? Vouchers, on the other hand, remove desperately needed tax funds from the classrooms and moves it to private institutions that can pick and choose the students it admits, thus guaranteeing that their, \"numbers,\" are higher, and subsequently pointing to these artificial numbers as proof that vouchers work. That sounds just like what BO has done. For that matter, so have I. When you don't enroll a child in public school the school system gets no money. One of my kids is in private school, thus \"removing desperately needed tax funds from the classrooms.\" Class rooms of the failing public schools of my district, that is. Is there any particular reason you think we should continue to reward failing institutions by continuing to subsidize them? Or rather why I should, while BO gets a pass? He is probably an NEA member. And competition sux.", 
        "reply": " I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! Also, the most significant issue to come from vouchers is the issue of religious indoctrination at tax-payer expenses. The more, \"successful voucher systems,\" are almost exclusively religious institutions, they do not have to take in any child that registers, they do not have to demonstrate that their teachers are highly qualified, they do not have to demonstrate how the voucher funds are spent, they do not have to comply with the local, state, and federal minimum public education standards, and therefore, their so called, \"superiority,\" cannot be independently verified.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 10:03:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science. I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "intTime": 20090410, 
        "postID": 81, 
        "quote": "Originally posted by RRR52: quote: Originally posted by skinman13: School vouchers are a farce and the biggest smoke screen the conservatives have come up with for, \"improving education,\" since they used another farce called, \"Intelligent Design,\" to try and push evolution out of the science class in favor of religious creationism. Vouchers work. Wish the same could be said of all teachers in the public arena. Of course, many good teachers are public. The good ones don't need to worry much about vouchers taking their jobs, but the collectivists always generate half-baked rationalizations why allowing parents a chance to decide where their child attends school is somehow harmful to education. (But they'd often be among the first to endorse the idea of a child in a mother's womb being merely a \"choice.\") Those mindlessly mouthing their faith in happenstance are welcome to their self-assurances. But to say that what they push is not based in a perverse and pointless faith in their own infallibility is a mockery of solid science.", 
        "reply": " I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 10:13:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "I am a public school teacher and I think that parents should be given the choice with vouchers. (Actually I have worked at both private and public schools.) It is awful that some children have no choice other than to attend schools where they worry every minute, for their own safety. Why force these kids to continue going to these schools? People just assume that every private school is just going to take these vouchers. With vouchers come accountability and government intrusion into the private school system. The private Catholic school where I taught would not be so quick to take this option. The school has it's rules and requirements. If you didn't want to be there you could leave. The school didn't have to take everyone. If a student disrupted the school and the students, the parents would be asked to find another place to educate that student. We also had students of other faiths enrolled in our school, and it was not the school's purpose to indoctrinate them into its faith. (Actually I had more religious harassment at the public school I had left prior to teaching at the private school.) Also, think logistics....how will these new students get to a private school? Not every community has a local private school and how would the student get to school. I just can't see every private school investing in mass transportation nor every parent able to drive these children to school across a city. Would the vouchers cover the cost of the transportation, too? Will the vouchers cover the cost of uniforms? Class supplies? The parents at private school do not grumble about the fact that they have to provide their children with pencils, pens, notebooks, lab fees, etc. It is expected and generally stated in the enrollment application. Oh, and remember, not all who send their children to private or parochial schools are rich. Many families make great sacrifices to make this education available to their children; but it is a matter of choice. In another post, someone mentioned that private schools can educate children much cheaper. This may well be the case. In our private school, parents would volunteer to clean (didn't have to hire a janitorial service). Need an electrician.....oh so and so's dad will help out. We had parents and some students that worked over the summer to sand and varnish all old hardwood floors of the elementary building. The school raised money to pay for the supplies and equipment needed. They did a beautiful job. The students took ownership of their facility and due to this no graffiti or property damage. Of course, there were some students that would also get to clean the bathroom or hallway with a toothbrush. (Parental support) So after a few times, these students, too, began to care about the appearance of the school. Yes, and many teachers work for much less because the working conditions are often times more desirable than some public schools, as well as class size much smaller. Students are for the most part polite and are there to learn. Now that is not to say that ALL public schools are less desirable than a public school. Right now I teach in a very nice public school that is in a higher socio-economic area with a majority of college educated parents. Parents are involved in their child's education and have high expectations. Communication is done readily by email and grades are all on-line. Vouchers would not take away our student population. Maybe, the real problem, is with those schools that have no control, have huge student populations (in which students have to have security and metal detectors), and have no discipline/high expectations. Perhaps reducing school size would be a part of the answer. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090410, 
        "postID": 82, 
        "quote": "", 
        "reply": "I am a public school teacher and I think that parents should be given the choice with vouchers. (Actually I have worked at both private and public schools.) It is awful that some children have no choice other than to attend schools where they worry every minute, for their own safety. Why force these kids to continue going to these schools? People just assume that every private school is just going to take these vouchers. With vouchers come accountability and government intrusion into the private school system. The private Catholic school where I taught would not be so quick to take this option. The school has it's rules and requirements. If you didn't want to be there you could leave. The school didn't have to take everyone. If a student disrupted the school and the students, the parents would be asked to find another place to educate that student. We also had students of other faiths enrolled in our school, and it was not the school's purpose to indoctrinate them into its faith. (Actually I had more religious harassment at the public school I had left prior to teaching at the private school.) Also, think logistics....how will these new students get to a private school? Not every community has a local private school and how would the student get to school. I just can't see every private school investing in mass transportation nor every parent able to drive these children to school across a city. Would the vouchers cover the cost of the transportation, too? Will the vouchers cover the cost of uniforms? Class supplies? The parents at private school do not grumble about the fact that they have to provide their children with pencils, pens, notebooks, lab fees, etc. It is expected and generally stated in the enrollment application. Oh, and remember, not all who send their children to private or parochial schools are rich. Many families make great sacrifices to make this education available to their children; but it is a matter of choice. In another post, someone mentioned that private schools can educate children much cheaper. This may well be the case. In our private school, parents would volunteer to clean (didn't have to hire a janitorial service). Need an electrician.....oh so and so's dad will help out. We had parents and some students that worked over the summer to sand and varnish all old hardwood floors of the elementary building. The school raised money to pay for the supplies and equipment needed. They did a beautiful job. The students took ownership of their facility and due to this no graffiti or property damage. Of course, there were some students that would also get to clean the bathroom or hallway with a toothbrush. (Parental support) So after a few times, these students, too, began to care about the appearance of the school. Yes, and many teachers work for much less because the working conditions are often times more desirable than some public schools, as well as class size much smaller. Students are for the most part polite and are there to learn. Now that is not to say that ALL public schools are less desirable than a public school. Right now I teach in a very nice public school that is in a higher socio-economic area with a majority of college educated parents. Parents are involved in their child's education and have high expectations. Communication is done readily by email and grades are all on-line. Vouchers would not take away our student population. Maybe, the real problem, is with those schools that have no control, have huge student populations (in which students have to have security and metal detectors), and have no discipline/high expectations. Perhaps reducing school size would be a part of the answer. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:21:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: [/QUOTE] [/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! [/QUOTE] Well now we're getting somewhere .... you have now acknowledged that some improvements have been obtained by use of vouchers. Your claim is that if we'd just spent the money in the public sector we'd have gotten the same result. How exactly did you determine this? Also, please define \"full transparency.\"", 
        "intTime": 20090410, 
        "postID": 83, 
        "quote": "Originally posted by skinman13: quote:", 
        "reply": " [/QUOTE] [/QUOTE] He is probably an NEA member. And competition sux.[/QUOTE] I do not belong to any union. However, I did a lot of research on this issue a few years back when I was a featured writer for my college newspaper and there is absolutely NO improvement in the academic learning process of children when vouchers are used and full transparency is required. Not one of the areas that push vouchers has demonstrated one bit of improvement that could have not equally been realized if the same focus and funds had not been spent on the local schools. NOT ONE! [/QUOTE] Well now we're getting somewhere .... you have now acknowledged that some improvements have been obtained by use of vouchers. Your claim is that if we'd just spent the money in the public sector we'd have gotten the same result. How exactly did you determine this? Also, please define \"full transparency.\"", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:43:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "intTime": 20090410, 
        "postID": 84, 
        "quote": "", 
        "reply": "I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:45:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by RRR52: quote: Originally posted by skinman13: I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both. Define a \"voucher school.\" How about you give us an example of one?", 
        "intTime": 20090410, 
        "postID": 85, 
        "quote": "Originally posted by skinman13: quote: Originally posted by RRR52: quote: Originally posted by skinman13: I hear you talking the talk, but can you give me ONE example of a voucher school that can withstand a fair comparison? Faith is not science...it is a belief of something that cannot withstand the scientific process. Science must be based on something that can be subjected to the scientific process and either proved or disproved. \"Intelligent Design,\" is nothing more than a thinly veiled rehashing of creationism and cannot be subjected to the scientific process, but evolution can. Finally, I usually find that people who are quick to criticize and trash public school teachers have never set foot in a classroom since they graduated (if they did graduate) high school. They usually have some left-over hate for the teachers who held them accountable for their academics or behavior, or both.", 
        "reply": " Define a \"voucher school.\" How about you give us an example of one?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 14:47:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "intTime": 20090410, 
        "postID": 86, 
        "quote": "Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one?", 
        "reply": " You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 23:42:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by threerings: I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools. Name one, and compare it to a public school in the areas of teacher certification, student assessment, student population and enrollment criteria. Don't tell me it works if you are not prepared to prove it. aggie_wife's post obviously comes from experience but even her pro-voucher arguments are full of holes. Yes, there are some serious issues with some public schools, and yes, voucher and charter schools have demonstrated success in these areas, but the reason that voucher and or charter schools can sometimes present a better academic picture in these cases is because these schools can cherry-pick their students and therefore can manipulate their success statistics. They can choose the best students, the public school is left with the rest, then the public schools get less money to educate those students the voucher and charter schools deem as undesirable but now with less resources because their resources have been siphoned off for vouchers and charter campuses. So the question is, can voucher schools and charter schools still present the same success stories if they were forced to take in any student that shows up at their campus regardless of their academic or discipline problems? I doubt it, and besides, that has never happened and is not the way voucher and or charter schools work, and therefore any comparison to public schools is skewed right from the start.", 
        "intTime": 20090410, 
        "postID": 87, 
        "quote": "Originally posted by threerings: I know two things: 1. Charter schools WORK. 2. Liberals hate charter schools.", 
        "reply": " Name one, and compare it to a public school in the areas of teacher certification, student assessment, student population and enrollment criteria. Don't tell me it works if you are not prepared to prove it. aggie_wife's post obviously comes from experience but even her pro-voucher arguments are full of holes. Yes, there are some serious issues with some public schools, and yes, voucher and charter schools have demonstrated success in these areas, but the reason that voucher and or charter schools can sometimes present a better academic picture in these cases is because these schools can cherry-pick their students and therefore can manipulate their success statistics. They can choose the best students, the public school is left with the rest, then the public schools get less money to educate those students the voucher and charter schools deem as undesirable but now with less resources because their resources have been siphoned off for vouchers and charter campuses. So the question is, can voucher schools and charter schools still present the same success stories if they were forced to take in any student that shows up at their campus regardless of their academic or discipline problems? I doubt it, and besides, that has never happened and is not the way voucher and or charter schools work, and therefore any comparison to public schools is skewed right from the start.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-10 23:50:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "skinman13"
    }, 
    {
        "content": "Private schools are awsome. I sent all three of my kids to private schools. They surpass public schools hands down. I didn't want my kids to be assimilated into the \"Borg\" by second rate \"teachers\"!", 
        "intTime": 20090411, 
        "postID": 88, 
        "quote": "", 
        "reply": "Private schools are awsome. I sent all three of my kids to private schools. They surpass public schools hands down. I didn't want my kids to be assimilated into the \"Borg\" by second rate \"teachers\"!", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 08:59:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools. So you can not define a \"voucher school\". Nor can you describe exactly what \"full transparency\" is. When you can do that, get back to us. Now about how you wish your tax dollars spent .... by chance are the public schools in your area broken. The ones in mine are failing, have been for years. Federal, state and local governments pour millions of dollars into my failing public schools and they continue to fail. Why should I continue to support failure with my tax dollars?", 
        "intTime": 20090411, 
        "postID": 89, 
        "quote": "Originally posted by skinman13: quote: Originally posted by Boospar: [snip] Define a \"voucher school.\" How about you give us an example of one? You are still talking the talk and not walking the walk, and you are dodging my challenge. Why? Is it too much for you? Maybe you didn't read it so I will repeat it, \"... can you give me ONE example of a voucher school that can withstand a fair comparison?\" I do not want MY tax dollars to support some private religious institution, which most schools that accept vouchers are, nor do I want MY tax dollars supporting a parallel school system that lacks equal accountability with public schools, I want MY tax dollars to be spent in fixing our local public schools.", 
        "reply": " So you can not define a \"voucher school\". Nor can you describe exactly what \"full transparency\" is. When you can do that, get back to us. Now about how you wish your tax dollars spent .... by chance are the public schools in your area broken. The ones in mine are failing, have been for years. Federal, state and local governments pour millions of dollars into my failing public schools and they continue to fail. Why should I continue to support failure with my tax dollars?", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 10:21:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22. Spot on regarding all the things my DD's school doesn't have to deal with. They seem, however, to do a better job teaching her.", 
        "intTime": 20090411, 
        "postID": 90, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by Boospar: It might be interesting to find out why they can do the job for less money. Beauracracy. Too many over paid nonteachers and an entitlement minded union that isn't willing to co-operate with entitlement minded government officials. A sad, downward spiraling catch-22.", 
        "reply": " Spot on regarding all the things my DD's school doesn't have to deal with. They seem, however, to do a better job teaching her.", 
        "threadID": "409192893_5690059912001", 
        "time": "2009-04-11 10:42:00", 
        "title": "Democrats and Poor Kids", 
        "userID": "Boospar"
    }
]