[
    {
        "content": "So this new \"inclusiveness\" that the GOP is allegedly adopting simply means that they shift their justification for discrimination? I understand Log Cabin Republicans less and less... RNC chief: Gay marriage will burden small business By RUSS BYNUM – 21 hours ago SAVANNAH, Ga. (AP) — Republicans can reach a broader base by recasting gay marriage as an issue that could dent pocketbooks as small businesses spend more on health care and other benefits, GOP Chairman Michael Steele said Saturday. Steele said that was just an example of how the party can retool its message to appeal to young voters and minorities without sacrificing core conservative principles. Steele said he used the argument weeks ago while chatting on a flight with a college student who described herself as fiscally conservative but socially liberal on issues like gay marriage. \"Now all of a sudden I've got someone who wasn't a spouse before, that I had no responsibility for, who is now getting claimed as a spouse that I now have financial responsibility for,\" Steele told Republicans at the state convention in traditionally conservative Georgia. \"So how do I pay for that? Who pays for that? You just cost me money.\" As Steele talked about ways the party could position itself, he also poked fun at his previous pledge to give the GOP a \"hip-hop makeover.\" \"You don't have to wear your pants cut down here or the big bling,\" he said. Vermont and Iowa have legalized gay marriage in recent weeks, and a Quinnipiac University poll released in April found that 57 percent of people questioned support civil unions that provide marriage-like rights. Although 55 percent said they opposed gay marriage, the poll indicated a shift toward more acceptance. \"http://www.google.com/hostednews/ap/article/ALeqM5hj-3T1zeVD9FsoDI8hSNGqd2Rs-QD987ERJO1\" Apparently Chairman Steele did not read this: \"http://www.forbes.com/2004/04/05/cx_al_0405gaymarriage.html\"", 
        "intTime": 20090517, 
        "postID": 1, 
        "quote": "", 
        "reply": "So this new \"inclusiveness\" that the GOP is allegedly adopting simply means that they shift their justification for discrimination? I understand Log Cabin Republicans less and less... RNC chief: Gay marriage will burden small business By RUSS BYNUM – 21 hours ago SAVANNAH, Ga. (AP) — Republicans can reach a broader base by recasting gay marriage as an issue that could dent pocketbooks as small businesses spend more on health care and other benefits, GOP Chairman Michael Steele said Saturday. Steele said that was just an example of how the party can retool its message to appeal to young voters and minorities without sacrificing core conservative principles. Steele said he used the argument weeks ago while chatting on a flight with a college student who described herself as fiscally conservative but socially liberal on issues like gay marriage. \"Now all of a sudden I've got someone who wasn't a spouse before, that I had no responsibility for, who is now getting claimed as a spouse that I now have financial responsibility for,\" Steele told Republicans at the state convention in traditionally conservative Georgia. \"So how do I pay for that? Who pays for that? You just cost me money.\" As Steele talked about ways the party could position itself, he also poked fun at his previous pledge to give the GOP a \"hip-hop makeover.\" \"You don't have to wear your pants cut down here or the big bling,\" he said. Vermont and Iowa have legalized gay marriage in recent weeks, and a Quinnipiac University poll released in April found that 57 percent of people questioned support civil unions that provide marriage-like rights. Although 55 percent said they opposed gay marriage, the poll indicated a shift toward more acceptance. \"http://www.google.com/hostednews/ap/article/ALeqM5hj-3T1zeVD9FsoDI8hSNGqd2Rs-QD987ERJO1\" Apparently Chairman Steele did not read this: \"http://www.forbes.com/2004/04/05/cx_al_0405gaymarriage.html\"", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 07:14:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "If one version of a bad idea fails - try a different version of the same bad idea. One could use the same ideas in Steele's new argument to call for the abolition of hetrosexual marriage. After all, hetrosexual marriage causes the same costs to business owners as his projected costs of same-sex marriage.", 
        "intTime": 20090517, 
        "postID": 2, 
        "quote": "", 
        "reply": "If one version of a bad idea fails - try a different version of the same bad idea. One could use the same ideas in Steele's new argument to call for the abolition of hetrosexual marriage. After all, hetrosexual marriage causes the same costs to business owners as his projected costs of same-sex marriage.", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 08:16:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: So this new \"inclusiveness\" that the GOP is allegedly adopting simply means that they shift their justification for discrimination? I understand Log Cabin Republicans less and less... RNC chief: Gay marriage will burden small business By RUSS BYNUM – 21 hours ago SAVANNAH, Ga. (AP) — Republicans can reach a broader base by recasting gay marriage as an issue that could dent pocketbooks as small businesses spend more on health care and other benefits, GOP Chairman Michael Steele said Saturday. Steele said that was just an example of how the party can retool its message to appeal to young voters and minorities without sacrificing core conservative principles. Steele said he used the argument weeks ago while chatting on a flight with a college student who described herself as fiscally conservative but socially liberal on issues like gay marriage. \"Now all of a sudden I've got someone who wasn't a spouse before, that I had no responsibility for, who is now getting claimed as a spouse that I now have financial responsibility for,\" Steele told Republicans at the state convention in traditionally conservative Georgia. \"So how do I pay for that? Who pays for that? You just cost me money.\" As Steele talked about ways the party could position itself, he also poked fun at his previous pledge to give the GOP a \"hip-hop makeover.\" \"You don't have to wear your pants cut down here or the big bling,\" he said. Vermont and Iowa have legalized gay marriage in recent weeks, and a Quinnipiac University poll released in April found that 57 percent of people questioned support civil unions that provide marriage-like rights. Although 55 percent said they opposed gay marriage, the poll indicated a shift toward more acceptance. \"http://www.google.com/hostednews/ap/article/ALeqM5hj-3T1zeVD9FsoDI8hSNGqd2Rs-QD987ERJO1\" Apparently Chairman Steele did not read this: \"http://www.forbes.com/2004/04/05/cx_al_0405gaymarriage.html\" Maybe . . ., just maybe... The \"log cabin\" REPs have enough sense to realize that had their mothers been pro-choice, their arses would have never existed . . ., flushed down the ole proverbial crapper, like the 48+ million, to date... And maybe . . . just maybe . . ., had their moms chose a woman, in lieu of a man, for a partner. . ., that too would have impacted on their birth probability... I'm not sure how long Invitro-Fertilization has been available (successful), prior to that is what I'm particularly addressing... I realize, of course, that what I've addressed above is of no consideration to you... Just imagine for ONE SECOND your mom decided to abort you...", 
        "intTime": 20090517, 
        "postID": 3, 
        "quote": "Originally posted by SeaWitch1220: So this new \"inclusiveness\" that the GOP is allegedly adopting simply means that they shift their justification for discrimination? I understand Log Cabin Republicans less and less... RNC chief: Gay marriage will burden small business By RUSS BYNUM – 21 hours ago SAVANNAH, Ga. (AP) — Republicans can reach a broader base by recasting gay marriage as an issue that could dent pocketbooks as small businesses spend more on health care and other benefits, GOP Chairman Michael Steele said Saturday. Steele said that was just an example of how the party can retool its message to appeal to young voters and minorities without sacrificing core conservative principles. Steele said he used the argument weeks ago while chatting on a flight with a college student who described herself as fiscally conservative but socially liberal on issues like gay marriage. \"Now all of a sudden I've got someone who wasn't a spouse before, that I had no responsibility for, who is now getting claimed as a spouse that I now have financial responsibility for,\" Steele told Republicans at the state convention in traditionally conservative Georgia. \"So how do I pay for that? Who pays for that? You just cost me money.\" As Steele talked about ways the party could position itself, he also poked fun at his previous pledge to give the GOP a \"hip-hop makeover.\" \"You don't have to wear your pants cut down here or the big bling,\" he said. Vermont and Iowa have legalized gay marriage in recent weeks, and a Quinnipiac University poll released in April found that 57 percent of people questioned support civil unions that provide marriage-like rights. Although 55 percent said they opposed gay marriage, the poll indicated a shift toward more acceptance. \"http://www.google.com/hostednews/ap/article/ALeqM5hj-3T1zeVD9FsoDI8hSNGqd2Rs-QD987ERJO1\" Apparently Chairman Steele did not read this: \"http://www.forbes.com/2004/04/05/cx_al_0405gaymarriage.html\"", 
        "reply": " Maybe . . ., just maybe... The \"log cabin\" REPs have enough sense to realize that had their mothers been pro-choice, their arses would have never existed . . ., flushed down the ole proverbial crapper, like the 48+ million, to date... And maybe . . . just maybe . . ., had their moms chose a woman, in lieu of a man, for a partner. . ., that too would have impacted on their birth probability... I'm not sure how long Invitro-Fertilization has been available (successful), prior to that is what I'm particularly addressing... I realize, of course, that what I've addressed above is of no consideration to you... Just imagine for ONE SECOND your mom decided to abort you...", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 10:37:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "RE-Branding?! The whole Javitz-Rockefeller wing of the Republican Party now resides in the Democratic camp with a few exceptions, good example is Senator Olympia Snow R-Maine. She is a liberal Republican who still is not in the Democratic column. But, many Ripon Society Republicans are now Democrats. The Neo-cons drove out that whole wing of the Republican Party.", 
        "intTime": 20090517, 
        "postID": 4, 
        "quote": "", 
        "reply": "RE-Branding?! The whole Javitz-Rockefeller wing of the Republican Party now resides in the Democratic camp with a few exceptions, good example is Senator Olympia Snow R-Maine. She is a liberal Republican who still is not in the Democratic column. But, many Ripon Society Republicans are now Democrats. The Neo-cons drove out that whole wing of the Republican Party.", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 10:51:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "When I was young the Democratic Party of the South and Middle Atlantic states were against Jews, Catholics, blacks,hispanics, etc... the Republican Party accepted them...when I was a kid! The political turnaround of both parties is really a eye opener over the years!", 
        "intTime": 20090517, 
        "postID": 5, 
        "quote": "", 
        "reply": "When I was young the Democratic Party of the South and Middle Atlantic states were against Jews, Catholics, blacks,hispanics, etc... the Republican Party accepted them...when I was a kid! The political turnaround of both parties is really a eye opener over the years!", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 15:14:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Whatever you do DragonFlyer, please, don't mention that LINCOLN was a republican, and the Abolitionist of that time were instrumental in the Underground Railroad..., were also REPUBLICANS... They'll (LIBs) never believe you. The southern (Dixie-crats) Democrats are the founders of the KKK... The LIBs will never believe that either. . .", 
        "intTime": 20090517, 
        "postID": 6, 
        "quote": "", 
        "reply": "Whatever you do DragonFlyer, please, don't mention that LINCOLN was a republican, and the Abolitionist of that time were instrumental in the Underground Railroad..., were also REPUBLICANS... They'll (LIBs) never believe you. The southern (Dixie-crats) Democrats are the founders of the KKK... The LIBs will never believe that either. . .", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 15:55:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: Whatever you do DragonFlyer, please, don't mention that LINCOLN was a republican, and the Abolitionist of that time were instrumental in the Underground Railroad..., were also REPUBLICANS... They'll (LIBs) never believe you. The southern (Dixie-crats) Democrats are the founders of the KKK... The LIBs will never believe that either. . . Yeah, it's almost like the parties flipped ideologies. I wonder what Lincoln would think of his party now? Golwater is rolling over in his grave for sure...", 
        "intTime": 20090517, 
        "postID": 7, 
        "quote": "Originally posted by ELLIOTT1980: Whatever you do DragonFlyer, please, don't mention that LINCOLN was a republican, and the Abolitionist of that time were instrumental in the Underground Railroad..., were also REPUBLICANS... They'll (LIBs) never believe you. The southern (Dixie-crats) Democrats are the founders of the KKK... The LIBs will never believe that either. . .", 
        "reply": " Yeah, it's almost like the parties flipped ideologies. I wonder what Lincoln would think of his party now? Golwater is rolling over in his grave for sure...", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 16:09:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by ELLIOTT1980: Whatever you do DragonFlyer, please, don't mention that LINCOLN was a republican, and the Abolitionist of that time were instrumental in the Underground Railroad..., were also REPUBLICANS... They'll (LIBs) never believe you. The southern (Dixie-crats) Democrats are the founders of the KKK... The LIBs will never believe that either. . . Yeah, it's almost like the parties flipped ideologies. I wonder what Lincoln would think of his party now? Golwater is rolling over in his grave for sure... My ancestor might think that We the People have become even greater enemies without the bloodshed...and that We totally miss the point of where We are economically...and politically in this World... If there is a time to mend the fences..and pull together...it is now... Printing useless dollars as currency...and buying a little time...won't pay for our indiscretions... We have no more time to find common ground...Americans must learn to respect each other now... Our basis here...is mil service...elsewhere...who knows... We must all learn to respect our neighbors...or else...", 
        "intTime": 20090517, 
        "postID": 8, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by ELLIOTT1980: Whatever you do DragonFlyer, please, don't mention that LINCOLN was a republican, and the Abolitionist of that time were instrumental in the Underground Railroad..., were also REPUBLICANS... They'll (LIBs) never believe you. The southern (Dixie-crats) Democrats are the founders of the KKK... The LIBs will never believe that either. . . Yeah, it's almost like the parties flipped ideologies. I wonder what Lincoln would think of his party now? Golwater is rolling over in his grave for sure...", 
        "reply": " My ancestor might think that We the People have become even greater enemies without the bloodshed...and that We totally miss the point of where We are economically...and politically in this World... If there is a time to mend the fences..and pull together...it is now... Printing useless dollars as currency...and buying a little time...won't pay for our indiscretions... We have no more time to find common ground...Americans must learn to respect each other now... Our basis here...is mil service...elsewhere...who knows... We must all learn to respect our neighbors...or else...", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 16:27:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "strobelvets"
    }, 
    {
        "content": "Its the religious fundamentalist's we have to purge....they have to GO. I'm a conservative but the religious stuff has no place here, people who devote their life and beliefs in God do not need some political party in America to have their voices heard... Atleast thats the way I see it...", 
        "intTime": 20090517, 
        "postID": 9, 
        "quote": "", 
        "reply": "Its the religious fundamentalist's we have to purge....they have to GO. I'm a conservative but the religious stuff has no place here, people who devote their life and beliefs in God do not need some political party in America to have their voices heard... Atleast thats the way I see it...", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 17:11:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Its the religious fundamentalist's we have to purge....they have to GO. I'm a conservative but the religious stuff has no place here, people who devote their life and beliefs in God do not need some political party in America to have their voices heard... Atleast thats the way I see it... They have to aspire to some party. Why would fundamentalist Christians not have the need? If you're referring to the necessity of separating church and government...I agree... It is a founding principle...and prevents the horrors observed in the european middle ages...when Church overcame state rights... And again, here, when Americans cleansed \"witches\"...", 
        "intTime": 20090517, 
        "postID": 10, 
        "quote": "Originally posted by Irwin_R_Schyster: Its the religious fundamentalist's we have to purge....they have to GO. I'm a conservative but the religious stuff has no place here, people who devote their life and beliefs in God do not need some political party in America to have their voices heard... Atleast thats the way I see it...", 
        "reply": " They have to aspire to some party. Why would fundamentalist Christians not have the need? If you're referring to the necessity of separating church and government...I agree... It is a founding principle...and prevents the horrors observed in the european middle ages...when Church overcame state rights... And again, here, when Americans cleansed \"witches\"...", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 18:02:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: We have no more time to find common ground...Americans must learn to respect each other now... Respect is earned not given . . . I have the utmost respect for those: 1. Believe (and live it) their word is their bond. 2. Incur a debt, pay their debt w/o B S excuses. 3. Live by Personal Accountability - Individual Responsibility Etho. I don't think the above are that hard except for the Lame arse, Lazy, Liar citizenry that \"can't\"...", 
        "intTime": 20090517, 
        "postID": 11, 
        "quote": "We have no more time to find common ground...Americans must learn to respect each other now...", 
        "reply": " Respect is earned not given . . . I have the utmost respect for those: 1. Believe (and live it) their word is their bond. 2. Incur a debt, pay their debt w/o B S excuses. 3. Live by Personal Accountability - Individual Responsibility Etho. I don't think the above are that hard except for the Lame arse, Lazy, Liar citizenry that \"can't\"...", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 18:10:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by strobelvets: quote: Originally posted by Irwin_R_Schyster: Its the religious fundamentalist's we have to purge....they have to GO. I'm a conservative but the religious stuff has no place here, people who devote their life and beliefs in God do not need some political party in America to have their voices heard... Atleast thats the way I see it... They have to aspire to some party. Why would fundamentalist Christians not have the need? If you're referring to the necessity of separating church and government...I agree... It is a founding principle...and prevents the horrors observed in the european middle ages...when Church overcame state rights... And again, here, when Americans cleansed \"witches\"... Why would Christians(or any religious group) \"Need\" a political party? It's my understanding that prayer, fasting, and faith is all that is required....Not lobbying, legislation, and condemnation... If Christians feel that they cannot get what they \"want\" through devine methods then they need to reevaluate their belief system...", 
        "intTime": 20090517, 
        "postID": 12, 
        "quote": "Originally posted by strobelvets: quote: Originally posted by Irwin_R_Schyster: Its the religious fundamentalist's we have to purge....they have to GO. I'm a conservative but the religious stuff has no place here, people who devote their life and beliefs in God do not need some political party in America to have their voices heard... Atleast thats the way I see it... They have to aspire to some party. Why would fundamentalist Christians not have the need? If you're referring to the necessity of separating church and government...I agree... It is a founding principle...and prevents the horrors observed in the european middle ages...when Church overcame state rights... And again, here, when Americans cleansed \"witches\"...", 
        "reply": " Why would Christians(or any religious group) \"Need\" a political party? It's my understanding that prayer, fasting, and faith is all that is required....Not lobbying, legislation, and condemnation... If Christians feel that they cannot get what they \"want\" through devine methods then they need to reevaluate their belief system...", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 18:45:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Irwin_R_Schyster, Maybe you should understand that God will not Judge for you....He will Judge you !! Religon will not solve the Gay marriage issue,...it is only an issue , if you are Gay, and there isn`t enough of them !!", 
        "intTime": 20090517, 
        "postID": 13, 
        "quote": "", 
        "reply": "Irwin_R_Schyster, Maybe you should understand that God will not Judge for you....He will Judge you !! Religon will not solve the Gay marriage issue,...it is only an issue , if you are Gay, and there isn`t enough of them !!", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 19:14:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: We have no more time to find common ground...Americans must learn to respect each other now... Respect is earned not given . . . I have the utmost respect for those: 1. Believe (and live it) their word is their bond. 2. Incur a debt, pay their debt w/o B S excuses. 3. Live by Personal Accountability - Individual Responsibility Etho. I don't think the above are that hard except for the Lame arse, Lazy, Liar citizenry that \"can't\"... JMHO, I could be wrong...", 
        "intTime": 20090517, 
        "postID": 14, 
        "quote": "Originally posted by ELLIOTT1980: quote: We have no more time to find common ground...Americans must learn to respect each other now... Respect is earned not given . . . I have the utmost respect for those: 1. Believe (and live it) their word is their bond. 2. Incur a debt, pay their debt w/o B S excuses. 3. Live by Personal Accountability - Individual Responsibility Etho. I don't think the above are that hard except for the Lame arse, Lazy, Liar citizenry that \"can't\"...", 
        "reply": " JMHO, I could be wrong...", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 19:28:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "REBRANDING??? Does anybody recall the meetings and conventions of the years following the Bush win?? I do....They had convocations one after another to re-package their \"message\". Turned out they didn't need to!! It's the same old playbook from the last fifty years!! We have nothing to sell, but fear itself!! So after changing the \"Modern Liberal\" tag for 'Progressives\" get out there and sell it they did!! LUCKY US!!! Can we say......suckers!!!!!!", 
        "intTime": 20090517, 
        "postID": 15, 
        "quote": "", 
        "reply": "REBRANDING??? Does anybody recall the meetings and conventions of the years following the Bush win?? I do....They had convocations one after another to re-package their \"message\". Turned out they didn't need to!! It's the same old playbook from the last fifty years!! We have nothing to sell, but fear itself!! So after changing the \"Modern Liberal\" tag for 'Progressives\" get out there and sell it they did!! LUCKY US!!! Can we say......suckers!!!!!!", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 21:35:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "tawodi"
    }, 
    {
        "content": "John Kennedy came up with and FDR...We have nothing to fear but fear itself... have not heard any other President use it without a quote.", 
        "intTime": 20090517, 
        "postID": 16, 
        "quote": "", 
        "reply": "John Kennedy came up with and FDR...We have nothing to fear but fear itself... have not heard any other President use it without a quote.", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-17 23:10:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Republicans trying to rebrand the GOP and democrats trying to rewrite history... \"The World's Finest\"", 
        "intTime": 20090518, 
        "postID": 17, 
        "quote": "", 
        "reply": "Republicans trying to rebrand the GOP and democrats trying to rewrite history... \"The World's Finest\"", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-18 04:13:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Republicans trying to rebrand the GOP and democrats trying to rewrite history... Really? How are the Democrats trying to rewrite history? Rewriting history seems to be the project of Dick Cheney and others in the Bush administration.", 
        "intTime": 20090518, 
        "postID": 18, 
        "quote": "Originally posted by Kegler300: Republicans trying to rebrand the GOP and democrats trying to rewrite history...", 
        "reply": " Really? How are the Democrats trying to rewrite history? Rewriting history seems to be the project of Dick Cheney and others in the Bush administration.", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-18 05:32:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Its the religious fundamentalist's we have to purge....they have to GO. I'm a conservative but the religious stuff has no place here, people who devote their life and beliefs in God do not need some political party in America to have their voices heard... Atleast thats the way I see it... It will never happen. Republicanism and the Christian Right are indelibly linked to one another. Yes, this could change, but not anytime soon! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 19, 
        "quote": "Originally posted by Irwin_R_Schyster: Its the religious fundamentalist's we have to purge....they have to GO. I'm a conservative but the religious stuff has no place here, people who devote their life and beliefs in God do not need some political party in America to have their voices heard... Atleast thats the way I see it...", 
        "reply": " It will never happen. Republicanism and the Christian Right are indelibly linked to one another. Yes, this could change, but not anytime soon! No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-18 06:25:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: They are not incredibaly linked. There was a time when Christian's didn't involve themselves with politics. Then the swing changed the were there were/are more people that label themselves 'christian' that are very liberal. And it will change again. Life is always in flux. KL, I did not say \"incredibaly linked,\" I said \"indelibly linked.\" The GOP and the Christian Right have literally become one in the same. I also said that over time, this correlation the party has with the Christian Right might change. BUT, it's going to take a long time. I think we agree on that point. As long as the GOP has such alliances with groups such as Reverend Dobson's \"Focus on the Family,\" the party will just continue to be looked upon as Bible Thumpers. Looking at such things from the other side of the isle, my best advice to the GOP would be to lose the Bibles ASAP, and to try to STOP being the party of NO. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 20, 
        "quote": "Originally posted by klassylady25: They are not incredibaly linked. There was a time when Christian's didn't involve themselves with politics. Then the swing changed the were there were/are more people that label themselves 'christian' that are very liberal. And it will change again. Life is always in flux.", 
        "reply": " KL, I did not say \"incredibaly linked,\" I said \"indelibly linked.\" The GOP and the Christian Right have literally become one in the same. I also said that over time, this correlation the party has with the Christian Right might change. BUT, it's going to take a long time. I think we agree on that point. As long as the GOP has such alliances with groups such as Reverend Dobson's \"Focus on the Family,\" the party will just continue to be looked upon as Bible Thumpers. Looking at such things from the other side of the isle, my best advice to the GOP would be to lose the Bibles ASAP, and to try to STOP being the party of NO. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_6000005322001", 
        "time": "2009-05-18 07:54:00", 
        "title": "More Republican \"Rebranding\"!!", 
        "userID": "ProgMod"
    }
]