[
    {
        "content": "Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special!", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special!", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 19:39:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor.", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 19:51:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special! It is EXACTLY true. Congressmen grilled a CitiCorp creep today, and he admitted that 10 billion had been lent to constructions companies in China from CitiCorp while similar companies here who needed loans or mortgage help were denied the money - - That is Treasonous bullshyyt while Chinese ships are harassing our own... Some of those CitiCorp bassturds need to be shot or hanged for profiteering and treason! CitiCorp = ChiComCorp!! Wandering and Wondering", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "Originally posted by EspritDeCorps: Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special!", 
        "reply": " It is EXACTLY true. Congressmen grilled a CitiCorp creep today, and he admitted that 10 billion had been lent to constructions companies in China from CitiCorp while similar companies here who needed loans or mortgage help were denied the money - - That is Treasonous bullshyyt while Chinese ships are harassing our own... Some of those CitiCorp bassturds need to be shot or hanged for profiteering and treason! CitiCorp = ChiComCorp!! Wandering and Wondering", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 19:55:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor. Well thanks for clearing that up....I'm more stimulated now than a teen on Viagra with a hooker! Thank God we're getting in on the \"ground floor\".... I sure would hate to see the jobless people here in the US suffer. At least everyone will have credit cards to help with the national debt.", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by 10tenths: That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor.", 
        "reply": " Well thanks for clearing that up....I'm more stimulated now than a teen on Viagra with a hooker! Thank God we're getting in on the \"ground floor\".... I sure would hate to see the jobless people here in the US suffer. At least everyone will have credit cards to help with the national debt.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 19:59:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: It is EXACTLY true. Congressmen grilled a CitiCorp creep today, and he admitted that 10 billion had been lent to constructions companies in China from CitiCorp while similar companies here who needed loans or mortgage help were denied the money - - That is Treasonous bullshyyt while Chinese ships are harassing our own... Some of those CitiCorp bassturds need to be shot or hanged for profiteering and treason! CitiCorp = ChiComCorp!! Show me a link because I cannot find one. And, I haven't gotten anything from my sources on this at all. Was it on C-Span? Where are you getting this from? quote: Originally posted by EspritDeCorps: Well thanks for clearing that up....I'm more stimulated now than a teen on Viagra with a hooker! Thank God we're getting in on the \"ground floor\".... I sure would hate to see the jobless people here in the US suffer. At least everyone will have credit cards to help with the national debt. That is just how business works. If you want them to pay us back, they need to make money. The probability of them making that money here in the States is pretty low because we are overextended in our credit and have a habit of defaulting. So, I cannot fault them in that regard.", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "Originally posted by greywolfghost: It is EXACTLY true. Congressmen grilled a CitiCorp creep today, and he admitted that 10 billion had been lent to constructions companies in China from CitiCorp while similar companies here who needed loans or mortgage help were denied the money - - That is Treasonous bullshyyt while Chinese ships are harassing our own... Some of those CitiCorp bassturds need to be shot or hanged for profiteering and treason! CitiCorp = ChiComCorp!!", 
        "reply": " Show me a link because I cannot find one. And, I haven't gotten anything from my sources on this at all. Was it on C-Span? Where are you getting this from? quote: Originally posted by EspritDeCorps: Well thanks for clearing that up....I'm more stimulated now than a teen on Viagra with a hooker! Thank God we're getting in on the \"ground floor\".... I sure would hate to see the jobless people here in the US suffer. At least everyone will have credit cards to help with the national debt. That is just how business works. If you want them to pay us back, they need to make money. The probability of them making that money here in the States is pretty low because we are overextended in our credit and have a habit of defaulting. So, I cannot fault them in that regard.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 21:49:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor. Which is a bail out??? And will create tens of thousands of AMERICAN jobs right?", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by 10tenths: That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor.", 
        "reply": " Which is a bail out??? And will create tens of thousands of AMERICAN jobs right?", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 23:03:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Dennis Kucinich really took the TARP fund overseer (Can't remember his name, but it starts with a K) to task over how the TARP funds have been spent. He pointedly asked if a bank which has received TARP money investing in Dubai is considered by the Treasury to be a legitimate use of that money an in the nations best interest. \"K\" hemmed and hawed but eventually came up with the explanation that Treasury has gone out of its way not to micro-manage the banks which we've leant money to and, if they invest overseas, it will make the bank more profitable and better able to pay back the \"loan\" we gave them. In other words, We The People just gave them an interest free loan to make more money and Treasury doesn't give a damn how they do it!", 
        "intTime": 20090312, 
        "postID": 7, 
        "quote": "", 
        "reply": "Dennis Kucinich really took the TARP fund overseer (Can't remember his name, but it starts with a K) to task over how the TARP funds have been spent. He pointedly asked if a bank which has received TARP money investing in Dubai is considered by the Treasury to be a legitimate use of that money an in the nations best interest. \"K\" hemmed and hawed but eventually came up with the explanation that Treasury has gone out of its way not to micro-manage the banks which we've leant money to and, if they invest overseas, it will make the bank more profitable and better able to pay back the \"loan\" we gave them. In other words, We The People just gave them an interest free loan to make more money and Treasury doesn't give a damn how they do it!", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 04:49:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "stillkit"
    }, 
    {
        "content": "I will have to ask Dennis about that next time I talk to him. Either way, if that is going to make Citi more solvent, then I do not see a problem. It would be dumb for any bank to lend to Americans right now for two reasons: Americans are completely tapped out as it is and they're defaulting on the loans they already have. The only alignments that most corporations have is to make their shareholders as much money as possible. And, that is what Citi is attempting to do. It is just that cannot be done in America right now. That is just obvious. It would be effective suicide for Citi to start lending here in the States and they know that. As for the Treasury not giving a darn how the money is spent. Well, maybe there should have been more earmarks in that bill or the bill should have been more specific. I always find it funny that most of the people who are now taking the protectionist route are the same ones who have accused me of being an isolationist. Most of you support the idea of spreading our military influence around the world, but don't do business outside of the US. Whereas I say do as much business and trade around the world as possible, but keep our military here at home. You guys really do crack me up sometimes. What's even funnier is that most of you are the same ones who wouldn't have believe a single word that Kucinich said only a few months ago. This forum is starting to wreak of hypocrisy and BS more and more everyday. Just out of curiosity, how in the hell do you expect Citi and the other banks to pay back the TARP money? Apparently the answer I am seeing is to loan money to people who can't pay back the loan and create jobs that are going to be a liability.", 
        "intTime": 20090312, 
        "postID": 8, 
        "quote": "", 
        "reply": "I will have to ask Dennis about that next time I talk to him. Either way, if that is going to make Citi more solvent, then I do not see a problem. It would be dumb for any bank to lend to Americans right now for two reasons: Americans are completely tapped out as it is and they're defaulting on the loans they already have. The only alignments that most corporations have is to make their shareholders as much money as possible. And, that is what Citi is attempting to do. It is just that cannot be done in America right now. That is just obvious. It would be effective suicide for Citi to start lending here in the States and they know that. As for the Treasury not giving a darn how the money is spent. Well, maybe there should have been more earmarks in that bill or the bill should have been more specific. I always find it funny that most of the people who are now taking the protectionist route are the same ones who have accused me of being an isolationist. Most of you support the idea of spreading our military influence around the world, but don't do business outside of the US. Whereas I say do as much business and trade around the world as possible, but keep our military here at home. You guys really do crack me up sometimes. What's even funnier is that most of you are the same ones who wouldn't have believe a single word that Kucinich said only a few months ago. This forum is starting to wreak of hypocrisy and BS more and more everyday. Just out of curiosity, how in the hell do you expect Citi and the other banks to pay back the TARP money? Apparently the answer I am seeing is to loan money to people who can't pay back the loan and create jobs that are going to be a liability.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:14:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Americans are completely tapped out as it is and they're defaulting on the loans they already have. Uh, speak for yourself.", 
        "intTime": 20090312, 
        "postID": 9, 
        "quote": "Americans are completely tapped out as it is and they're defaulting on the loans they already have.", 
        "reply": " Uh, speak for yourself.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:20:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I was speaking in General. Trust me, I am fine. My investments are up 8% since this crap started and I only pay cash. But, the banks still stand to lose a lot more money in the states as summer gets closer. The foreclosures are finally starting to settle in the West, but they are now rising in all of the States that weren't hit as hard in the first sweep. Plus, Commercial Real Estate in Detroit and here in Cleveland is about ready to crash at any moment. And, most of those that recently lost their jobs are now living on their credit cards. So, we can expect that sector to take a huge hit as summer comes.", 
        "intTime": 20090312, 
        "postID": 10, 
        "quote": "", 
        "reply": "I was speaking in General. Trust me, I am fine. My investments are up 8% since this crap started and I only pay cash. But, the banks still stand to lose a lot more money in the states as summer gets closer. The foreclosures are finally starting to settle in the West, but they are now rising in all of the States that weren't hit as hard in the first sweep. Plus, Commercial Real Estate in Detroit and here in Cleveland is about ready to crash at any moment. And, most of those that recently lost their jobs are now living on their credit cards. So, we can expect that sector to take a huge hit as summer comes.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:24:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Just out of curiosity, how in the hell do you expect Citi and the other banks to pay back the TARP money? Apparently the answer I am seeing is to loan money to people who can't pay back the loan and create jobs that are going to be a liability. 1) loan to innovative Americans 2) drop minimum wage laws, OSHA rules, and other bueracracies those nations we \"trade\" with don't pay for. 3) strictly account for all federal gov't spending 3) re-inact the 10 the amendment, allowing states to become innovative. 4) put a stop to welfare payments for those that historically consider it their entitlement. 5) use prisoners to do infrastructure work. 6) educate Americans instead of creating perpetual democrats. 7) this list could go on and on and on......", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Just out of curiosity, how in the hell do you expect Citi and the other banks to pay back the TARP money? Apparently the answer I am seeing is to loan money to people who can't pay back the loan and create jobs that are going to be a liability.", 
        "reply": " 1) loan to innovative Americans 2) drop minimum wage laws, OSHA rules, and other bueracracies those nations we \"trade\" with don't pay for. 3) strictly account for all federal gov't spending 3) re-inact the 10 the amendment, allowing states to become innovative. 4) put a stop to welfare payments for those that historically consider it their entitlement. 5) use prisoners to do infrastructure work. 6) educate Americans instead of creating perpetual democrats. 7) this list could go on and on and on......", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:27:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "But, you and I both know that is never going to happen. That is all dreamworld stuff that requires Congress to take action. And, with a Democratic Congress, that is next to impossible. But, that is also true if it were a Republican Congress. You are bringing up a hypothetical that will not happen. Sure, if we weren't in a fiat system I don't think any of this would have happened. But, once again, that is my dreamworld. But, we are in reality. Answer that question, but instead of living in a dreamworld, answer it in accordance with what is our current reality.", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "", 
        "reply": "But, you and I both know that is never going to happen. That is all dreamworld stuff that requires Congress to take action. And, with a Democratic Congress, that is next to impossible. But, that is also true if it were a Republican Congress. You are bringing up a hypothetical that will not happen. Sure, if we weren't in a fiat system I don't think any of this would have happened. But, once again, that is my dreamworld. But, we are in reality. Answer that question, but instead of living in a dreamworld, answer it in accordance with what is our current reality.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:33:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Answer that question, but instead of living in a dreamworld, answer it in accordance with what is our current reality. ok, they won't pay back the money, our currency will collapse by design, a regional or one world currency will be pushed upon us (for our own good of course), since it is also \"fiat\" it will eventually collapse. They will then offer the chip implant as the only way to feed our families. We'll work a certain amount of hours for a certain amount of grain. WooHoo!! Listen, if the gov't would have cut ALL projects except those explicitly governed by the constitution, we would have seen our taxes fall considerably, we'd of paid our individual debts, and bought neccesities as needed. American manufacturing would have flourished and jobs created. How can anyone expect this current \"solution\" as in our interest? Now we are in so much debt, our only solution is the new world order, and that is hardly a solution, it's a controlled death.", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "Answer that question, but instead of living in a dreamworld, answer it in accordance with what is our current reality.", 
        "reply": " ok, they won't pay back the money, our currency will collapse by design, a regional or one world currency will be pushed upon us (for our own good of course), since it is also \"fiat\" it will eventually collapse. They will then offer the chip implant as the only way to feed our families. We'll work a certain amount of hours for a certain amount of grain. WooHoo!! Listen, if the gov't would have cut ALL projects except those explicitly governed by the constitution, we would have seen our taxes fall considerably, we'd of paid our individual debts, and bought neccesities as needed. American manufacturing would have flourished and jobs created. How can anyone expect this current \"solution\" as in our interest? Now we are in so much debt, our only solution is the new world order, and that is hardly a solution, it's a controlled death.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 13:32:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Ok, well at least we agree on one thing. Hey, just in case you have time, this is a good read and related to one of your comments. ----http://www.mises.org/books/fortycenturies.pdf Also, they are already talking about a single entity regulatory and financial body. They had people from CFR, S&P and Demos on Newshour Tuesday. That is exactly what they are recommending. Scary thought.", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "", 
        "reply": "Ok, well at least we agree on one thing. Hey, just in case you have time, this is a good read and related to one of your comments. ----http://www.mises.org/books/fortycenturies.pdf Also, they are already talking about a single entity regulatory and financial body. They had people from CFR, S&P and Demos on Newshour Tuesday. That is exactly what they are recommending. Scary thought.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 13:44:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "This talk of a one-world currency, etc is just ignorant. First of all, all money is fiat money, except if you're going to barter. 5 goats for 10 chickens, that sort of thing. Money is just whatever value people assign to something - makes no difference if it's paper or metal. Secondly, it's a good thing we went off the gold standard, as we were running out of gold as countries were converting dollars into gold. Further, a fixed exchange rate doesn't work for long. And that is why we are on a floating exchange rate today, because it works better. That is why other countries let their currencies float as well. And why more, like China, are moving toward that. It works better for economies that way, because it doesn't work in the long run when you try to fix prices at a certain level. It is much more beneficial to have many currencies, which are floating, and benefits no one, not rich nor poor, to have a \"one world\" currency. It isn't going to happen, no one is trying to make it happen, and it's crazy and ignorant to think that's what happening.", 
        "intTime": 20090312, 
        "postID": 15, 
        "quote": "", 
        "reply": "This talk of a one-world currency, etc is just ignorant. First of all, all money is fiat money, except if you're going to barter. 5 goats for 10 chickens, that sort of thing. Money is just whatever value people assign to something - makes no difference if it's paper or metal. Secondly, it's a good thing we went off the gold standard, as we were running out of gold as countries were converting dollars into gold. Further, a fixed exchange rate doesn't work for long. And that is why we are on a floating exchange rate today, because it works better. That is why other countries let their currencies float as well. And why more, like China, are moving toward that. It works better for economies that way, because it doesn't work in the long run when you try to fix prices at a certain level. It is much more beneficial to have many currencies, which are floating, and benefits no one, not rich nor poor, to have a \"one world\" currency. It isn't going to happen, no one is trying to make it happen, and it's crazy and ignorant to think that's what happening.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 14:15:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "I am speaking of fiat in relation to representative currency. Our current fiat system is not represented by anything but debt. If everybody were to pay off all debts, there would be no money in circulation. And, I don't think anybody recommended price fixing. As a matter of fact, the research info that I posted in my last post completely blasts price fixing and shows it's downfall. \"This is the shabby secret of the welfare statists' tirades against gold. Deficit spending is simply a scheme for the confiscation of wealth. Gold stands in the way of this insidious process. It stands as a protector of property rights. If one grasps this, one has no difficulty in understanding the statists' antagonism toward the gold standard.\" Alan Greenspan Also, we were indeed running out of Gold in the 30s. But, that is not due to the system itself. It was due to the initiatives of the Roosevelt administration to get us off of the Gold Standard. That process was indeed legislated and it's process continues until Nixon put the nail in the coffin. And, the transcripts to the Newshour story: ---URL=http://www.pbs.org/newshour/bb/business/jan-june09/regulationchanges_03.html]http://www.pbs.org/newshour/bb/business/jan-june09/regulationchanges_03.html", 
        "intTime": 20090312, 
        "postID": 16, 
        "quote": "", 
        "reply": "I am speaking of fiat in relation to representative currency. Our current fiat system is not represented by anything but debt. If everybody were to pay off all debts, there would be no money in circulation. And, I don't think anybody recommended price fixing. As a matter of fact, the research info that I posted in my last post completely blasts price fixing and shows it's downfall. \"This is the shabby secret of the welfare statists' tirades against gold. Deficit spending is simply a scheme for the confiscation of wealth. Gold stands in the way of this insidious process. It stands as a protector of property rights. If one grasps this, one has no difficulty in understanding the statists' antagonism toward the gold standard.\" Alan Greenspan Also, we were indeed running out of Gold in the 30s. But, that is not due to the system itself. It was due to the initiatives of the Roosevelt administration to get us off of the Gold Standard. That process was indeed legislated and it's process continues until Nixon put the nail in the coffin. And, the transcripts to the Newshour story: ---URL=http://www.pbs.org/newshour/bb/business/jan-june09/regulationchanges_03.html]http://www.pbs.org/newshour/bb/business/jan-june09/regulationchanges_03.html", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 15:22:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "What our current fiat system is represented by is value of labor, not debt. It does not matter if it's paper or metal. I work 8 hours a day, I can be paid in X units of gold or Y units of dollars, it doesn't matter which. It is the LABOR that ANY monetary system represents, because as a society, labor is what we value. Debt is just a way in which a person says, ok my time is worth X units of dollars or Y units of gold, and I want to purchase this house(for example) and I am willing to devote 30 years of my time for this dwelling. Debt is simply a way of which a person arbitrarily and voluntarily assigns an upper limit on what he can accomplish(or conversely a lower limit for others), but it is not representative of what the currency represents. Labor is representative of that. The value of work. And since labor is representative of whatever our currency happens to be, assuming all debts were paid off, are you saying that my labor could then not buy anything? Of course it could. As for Greenspan's comment, can you elaborate a little and explain what you you interpret as him saying in that comment? How exactly does gold protect property rights? This message has been edited. Last edited by: DCookeUSA1, Thu 12 March 2009 04:08 PM", 
        "intTime": 20090312, 
        "postID": 17, 
        "quote": "", 
        "reply": "What our current fiat system is represented by is value of labor, not debt. It does not matter if it's paper or metal. I work 8 hours a day, I can be paid in X units of gold or Y units of dollars, it doesn't matter which. It is the LABOR that ANY monetary system represents, because as a society, labor is what we value. Debt is just a way in which a person says, ok my time is worth X units of dollars or Y units of gold, and I want to purchase this house(for example) and I am willing to devote 30 years of my time for this dwelling. Debt is simply a way of which a person arbitrarily and voluntarily assigns an upper limit on what he can accomplish(or conversely a lower limit for others), but it is not representative of what the currency represents. Labor is representative of that. The value of work. And since labor is representative of whatever our currency happens to be, assuming all debts were paid off, are you saying that my labor could then not buy anything? Of course it could. As for Greenspan's comment, can you elaborate a little and explain what you you interpret as him saying in that comment? How exactly does gold protect property rights? This message has been edited. Last edited by: DCookeUSA1, Thu 12 March 2009 04:08 PM", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 15:42:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "Here's another way to think about it - think of labor as representative of debt. If I owe money on a credit card, I have agreed to devote a certain amount of time and labor, whatever it may be, to repay my debt to that company. I decide for myself what the value of my labor is. Conversely, if others are in debt to me, they have agreed to a certain amount of time and labor to pay off their debt to me. In this case, I assign for others what I think the value of their labor is. But even if there WERE no debt, I could still assign a value for what I think my labor is worth, and by working, produce said value. Others could do the same. So debt is a way by which I say my labor is worth X and will CONTINUE to be worth X for a certain period in the future.", 
        "intTime": 20090312, 
        "postID": 18, 
        "quote": "", 
        "reply": "Here's another way to think about it - think of labor as representative of debt. If I owe money on a credit card, I have agreed to devote a certain amount of time and labor, whatever it may be, to repay my debt to that company. I decide for myself what the value of my labor is. Conversely, if others are in debt to me, they have agreed to a certain amount of time and labor to pay off their debt to me. In this case, I assign for others what I think the value of their labor is. But even if there WERE no debt, I could still assign a value for what I think my labor is worth, and by working, produce said value. Others could do the same. So debt is a way by which I say my labor is worth X and will CONTINUE to be worth X for a certain period in the future.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 16:19:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special! We're spreading hope.", 
        "intTime": 20090312, 
        "postID": 19, 
        "quote": "Originally posted by EspritDeCorps: Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special!", 
        "reply": " We're spreading hope.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 16:33:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: What our current fiat system is represented by is value of labor, not debt. Ok, what is the bankers labor? You know, the ones that possess 3/4 of all the worlds wealth (i.e. Rothschild). What is the bankers labor? With gold, the banker doesn't have the ability to \"produce\" 9 dollars from 1 dollar in his possession.", 
        "intTime": 20090312, 
        "postID": 20, 
        "quote": "What our current fiat system is represented by is value of labor, not debt.", 
        "reply": " Ok, what is the bankers labor? You know, the ones that possess 3/4 of all the worlds wealth (i.e. Rothschild). What is the bankers labor? With gold, the banker doesn't have the ability to \"produce\" 9 dollars from 1 dollar in his possession.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 16:56:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: If I owe money on a credit card, I have agreed to devote a certain amount of time and labor, whatever it may be, to repay my debt to that company. I decide for myself what the value of my labor is. What you are describing is a serf system - slavery.", 
        "intTime": 20090312, 
        "postID": 21, 
        "quote": "If I owe money on a credit card, I have agreed to devote a certain amount of time and labor, whatever it may be, to repay my debt to that company. I decide for myself what the value of my labor is.", 
        "reply": " What you are describing is a serf system - slavery.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:00:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "soscorpio, the banker may leverage 1 dollar to lend out 9, but the banker doesn't keep that money. It's passed on to investors. Most of it, anyway. Anyone who can afford the security can buy a mortgage backed security - here's an example right off the fannie mae website. --http://fapt.efanniemae.com/eprosupp2/RetrievePDF.jsp It probably is, in a sense, a type of serf system. But here's the difference - no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. So you can buy your financial freedom. At a million or two you can write your own ticket in life. That's what I think America is about - an environment where the individual can empower himself or herself, if the individual chooses to. Plus I think it's a mistake to try to forcefully \"empower\" anyone, it can easily lead to tyranny. The \"liberty\" part of \"life liberty and pursuit of happiness\" is still there, because you are free to empower yourself, if you choose.", 
        "intTime": 20090312, 
        "postID": 22, 
        "quote": "", 
        "reply": "soscorpio, the banker may leverage 1 dollar to lend out 9, but the banker doesn't keep that money. It's passed on to investors. Most of it, anyway. Anyone who can afford the security can buy a mortgage backed security - here's an example right off the fannie mae website. --http://fapt.efanniemae.com/eprosupp2/RetrievePDF.jsp It probably is, in a sense, a type of serf system. But here's the difference - no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. So you can buy your financial freedom. At a million or two you can write your own ticket in life. That's what I think America is about - an environment where the individual can empower himself or herself, if the individual chooses to. Plus I think it's a mistake to try to forcefully \"empower\" anyone, it can easily lead to tyranny. The \"liberty\" part of \"life liberty and pursuit of happiness\" is still there, because you are free to empower yourself, if you choose.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:25:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "How come we did'nt see this coming? It's to late to say \"I told you so\".", 
        "intTime": 20090312, 
        "postID": 23, 
        "quote": "", 
        "reply": "How come we did'nt see this coming? It's to late to say \"I told you so\".", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:32:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. A fiat currency ALWAYS devalues the fruits of labors to the point where the citizens rely on gov't for a meal. The bankers intentionally create power in which they conveniently own the men to staff the regimes. Every society has gone thru this transformation. Tyranny is the goal of fiat currency and gold is the sheild for the working joe.", 
        "intTime": 20090312, 
        "postID": 24, 
        "quote": "no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt.", 
        "reply": " A fiat currency ALWAYS devalues the fruits of labors to the point where the citizens rely on gov't for a meal. The bankers intentionally create power in which they conveniently own the men to staff the regimes. Every society has gone thru this transformation. Tyranny is the goal of fiat currency and gold is the sheild for the working joe.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:47:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. A fiat currency ALWAYS devalues the fruits of labors to the point where the citizens rely on gov't for a meal. The bankers intentionally create power in which they conveniently own the men to staff the regimes. Every society has gone thru this transformation. Tyranny is the goal of fiat currency and gold is the sheild for the working joe. Is gold going to make you any more productive of a person? Doubtful. Here's how it works: when the economy is in a recession, stock market is going down, and deflation is taking place, the value of that country's currency goes up, because there's more demand for it. When the economy is in a boom, stock market is going up, and inflation is taking place, the value of that country's currency goes down, because there's less of a demand for it.", 
        "intTime": 20090312, 
        "postID": 25, 
        "quote": "Originally posted by soscorpio: quote: no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. A fiat currency ALWAYS devalues the fruits of labors to the point where the citizens rely on gov't for a meal. The bankers intentionally create power in which they conveniently own the men to staff the regimes. Every society has gone thru this transformation. Tyranny is the goal of fiat currency and gold is the sheild for the working joe.", 
        "reply": " Is gold going to make you any more productive of a person? Doubtful. Here's how it works: when the economy is in a recession, stock market is going down, and deflation is taking place, the value of that country's currency goes up, because there's more demand for it. When the economy is in a boom, stock market is going up, and inflation is taking place, the value of that country's currency goes down, because there's less of a demand for it.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:54:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Is gold going to make you any more productive of a person? PERSONAL RESPONSIBILITY makes us more productive in a gold backed system. The invisible iron fist in a fiat system gives the illusion of productivness. Bankers prefer fiat money, in which their wealth is made by laws that favor them. They get more powerful as the wealth that is created out of thin air eventually returns to them as our power diminishes. Their is no labor in it for them, but yet they incrementally become more influential as their wealth rises on the backs of labor. It's odd you support such a system, especially considering that you are living in a moment of time when the iron fist has you pinned against a wall. If this system you admire is ideal, why isn't mankind in bliss? Where is this productive society that you say is the result of a debt based system? (Germany does it best, but when gold was money, America did it best and spread light throughout the world (which bankers despised). Your references to the virtues of this system is biased. You have gone into the lions den to find your defense. If you were a mouse (we all are) and we went to the lion and asked \"am I safe here among you?\" of course the lion's answer will be \"yes, it is!\" as the lion doesn't want to have to chase you, to consume you, he prefers for you to walk into his mouth.", 
        "intTime": 20090313, 
        "postID": 26, 
        "quote": "Is gold going to make you any more productive of a person?", 
        "reply": " PERSONAL RESPONSIBILITY makes us more productive in a gold backed system. The invisible iron fist in a fiat system gives the illusion of productivness. Bankers prefer fiat money, in which their wealth is made by laws that favor them. They get more powerful as the wealth that is created out of thin air eventually returns to them as our power diminishes. Their is no labor in it for them, but yet they incrementally become more influential as their wealth rises on the backs of labor. It's odd you support such a system, especially considering that you are living in a moment of time when the iron fist has you pinned against a wall. If this system you admire is ideal, why isn't mankind in bliss? Where is this productive society that you say is the result of a debt based system? (Germany does it best, but when gold was money, America did it best and spread light throughout the world (which bankers despised). Your references to the virtues of this system is biased. You have gone into the lions den to find your defense. If you were a mouse (we all are) and we went to the lion and asked \"am I safe here among you?\" of course the lion's answer will be \"yes, it is!\" as the lion doesn't want to have to chase you, to consume you, he prefers for you to walk into his mouth.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 06:19:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Is gold going to make you any more productive of a person? PERSONAL RESPONSIBILITY makes us more productive in a gold backed system. The invisible iron fist in a fiat system gives the illusion of productivness. Bankers prefer fiat money, in which their wealth is made by laws that favor them. They get more powerful as the wealth that is created out of thin air eventually returns to them as our power diminishes. Their is no labor in it for them, but yet they incrementally become more influential as their wealth rises on the backs of labor. It's odd you support such a system, especially considering that you are living in a moment of time when the iron fist has you pinned against a wall. If this system you admire is ideal, why isn't mankind in bliss? Where is this productive society that you say is the result of a debt based system? (Germany does it best, but when gold was money, America did it best and spread light throughout the world (which bankers despised). Your references to the virtues of this system is biased. You have gone into the lions den to find your defense. If you were a mouse (we all are) and we went to the lion and asked \"am I safe here among you?\" of course the lion's answer will be \"yes, it is!\" as the lion doesn't want to have to chase you, to consume you, he prefers for you to walk into his mouth. The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in.", 
        "intTime": 20090313, 
        "postID": 27, 
        "quote": "Originally posted by soscorpio: quote: Is gold going to make you any more productive of a person? PERSONAL RESPONSIBILITY makes us more productive in a gold backed system. The invisible iron fist in a fiat system gives the illusion of productivness. Bankers prefer fiat money, in which their wealth is made by laws that favor them. They get more powerful as the wealth that is created out of thin air eventually returns to them as our power diminishes. Their is no labor in it for them, but yet they incrementally become more influential as their wealth rises on the backs of labor. It's odd you support such a system, especially considering that you are living in a moment of time when the iron fist has you pinned against a wall. If this system you admire is ideal, why isn't mankind in bliss? Where is this productive society that you say is the result of a debt based system? (Germany does it best, but when gold was money, America did it best and spread light throughout the world (which bankers despised). Your references to the virtues of this system is biased. You have gone into the lions den to find your defense. If you were a mouse (we all are) and we went to the lion and asked \"am I safe here among you?\" of course the lion's answer will be \"yes, it is!\" as the lion doesn't want to have to chase you, to consume you, he prefers for you to walk into his mouth.", 
        "reply": " The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 08:52:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in. Then you have a wake-up call ahead. The actions of others will soon effect you and the your spawn.", 
        "intTime": 20090313, 
        "postID": 28, 
        "quote": "The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in.", 
        "reply": " Then you have a wake-up call ahead. The actions of others will soon effect you and the your spawn.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 09:01:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in. Then you have a wake-up call ahead. The actions of others will soon effect you and the your spawn. I certainly hope so. And by the way, I don't go asking anyone \"am I safe here among you?\" That doesn't concern me. Promises, assurances, threats from others are irrelevant to me. Do YOU feel like some \"invisible iron fist\" has got you \"pinned against a wall\"? Look man, if I can offer a thought - don't worry so much. Things are going to be ok.", 
        "intTime": 20090313, 
        "postID": 29, 
        "quote": "Originally posted by soscorpio: quote: The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in. Then you have a wake-up call ahead. The actions of others will soon effect you and the your spawn.", 
        "reply": " I certainly hope so. And by the way, I don't go asking anyone \"am I safe here among you?\" That doesn't concern me. Promises, assurances, threats from others are irrelevant to me. Do YOU feel like some \"invisible iron fist\" has got you \"pinned against a wall\"? Look man, if I can offer a thought - don't worry so much. Things are going to be ok.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 09:15:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: And by the way, I don't go asking anyone \"am I safe here among you?\" That doesn't concern me. Promises, assurances, threats from others are irrelevant to me. I'm sorry, I thought I was talking with an adult. Good luck son, threats are real, and its best to be prepared for them and assurances from others can be vital life-lines and I'd suggest you build as many as you can. Your reality is going to be shattered, painfully shattered.", 
        "intTime": 20090313, 
        "postID": 30, 
        "quote": "And by the way, I don't go asking anyone \"am I safe here among you?\" That doesn't concern me. Promises, assurances, threats from others are irrelevant to me.", 
        "reply": " I'm sorry, I thought I was talking with an adult. Good luck son, threats are real, and its best to be prepared for them and assurances from others can be vital life-lines and I'd suggest you build as many as you can. Your reality is going to be shattered, painfully shattered.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 11:07:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special!", 
        "intTime": 20090311, 
        "postID": 31, 
        "quote": "", 
        "reply": "Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special!", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 19:39:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor.", 
        "intTime": 20090311, 
        "postID": 32, 
        "quote": "", 
        "reply": "That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 19:51:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special! It is EXACTLY true. Congressmen grilled a CitiCorp creep today, and he admitted that 10 billion had been lent to constructions companies in China from CitiCorp while similar companies here who needed loans or mortgage help were denied the money - - That is Treasonous bullshyyt while Chinese ships are harassing our own... Some of those CitiCorp bassturds need to be shot or hanged for profiteering and treason! CitiCorp = ChiComCorp!! Wandering and Wondering", 
        "intTime": 20090311, 
        "postID": 33, 
        "quote": "Originally posted by EspritDeCorps: Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special!", 
        "reply": " It is EXACTLY true. Congressmen grilled a CitiCorp creep today, and he admitted that 10 billion had been lent to constructions companies in China from CitiCorp while similar companies here who needed loans or mortgage help were denied the money - - That is Treasonous bullshyyt while Chinese ships are harassing our own... Some of those CitiCorp bassturds need to be shot or hanged for profiteering and treason! CitiCorp = ChiComCorp!! Wandering and Wondering", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 19:55:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor. Well thanks for clearing that up....I'm more stimulated now than a teen on Viagra with a hooker! Thank God we're getting in on the \"ground floor\".... I sure would hate to see the jobless people here in the US suffer. At least everyone will have credit cards to help with the national debt.", 
        "intTime": 20090311, 
        "postID": 34, 
        "quote": "Originally posted by 10tenths: That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor.", 
        "reply": " Well thanks for clearing that up....I'm more stimulated now than a teen on Viagra with a hooker! Thank God we're getting in on the \"ground floor\".... I sure would hate to see the jobless people here in the US suffer. At least everyone will have credit cards to help with the national debt.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 19:59:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: It is EXACTLY true. Congressmen grilled a CitiCorp creep today, and he admitted that 10 billion had been lent to constructions companies in China from CitiCorp while similar companies here who needed loans or mortgage help were denied the money - - That is Treasonous bullshyyt while Chinese ships are harassing our own... Some of those CitiCorp bassturds need to be shot or hanged for profiteering and treason! CitiCorp = ChiComCorp!! Show me a link because I cannot find one. And, I haven't gotten anything from my sources on this at all. Was it on C-Span? Where are you getting this from? quote: Originally posted by EspritDeCorps: Well thanks for clearing that up....I'm more stimulated now than a teen on Viagra with a hooker! Thank God we're getting in on the \"ground floor\".... I sure would hate to see the jobless people here in the US suffer. At least everyone will have credit cards to help with the national debt. That is just how business works. If you want them to pay us back, they need to make money. The probability of them making that money here in the States is pretty low because we are overextended in our credit and have a habit of defaulting. So, I cannot fault them in that regard.", 
        "intTime": 20090311, 
        "postID": 35, 
        "quote": "Originally posted by greywolfghost: It is EXACTLY true. Congressmen grilled a CitiCorp creep today, and he admitted that 10 billion had been lent to constructions companies in China from CitiCorp while similar companies here who needed loans or mortgage help were denied the money - - That is Treasonous bullshyyt while Chinese ships are harassing our own... Some of those CitiCorp bassturds need to be shot or hanged for profiteering and treason! CitiCorp = ChiComCorp!!", 
        "reply": " Show me a link because I cannot find one. And, I haven't gotten anything from my sources on this at all. Was it on C-Span? Where are you getting this from? quote: Originally posted by EspritDeCorps: Well thanks for clearing that up....I'm more stimulated now than a teen on Viagra with a hooker! Thank God we're getting in on the \"ground floor\".... I sure would hate to see the jobless people here in the US suffer. At least everyone will have credit cards to help with the national debt. That is just how business works. If you want them to pay us back, they need to make money. The probability of them making that money here in the States is pretty low because we are overextended in our credit and have a habit of defaulting. So, I cannot fault them in that regard.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 21:49:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor. Which is a bail out??? And will create tens of thousands of AMERICAN jobs right?", 
        "intTime": 20090311, 
        "postID": 36, 
        "quote": "Originally posted by 10tenths: That isn't exactly true. What they are doing is partnering with banks over their to get into their credit card markets. The credit card markets in those countries are relatively new and primed to boom, Citi and BoA are getting in on the ground floor.", 
        "reply": " Which is a bail out??? And will create tens of thousands of AMERICAN jobs right?", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-11 23:03:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Dennis Kucinich really took the TARP fund overseer (Can't remember his name, but it starts with a K) to task over how the TARP funds have been spent. He pointedly asked if a bank which has received TARP money investing in Dubai is considered by the Treasury to be a legitimate use of that money an in the nations best interest. \"K\" hemmed and hawed but eventually came up with the explanation that Treasury has gone out of its way not to micro-manage the banks which we've leant money to and, if they invest overseas, it will make the bank more profitable and better able to pay back the \"loan\" we gave them. In other words, We The People just gave them an interest free loan to make more money and Treasury doesn't give a damn how they do it!", 
        "intTime": 20090312, 
        "postID": 37, 
        "quote": "", 
        "reply": "Dennis Kucinich really took the TARP fund overseer (Can't remember his name, but it starts with a K) to task over how the TARP funds have been spent. He pointedly asked if a bank which has received TARP money investing in Dubai is considered by the Treasury to be a legitimate use of that money an in the nations best interest. \"K\" hemmed and hawed but eventually came up with the explanation that Treasury has gone out of its way not to micro-manage the banks which we've leant money to and, if they invest overseas, it will make the bank more profitable and better able to pay back the \"loan\" we gave them. In other words, We The People just gave them an interest free loan to make more money and Treasury doesn't give a damn how they do it!", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 04:49:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "stillkit"
    }, 
    {
        "content": "I will have to ask Dennis about that next time I talk to him. Either way, if that is going to make Citi more solvent, then I do not see a problem. It would be dumb for any bank to lend to Americans right now for two reasons: Americans are completely tapped out as it is and they're defaulting on the loans they already have. The only alignments that most corporations have is to make their shareholders as much money as possible. And, that is what Citi is attempting to do. It is just that cannot be done in America right now. That is just obvious. It would be effective suicide for Citi to start lending here in the States and they know that. As for the Treasury not giving a darn how the money is spent. Well, maybe there should have been more earmarks in that bill or the bill should have been more specific. I always find it funny that most of the people who are now taking the protectionist route are the same ones who have accused me of being an isolationist. Most of you support the idea of spreading our military influence around the world, but don't do business outside of the US. Whereas I say do as much business and trade around the world as possible, but keep our military here at home. You guys really do crack me up sometimes. What's even funnier is that most of you are the same ones who wouldn't have believe a single word that Kucinich said only a few months ago. This forum is starting to wreak of hypocrisy and BS more and more everyday. Just out of curiosity, how in the hell do you expect Citi and the other banks to pay back the TARP money? Apparently the answer I am seeing is to loan money to people who can't pay back the loan and create jobs that are going to be a liability.", 
        "intTime": 20090312, 
        "postID": 38, 
        "quote": "", 
        "reply": "I will have to ask Dennis about that next time I talk to him. Either way, if that is going to make Citi more solvent, then I do not see a problem. It would be dumb for any bank to lend to Americans right now for two reasons: Americans are completely tapped out as it is and they're defaulting on the loans they already have. The only alignments that most corporations have is to make their shareholders as much money as possible. And, that is what Citi is attempting to do. It is just that cannot be done in America right now. That is just obvious. It would be effective suicide for Citi to start lending here in the States and they know that. As for the Treasury not giving a darn how the money is spent. Well, maybe there should have been more earmarks in that bill or the bill should have been more specific. I always find it funny that most of the people who are now taking the protectionist route are the same ones who have accused me of being an isolationist. Most of you support the idea of spreading our military influence around the world, but don't do business outside of the US. Whereas I say do as much business and trade around the world as possible, but keep our military here at home. You guys really do crack me up sometimes. What's even funnier is that most of you are the same ones who wouldn't have believe a single word that Kucinich said only a few months ago. This forum is starting to wreak of hypocrisy and BS more and more everyday. Just out of curiosity, how in the hell do you expect Citi and the other banks to pay back the TARP money? Apparently the answer I am seeing is to loan money to people who can't pay back the loan and create jobs that are going to be a liability.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:14:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Americans are completely tapped out as it is and they're defaulting on the loans they already have. Uh, speak for yourself.", 
        "intTime": 20090312, 
        "postID": 39, 
        "quote": "Americans are completely tapped out as it is and they're defaulting on the loans they already have.", 
        "reply": " Uh, speak for yourself.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:20:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I was speaking in General. Trust me, I am fine. My investments are up 8% since this crap started and I only pay cash. But, the banks still stand to lose a lot more money in the states as summer gets closer. The foreclosures are finally starting to settle in the West, but they are now rising in all of the States that weren't hit as hard in the first sweep. Plus, Commercial Real Estate in Detroit and here in Cleveland is about ready to crash at any moment. And, most of those that recently lost their jobs are now living on their credit cards. So, we can expect that sector to take a huge hit as summer comes.", 
        "intTime": 20090312, 
        "postID": 40, 
        "quote": "", 
        "reply": "I was speaking in General. Trust me, I am fine. My investments are up 8% since this crap started and I only pay cash. But, the banks still stand to lose a lot more money in the states as summer gets closer. The foreclosures are finally starting to settle in the West, but they are now rising in all of the States that weren't hit as hard in the first sweep. Plus, Commercial Real Estate in Detroit and here in Cleveland is about ready to crash at any moment. And, most of those that recently lost their jobs are now living on their credit cards. So, we can expect that sector to take a huge hit as summer comes.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:24:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Just out of curiosity, how in the hell do you expect Citi and the other banks to pay back the TARP money? Apparently the answer I am seeing is to loan money to people who can't pay back the loan and create jobs that are going to be a liability. 1) loan to innovative Americans 2) drop minimum wage laws, OSHA rules, and other bueracracies those nations we \"trade\" with don't pay for. 3) strictly account for all federal gov't spending 3) re-inact the 10 the amendment, allowing states to become innovative. 4) put a stop to welfare payments for those that historically consider it their entitlement. 5) use prisoners to do infrastructure work. 6) educate Americans instead of creating perpetual democrats. 7) this list could go on and on and on......", 
        "intTime": 20090312, 
        "postID": 41, 
        "quote": "Just out of curiosity, how in the hell do you expect Citi and the other banks to pay back the TARP money? Apparently the answer I am seeing is to loan money to people who can't pay back the loan and create jobs that are going to be a liability.", 
        "reply": " 1) loan to innovative Americans 2) drop minimum wage laws, OSHA rules, and other bueracracies those nations we \"trade\" with don't pay for. 3) strictly account for all federal gov't spending 3) re-inact the 10 the amendment, allowing states to become innovative. 4) put a stop to welfare payments for those that historically consider it their entitlement. 5) use prisoners to do infrastructure work. 6) educate Americans instead of creating perpetual democrats. 7) this list could go on and on and on......", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:27:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "But, you and I both know that is never going to happen. That is all dreamworld stuff that requires Congress to take action. And, with a Democratic Congress, that is next to impossible. But, that is also true if it were a Republican Congress. You are bringing up a hypothetical that will not happen. Sure, if we weren't in a fiat system I don't think any of this would have happened. But, once again, that is my dreamworld. But, we are in reality. Answer that question, but instead of living in a dreamworld, answer it in accordance with what is our current reality.", 
        "intTime": 20090312, 
        "postID": 42, 
        "quote": "", 
        "reply": "But, you and I both know that is never going to happen. That is all dreamworld stuff that requires Congress to take action. And, with a Democratic Congress, that is next to impossible. But, that is also true if it were a Republican Congress. You are bringing up a hypothetical that will not happen. Sure, if we weren't in a fiat system I don't think any of this would have happened. But, once again, that is my dreamworld. But, we are in reality. Answer that question, but instead of living in a dreamworld, answer it in accordance with what is our current reality.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 11:33:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Answer that question, but instead of living in a dreamworld, answer it in accordance with what is our current reality. ok, they won't pay back the money, our currency will collapse by design, a regional or one world currency will be pushed upon us (for our own good of course), since it is also \"fiat\" it will eventually collapse. They will then offer the chip implant as the only way to feed our families. We'll work a certain amount of hours for a certain amount of grain. WooHoo!! Listen, if the gov't would have cut ALL projects except those explicitly governed by the constitution, we would have seen our taxes fall considerably, we'd of paid our individual debts, and bought neccesities as needed. American manufacturing would have flourished and jobs created. How can anyone expect this current \"solution\" as in our interest? Now we are in so much debt, our only solution is the new world order, and that is hardly a solution, it's a controlled death.", 
        "intTime": 20090312, 
        "postID": 43, 
        "quote": "Answer that question, but instead of living in a dreamworld, answer it in accordance with what is our current reality.", 
        "reply": " ok, they won't pay back the money, our currency will collapse by design, a regional or one world currency will be pushed upon us (for our own good of course), since it is also \"fiat\" it will eventually collapse. They will then offer the chip implant as the only way to feed our families. We'll work a certain amount of hours for a certain amount of grain. WooHoo!! Listen, if the gov't would have cut ALL projects except those explicitly governed by the constitution, we would have seen our taxes fall considerably, we'd of paid our individual debts, and bought neccesities as needed. American manufacturing would have flourished and jobs created. How can anyone expect this current \"solution\" as in our interest? Now we are in so much debt, our only solution is the new world order, and that is hardly a solution, it's a controlled death.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 13:32:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Ok, well at least we agree on one thing. Hey, just in case you have time, this is a good read and related to one of your comments. ----http://www.mises.org/books/fortycenturies.pdf Also, they are already talking about a single entity regulatory and financial body. They had people from CFR, S&P and Demos on Newshour Tuesday. That is exactly what they are recommending. Scary thought.", 
        "intTime": 20090312, 
        "postID": 44, 
        "quote": "", 
        "reply": "Ok, well at least we agree on one thing. Hey, just in case you have time, this is a good read and related to one of your comments. ----http://www.mises.org/books/fortycenturies.pdf Also, they are already talking about a single entity regulatory and financial body. They had people from CFR, S&P and Demos on Newshour Tuesday. That is exactly what they are recommending. Scary thought.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 13:44:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "This talk of a one-world currency, etc is just ignorant. First of all, all money is fiat money, except if you're going to barter. 5 goats for 10 chickens, that sort of thing. Money is just whatever value people assign to something - makes no difference if it's paper or metal. Secondly, it's a good thing we went off the gold standard, as we were running out of gold as countries were converting dollars into gold. Further, a fixed exchange rate doesn't work for long. And that is why we are on a floating exchange rate today, because it works better. That is why other countries let their currencies float as well. And why more, like China, are moving toward that. It works better for economies that way, because it doesn't work in the long run when you try to fix prices at a certain level. It is much more beneficial to have many currencies, which are floating, and benefits no one, not rich nor poor, to have a \"one world\" currency. It isn't going to happen, no one is trying to make it happen, and it's crazy and ignorant to think that's what happening.", 
        "intTime": 20090312, 
        "postID": 45, 
        "quote": "", 
        "reply": "This talk of a one-world currency, etc is just ignorant. First of all, all money is fiat money, except if you're going to barter. 5 goats for 10 chickens, that sort of thing. Money is just whatever value people assign to something - makes no difference if it's paper or metal. Secondly, it's a good thing we went off the gold standard, as we were running out of gold as countries were converting dollars into gold. Further, a fixed exchange rate doesn't work for long. And that is why we are on a floating exchange rate today, because it works better. That is why other countries let their currencies float as well. And why more, like China, are moving toward that. It works better for economies that way, because it doesn't work in the long run when you try to fix prices at a certain level. It is much more beneficial to have many currencies, which are floating, and benefits no one, not rich nor poor, to have a \"one world\" currency. It isn't going to happen, no one is trying to make it happen, and it's crazy and ignorant to think that's what happening.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 14:15:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "I am speaking of fiat in relation to representative currency. Our current fiat system is not represented by anything but debt. If everybody were to pay off all debts, there would be no money in circulation. And, I don't think anybody recommended price fixing. As a matter of fact, the research info that I posted in my last post completely blasts price fixing and shows it's downfall. \"This is the shabby secret of the welfare statists' tirades against gold. Deficit spending is simply a scheme for the confiscation of wealth. Gold stands in the way of this insidious process. It stands as a protector of property rights. If one grasps this, one has no difficulty in understanding the statists' antagonism toward the gold standard.\" Alan Greenspan Also, we were indeed running out of Gold in the 30s. But, that is not due to the system itself. It was due to the initiatives of the Roosevelt administration to get us off of the Gold Standard. That process was indeed legislated and it's process continues until Nixon put the nail in the coffin. And, the transcripts to the Newshour story: ---URL=http://www.pbs.org/newshour/bb/business/jan-june09/regulationchanges_03.html]http://www.pbs.org/newshour/bb/business/jan-june09/regulationchanges_03.html", 
        "intTime": 20090312, 
        "postID": 46, 
        "quote": "", 
        "reply": "I am speaking of fiat in relation to representative currency. Our current fiat system is not represented by anything but debt. If everybody were to pay off all debts, there would be no money in circulation. And, I don't think anybody recommended price fixing. As a matter of fact, the research info that I posted in my last post completely blasts price fixing and shows it's downfall. \"This is the shabby secret of the welfare statists' tirades against gold. Deficit spending is simply a scheme for the confiscation of wealth. Gold stands in the way of this insidious process. It stands as a protector of property rights. If one grasps this, one has no difficulty in understanding the statists' antagonism toward the gold standard.\" Alan Greenspan Also, we were indeed running out of Gold in the 30s. But, that is not due to the system itself. It was due to the initiatives of the Roosevelt administration to get us off of the Gold Standard. That process was indeed legislated and it's process continues until Nixon put the nail in the coffin. And, the transcripts to the Newshour story: ---URL=http://www.pbs.org/newshour/bb/business/jan-june09/regulationchanges_03.html]http://www.pbs.org/newshour/bb/business/jan-june09/regulationchanges_03.html", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 15:22:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "What our current fiat system is represented by is value of labor, not debt. It does not matter if it's paper or metal. I work 8 hours a day, I can be paid in X units of gold or Y units of dollars, it doesn't matter which. It is the LABOR that ANY monetary system represents, because as a society, labor is what we value. Debt is just a way in which a person says, ok my time is worth X units of dollars or Y units of gold, and I want to purchase this house(for example) and I am willing to devote 30 years of my time for this dwelling. Debt is simply a way of which a person arbitrarily and voluntarily assigns an upper limit on what he can accomplish(or conversely a lower limit for others), but it is not representative of what the currency represents. Labor is representative of that. The value of work. And since labor is representative of whatever our currency happens to be, assuming all debts were paid off, are you saying that my labor could then not buy anything? Of course it could. As for Greenspan's comment, can you elaborate a little and explain what you you interpret as him saying in that comment? How exactly does gold protect property rights? This message has been edited. Last edited by: DCookeUSA1, Thu 12 March 2009 04:08 PM", 
        "intTime": 20090312, 
        "postID": 47, 
        "quote": "", 
        "reply": "What our current fiat system is represented by is value of labor, not debt. It does not matter if it's paper or metal. I work 8 hours a day, I can be paid in X units of gold or Y units of dollars, it doesn't matter which. It is the LABOR that ANY monetary system represents, because as a society, labor is what we value. Debt is just a way in which a person says, ok my time is worth X units of dollars or Y units of gold, and I want to purchase this house(for example) and I am willing to devote 30 years of my time for this dwelling. Debt is simply a way of which a person arbitrarily and voluntarily assigns an upper limit on what he can accomplish(or conversely a lower limit for others), but it is not representative of what the currency represents. Labor is representative of that. The value of work. And since labor is representative of whatever our currency happens to be, assuming all debts were paid off, are you saying that my labor could then not buy anything? Of course it could. As for Greenspan's comment, can you elaborate a little and explain what you you interpret as him saying in that comment? How exactly does gold protect property rights? This message has been edited. Last edited by: DCookeUSA1, Thu 12 March 2009 04:08 PM", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 15:42:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "Here's another way to think about it - think of labor as representative of debt. If I owe money on a credit card, I have agreed to devote a certain amount of time and labor, whatever it may be, to repay my debt to that company. I decide for myself what the value of my labor is. Conversely, if others are in debt to me, they have agreed to a certain amount of time and labor to pay off their debt to me. In this case, I assign for others what I think the value of their labor is. But even if there WERE no debt, I could still assign a value for what I think my labor is worth, and by working, produce said value. Others could do the same. So debt is a way by which I say my labor is worth X and will CONTINUE to be worth X for a certain period in the future.", 
        "intTime": 20090312, 
        "postID": 48, 
        "quote": "", 
        "reply": "Here's another way to think about it - think of labor as representative of debt. If I owe money on a credit card, I have agreed to devote a certain amount of time and labor, whatever it may be, to repay my debt to that company. I decide for myself what the value of my labor is. Conversely, if others are in debt to me, they have agreed to a certain amount of time and labor to pay off their debt to me. In this case, I assign for others what I think the value of their labor is. But even if there WERE no debt, I could still assign a value for what I think my labor is worth, and by working, produce said value. Others could do the same. So debt is a way by which I say my labor is worth X and will CONTINUE to be worth X for a certain period in the future.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 16:19:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special! We're spreading hope.", 
        "intTime": 20090312, 
        "postID": 49, 
        "quote": "Originally posted by EspritDeCorps: Just heard that Dubai, India, and China are getting our tax dollars from the TARP fund. Isn't that special!", 
        "reply": " We're spreading hope.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 16:33:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: What our current fiat system is represented by is value of labor, not debt. Ok, what is the bankers labor? You know, the ones that possess 3/4 of all the worlds wealth (i.e. Rothschild). What is the bankers labor? With gold, the banker doesn't have the ability to \"produce\" 9 dollars from 1 dollar in his possession.", 
        "intTime": 20090312, 
        "postID": 50, 
        "quote": "What our current fiat system is represented by is value of labor, not debt.", 
        "reply": " Ok, what is the bankers labor? You know, the ones that possess 3/4 of all the worlds wealth (i.e. Rothschild). What is the bankers labor? With gold, the banker doesn't have the ability to \"produce\" 9 dollars from 1 dollar in his possession.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 16:56:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: If I owe money on a credit card, I have agreed to devote a certain amount of time and labor, whatever it may be, to repay my debt to that company. I decide for myself what the value of my labor is. What you are describing is a serf system - slavery.", 
        "intTime": 20090312, 
        "postID": 51, 
        "quote": "If I owe money on a credit card, I have agreed to devote a certain amount of time and labor, whatever it may be, to repay my debt to that company. I decide for myself what the value of my labor is.", 
        "reply": " What you are describing is a serf system - slavery.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:00:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "soscorpio, the banker may leverage 1 dollar to lend out 9, but the banker doesn't keep that money. It's passed on to investors. Most of it, anyway. Anyone who can afford the security can buy a mortgage backed security - here's an example right off the fannie mae website. --http://fapt.efanniemae.com/eprosupp2/RetrievePDF.jsp It probably is, in a sense, a type of serf system. But here's the difference - no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. So you can buy your financial freedom. At a million or two you can write your own ticket in life. That's what I think America is about - an environment where the individual can empower himself or herself, if the individual chooses to. Plus I think it's a mistake to try to forcefully \"empower\" anyone, it can easily lead to tyranny. The \"liberty\" part of \"life liberty and pursuit of happiness\" is still there, because you are free to empower yourself, if you choose.", 
        "intTime": 20090312, 
        "postID": 52, 
        "quote": "", 
        "reply": "soscorpio, the banker may leverage 1 dollar to lend out 9, but the banker doesn't keep that money. It's passed on to investors. Most of it, anyway. Anyone who can afford the security can buy a mortgage backed security - here's an example right off the fannie mae website. --http://fapt.efanniemae.com/eprosupp2/RetrievePDF.jsp It probably is, in a sense, a type of serf system. But here's the difference - no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. So you can buy your financial freedom. At a million or two you can write your own ticket in life. That's what I think America is about - an environment where the individual can empower himself or herself, if the individual chooses to. Plus I think it's a mistake to try to forcefully \"empower\" anyone, it can easily lead to tyranny. The \"liberty\" part of \"life liberty and pursuit of happiness\" is still there, because you are free to empower yourself, if you choose.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:25:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "How come we did'nt see this coming? It's to late to say \"I told you so\".", 
        "intTime": 20090312, 
        "postID": 53, 
        "quote": "", 
        "reply": "How come we did'nt see this coming? It's to late to say \"I told you so\".", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:32:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. A fiat currency ALWAYS devalues the fruits of labors to the point where the citizens rely on gov't for a meal. The bankers intentionally create power in which they conveniently own the men to staff the regimes. Every society has gone thru this transformation. Tyranny is the goal of fiat currency and gold is the sheild for the working joe.", 
        "intTime": 20090312, 
        "postID": 54, 
        "quote": "no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt.", 
        "reply": " A fiat currency ALWAYS devalues the fruits of labors to the point where the citizens rely on gov't for a meal. The bankers intentionally create power in which they conveniently own the men to staff the regimes. Every society has gone thru this transformation. Tyranny is the goal of fiat currency and gold is the sheild for the working joe.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:47:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. A fiat currency ALWAYS devalues the fruits of labors to the point where the citizens rely on gov't for a meal. The bankers intentionally create power in which they conveniently own the men to staff the regimes. Every society has gone thru this transformation. Tyranny is the goal of fiat currency and gold is the sheild for the working joe. Is gold going to make you any more productive of a person? Doubtful. Here's how it works: when the economy is in a recession, stock market is going down, and deflation is taking place, the value of that country's currency goes up, because there's more demand for it. When the economy is in a boom, stock market is going up, and inflation is taking place, the value of that country's currency goes down, because there's less of a demand for it.", 
        "intTime": 20090312, 
        "postID": 55, 
        "quote": "Originally posted by soscorpio: quote: no one is in physical shackles, people can stop paying at any time, but more importantly, the environment is there where a person can most easily empower himself or herself through education and break the shackle of debt. A fiat currency ALWAYS devalues the fruits of labors to the point where the citizens rely on gov't for a meal. The bankers intentionally create power in which they conveniently own the men to staff the regimes. Every society has gone thru this transformation. Tyranny is the goal of fiat currency and gold is the sheild for the working joe.", 
        "reply": " Is gold going to make you any more productive of a person? Doubtful. Here's how it works: when the economy is in a recession, stock market is going down, and deflation is taking place, the value of that country's currency goes up, because there's more demand for it. When the economy is in a boom, stock market is going up, and inflation is taking place, the value of that country's currency goes down, because there's less of a demand for it.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-12 17:54:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Is gold going to make you any more productive of a person? PERSONAL RESPONSIBILITY makes us more productive in a gold backed system. The invisible iron fist in a fiat system gives the illusion of productivness. Bankers prefer fiat money, in which their wealth is made by laws that favor them. They get more powerful as the wealth that is created out of thin air eventually returns to them as our power diminishes. Their is no labor in it for them, but yet they incrementally become more influential as their wealth rises on the backs of labor. It's odd you support such a system, especially considering that you are living in a moment of time when the iron fist has you pinned against a wall. If this system you admire is ideal, why isn't mankind in bliss? Where is this productive society that you say is the result of a debt based system? (Germany does it best, but when gold was money, America did it best and spread light throughout the world (which bankers despised). Your references to the virtues of this system is biased. You have gone into the lions den to find your defense. If you were a mouse (we all are) and we went to the lion and asked \"am I safe here among you?\" of course the lion's answer will be \"yes, it is!\" as the lion doesn't want to have to chase you, to consume you, he prefers for you to walk into his mouth.", 
        "intTime": 20090313, 
        "postID": 56, 
        "quote": "Is gold going to make you any more productive of a person?", 
        "reply": " PERSONAL RESPONSIBILITY makes us more productive in a gold backed system. The invisible iron fist in a fiat system gives the illusion of productivness. Bankers prefer fiat money, in which their wealth is made by laws that favor them. They get more powerful as the wealth that is created out of thin air eventually returns to them as our power diminishes. Their is no labor in it for them, but yet they incrementally become more influential as their wealth rises on the backs of labor. It's odd you support such a system, especially considering that you are living in a moment of time when the iron fist has you pinned against a wall. If this system you admire is ideal, why isn't mankind in bliss? Where is this productive society that you say is the result of a debt based system? (Germany does it best, but when gold was money, America did it best and spread light throughout the world (which bankers despised). Your references to the virtues of this system is biased. You have gone into the lions den to find your defense. If you were a mouse (we all are) and we went to the lion and asked \"am I safe here among you?\" of course the lion's answer will be \"yes, it is!\" as the lion doesn't want to have to chase you, to consume you, he prefers for you to walk into his mouth.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 06:19:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Is gold going to make you any more productive of a person? PERSONAL RESPONSIBILITY makes us more productive in a gold backed system. The invisible iron fist in a fiat system gives the illusion of productivness. Bankers prefer fiat money, in which their wealth is made by laws that favor them. They get more powerful as the wealth that is created out of thin air eventually returns to them as our power diminishes. Their is no labor in it for them, but yet they incrementally become more influential as their wealth rises on the backs of labor. It's odd you support such a system, especially considering that you are living in a moment of time when the iron fist has you pinned against a wall. If this system you admire is ideal, why isn't mankind in bliss? Where is this productive society that you say is the result of a debt based system? (Germany does it best, but when gold was money, America did it best and spread light throughout the world (which bankers despised). Your references to the virtues of this system is biased. You have gone into the lions den to find your defense. If you were a mouse (we all are) and we went to the lion and asked \"am I safe here among you?\" of course the lion's answer will be \"yes, it is!\" as the lion doesn't want to have to chase you, to consume you, he prefers for you to walk into his mouth. The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in.", 
        "intTime": 20090313, 
        "postID": 57, 
        "quote": "Originally posted by soscorpio: quote: Is gold going to make you any more productive of a person? PERSONAL RESPONSIBILITY makes us more productive in a gold backed system. The invisible iron fist in a fiat system gives the illusion of productivness. Bankers prefer fiat money, in which their wealth is made by laws that favor them. They get more powerful as the wealth that is created out of thin air eventually returns to them as our power diminishes. Their is no labor in it for them, but yet they incrementally become more influential as their wealth rises on the backs of labor. It's odd you support such a system, especially considering that you are living in a moment of time when the iron fist has you pinned against a wall. If this system you admire is ideal, why isn't mankind in bliss? Where is this productive society that you say is the result of a debt based system? (Germany does it best, but when gold was money, America did it best and spread light throughout the world (which bankers despised). Your references to the virtues of this system is biased. You have gone into the lions den to find your defense. If you were a mouse (we all are) and we went to the lion and asked \"am I safe here among you?\" of course the lion's answer will be \"yes, it is!\" as the lion doesn't want to have to chase you, to consume you, he prefers for you to walk into his mouth.", 
        "reply": " The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 08:52:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in. Then you have a wake-up call ahead. The actions of others will soon effect you and the your spawn.", 
        "intTime": 20090313, 
        "postID": 58, 
        "quote": "The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in.", 
        "reply": " Then you have a wake-up call ahead. The actions of others will soon effect you and the your spawn.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 09:01:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in. Then you have a wake-up call ahead. The actions of others will soon effect you and the your spawn. I certainly hope so. And by the way, I don't go asking anyone \"am I safe here among you?\" That doesn't concern me. Promises, assurances, threats from others are irrelevant to me. Do YOU feel like some \"invisible iron fist\" has got you \"pinned against a wall\"? Look man, if I can offer a thought - don't worry so much. Things are going to be ok.", 
        "intTime": 20090313, 
        "postID": 59, 
        "quote": "Originally posted by soscorpio: quote: The only wall I'm pinned against is the one I choose to pin myself to, and that's not a practice I engage in. Then you have a wake-up call ahead. The actions of others will soon effect you and the your spawn.", 
        "reply": " I certainly hope so. And by the way, I don't go asking anyone \"am I safe here among you?\" That doesn't concern me. Promises, assurances, threats from others are irrelevant to me. Do YOU feel like some \"invisible iron fist\" has got you \"pinned against a wall\"? Look man, if I can offer a thought - don't worry so much. Things are going to be ok.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 09:15:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: And by the way, I don't go asking anyone \"am I safe here among you?\" That doesn't concern me. Promises, assurances, threats from others are irrelevant to me. I'm sorry, I thought I was talking with an adult. Good luck son, threats are real, and its best to be prepared for them and assurances from others can be vital life-lines and I'd suggest you build as many as you can. Your reality is going to be shattered, painfully shattered.", 
        "intTime": 20090313, 
        "postID": 60, 
        "quote": "And by the way, I don't go asking anyone \"am I safe here among you?\" That doesn't concern me. Promises, assurances, threats from others are irrelevant to me.", 
        "reply": " I'm sorry, I thought I was talking with an adult. Good luck son, threats are real, and its best to be prepared for them and assurances from others can be vital life-lines and I'd suggest you build as many as you can. Your reality is going to be shattered, painfully shattered.", 
        "threadID": "409192893_1370095712001", 
        "time": "2009-03-13 11:07:00", 
        "title": "TARP Funds to create jobs overseas!", 
        "userID": "soscorpio"
    }
]