[
    {
        "content": "As most of us know from our years of military service, the code of conduct stipulates that if captured, one must provide their captor with the following information: Name, rank, date of birth and serial number (SSN). I don't think I would give my captor my full social security number. Too much mischief can be done now with a SSN, and frankly, I would expect the enemy to try to use it to damage me financially while I was under their control if I didn't feed them intelligence. Is this an example, in your opinion, of a rule/norm that made sense at one time, but now should be changed to protect people from exploitation?", 
        "intTime": 20090508, 
        "postID": 1, 
        "quote": "", 
        "reply": "As most of us know from our years of military service, the code of conduct stipulates that if captured, one must provide their captor with the following information: Name, rank, date of birth and serial number (SSN). I don't think I would give my captor my full social security number. Too much mischief can be done now with a SSN, and frankly, I would expect the enemy to try to use it to damage me financially while I was under their control if I didn't feed them intelligence. Is this an example, in your opinion, of a rule/norm that made sense at one time, but now should be changed to protect people from exploitation?", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-08 05:45:00", 
        "title": "Code of Conduct debate", 
        "userID": "AKinNC"
    }, 
    {
        "content": "Believe it or not, most people's first reaction to being captured in wartime is not \"What will this do to my credit rating?\" Since your name, rank and serial number are on your ID card (required by the Geneva and Hague conventions), your uniform and your dogtags (also required by law), I don't really see how verbally giving them are in any way an additional piece of information for your captors. It might just be a means for you to avoid being shot as a spy impersonating someone else. Please tell me this line of questions is tongue-in-cheek. Sullivan013", 
        "intTime": 20090508, 
        "postID": 2, 
        "quote": "", 
        "reply": "Believe it or not, most people's first reaction to being captured in wartime is not \"What will this do to my credit rating?\" Since your name, rank and serial number are on your ID card (required by the Geneva and Hague conventions), your uniform and your dogtags (also required by law), I don't really see how verbally giving them are in any way an additional piece of information for your captors. It might just be a means for you to avoid being shot as a spy impersonating someone else. Please tell me this line of questions is tongue-in-cheek. Sullivan013", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-08 08:07:00", 
        "title": "Code of Conduct debate", 
        "userID": "sullivan013"
    }, 
    {
        "content": "I dunno... I think I'd be a little more concerned with al aAkbar and his giant knife being poised above my neck than I would be about whether he gets a big screen TV on my credit!", 
        "intTime": 20090508, 
        "postID": 3, 
        "quote": "", 
        "reply": "I dunno... I think I'd be a little more concerned with al aAkbar and his giant knife being poised above my neck than I would be about whether he gets a big screen TV on my credit!", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-08 08:14:00", 
        "title": "Code of Conduct debate", 
        "userID": "2494906"
    }, 
    {
        "content": "I agree we should be using service numbers not SSN's...it was a dumb move on the military's part to use the SSN in the first place... ID cards, if lost, have the SSN right on the front to be stolen. We need a policy change.", 
        "intTime": 20090508, 
        "postID": 4, 
        "quote": "", 
        "reply": "I agree we should be using service numbers not SSN's...it was a dumb move on the military's part to use the SSN in the first place... ID cards, if lost, have the SSN right on the front to be stolen. We need a policy change.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-08 08:22:00", 
        "title": "Code of Conduct debate", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: Believe it or not, most people's first reaction to being captured in wartime is not \"What will this do to my credit rating?\" Since your name, rank and serial number are on your ID card (required by the Geneva and Hague conventions), your uniform and your dogtags (also required by law), I don't really see how verbally giving them are in any way an additional piece of information for your captors. It might just be a means for you to avoid being shot as a spy impersonating someone else. Please tell me this line of questions is tongue-in-cheek. Sullivan013 That was part of the reason behind the velcro name tapes on the ACUs. Also, the CAC card is supposed to (in the near future) have the SSN hidden. Many patrol leaders during PCIs have their Soldiers leave their ID cards and dog tags back in the base camp. Name, rank and DOB is fine. I just think that in the current era of identity theft, maybe we should not have to give out a piece of information that could potentially cause us damage. Why would a captor need your whole SSN?", 
        "intTime": 20090508, 
        "postID": 5, 
        "quote": "Originally posted by sullivan013: Believe it or not, most people's first reaction to being captured in wartime is not \"What will this do to my credit rating?\" Since your name, rank and serial number are on your ID card (required by the Geneva and Hague conventions), your uniform and your dogtags (also required by law), I don't really see how verbally giving them are in any way an additional piece of information for your captors. It might just be a means for you to avoid being shot as a spy impersonating someone else. Please tell me this line of questions is tongue-in-cheek. Sullivan013", 
        "reply": " That was part of the reason behind the velcro name tapes on the ACUs. Also, the CAC card is supposed to (in the near future) have the SSN hidden. Many patrol leaders during PCIs have their Soldiers leave their ID cards and dog tags back in the base camp. Name, rank and DOB is fine. I just think that in the current era of identity theft, maybe we should not have to give out a piece of information that could potentially cause us damage. Why would a captor need your whole SSN?", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-08 13:42:00", 
        "title": "Code of Conduct debate", 
        "userID": "AKinNC"
    }, 
    {
        "content": "I'd like to see that policy change. You guys are out there defending our freedom and risking your lives. If only a little bit of your worry could be eliminated by a policy change, I hope it happens. Sadly, I don't see military concerns at the top of the new admin's priority list. BUT, you'll always be at the top of the supporters' list! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 6, 
        "quote": "", 
        "reply": "I'd like to see that policy change. You guys are out there defending our freedom and risking your lives. If only a little bit of your worry could be eliminated by a policy change, I hope it happens. Sadly, I don't see military concerns at the top of the new admin's priority list. BUT, you'll always be at the top of the supporters' list! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-08 19:28:00", 
        "title": "Code of Conduct debate", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "What I tried to say is, it isn't a 'policy' by the US, it is a requirement of the Geneva and Hague Conventions for all armed combatants of signatory nations. It has nothing to do with the new uniform changes or any such nonsense. The inclusion of velcro was for simple convienience to change from uniform to uniform without sewing anything. The very reason for the name tapes, dogtags, etc. is the Geneva Convention. It's not even a 'military ID'. It's a Geneva Convention ID Card. My retiree card says so, but I admit I haven't seen the latest active duty cards. Now, if you say the US should drop the use of the SSN, I would agree, but there would have to be a unique number for each member with a card nevertheless. Adding an additional unique number might just cause enough confusion to allow even MORE identity theft than there is now, but that's a chance to be taken. Sullivan013", 
        "intTime": 20090509, 
        "postID": 7, 
        "quote": "", 
        "reply": "What I tried to say is, it isn't a 'policy' by the US, it is a requirement of the Geneva and Hague Conventions for all armed combatants of signatory nations. It has nothing to do with the new uniform changes or any such nonsense. The inclusion of velcro was for simple convienience to change from uniform to uniform without sewing anything. The very reason for the name tapes, dogtags, etc. is the Geneva Convention. It's not even a 'military ID'. It's a Geneva Convention ID Card. My retiree card says so, but I admit I haven't seen the latest active duty cards. Now, if you say the US should drop the use of the SSN, I would agree, but there would have to be a unique number for each member with a card nevertheless. Adding an additional unique number might just cause enough confusion to allow even MORE identity theft than there is now, but that's a chance to be taken. Sullivan013", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-09 22:30:00", 
        "title": "Code of Conduct debate", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: I'd like to see that policy change. You guys are out there defending our freedom and risking your lives. If only a little bit of your worry could be eliminated by a policy change, I hope it happens. Sadly, I don't see military concerns at the top of the new admin's priority list. BUT, you'll always be at the top of the supporters' list! Instead of repeating someone else's talking points, you should join and experience the military first hand. We'd welcome you with open arms. Just imagine if you could actually fight for our freedom instead of bashing the men and women of the military.", 
        "intTime": 20090510, 
        "postID": 8, 
        "quote": "Originally posted by PinkBlossoms: I'd like to see that policy change. You guys are out there defending our freedom and risking your lives. If only a little bit of your worry could be eliminated by a policy change, I hope it happens. Sadly, I don't see military concerns at the top of the new admin's priority list. BUT, you'll always be at the top of the supporters' list!", 
        "reply": " Instead of repeating someone else's talking points, you should join and experience the military first hand. We'd welcome you with open arms. Just imagine if you could actually fight for our freedom instead of bashing the men and women of the military.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 09:25:00", 
        "title": "Code of Conduct debate", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Now, if you say the US should drop the use of the SSN, I would agree, but there would have to be a unique number for each member with a card nevertheless. Adding an additional unique number might just cause enough confusion to allow even MORE identity theft than there is now, but that's a chance to be taken. Sullivan013 The Coast Guard did away with using SSN#’s about 2002. We now have employee ID numbers.", 
        "intTime": 20090510, 
        "postID": 9, 
        "quote": "Now, if you say the US should drop the use of the SSN, I would agree, but there would have to be a unique number for each member with a card nevertheless. Adding an additional unique number might just cause enough confusion to allow even MORE identity theft than there is now, but that's a chance to be taken. Sullivan013", 
        "reply": " The Coast Guard did away with using SSN#’s about 2002. We now have employee ID numbers.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 09:39:00", 
        "title": "Code of Conduct debate", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Prior to using SSN's there were Service Numbers...on dog tags, ID's, etc. Then some idiot wanted to use SSN's to get a comprehensive record for everyone as a point of reference.", 
        "intTime": 20090510, 
        "postID": 10, 
        "quote": "", 
        "reply": "Prior to using SSN's there were Service Numbers...on dog tags, ID's, etc. Then some idiot wanted to use SSN's to get a comprehensive record for everyone as a point of reference.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:03:00", 
        "title": "Code of Conduct debate", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Prior to using SSN's there were Service Numbers...on dog tags, ID's, etc. Then some idiot wanted to use SSN's to get a comprehensive record for everyone as a point of reference. Identity theft probably wasn’t a big issue then either.", 
        "intTime": 20090510, 
        "postID": 11, 
        "quote": "Originally posted by dragonflyer04: Prior to using SSN's there were Service Numbers...on dog tags, ID's, etc. Then some idiot wanted to use SSN's to get a comprehensive record for everyone as a point of reference.", 
        "reply": " Identity theft probably wasn’t a big issue then either.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:05:00", 
        "title": "Code of Conduct debate", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Your right... I still remember mine", 
        "intTime": 20090510, 
        "postID": 12, 
        "quote": "", 
        "reply": "Your right... I still remember mine", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:15:00", 
        "title": "Code of Conduct debate", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by PinkBlossoms: I'd like to see that policy change. You guys are out there defending our freedom and risking your lives. If only a little bit of your worry could be eliminated by a policy change, I hope it happens. Sadly, I don't see military concerns at the top of the new admin's priority list. BUT, you'll always be at the top of the supporters' list! Instead of repeating someone else's talking points, you should join and experience the military first hand. We'd welcome you with open arms. Just imagine if you could actually fight for our freedom instead of bashing the men and women of the military. Weps, I am not sure where this came from - while I disagree with Pink on many issues I do not recall her \"bashing\" servicemen, nor am I sure what talking points you are talking about.", 
        "intTime": 20090510, 
        "postID": 13, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by PinkBlossoms: I'd like to see that policy change. You guys are out there defending our freedom and risking your lives. If only a little bit of your worry could be eliminated by a policy change, I hope it happens. Sadly, I don't see military concerns at the top of the new admin's priority list. BUT, you'll always be at the top of the supporters' list! Instead of repeating someone else's talking points, you should join and experience the military first hand. We'd welcome you with open arms. Just imagine if you could actually fight for our freedom instead of bashing the men and women of the military.", 
        "reply": " Weps, I am not sure where this came from - while I disagree with Pink on many issues I do not recall her \"bashing\" servicemen, nor am I sure what talking points you are talking about.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:19:00", 
        "title": "Code of Conduct debate", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: quote: Originally posted by PinkBlossoms: I'd like to see that policy change. You guys are out there defending our freedom and risking your lives. If only a little bit of your worry could be eliminated by a policy change, I hope it happens. Sadly, I don't see military concerns at the top of the new admin's priority list. BUT, you'll always be at the top of the supporters' list! Instead of repeating someone else's talking points, you should join and experience the military first hand. We'd welcome you with open arms. Just imagine if you could actually fight for our freedom instead of bashing the men and women of the military.", 
        "intTime": 20090510, 
        "postID": 14, 
        "quote": "quote: Originally posted by PinkBlossoms: I'd like to see that policy change. You guys are out there defending our freedom and risking your lives. If only a little bit of your worry could be eliminated by a policy change, I hope it happens. Sadly, I don't see military concerns at the top of the new admin's priority list. BUT, you'll always be at the top of the supporters' list! Instead of repeating someone else's talking points, you should join and experience the military first hand. We'd welcome you with open arms. Just imagine if you could actually fight for our freedom instead of bashing the men and women of the military.", 
        "reply": "", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:23:00", 
        "title": "Code of Conduct debate", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by AKinNC: As most of us know from our years of military service, the code of conduct stipulates that if captured, one must provide their captor with the following information: Name, rank, date of birth and serial number (SSN). I don't think I would give my captor my full social security number. Too much mischief can be done now with a SSN, and frankly, I would expect the enemy to try to use it to damage me financially while I was under their control if I didn't feed them intelligence. Is this an example, in your opinion, of a rule/norm that made sense at one time, but now should be changed to protect people from exploitation? Things must have changed. In my time all that was required was name rank and serial number period as per the Geneva conventions.", 
        "intTime": 20090510, 
        "postID": 15, 
        "quote": "Originally posted by AKinNC: As most of us know from our years of military service, the code of conduct stipulates that if captured, one must provide their captor with the following information: Name, rank, date of birth and serial number (SSN). I don't think I would give my captor my full social security number. Too much mischief can be done now with a SSN, and frankly, I would expect the enemy to try to use it to damage me financially while I was under their control if I didn't feed them intelligence. Is this an example, in your opinion, of a rule/norm that made sense at one time, but now should be changed to protect people from exploitation?", 
        "reply": " Things must have changed. In my time all that was required was name rank and serial number period as per the Geneva conventions.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:28:00", 
        "title": "Code of Conduct debate", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Prior to using SSN's there were Service Numbers...on dog tags, ID's, etc. Then some idiot wanted to use SSN's to get a comprehensive record for everyone as a point of reference. My Dad retired from the Navy 41 years ago and I still remember his service number.", 
        "intTime": 20090510, 
        "postID": 16, 
        "quote": "Originally posted by dragonflyer04: Prior to using SSN's there were Service Numbers...on dog tags, ID's, etc. Then some idiot wanted to use SSN's to get a comprehensive record for everyone as a point of reference.", 
        "reply": " My Dad retired from the Navy 41 years ago and I still remember his service number.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:29:00", 
        "title": "Code of Conduct debate", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: I agree we should be using service numbers not SSN's...it was a dumb move on the military's part to use the SSN in the first place... ID cards, if lost, have the SSN right on the front to be stolen. We need a policy change. Go back to the old way and issue Geneva Convention ID cards Thats all the information they are required to have. And the rules were right on the ID card.", 
        "intTime": 20090510, 
        "postID": 17, 
        "quote": "Originally posted by dragonflyer04: I agree we should be using service numbers not SSN's...it was a dumb move on the military's part to use the SSN in the first place... ID cards, if lost, have the SSN right on the front to be stolen. We need a policy change.", 
        "reply": " Go back to the old way and issue Geneva Convention ID cards Thats all the information they are required to have. And the rules were right on the ID card.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:32:00", 
        "title": "Code of Conduct debate", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Prior to using SSN's there were Service Numbers...on dog tags, ID's, etc. Then some idiot wanted to use SSN's to get a comprehensive record for everyone as a point of reference. Ahh now I understand couldnt figure why the serial number wasnt good enough. Some bean counter did away with the serial numbers, go figure. Peters principal is the best I can come up with.", 
        "intTime": 20090510, 
        "postID": 18, 
        "quote": "Originally posted by dragonflyer04: Prior to using SSN's there were Service Numbers...on dog tags, ID's, etc. Then some idiot wanted to use SSN's to get a comprehensive record for everyone as a point of reference.", 
        "reply": " Ahh now I understand couldnt figure why the serial number wasnt good enough. Some bean counter did away with the serial numbers, go figure. Peters principal is the best I can come up with.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 10:41:00", 
        "title": "Code of Conduct debate", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: If I am senior, I will take command. If not, I will obey the lawful orders of those appointed over me and will back them up in every way. Although they made it appear that McCain refused to leave when offered his release before others which may be true,He was following the policy of the camps senior officer and code of conduct which was first in first out. To do otherwise could have been a court martial offense had he Accepted an early release.", 
        "intTime": 20090510, 
        "postID": 19, 
        "quote": "If I am senior, I will take command. If not, I will obey the lawful orders of those appointed over me and will back them up in every way.", 
        "reply": " Although they made it appear that McCain refused to leave when offered his release before others which may be true,He was following the policy of the camps senior officer and code of conduct which was first in first out. To do otherwise could have been a court martial offense had he Accepted an early release.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 12:25:00", 
        "title": "Code of Conduct debate", 
        "userID": "john2x"
    }, 
    {
        "content": "Service number has been effectively replaced with SSN. I see no reason to give my SSN to the enemy. One of the unintended (or intended) features of the velcro nametapes on the ACU is that they can be removed prior to a mission outside the wire. We are not fighting an enemy that honors the Geneva convention, and there is no reason to give them any more information than is absolutely neccesary.", 
        "intTime": 20090510, 
        "postID": 20, 
        "quote": "", 
        "reply": "Service number has been effectively replaced with SSN. I see no reason to give my SSN to the enemy. One of the unintended (or intended) features of the velcro nametapes on the ACU is that they can be removed prior to a mission outside the wire. We are not fighting an enemy that honors the Geneva convention, and there is no reason to give them any more information than is absolutely neccesary.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 17:49:00", 
        "title": "Code of Conduct debate", 
        "userID": "AKinNC"
    }, 
    {
        "content": "If this is being done, it's a violation of the Law of Land Warfare, and therefore the UCMJ. You can't pick and choose which part of the G&H you follow based upon who the enemy is and how they act. That path leads to My Lai and Abu Gahrib. No thanks. Sullivan013", 
        "intTime": 20090510, 
        "postID": 21, 
        "quote": "", 
        "reply": "If this is being done, it's a violation of the Law of Land Warfare, and therefore the UCMJ. You can't pick and choose which part of the G&H you follow based upon who the enemy is and how they act. That path leads to My Lai and Abu Gahrib. No thanks. Sullivan013", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 20:02:00", 
        "title": "Code of Conduct debate", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: If this is being done, it's a violation of the Law of Land Warfare, and therefore the UCMJ. You can't pick and choose which part of the G&H you follow based upon who the enemy is and how they act. That path leads to My Lai and Abu Gahrib. No thanks. Sullivan013 Thats always been my contention and what I have been trying to convey. Rules are rules and should be followed as written till changed. There written simple enough to understand. The interpretation game is a lawyer word game that often frees the guilty.", 
        "intTime": 20090510, 
        "postID": 22, 
        "quote": "Originally posted by sullivan013: If this is being done, it's a violation of the Law of Land Warfare, and therefore the UCMJ. You can't pick and choose which part of the G&H you follow based upon who the enemy is and how they act. That path leads to My Lai and Abu Gahrib. No thanks. Sullivan013", 
        "reply": " Thats always been my contention and what I have been trying to convey. Rules are rules and should be followed as written till changed. There written simple enough to understand. The interpretation game is a lawyer word game that often frees the guilty.", 
        "threadID": "409192893_3690097222001", 
        "time": "2009-05-10 20:37:00", 
        "title": "Code of Conduct debate", 
        "userID": "john2x"
    }
]