[
    {
        "content": "+++http://article.nationalreview.com/print/?q=YThjODY2NmIzMDc0OTNiMGI5MmNlNGRhOTFiOWMyODQ= DOJ Nominee ‘Shocked’ by Her Own Words Surprised at her own argument, Johnsen now says she did not mean what she plainly wrote. By Andrew C. McCarthy Indiana law professor Dawn Johnsen, Pres. Barack Obama’s nominee to head the Justice Department’s all-important Office of Legal Counsel, had her Senate confirmation hearing Wednesday. During questioning by Sen. Arlen Specter, the professor professed to be “shocked” by my contention that she had once analogized pregnancy to involuntary servitude, a violation of the Thirteenth Amendment’s prohibition of slavery. I made this contention in a profile of Johnsen for the current (March 9) issue of National Review, which was posted on NRO on Monday. I think the shock is on the other foot, for two reasons. First, Johnsen did make this jaw-dropping argument to the Supreme Court. And second, in her hearing testimony, she nevertheless flatly denied making a Thirteenth Amendment argument: “This is a brief that I filed arguing that the right to privacy protects, um, the right of women and their families to make these choices and that Roe v. Wade should be upheld, which is in 1989. I made no Thirteenth Amendment argument.” Given the inevitability of the claim that I’ve taken Johnsen out of context, I am going to provide the full colloquy below, in the form of a transcript. But don’t take my word for it: The recorded hearing is available on the Senate Judiciary Committee website, here. Senator Specter’s questions on this topic begin at around 47:40 into the proceeding, which was a joint confirmation hearing for Johnsen and David Kris, the nominee to be assistant attorney general for DOJ’s National Security Division. Before getting to that, though, let’s set the stage. Here is what Johnsen argued in footnote 23 of the amicus brief she filed (as the head of the National Abortion Rights Action League) in the Supreme Court’s 1989 case Webster v. Reproductive Health Services, 492 U.S. 490 (1989) (No. 88-605): Statutes that curtail [a woman’s] abortion choice are disturbingly suggestive of involuntary servitude, prohibited by the Thirteenth Amendment, in that forced pregnancy requires a woman to provide continuous physical service to the fetus in order to further the state’s asserted interest. This line of argument was not an aberration. It is consistent with a major theme of the brief, to wit, that abortion restrictions result in “forced pregnancy” and government “conscription” of the woman’s body for its own purposes. Thus, for example, Johnsen wrote elsewhere in the brief: “[The woman] is constantly aware for nine months that her body is not wholly her own: the state has conscripted her body for its own ends.” Consequently, she concluded, abortion restrictions “reduce pregnant women to no more than fetal containers.” With that in mind, here is the exchange between Johnsen and Specter at yesterday’s hearing. Note that Senator Specter does not purport to be reading from my article. He says he is going by Johnsen’s own writings — it was Johnsen who brought up my article. Specter: [Video 47:40] The position you take on pro-choice — I’m pro-choice, and I agree with that doctrine. Some of the Supreme Court cases don’t please me, but that’s the law. When I read in your writings that abortion bans go beyond the Thirteenth Amendment, which bars slavery, and that “forced pregnancy requires a woman to provide continuous physical service to the fetus in order to further the state’s asserted interest” — it seems to me just candidly beyond the pale. To say that that’s a violation of the Thirteenth Amendment against slavery — do you stand by that statement? Johnson: [Video 48:35] Thank you, Senator, for that opportunity to clarify. I was, I have to say, shocked when I saw that National Review article that made certain claims about what I had written yesterday. I have never — Specter: You did not write that? Johnson: I did write the part that you quoted, absolutely. Um, I have never argued that there’s a Thirteenth Amendment violation um, when, um, the government restricts abortion. Uh, that — I was shocked when I saw that. It took me a while to search and find what they were referring to. They made other claims that were clearly false. Uh — Here they — I did write a brief 20 years ago. Uh — In footnote 23, I found, makes um, um, a suggestion that there may be an analogy, um, between, not what the article said, pregnancy, which I’ve been blessed with twice and have two wonderful sons, but forced childbirth. This is a brief that I filed arguing that the right to privacy protects, um, the right of women and their families to make these choices and that Roe v. Wade should be upheld, which is in 1989. I made no Thirteenth Amendment argument. I can state categorically: I do not believe the Thirteenth Amendment is relevant at all. It was a straight Fourteenth Amendment argument. Specter: Well, my question was whether you wrote that. I have listened to your answer, but I do not understand it. But I’ll take a look at footnote 23. Johnsen’s statement maintaining that she “made no Thirteenth Amendment argument,” is simply not true. No matter how you slice it, footnote 23 is a Thirteenth Amendment argument. Bear in mind, we are talking here about a brief filed in the United States Supreme Court. These are the nation’s most significant cases, and there are tight restrictions on the length of such submissions — litigants don’t raise the Thirteenth Amendment on a lark. They invoke it when they are trying to persuade the justices that the controversy at issue is so comparable to involuntary servitude that it should be treated the same way American law treats slavery: namely, that it should be barred as a violation of the Constitution. I did not pull the terms prohibited by the Thirteenth Amendment, involuntary servitude, and conscription out of thin air; they are the words Johnsen herself used to make her points. Leaving aside that she most certainly did make a legal argument explicitly based on Thirteenth Amendment, and that this argument was consonant with the rest of her brief, her hair-splitting is absurd. She is suggesting that she didn’t make an “argument” but rather posited “a suggestion that there may be an analogy.” Indeed, intent on distancing herself from her own words, she told Specter she had “found” it and seemed surprised at what it said — as if the footnote had spontaneously appeared and she was merely a bystander rather than the author. You don’t have to be a lawyer to know she is spinning you. (And you might ask yourself how the senators on the famously tolerant and fair-minded Judiciary Committee would have reacted if such parsing were done by, say, Alberto Gonzales or John Yoo.) In a legal brief, when an attorney draws the court’s attention to a suggested analogy, that is known as argument. It is advanced in order to persuade. Even Dahlia Lithwick, attempting to ride to Johnsen’s defense in Slate on Thursday, concedes — however unintentionally — that Johnsen made a legal argument based on the Thirteenth Amendment: “Some might call this radical lawyering,\" she writes, \"Others call it legal argument.” Moreover, the distinction between pregnancy and forced childbirth is unavailing. The article I wrote makes crystal clear that Johnsen’s involuntary servitude argument related to involuntary pregnancies (which she refers to as “forced childbirth” — or, sometimes, as “forced pregnanc[ies]” — if they are not terminated because of abortion restrictions). Compare this from my article: [In Webster, Johnsen] insisted that, without government-provided abortion counseling, a large number of women would be left without “proper information about contraception.” This, she claimed, would mean they “cannot be said to have a meaningful opportunity to avoid pregnancy.” The usual rejoinder to such reasoning is that nobody is forcing these women to have sex. Johnsen sees it differently, writing that these “losers in the contraceptive lottery no more ‘consent’ to pregnancy than pedestrians ‘consent’ to being struck by drunk drivers.” Johnsen might want to stay out of the analogy business, since resort to it betrays her extremism. The fact that she does not describe all pregnancies as involuntary servitude, government conscription, or the similarly bracing characterizations she used in her brief does not change the fact that she equates unplanned pregnancies with slavery. Furthermore, the happenstance that she is gratified to have twice given birth, while touching, is quite beside the point. What if a woman were not so gratified? That woman could equally well argue that the threat of imprisonment for neglecting her children is a form of “involuntary servitude” because the state is “conscripting” her to tend to the children whether she wants to or not; she is not free to choose, and in that sense her body and her life are not her own. I’d wager most people would find such a claim — analogizing “forced parenting” to a Thirteenth Amendment violation — both unpersuasive and radical. The issue Specter was probing is whether Johnsen made the similarly extreme argument that pregnancy is sometimes comparable to slavery. She clearly did, and now she says she didn’t. Johnsen was adamant, adding: “I can state categorically: I do not believe the Thirteenth Amendment is relevant at all.” That’s correct, and it’s good to hear her say it. But, if the Thirteenth Amendment is not relevant, what on earth is it doing in a legal brief filed with the Supreme Court? Again, this goes to Johnsen’s suitability for the “lawyers’ lawyer” position at OLC. She has every right to be a passionate partisan. As we see day in and day out, there are plenty of places in government for such people. President Obama himself has a history of taking extreme positions on abortion. But OLC is supposed to be the brake that stops the irrelevant, loopy arguments from getting into the briefs — the office where sober judgment reins in the passionate partisans. And when errors happen, as they inevitably do, OLC All of which begs the question: Is Dawn Johnsen stupid, a liar, or both?", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://article.nationalreview.com/print/?q=YThjODY2NmIzMDc0OTNiMGI5MmNlNGRhOTFiOWMyODQ= DOJ Nominee ‘Shocked’ by Her Own Words Surprised at her own argument, Johnsen now says she did not mean what she plainly wrote. By Andrew C. McCarthy Indiana law professor Dawn Johnsen, Pres. Barack Obama’s nominee to head the Justice Department’s all-important Office of Legal Counsel, had her Senate confirmation hearing Wednesday. During questioning by Sen. Arlen Specter, the professor professed to be “shocked” by my contention that she had once analogized pregnancy to involuntary servitude, a violation of the Thirteenth Amendment’s prohibition of slavery. I made this contention in a profile of Johnsen for the current (March 9) issue of National Review, which was posted on NRO on Monday. I think the shock is on the other foot, for two reasons. First, Johnsen did make this jaw-dropping argument to the Supreme Court. And second, in her hearing testimony, she nevertheless flatly denied making a Thirteenth Amendment argument: “This is a brief that I filed arguing that the right to privacy protects, um, the right of women and their families to make these choices and that Roe v. Wade should be upheld, which is in 1989. I made no Thirteenth Amendment argument.” Given the inevitability of the claim that I’ve taken Johnsen out of context, I am going to provide the full colloquy below, in the form of a transcript. But don’t take my word for it: The recorded hearing is available on the Senate Judiciary Committee website, here. Senator Specter’s questions on this topic begin at around 47:40 into the proceeding, which was a joint confirmation hearing for Johnsen and David Kris, the nominee to be assistant attorney general for DOJ’s National Security Division. Before getting to that, though, let’s set the stage. Here is what Johnsen argued in footnote 23 of the amicus brief she filed (as the head of the National Abortion Rights Action League) in the Supreme Court’s 1989 case Webster v. Reproductive Health Services, 492 U.S. 490 (1989) (No. 88-605): Statutes that curtail [a woman’s] abortion choice are disturbingly suggestive of involuntary servitude, prohibited by the Thirteenth Amendment, in that forced pregnancy requires a woman to provide continuous physical service to the fetus in order to further the state’s asserted interest. This line of argument was not an aberration. It is consistent with a major theme of the brief, to wit, that abortion restrictions result in “forced pregnancy” and government “conscription” of the woman’s body for its own purposes. Thus, for example, Johnsen wrote elsewhere in the brief: “[The woman] is constantly aware for nine months that her body is not wholly her own: the state has conscripted her body for its own ends.” Consequently, she concluded, abortion restrictions “reduce pregnant women to no more than fetal containers.” With that in mind, here is the exchange between Johnsen and Specter at yesterday’s hearing. Note that Senator Specter does not purport to be reading from my article. He says he is going by Johnsen’s own writings — it was Johnsen who brought up my article. Specter: [Video 47:40] The position you take on pro-choice — I’m pro-choice, and I agree with that doctrine. Some of the Supreme Court cases don’t please me, but that’s the law. When I read in your writings that abortion bans go beyond the Thirteenth Amendment, which bars slavery, and that “forced pregnancy requires a woman to provide continuous physical service to the fetus in order to further the state’s asserted interest” — it seems to me just candidly beyond the pale. To say that that’s a violation of the Thirteenth Amendment against slavery — do you stand by that statement? Johnson: [Video 48:35] Thank you, Senator, for that opportunity to clarify. I was, I have to say, shocked when I saw that National Review article that made certain claims about what I had written yesterday. I have never — Specter: You did not write that? Johnson: I did write the part that you quoted, absolutely. Um, I have never argued that there’s a Thirteenth Amendment violation um, when, um, the government restricts abortion. Uh, that — I was shocked when I saw that. It took me a while to search and find what they were referring to. They made other claims that were clearly false. Uh — Here they — I did write a brief 20 years ago. Uh — In footnote 23, I found, makes um, um, a suggestion that there may be an analogy, um, between, not what the article said, pregnancy, which I’ve been blessed with twice and have two wonderful sons, but forced childbirth. This is a brief that I filed arguing that the right to privacy protects, um, the right of women and their families to make these choices and that Roe v. Wade should be upheld, which is in 1989. I made no Thirteenth Amendment argument. I can state categorically: I do not believe the Thirteenth Amendment is relevant at all. It was a straight Fourteenth Amendment argument. Specter: Well, my question was whether you wrote that. I have listened to your answer, but I do not understand it. But I’ll take a look at footnote 23. Johnsen’s statement maintaining that she “made no Thirteenth Amendment argument,” is simply not true. No matter how you slice it, footnote 23 is a Thirteenth Amendment argument. Bear in mind, we are talking here about a brief filed in the United States Supreme Court. These are the nation’s most significant cases, and there are tight restrictions on the length of such submissions — litigants don’t raise the Thirteenth Amendment on a lark. They invoke it when they are trying to persuade the justices that the controversy at issue is so comparable to involuntary servitude that it should be treated the same way American law treats slavery: namely, that it should be barred as a violation of the Constitution. I did not pull the terms prohibited by the Thirteenth Amendment, involuntary servitude, and conscription out of thin air; they are the words Johnsen herself used to make her points. Leaving aside that she most certainly did make a legal argument explicitly based on Thirteenth Amendment, and that this argument was consonant with the rest of her brief, her hair-splitting is absurd. She is suggesting that she didn’t make an “argument” but rather posited “a suggestion that there may be an analogy.” Indeed, intent on distancing herself from her own words, she told Specter she had “found” it and seemed surprised at what it said — as if the footnote had spontaneously appeared and she was merely a bystander rather than the author. You don’t have to be a lawyer to know she is spinning you. (And you might ask yourself how the senators on the famously tolerant and fair-minded Judiciary Committee would have reacted if such parsing were done by, say, Alberto Gonzales or John Yoo.) In a legal brief, when an attorney draws the court’s attention to a suggested analogy, that is known as argument. It is advanced in order to persuade. Even Dahlia Lithwick, attempting to ride to Johnsen’s defense in Slate on Thursday, concedes — however unintentionally — that Johnsen made a legal argument based on the Thirteenth Amendment: “Some might call this radical lawyering,\" she writes, \"Others call it legal argument.” Moreover, the distinction between pregnancy and forced childbirth is unavailing. The article I wrote makes crystal clear that Johnsen’s involuntary servitude argument related to involuntary pregnancies (which she refers to as “forced childbirth” — or, sometimes, as “forced pregnanc[ies]” — if they are not terminated because of abortion restrictions). Compare this from my article: [In Webster, Johnsen] insisted that, without government-provided abortion counseling, a large number of women would be left without “proper information about contraception.” This, she claimed, would mean they “cannot be said to have a meaningful opportunity to avoid pregnancy.” The usual rejoinder to such reasoning is that nobody is forcing these women to have sex. Johnsen sees it differently, writing that these “losers in the contraceptive lottery no more ‘consent’ to pregnancy than pedestrians ‘consent’ to being struck by drunk drivers.” Johnsen might want to stay out of the analogy business, since resort to it betrays her extremism. The fact that she does not describe all pregnancies as involuntary servitude, government conscription, or the similarly bracing characterizations she used in her brief does not change the fact that she equates unplanned pregnancies with slavery. Furthermore, the happenstance that she is gratified to have twice given birth, while touching, is quite beside the point. What if a woman were not so gratified? That woman could equally well argue that the threat of imprisonment for neglecting her children is a form of “involuntary servitude” because the state is “conscripting” her to tend to the children whether she wants to or not; she is not free to choose, and in that sense her body and her life are not her own. I’d wager most people would find such a claim — analogizing “forced parenting” to a Thirteenth Amendment violation — both unpersuasive and radical. The issue Specter was probing is whether Johnsen made the similarly extreme argument that pregnancy is sometimes comparable to slavery. She clearly did, and now she says she didn’t. Johnsen was adamant, adding: “I can state categorically: I do not believe the Thirteenth Amendment is relevant at all.” That’s correct, and it’s good to hear her say it. But, if the Thirteenth Amendment is not relevant, what on earth is it doing in a legal brief filed with the Supreme Court? Again, this goes to Johnsen’s suitability for the “lawyers’ lawyer” position at OLC. She has every right to be a passionate partisan. As we see day in and day out, there are plenty of places in government for such people. President Obama himself has a history of taking extreme positions on abortion. But OLC is supposed to be the brake that stops the irrelevant, loopy arguments from getting into the briefs — the office where sober judgment reins in the passionate partisans. And when errors happen, as they inevitably do, OLC All of which begs the question: Is Dawn Johnsen stupid, a liar, or both?", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 14:51:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "threerings"
    }, 
    {
        "content": "\"I um, uh what I meant, umm um, was , uh, well, umm uh\" Barry sure can pick 'em, can't he ?", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"I um, uh what I meant, umm um, was , uh, well, umm uh\" Barry sure can pick 'em, can't he ?", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 15:00:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "MaddogK"
    }, 
    {
        "content": "Sounds like folk are trying to reduce a nuanced legal argument to a slogan, which is never a good idea, and shows the ignorance of the one attempting to \"slogan-ize\" the world rather than of the one who made the original statement.", 
        "intTime": 20090304, 
        "postID": 3, 
        "quote": "", 
        "reply": "Sounds like folk are trying to reduce a nuanced legal argument to a slogan, which is never a good idea, and shows the ignorance of the one attempting to \"slogan-ize\" the world rather than of the one who made the original statement.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 17:03:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "sweetsuds"
    }, 
    {
        "content": "quote: Originally posted by sweetsuds: Sounds like folk are trying to reduce a nuanced legal argument to a slogan, which is never a good idea, and shows the ignorance of the one attempting to \"slogan-ize\" the world rather than of the one who made the original statement. Ya... \"the state has conscripted her body for its own ends\" nuance that...", 
        "intTime": 20090304, 
        "postID": 4, 
        "quote": "Originally posted by sweetsuds: Sounds like folk are trying to reduce a nuanced legal argument to a slogan, which is never a good idea, and shows the ignorance of the one attempting to \"slogan-ize\" the world rather than of the one who made the original statement.", 
        "reply": " Ya... \"the state has conscripted her body for its own ends\" nuance that...", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 17:11:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by sweetsuds: Sounds like folk are trying to reduce a nuanced legal argument to a slogan, which is never a good idea, and shows the ignorance of the one attempting to \"slogan-ize\" the world rather than of the one who made the original statement. Ya... \"the state has conscripted her body for its own ends\" nuance that... It doesn't need to be nuanced, it speaks for itself. Of course the woman should either stand by her words of simply say that her position has changed in the last 20 years. But no, she is a slimy politician who is trying to please both sides of the abortion issue.", 
        "intTime": 20090304, 
        "postID": 5, 
        "quote": "Originally posted by threerings: quote: Originally posted by sweetsuds: Sounds like folk are trying to reduce a nuanced legal argument to a slogan, which is never a good idea, and shows the ignorance of the one attempting to \"slogan-ize\" the world rather than of the one who made the original statement. Ya... \"the state has conscripted her body for its own ends\" nuance that...", 
        "reply": " It doesn't need to be nuanced, it speaks for itself. Of course the woman should either stand by her words of simply say that her position has changed in the last 20 years. But no, she is a slimy politician who is trying to please both sides of the abortion issue.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 20:31:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "thorin001"
    }, 
    {
        "content": "Nuanced. That would be the new euphemism for stuttering and non-sensical. Often employed in denial of fact. These people dance around you with words that make you feel good, BS words, just count how many times they use \"comprehensive\". And you buy it hook line and sinker. She related pregnancy to slavery. I wonder when they'll try to pass a constitutional amendment barring involuntary migraines so every woman can \"feel\" as if she's in complete control of her body.", 
        "intTime": 20090304, 
        "postID": 6, 
        "quote": "", 
        "reply": "Nuanced. That would be the new euphemism for stuttering and non-sensical. Often employed in denial of fact. These people dance around you with words that make you feel good, BS words, just count how many times they use \"comprehensive\". And you buy it hook line and sinker. She related pregnancy to slavery. I wonder when they'll try to pass a constitutional amendment barring involuntary migraines so every woman can \"feel\" as if she's in complete control of her body.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 21:20:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with.", 
        "intTime": 20090304, 
        "postID": 7, 
        "quote": "", 
        "reply": "Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 21:43:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "reducetension"
    }, 
    {
        "content": "Has anyone even read the brief being so condemned? I haven't been able to find it just yet, but until I can at least read the full text of something as complex as a legal document, I'm not going to make assumptions or judgments about its contents. That said, her response in the hearing was just weaseling. It's one thing to make a strong statement that could be taken out of context, it's another thing to not stand by it or state that she's had a change of heart.", 
        "intTime": 20090304, 
        "postID": 8, 
        "quote": "", 
        "reply": "Has anyone even read the brief being so condemned? I haven't been able to find it just yet, but until I can at least read the full text of something as complex as a legal document, I'm not going to make assumptions or judgments about its contents. That said, her response in the hearing was just weaseling. It's one thing to make a strong statement that could be taken out of context, it's another thing to not stand by it or state that she's had a change of heart.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 21:44:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "sweetsuds"
    }, 
    {
        "content": "The notion that it's about controlling ones own body is what I find galling. \"I want control of my body at \"this\" point in time because I could not/would not control my body at \"that\" point in time.\" Whatever.", 
        "intTime": 20090304, 
        "postID": 9, 
        "quote": "", 
        "reply": "The notion that it's about controlling ones own body is what I find galling. \"I want control of my body at \"this\" point in time because I could not/would not control my body at \"that\" point in time.\" Whatever.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-04 23:58:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "Most folk want to be able to make decisions regarding their own bodies all the time- which is why consent is generally required for someone else to do something to your body. If they do not obtain your consent, in most cases, it's a crime.", 
        "intTime": 20090305, 
        "postID": 10, 
        "quote": "", 
        "reply": "Most folk want to be able to make decisions regarding their own bodies all the time- which is why consent is generally required for someone else to do something to your body. If they do not obtain your consent, in most cases, it's a crime.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 00:20:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "sweetsuds"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: The notion that it's about controlling ones own body is what I find galling. \"I want control of my body at \"this\" point in time because I could not/would not control my body at \"that\" point in time.\" Whatever. So, you are advocating someone else control it? As sweetsuds says, that would be a crime. Who gets to control your body?", 
        "intTime": 20090305, 
        "postID": 11, 
        "quote": "Originally posted by M1Lase_n_Blaze: The notion that it's about controlling ones own body is what I find galling. \"I want control of my body at \"this\" point in time because I could not/would not control my body at \"that\" point in time.\" Whatever.", 
        "reply": " So, you are advocating someone else control it? As sweetsuds says, that would be a crime. Who gets to control your body?", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 01:01:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with. Ah, the old oppressive patriarchy whine once again rears its foolish head. Of greater importance, it is generally a poor idea to base an argument on the emotions of maladjusted individuals.", 
        "intTime": 20090305, 
        "postID": 12, 
        "quote": "Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with.", 
        "reply": " Ah, the old oppressive patriarchy whine once again rears its foolish head. Of greater importance, it is generally a poor idea to base an argument on the emotions of maladjusted individuals.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 02:40:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with. No man can impose anything on a woman, that the woman does not allow. This is not 1700. If a person, man or woman, is so weak as to allow anything of this sort then its there problem.", 
        "intTime": 20090305, 
        "postID": 13, 
        "quote": "Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with.", 
        "reply": " No man can impose anything on a woman, that the woman does not allow. This is not 1700. If a person, man or woman, is so weak as to allow anything of this sort then its there problem.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 04:34:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "threerings"
    }, 
    {
        "content": "Crime statistics would argue otherwise- or are you saying that anyone who's robbed/raped/murdered allowed it to happen?", 
        "intTime": 20090305, 
        "postID": 14, 
        "quote": "", 
        "reply": "Crime statistics would argue otherwise- or are you saying that anyone who's robbed/raped/murdered allowed it to happen?", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 08:31:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "sweetsuds"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with. Ah, the old oppressive patriarchy whine once again rears its foolish head. Of greater importance, it is generally a poor idea to base an argument on the emotions of maladjusted individuals. Well then, why should I take your counsel? I suppose 13 years with Army Family Advocacy dealing with maladjusted individuals by the hundreds each year is just a 'whine'? Family abuse is up even more now (I retired from that circus in 2005.) I've seen your attitude in any number of 'maladjusted males' in uniform... and in the RCF (military prison) as well. Humans can draw from their psyche that which justifies their dysfunction.. and denial is a big one, minimizing is the next and then out right projection by blaming and accusing others. You fit the profile.", 
        "intTime": 20090305, 
        "postID": 15, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with. Ah, the old oppressive patriarchy whine once again rears its foolish head. Of greater importance, it is generally a poor idea to base an argument on the emotions of maladjusted individuals.", 
        "reply": " Well then, why should I take your counsel? I suppose 13 years with Army Family Advocacy dealing with maladjusted individuals by the hundreds each year is just a 'whine'? Family abuse is up even more now (I retired from that circus in 2005.) I've seen your attitude in any number of 'maladjusted males' in uniform... and in the RCF (military prison) as well. Humans can draw from their psyche that which justifies their dysfunction.. and denial is a big one, minimizing is the next and then out right projection by blaming and accusing others. You fit the profile.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 11:44:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with. No man can impose anything on a woman, that the woman does not allow. This is not 1700. If a person, man or woman, is so weak as to allow anything of this sort then its there problem. See my previous post.", 
        "intTime": 20090305, 
        "postID": 16, 
        "quote": "Originally posted by threerings: quote: Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with. No man can impose anything on a woman, that the woman does not allow. This is not 1700. If a person, man or woman, is so weak as to allow anything of this sort then its there problem.", 
        "reply": " See my previous post.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 11:45:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with. Ah, the old oppressive patriarchy whine once again rears its foolish head. Of greater importance, it is generally a poor idea to base an argument on the emotions of maladjusted individuals. Well then, why should I take your counsel? I suppose 13 years with Army Family Advocacy dealing with maladjusted individuals by the hundreds each year is just a 'whine'? Family abuse is up even more now (I retired from that circus in 2005.) I've seen your attitude in any number of 'maladjusted males' in uniform... and in the RCF (military prison) as well. Humans can draw from their psyche that which justifies their dysfunction.. and denial is a big one, minimizing is the next and then out right projection by blaming and accusing others. You fit the profile. Sadly, a run of the mill psychorant as it merely contains the usual psychobabble used by the DSM crowd to deflect attention from their own inadequacies.", 
        "intTime": 20090305, 
        "postID": 17, 
        "quote": "Originally posted by reducetension: quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Unfortunatley, I have have met women in my mental health and family profession who do feel that way about having children.... or the 'bare foot & pregnant' mentality some men might impose on women. You can't say it doesn't happen when there are women who express it that way from experience. Some women (and fathers) don't want to have more and more.... they begin to feel like slaves. (btw way, the concept of family in the ancient times meant 'household slave'.) So whatever Johnson was thinking, it happens to be something, unfortunately, some women would agree with. Ah, the old oppressive patriarchy whine once again rears its foolish head. Of greater importance, it is generally a poor idea to base an argument on the emotions of maladjusted individuals. Well then, why should I take your counsel? I suppose 13 years with Army Family Advocacy dealing with maladjusted individuals by the hundreds each year is just a 'whine'? Family abuse is up even more now (I retired from that circus in 2005.) I've seen your attitude in any number of 'maladjusted males' in uniform... and in the RCF (military prison) as well. Humans can draw from their psyche that which justifies their dysfunction.. and denial is a big one, minimizing is the next and then out right projection by blaming and accusing others. You fit the profile.", 
        "reply": " Sadly, a run of the mill psychorant as it merely contains the usual psychobabble used by the DSM crowd to deflect attention from their own inadequacies.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 12:23:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by M1Lase_n_Blaze: The notion that it's about controlling ones own body is what I find galling. \"I want control of my body at \"this\" point in time because I could not/would not control my body at \"that\" point in time.\" Whatever. So, you are advocating someone else control it? As sweetsuds says, that would be a crime. Who gets to control your body? You do, right up until the point where you do something that causes the inevitable result of nature taking charge. Get a tattoo? Live with the ink. Eat too much? Live with the fact you're going to gain weight. Use botox? Live with a stiff face. CHOOSE to mate before preparing the \"nest\"? Prepare to scramble and \"settle\". Oh I know I'll be \"pashawed\" over that but any crap shooter will tell you \"You can easily decide whether or not to throw the dice, but you can't decide after the fact that the consequences just aren't for you.\" Choose to join the Army? Accept that you might die. It's that frikkin' easy. Choose to have sex, take drugs or drink alchohol and you relinquish control of your body to chemistry and natural biology.", 
        "intTime": 20090305, 
        "postID": 18, 
        "quote": "Originally posted by reducetension: quote: Originally posted by M1Lase_n_Blaze: The notion that it's about controlling ones own body is what I find galling. \"I want control of my body at \"this\" point in time because I could not/would not control my body at \"that\" point in time.\" Whatever. So, you are advocating someone else control it? As sweetsuds says, that would be a crime. Who gets to control your body?", 
        "reply": " You do, right up until the point where you do something that causes the inevitable result of nature taking charge. Get a tattoo? Live with the ink. Eat too much? Live with the fact you're going to gain weight. Use botox? Live with a stiff face. CHOOSE to mate before preparing the \"nest\"? Prepare to scramble and \"settle\". Oh I know I'll be \"pashawed\" over that but any crap shooter will tell you \"You can easily decide whether or not to throw the dice, but you can't decide after the fact that the consequences just aren't for you.\" Choose to join the Army? Accept that you might die. It's that frikkin' easy. Choose to have sex, take drugs or drink alchohol and you relinquish control of your body to chemistry and natural biology.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 12:48:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "I'll just add my 2 cents worth: This attack on Dawn Johnsen is just as rediculus as the lib/socialist attack on Rush. Don't let it distract you from the porkubus spending bill just proposed by the lib/socialist congress.", 
        "intTime": 20090305, 
        "postID": 19, 
        "quote": "", 
        "reply": "I'll just add my 2 cents worth: This attack on Dawn Johnsen is just as rediculus as the lib/socialist attack on Rush. Don't let it distract you from the porkubus spending bill just proposed by the lib/socialist congress.", 
        "threadID": "409192893_7620029612001", 
        "time": "2009-03-05 12:53:00", 
        "title": "Another Winning Obama pick: pregnancy = involuntary servitude", 
        "userID": "bill_kananen"
    }
]