[
    {
        "content": "I am surprised at the discussions on this board. When President Bush was President there were moderators everywhere looking for even the remote chance someone may be \"disrespectful\" to POTUS. Now that President Obama is in office it seems that there is a wild free for all in terms of questioning him, calling him names, questioning his citizenship etc. etc. Has something changed? Are we now allowed to do this? I had friends \"kicked off\" this board for questioning Bush's authority or decisions. Certainly what I am reading here would have caused the writers to be banned for life if they had said this stuff about President Bush. Seems like things have changed a bit.", 
        "intTime": 20090301, 
        "postID": 1, 
        "quote": "", 
        "reply": "I am surprised at the discussions on this board. When President Bush was President there were moderators everywhere looking for even the remote chance someone may be \"disrespectful\" to POTUS. Now that President Obama is in office it seems that there is a wild free for all in terms of questioning him, calling him names, questioning his citizenship etc. etc. Has something changed? Are we now allowed to do this? I had friends \"kicked off\" this board for questioning Bush's authority or decisions. Certainly what I am reading here would have caused the writers to be banned for life if they had said this stuff about President Bush. Seems like things have changed a bit.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:05:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "Yes it has changed. Now, do not call out the Moderators here or you will not be here long. Mainedawg Moderator", 
        "intTime": 20090301, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yes it has changed. Now, do not call out the Moderators here or you will not be here long. Mainedawg Moderator", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:09:00", 
        "title": "Discussion about President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "Why did it change?", 
        "intTime": 20090301, 
        "postID": 3, 
        "quote": "", 
        "reply": "Why did it change?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:19:00", 
        "title": "Discussion about President Obama", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Did it change officially? I am just trying to figure it out. If so, why did it change?", 
        "intTime": 20090301, 
        "postID": 4, 
        "quote": "", 
        "reply": "Did it change officially? I am just trying to figure it out. If so, why did it change?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:27:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. For those of you that are new to here or have been gone for some time, now would be a good time to reread the TOS and the stickies at the top of the boards so all stays out of trouble. Mainedawg Moderator", 
        "intTime": 20090301, 
        "postID": 5, 
        "quote": "", 
        "reply": "Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. For those of you that are new to here or have been gone for some time, now would be a good time to reread the TOS and the stickies at the top of the boards so all stays out of trouble. Mainedawg Moderator", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:30:00", 
        "title": "Discussion about President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. Ok, thanks.. I appreciate the update. I tried to find the new rules and except for OPSEC did not see any. So, there are no more rules around discussion of the politics of POTUS and no more risk about being banned or cited for \"disrespect to POTUS\"?", 
        "intTime": 20090301, 
        "postID": 6, 
        "quote": "Originally posted by mainedawg: Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on.", 
        "reply": " Ok, thanks.. I appreciate the update. I tried to find the new rules and except for OPSEC did not see any. So, there are no more rules around discussion of the politics of POTUS and no more risk about being banned or cited for \"disrespect to POTUS\"?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:33:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "I don't know what to say to you. Just be nice and we will all have fun. Mainedawg Moderator", 
        "intTime": 20090301, 
        "postID": 7, 
        "quote": "", 
        "reply": "I don't know what to say to you. Just be nice and we will all have fun. Mainedawg Moderator", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:35:00", 
        "title": "Discussion about President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Why did it change? quote: Originally posted by mainedawg: (edited for brevity) This is a for profit site. Not just a board for us to post on. Now if the old \"No CinC-bashing\" rule was enforced equally for President Obama the same way it was for Bush, there would likely be a considerable drop in posters here, and hence revenue to the site. That's the reason, and sadly there isn't much the Mods seem to be able to do about it. The official line from the top was something like this - The \"no-CinC bashing\" rule was not part of the TOS, and couldn't be enforced, hence was done away with. Granted, it would have been easy enough to codify it into the TOS had it truly been viewed as important. Don't like it? Write to Monster. Maybe if enough folks do it, it will change.", 
        "intTime": 20090301, 
        "postID": 8, 
        "quote": "Originally posted by mcgreer: Why did it change?", 
        "reply": " quote: Originally posted by mainedawg: (edited for brevity) This is a for profit site. Not just a board for us to post on. Now if the old \"No CinC-bashing\" rule was enforced equally for President Obama the same way it was for Bush, there would likely be a considerable drop in posters here, and hence revenue to the site. That's the reason, and sadly there isn't much the Mods seem to be able to do about it. The official line from the top was something like this - The \"no-CinC bashing\" rule was not part of the TOS, and couldn't be enforced, hence was done away with. Granted, it would have been easy enough to codify it into the TOS had it truly been viewed as important. Don't like it? Write to Monster. Maybe if enough folks do it, it will change.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:35:00", 
        "title": "Discussion about President Obama", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I will leave this thread open a short time longer and then it's gone. I can see where it will get out of hand easy.", 
        "intTime": 20090301, 
        "postID": 9, 
        "quote": "", 
        "reply": "I will leave this thread open a short time longer and then it's gone. I can see where it will get out of hand easy.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:38:00", 
        "title": "Discussion about President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "I'd also be willing to bet a cold six pack of beer that none of the Mods, past or present, are thrilled with the change themselves - but when given orders from above, there isn't much you can do but follow them or get your butt in a sling.", 
        "intTime": 20090301, 
        "postID": 10, 
        "quote": "", 
        "reply": "I'd also be willing to bet a cold six pack of beer that none of the Mods, past or present, are thrilled with the change themselves - but when given orders from above, there isn't much you can do but follow them or get your butt in a sling.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:48:00", 
        "title": "Discussion about President Obama", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I will leave this thread open a short time longer and then it's gone. I can see where it will get out of hand easy. Well, I am glad that the policy has changed and thank you for clarifying. I find it funny that it changed just at the time President Obama became the CINC but that is OK, at least the group is finally supporting free speech which is what I always thought the military was doing anyway. Great. Thanks for agreeing with me. It took better part of a year to get this policy, and I am sure it was changed for all the wrong reasons (like the group loves to bash the new CINC) but, alas, you are with the right side of freedom now. Thanks", 
        "intTime": 20090301, 
        "postID": 11, 
        "quote": "Originally posted by mainedawg: I will leave this thread open a short time longer and then it's gone. I can see where it will get out of hand easy.", 
        "reply": " Well, I am glad that the policy has changed and thank you for clarifying. I find it funny that it changed just at the time President Obama became the CINC but that is OK, at least the group is finally supporting free speech which is what I always thought the military was doing anyway. Great. Thanks for agreeing with me. It took better part of a year to get this policy, and I am sure it was changed for all the wrong reasons (like the group loves to bash the new CINC) but, alas, you are with the right side of freedom now. Thanks", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:48:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings...", 
        "intTime": 20090301, 
        "postID": 12, 
        "quote": "", 
        "reply": "To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:49:00", 
        "title": "Discussion about President Obama", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Don't like it? Write to Monster. Maybe if enough folks do it, it will change. Good suggestion, PD. Have my letter all ready to send and will decide whether or not to mail it in November 2012! As to POTUS 44, I respectfully hope he is successful in many of his endeavors ... and just as respectfully hope he fails in others. {Just trying to lighten things up a bit here. )", 
        "intTime": 20090301, 
        "postID": 13, 
        "quote": "Don't like it? Write to Monster. Maybe if enough folks do it, it will change.", 
        "reply": " Good suggestion, PD. Have my letter all ready to send and will decide whether or not to mail it in November 2012! As to POTUS 44, I respectfully hope he is successful in many of his endeavors ... and just as respectfully hope he fails in others. {Just trying to lighten things up a bit here. )", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:57:00", 
        "title": "Discussion about President Obama", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. And generally those that come back with a different \"name\" usually say who they posted as previously. So who were you? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090301, 
        "postID": 14, 
        "quote": "Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting.", 
        "reply": " And generally those that come back with a different \"name\" usually say who they posted as previously. So who were you? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:10:00", 
        "title": "Discussion about President Obama", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate.", 
        "intTime": 20090301, 
        "postID": 15, 
        "quote": "Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\".", 
        "reply": " What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:13:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. And generally those that come back with a different \"name\" usually say who they posted as previously. So who were you? Originally... 'topgunny'...October of 2000 As if it is any of your bidness And you... You opened the hatchway...", 
        "intTime": 20090301, 
        "postID": 16, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. And generally those that come back with a different \"name\" usually say who they posted as previously. So who were you?", 
        "reply": " Originally... 'topgunny'...October of 2000 As if it is any of your bidness And you... You opened the hatchway...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:19:00", 
        "title": "Discussion about President Obama", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Hoffy ... though she responded to your comment, I think she was trying to reinforce it and her \"challenge\" was intended for the OP, michigancaptain, not you.", 
        "intTime": 20090301, 
        "postID": 17, 
        "quote": "", 
        "reply": "Hoffy ... though she responded to your comment, I think she was trying to reinforce it and her \"challenge\" was intended for the OP, michigancaptain, not you.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:33:00", 
        "title": "Discussion about President Obama", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings... yea i agree... although i dislike obama i do not call him derogatory names ... about the only thing i will call him other then obama is \"the one\" in references to him... and well his people called him that during the election...", 
        "intTime": 20090301, 
        "postID": 18, 
        "quote": "Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings...", 
        "reply": " yea i agree... although i dislike obama i do not call him derogatory names ... about the only thing i will call him other then obama is \"the one\" in references to him... and well his people called him that during the election...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:34:00", 
        "title": "Discussion about President Obama", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by michigancaptain: quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate. With all due respect, MC, I don't see it that way. I have seen it both ways. Yes, there are some here that will \"disrespect\" our current CinC but, there are some here who have disrespected our former CinC. It equals out. For those who do not take their rose-tinted glasses off will not see it as equal...they only see it one sided, which you are purporting as of this conversation, you know what I mean? JMHO, I could be wrong...", 
        "intTime": 20090301, 
        "postID": 19, 
        "quote": "Originally posted by michigancaptain: quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate.", 
        "reply": " With all due respect, MC, I don't see it that way. I have seen it both ways. Yes, there are some here that will \"disrespect\" our current CinC but, there are some here who have disrespected our former CinC. It equals out. For those who do not take their rose-tinted glasses off will not see it as equal...they only see it one sided, which you are purporting as of this conversation, you know what I mean? JMHO, I could be wrong...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 19:07:00", 
        "title": "Discussion about President Obama", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I don't think so. If what I'm hearing that financial interests caused a relaxing of a standard, that seems odd to me. To me, that implies that the major contributors to this site, a site that is catered to the military, that knows to show respect to the Commander in Chief, don't hold those same values. Not to tick anyone off here, or put anyone on the spot - but that doesn't make sense to me. Why should who the Commander in Chief is make any difference?", 
        "intTime": 20090301, 
        "postID": 20, 
        "quote": "", 
        "reply": "Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I don't think so. If what I'm hearing that financial interests caused a relaxing of a standard, that seems odd to me. To me, that implies that the major contributors to this site, a site that is catered to the military, that knows to show respect to the Commander in Chief, don't hold those same values. Not to tick anyone off here, or put anyone on the spot - but that doesn't make sense to me. Why should who the Commander in Chief is make any difference?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 19:38:00", 
        "title": "Discussion about President Obama", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I don't think so. If what I'm hearing that financial interests caused a relaxing of a standard, that seems odd to me. To me, that implies that the major contributors to this site, a site that is catered to the military, that knows to show respect to the Commander in Chief, don't hold those same values. Not to tick anyone off here, or put anyone on the spot - but that doesn't make sense to me. Why should who the Commander in Chief is make any difference? Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I bet you would not survive to day if you said that about the previous president. Many of us were betting that the TOS would change if a democrat got the office. He did and it did. It takes time to make a positive change. Some day it will come.", 
        "intTime": 20090301, 
        "postID": 21, 
        "quote": "Originally posted by mcgreer: Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I don't think so. If what I'm hearing that financial interests caused a relaxing of a standard, that seems odd to me. To me, that implies that the major contributors to this site, a site that is catered to the military, that knows to show respect to the Commander in Chief, don't hold those same values. Not to tick anyone off here, or put anyone on the spot - but that doesn't make sense to me. Why should who the Commander in Chief is make any difference?", 
        "reply": " Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I bet you would not survive to day if you said that about the previous president. Many of us were betting that the TOS would change if a democrat got the office. He did and it did. It takes time to make a positive change. Some day it will come.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:07:00", 
        "title": "Discussion about President Obama", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by MilitaryFanSupporter: quote: Originally posted by michigancaptain: quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate. With all due respect, MC, I don't see it that way. I have seen it both ways. Yes, there are some here that will \"disrespect\" our current CinC but, there are some here who have disrespected our former CinC. It equals out. For those who do not take their rose-tinted glasses off will not see it as equal...they only see it one sided, which you are purporting as of this conversation, you know what I mean? Paul I see you are a Military Enthusiast will you be joining??", 
        "intTime": 20090301, 
        "postID": 22, 
        "quote": "Originally posted by MilitaryFanSupporter: quote: Originally posted by michigancaptain: quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate. With all due respect, MC, I don't see it that way. I have seen it both ways. Yes, there are some here that will \"disrespect\" our current CinC but, there are some here who have disrespected our former CinC. It equals out. For those who do not take their rose-tinted glasses off will not see it as equal...they only see it one sided, which you are purporting as of this conversation, you know what I mean?", 
        "reply": " Paul I see you are a Military Enthusiast will you be joining??", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:09:00", 
        "title": "Discussion about President Obama", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. In fact, weren't you kicked off? And aren't you circumventing a suspension?", 
        "intTime": 20090301, 
        "postID": 23, 
        "quote": "I had friends \"kicked off\" this board for questioning Bush's authority or decisions.", 
        "reply": " In fact, weren't you kicked off? And aren't you circumventing a suspension?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:10:00", 
        "title": "Discussion about President Obama", 
        "userID": "ipscone"
    }, 
    {
        "content": "quote: Originally posted by ipscone: quote: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. In fact, weren't you kicked off? And aren't you circumventing a suspension? Who are you quoting I cant find that line", 
        "intTime": 20090301, 
        "postID": 24, 
        "quote": "Originally posted by ipscone: quote: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. In fact, weren't you kicked off? And aren't you circumventing a suspension?", 
        "reply": " Who are you quoting I cant find that line", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:17:00", 
        "title": "Discussion about President Obama", 
        "userID": "6837602"
    }, 
    {
        "content": "fair and balanced...", 
        "intTime": 20090301, 
        "postID": 25, 
        "quote": "", 
        "reply": "fair and balanced...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:38:00", 
        "title": "Discussion about President Obama", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "So then, any conservative is fair game? And can we retroactively bash Bush? His sins are still evident and he yet smolders. Sarah Palin could use some more whacking (figuratively speaking) and that puppet the Repubs drug out to respond to Obama the other day. And then there is always Rush who is more deserving of criticism and ridicule than even the defoliated Bush. I guess speech has been freed from the shackles of conservative 'martial law'?", 
        "intTime": 20090301, 
        "postID": 26, 
        "quote": "", 
        "reply": "So then, any conservative is fair game? And can we retroactively bash Bush? His sins are still evident and he yet smolders. Sarah Palin could use some more whacking (figuratively speaking) and that puppet the Repubs drug out to respond to Obama the other day. And then there is always Rush who is more deserving of criticism and ridicule than even the defoliated Bush. I guess speech has been freed from the shackles of conservative 'martial law'?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:39:00", 
        "title": "Discussion about President Obama", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings... I know how you feel!!! I saw thru that empty cowboy hat 8 years ago....I was right again", 
        "intTime": 20090301, 
        "postID": 27, 
        "quote": "Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings...", 
        "reply": " I know how you feel!!! I saw thru that empty cowboy hat 8 years ago....I was right again", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 23:31:00", 
        "title": "Discussion about President Obama", 
        "userID": "scottrj50"
    }, 
    {
        "content": "[QUOTE]Originally posted by michigancaptain: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. QUOTE] To member: 6837602... This is the statement you are asking about...", 
        "intTime": 20090302, 
        "postID": 28, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by michigancaptain: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. QUOTE] To member: 6837602... This is the statement you are asking about...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-02 03:36:00", 
        "title": "Discussion about President Obama", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: ***Edited/Snipped*** I know how you feel!!! I saw thru that empty cowboy hat 8 years ago....I was right again You have no idea how I felt then...nor how I am feeling at this time!", 
        "intTime": 20090302, 
        "postID": 29, 
        "quote": "Originally posted by scottrj50: ***Edited/Snipped*** I know how you feel!!! I saw thru that empty cowboy hat 8 years ago....I was right again", 
        "reply": " You have no idea how I felt then...nor how I am feeling at this time!", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-02 03:40:00", 
        "title": "Discussion about President Obama", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by michigancaptain: quote: Originally posted by mainedawg: Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. Ok, thanks.. I appreciate the update. I tried to find the new rules and except for OPSEC did not see any. So, there are no more rules around discussion of the politics of POTUS and no more risk about being banned or cited for \"disrespect to POTUS\"? COMMENT: It appears that the essence of respect and decorum is withdrawn as regards Mr. Obama, both personally and politically, as the president. His policies and pronouncements are certainly \"fair game\" for vigorous debate and discussion; the personal attacks on his character and background detract from legitimate discussion.", 
        "intTime": 20090302, 
        "postID": 30, 
        "quote": "Originally posted by michigancaptain: quote: Originally posted by mainedawg: Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. Ok, thanks.. I appreciate the update. I tried to find the new rules and except for OPSEC did not see any. So, there are no more rules around discussion of the politics of POTUS and no more risk about being banned or cited for \"disrespect to POTUS\"?", 
        "reply": " COMMENT: It appears that the essence of respect and decorum is withdrawn as regards Mr. Obama, both personally and politically, as the president. His policies and pronouncements are certainly \"fair game\" for vigorous debate and discussion; the personal attacks on his character and background detract from legitimate discussion.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-02 04:47:00", 
        "title": "Discussion about President Obama", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "I am surprised at the discussions on this board. When President Bush was President there were moderators everywhere looking for even the remote chance someone may be \"disrespectful\" to POTUS. Now that President Obama is in office it seems that there is a wild free for all in terms of questioning him, calling him names, questioning his citizenship etc. etc. Has something changed? Are we now allowed to do this? I had friends \"kicked off\" this board for questioning Bush's authority or decisions. Certainly what I am reading here would have caused the writers to be banned for life if they had said this stuff about President Bush. Seems like things have changed a bit.", 
        "intTime": 20090301, 
        "postID": 31, 
        "quote": "", 
        "reply": "I am surprised at the discussions on this board. When President Bush was President there were moderators everywhere looking for even the remote chance someone may be \"disrespectful\" to POTUS. Now that President Obama is in office it seems that there is a wild free for all in terms of questioning him, calling him names, questioning his citizenship etc. etc. Has something changed? Are we now allowed to do this? I had friends \"kicked off\" this board for questioning Bush's authority or decisions. Certainly what I am reading here would have caused the writers to be banned for life if they had said this stuff about President Bush. Seems like things have changed a bit.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:05:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "Yes it has changed. Now, do not call out the Moderators here or you will not be here long. Mainedawg Moderator", 
        "intTime": 20090301, 
        "postID": 32, 
        "quote": "", 
        "reply": "Yes it has changed. Now, do not call out the Moderators here or you will not be here long. Mainedawg Moderator", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:09:00", 
        "title": "Discussion about President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "Why did it change?", 
        "intTime": 20090301, 
        "postID": 33, 
        "quote": "", 
        "reply": "Why did it change?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:19:00", 
        "title": "Discussion about President Obama", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Did it change officially? I am just trying to figure it out. If so, why did it change?", 
        "intTime": 20090301, 
        "postID": 34, 
        "quote": "", 
        "reply": "Did it change officially? I am just trying to figure it out. If so, why did it change?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:27:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. For those of you that are new to here or have been gone for some time, now would be a good time to reread the TOS and the stickies at the top of the boards so all stays out of trouble. Mainedawg Moderator", 
        "intTime": 20090301, 
        "postID": 35, 
        "quote": "", 
        "reply": "Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. For those of you that are new to here or have been gone for some time, now would be a good time to reread the TOS and the stickies at the top of the boards so all stays out of trouble. Mainedawg Moderator", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:30:00", 
        "title": "Discussion about President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. Ok, thanks.. I appreciate the update. I tried to find the new rules and except for OPSEC did not see any. So, there are no more rules around discussion of the politics of POTUS and no more risk about being banned or cited for \"disrespect to POTUS\"?", 
        "intTime": 20090301, 
        "postID": 36, 
        "quote": "Originally posted by mainedawg: Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on.", 
        "reply": " Ok, thanks.. I appreciate the update. I tried to find the new rules and except for OPSEC did not see any. So, there are no more rules around discussion of the politics of POTUS and no more risk about being banned or cited for \"disrespect to POTUS\"?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:33:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "I don't know what to say to you. Just be nice and we will all have fun. Mainedawg Moderator", 
        "intTime": 20090301, 
        "postID": 37, 
        "quote": "", 
        "reply": "I don't know what to say to you. Just be nice and we will all have fun. Mainedawg Moderator", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:35:00", 
        "title": "Discussion about President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Why did it change? quote: Originally posted by mainedawg: (edited for brevity) This is a for profit site. Not just a board for us to post on. Now if the old \"No CinC-bashing\" rule was enforced equally for President Obama the same way it was for Bush, there would likely be a considerable drop in posters here, and hence revenue to the site. That's the reason, and sadly there isn't much the Mods seem to be able to do about it. The official line from the top was something like this - The \"no-CinC bashing\" rule was not part of the TOS, and couldn't be enforced, hence was done away with. Granted, it would have been easy enough to codify it into the TOS had it truly been viewed as important. Don't like it? Write to Monster. Maybe if enough folks do it, it will change.", 
        "intTime": 20090301, 
        "postID": 38, 
        "quote": "Originally posted by mcgreer: Why did it change?", 
        "reply": " quote: Originally posted by mainedawg: (edited for brevity) This is a for profit site. Not just a board for us to post on. Now if the old \"No CinC-bashing\" rule was enforced equally for President Obama the same way it was for Bush, there would likely be a considerable drop in posters here, and hence revenue to the site. That's the reason, and sadly there isn't much the Mods seem to be able to do about it. The official line from the top was something like this - The \"no-CinC bashing\" rule was not part of the TOS, and couldn't be enforced, hence was done away with. Granted, it would have been easy enough to codify it into the TOS had it truly been viewed as important. Don't like it? Write to Monster. Maybe if enough folks do it, it will change.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:35:00", 
        "title": "Discussion about President Obama", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I will leave this thread open a short time longer and then it's gone. I can see where it will get out of hand easy.", 
        "intTime": 20090301, 
        "postID": 39, 
        "quote": "", 
        "reply": "I will leave this thread open a short time longer and then it's gone. I can see where it will get out of hand easy.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:38:00", 
        "title": "Discussion about President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "I'd also be willing to bet a cold six pack of beer that none of the Mods, past or present, are thrilled with the change themselves - but when given orders from above, there isn't much you can do but follow them or get your butt in a sling.", 
        "intTime": 20090301, 
        "postID": 40, 
        "quote": "", 
        "reply": "I'd also be willing to bet a cold six pack of beer that none of the Mods, past or present, are thrilled with the change themselves - but when given orders from above, there isn't much you can do but follow them or get your butt in a sling.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:48:00", 
        "title": "Discussion about President Obama", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I will leave this thread open a short time longer and then it's gone. I can see where it will get out of hand easy. Well, I am glad that the policy has changed and thank you for clarifying. I find it funny that it changed just at the time President Obama became the CINC but that is OK, at least the group is finally supporting free speech which is what I always thought the military was doing anyway. Great. Thanks for agreeing with me. It took better part of a year to get this policy, and I am sure it was changed for all the wrong reasons (like the group loves to bash the new CINC) but, alas, you are with the right side of freedom now. Thanks", 
        "intTime": 20090301, 
        "postID": 41, 
        "quote": "Originally posted by mainedawg: I will leave this thread open a short time longer and then it's gone. I can see where it will get out of hand easy.", 
        "reply": " Well, I am glad that the policy has changed and thank you for clarifying. I find it funny that it changed just at the time President Obama became the CINC but that is OK, at least the group is finally supporting free speech which is what I always thought the military was doing anyway. Great. Thanks for agreeing with me. It took better part of a year to get this policy, and I am sure it was changed for all the wrong reasons (like the group loves to bash the new CINC) but, alas, you are with the right side of freedom now. Thanks", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:48:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings...", 
        "intTime": 20090301, 
        "postID": 42, 
        "quote": "", 
        "reply": "To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:49:00", 
        "title": "Discussion about President Obama", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Don't like it? Write to Monster. Maybe if enough folks do it, it will change. Good suggestion, PD. Have my letter all ready to send and will decide whether or not to mail it in November 2012! As to POTUS 44, I respectfully hope he is successful in many of his endeavors ... and just as respectfully hope he fails in others. {Just trying to lighten things up a bit here. )", 
        "intTime": 20090301, 
        "postID": 43, 
        "quote": "Don't like it? Write to Monster. Maybe if enough folks do it, it will change.", 
        "reply": " Good suggestion, PD. Have my letter all ready to send and will decide whether or not to mail it in November 2012! As to POTUS 44, I respectfully hope he is successful in many of his endeavors ... and just as respectfully hope he fails in others. {Just trying to lighten things up a bit here. )", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 15:57:00", 
        "title": "Discussion about President Obama", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. And generally those that come back with a different \"name\" usually say who they posted as previously. So who were you? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090301, 
        "postID": 44, 
        "quote": "Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting.", 
        "reply": " And generally those that come back with a different \"name\" usually say who they posted as previously. So who were you? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:10:00", 
        "title": "Discussion about President Obama", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate.", 
        "intTime": 20090301, 
        "postID": 45, 
        "quote": "Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\".", 
        "reply": " What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:13:00", 
        "title": "Discussion about President Obama", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. And generally those that come back with a different \"name\" usually say who they posted as previously. So who were you? Originally... 'topgunny'...October of 2000 As if it is any of your bidness And you... You opened the hatchway...", 
        "intTime": 20090301, 
        "postID": 46, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. And generally those that come back with a different \"name\" usually say who they posted as previously. So who were you?", 
        "reply": " Originally... 'topgunny'...October of 2000 As if it is any of your bidness And you... You opened the hatchway...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:19:00", 
        "title": "Discussion about President Obama", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "Hoffy ... though she responded to your comment, I think she was trying to reinforce it and her \"challenge\" was intended for the OP, michigancaptain, not you.", 
        "intTime": 20090301, 
        "postID": 47, 
        "quote": "", 
        "reply": "Hoffy ... though she responded to your comment, I think she was trying to reinforce it and her \"challenge\" was intended for the OP, michigancaptain, not you.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:33:00", 
        "title": "Discussion about President Obama", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings... yea i agree... although i dislike obama i do not call him derogatory names ... about the only thing i will call him other then obama is \"the one\" in references to him... and well his people called him that during the election...", 
        "intTime": 20090301, 
        "postID": 48, 
        "quote": "Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings...", 
        "reply": " yea i agree... although i dislike obama i do not call him derogatory names ... about the only thing i will call him other then obama is \"the one\" in references to him... and well his people called him that during the election...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 16:34:00", 
        "title": "Discussion about President Obama", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by michigancaptain: quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate. With all due respect, MC, I don't see it that way. I have seen it both ways. Yes, there are some here that will \"disrespect\" our current CinC but, there are some here who have disrespected our former CinC. It equals out. For those who do not take their rose-tinted glasses off will not see it as equal...they only see it one sided, which you are purporting as of this conversation, you know what I mean? JMHO, I could be wrong...", 
        "intTime": 20090301, 
        "postID": 49, 
        "quote": "Originally posted by michigancaptain: quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate.", 
        "reply": " With all due respect, MC, I don't see it that way. I have seen it both ways. Yes, there are some here that will \"disrespect\" our current CinC but, there are some here who have disrespected our former CinC. It equals out. For those who do not take their rose-tinted glasses off will not see it as equal...they only see it one sided, which you are purporting as of this conversation, you know what I mean? JMHO, I could be wrong...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 19:07:00", 
        "title": "Discussion about President Obama", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I don't think so. If what I'm hearing that financial interests caused a relaxing of a standard, that seems odd to me. To me, that implies that the major contributors to this site, a site that is catered to the military, that knows to show respect to the Commander in Chief, don't hold those same values. Not to tick anyone off here, or put anyone on the spot - but that doesn't make sense to me. Why should who the Commander in Chief is make any difference?", 
        "intTime": 20090301, 
        "postID": 50, 
        "quote": "", 
        "reply": "Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I don't think so. If what I'm hearing that financial interests caused a relaxing of a standard, that seems odd to me. To me, that implies that the major contributors to this site, a site that is catered to the military, that knows to show respect to the Commander in Chief, don't hold those same values. Not to tick anyone off here, or put anyone on the spot - but that doesn't make sense to me. Why should who the Commander in Chief is make any difference?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 19:38:00", 
        "title": "Discussion about President Obama", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I don't think so. If what I'm hearing that financial interests caused a relaxing of a standard, that seems odd to me. To me, that implies that the major contributors to this site, a site that is catered to the military, that knows to show respect to the Commander in Chief, don't hold those same values. Not to tick anyone off here, or put anyone on the spot - but that doesn't make sense to me. Why should who the Commander in Chief is make any difference? Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I bet you would not survive to day if you said that about the previous president. Many of us were betting that the TOS would change if a democrat got the office. He did and it did. It takes time to make a positive change. Some day it will come.", 
        "intTime": 20090301, 
        "postID": 51, 
        "quote": "Originally posted by mcgreer: Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I don't think so. If what I'm hearing that financial interests caused a relaxing of a standard, that seems odd to me. To me, that implies that the major contributors to this site, a site that is catered to the military, that knows to show respect to the Commander in Chief, don't hold those same values. Not to tick anyone off here, or put anyone on the spot - but that doesn't make sense to me. Why should who the Commander in Chief is make any difference?", 
        "reply": " Would I have survived here if I called the previous President a socialist? Constantly questioned his citizenship? Considered him an enemy of the state? I bet you would not survive to day if you said that about the previous president. Many of us were betting that the TOS would change if a democrat got the office. He did and it did. It takes time to make a positive change. Some day it will come.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:07:00", 
        "title": "Discussion about President Obama", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by MilitaryFanSupporter: quote: Originally posted by michigancaptain: quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate. With all due respect, MC, I don't see it that way. I have seen it both ways. Yes, there are some here that will \"disrespect\" our current CinC but, there are some here who have disrespected our former CinC. It equals out. For those who do not take their rose-tinted glasses off will not see it as equal...they only see it one sided, which you are purporting as of this conversation, you know what I mean? Paul I see you are a Military Enthusiast will you be joining??", 
        "intTime": 20090301, 
        "postID": 52, 
        "quote": "Originally posted by MilitaryFanSupporter: quote: Originally posted by michigancaptain: quote: Originally posted by Hoffy1951: To the originating poster... Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". What caused me to ask this question are the posts currently on line about President Obama. Have you read the posts concerning President Obama? What defines \"openly rabid\"? The stuff I am reading here far exceeds anything I read about President Bush. Yes, I was here and I left on my own because every time you even remotely discussed something against President Bush you were seen as a \"disrupter\" or \"disrespectful\". I thought I would come back to see how the forums are now and I have not been shocked. I figured this would occur. Which, by the way, I am OK with. I am fine with having open dialogue about the POTUS and his policies. In fact, it is respectful in my mind to question authority; the Country was built on this and, in fact, our forefathers took up arms against what was \"the authority\". I personally think President Obama is the best thing to happen to this Country in my lifetime. Unfortunately, he was left a Country which is essentially in tatters. But, I could not think of anyone to fix the mess better than President Obama. I fully support the new policy and look forward to lively debate. With all due respect, MC, I don't see it that way. I have seen it both ways. Yes, there are some here that will \"disrespect\" our current CinC but, there are some here who have disrespected our former CinC. It equals out. For those who do not take their rose-tinted glasses off will not see it as equal...they only see it one sided, which you are purporting as of this conversation, you know what I mean?", 
        "reply": " Paul I see you are a Military Enthusiast will you be joining??", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:09:00", 
        "title": "Discussion about President Obama", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. In fact, weren't you kicked off? And aren't you circumventing a suspension?", 
        "intTime": 20090301, 
        "postID": 53, 
        "quote": "I had friends \"kicked off\" this board for questioning Bush's authority or decisions.", 
        "reply": " In fact, weren't you kicked off? And aren't you circumventing a suspension?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:10:00", 
        "title": "Discussion about President Obama", 
        "userID": "ipscone"
    }, 
    {
        "content": "quote: Originally posted by ipscone: quote: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. In fact, weren't you kicked off? And aren't you circumventing a suspension? Who are you quoting I cant find that line", 
        "intTime": 20090301, 
        "postID": 54, 
        "quote": "Originally posted by ipscone: quote: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. In fact, weren't you kicked off? And aren't you circumventing a suspension?", 
        "reply": " Who are you quoting I cant find that line", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:17:00", 
        "title": "Discussion about President Obama", 
        "userID": "6837602"
    }, 
    {
        "content": "fair and balanced...", 
        "intTime": 20090301, 
        "postID": 55, 
        "quote": "", 
        "reply": "fair and balanced...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:38:00", 
        "title": "Discussion about President Obama", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "So then, any conservative is fair game? And can we retroactively bash Bush? His sins are still evident and he yet smolders. Sarah Palin could use some more whacking (figuratively speaking) and that puppet the Repubs drug out to respond to Obama the other day. And then there is always Rush who is more deserving of criticism and ridicule than even the defoliated Bush. I guess speech has been freed from the shackles of conservative 'martial law'?", 
        "intTime": 20090301, 
        "postID": 56, 
        "quote": "", 
        "reply": "So then, any conservative is fair game? And can we retroactively bash Bush? His sins are still evident and he yet smolders. Sarah Palin could use some more whacking (figuratively speaking) and that puppet the Repubs drug out to respond to Obama the other day. And then there is always Rush who is more deserving of criticism and ridicule than even the defoliated Bush. I guess speech has been freed from the shackles of conservative 'martial law'?", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 22:39:00", 
        "title": "Discussion about President Obama", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings... I know how you feel!!! I saw thru that empty cowboy hat 8 years ago....I was right again", 
        "intTime": 20090301, 
        "postID": 57, 
        "quote": "Originally posted by Hoffy1951: To the originating poster... It's quite plain that you have been here before by your posting. There were quite a few former and some present members who were quite venomous in their posting of topics bashing now-former President Bush. In fact, that was their main mission. Nothing else. It got so out of hand, that there were 'stickied advisories' posted at the top of certain forums denoting this practice was not permitted. There were those who deliberately chose to openly defy these warnings...and paid the price. Some of these members are gone, permanently. Some have returned. Bottomline is this... The OFFICE of POTUS is to be respected. You may not agree with the policies of the individual in the Office and state such. But, you are not allowed to openly run rabid on the 'chair sitter'...and openly be disruptive and disrespectful. \"Think before you post\". Personally speaking... I did not vote for the current office-holder, as I saw thru his campaign rehortic, and for what he planned to do. Thus far...what has been done had reinforced my gut feelings...", 
        "reply": " I know how you feel!!! I saw thru that empty cowboy hat 8 years ago....I was right again", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-01 23:31:00", 
        "title": "Discussion about President Obama", 
        "userID": "scottrj50"
    }, 
    {
        "content": "[QUOTE]Originally posted by michigancaptain: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. QUOTE] To member: 6837602... This is the statement you are asking about...", 
        "intTime": 20090302, 
        "postID": 58, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by michigancaptain: I had friends \"kicked off\" this board for questioning Bush's authority or decisions. QUOTE] To member: 6837602... This is the statement you are asking about...", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-02 03:36:00", 
        "title": "Discussion about President Obama", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: ***Edited/Snipped*** I know how you feel!!! I saw thru that empty cowboy hat 8 years ago....I was right again You have no idea how I felt then...nor how I am feeling at this time!", 
        "intTime": 20090302, 
        "postID": 59, 
        "quote": "Originally posted by scottrj50: ***Edited/Snipped*** I know how you feel!!! I saw thru that empty cowboy hat 8 years ago....I was right again", 
        "reply": " You have no idea how I felt then...nor how I am feeling at this time!", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-02 03:40:00", 
        "title": "Discussion about President Obama", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by michigancaptain: quote: Originally posted by mainedawg: Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. Ok, thanks.. I appreciate the update. I tried to find the new rules and except for OPSEC did not see any. So, there are no more rules around discussion of the politics of POTUS and no more risk about being banned or cited for \"disrespect to POTUS\"? COMMENT: It appears that the essence of respect and decorum is withdrawn as regards Mr. Obama, both personally and politically, as the president. His policies and pronouncements are certainly \"fair game\" for vigorous debate and discussion; the personal attacks on his character and background detract from legitimate discussion.", 
        "intTime": 20090302, 
        "postID": 60, 
        "quote": "Originally posted by michigancaptain: quote: Originally posted by mainedawg: Freedom of speech is the reason. Military.com tries hard to give people the chance to say as they wish. The change came about when the board settled down again and the trouble makers either posted within the TOS or left. I see a good influx of new posters and a lot of old posters back now. This is a for profit site. Not just a board for us to post on. Ok, thanks.. I appreciate the update. I tried to find the new rules and except for OPSEC did not see any. So, there are no more rules around discussion of the politics of POTUS and no more risk about being banned or cited for \"disrespect to POTUS\"?", 
        "reply": " COMMENT: It appears that the essence of respect and decorum is withdrawn as regards Mr. Obama, both personally and politically, as the president. His policies and pronouncements are certainly \"fair game\" for vigorous debate and discussion; the personal attacks on his character and background detract from legitimate discussion.", 
        "threadID": "409192893_2750006612001", 
        "time": "2009-03-02 04:47:00", 
        "title": "Discussion about President Obama", 
        "userID": "NOVAMarine"
    }
]