[
    {
        "content": "Why shouldn’t Nancy Pelosi and the other democrats who KNEW about these tortures be IMPEACHED and prosecuted? They SCREAMED about it throughout the war to prosecute Bush & Cheney and all the while flat-out LYING about their involvement. What a freaking disgrace… Osama Bin Laden must laughing is dusty crack off watching these arrogant idiots… These people are an embarrassment to humanity. Hill Briefed on Waterboarding in 2002 In Meetings, Spy Panels' Chiefs Did Not Protest, Officials Say By Joby Warrick and Dan Eggen Washington Post Staff Writers Sunday, December 9, 2007; A01 In September 2002, four members of Congress met in secret for a first look at a unique CIA program designed to wring vital information from reticent terrorism suspects in U.S. custody. For more than an hour, the bipartisan group, which included current House Speaker Nancy Pelosi (D-Calif.), was given a virtual tour of the CIA's overseas detention sites and the harsh techniques interrogators had devised to try to make their prisoners talk. Among the techniques described, said two officials present, was waterboarding, a practice that years later would be condemned as torture by Democrats and some Republicans on Capitol Hill. But on that day, no objections were raised. Instead, at least two lawmakers in the room asked the CIA to push harder, two U.S. officials said. \"The briefer was specifically asked if the methods were tough enough,\" said a U.S. official who witnessed the exchange. Congressional leaders from both parties would later seize on waterboarding as a symbol of the worst excesses of the Bush administration's counterterrorism effort. The CIA last week admitted that videotape of an interrogation of one of the waterboarded detainees was destroyed in 2005 against the advice of Justice Department and White House officials, provoking allegations that its actions were illegal and the destruction was a coverup. Yet long before \"waterboarding\" entered the public discourse, the CIA gave key legislative overseers about 30 private briefings, some of which included descriptions of that technique and other harsh interrogation methods, according to interviews with multiple U.S. officials with firsthand knowledge. ---snip--- Another source… - taken from the report… In September 2002, four members of Congress met in secret for a first look at a unique CIA program designed to wring vital information from reticent terrorism suspects in U.S. custody. For more than an hour, the bipartisan group, which included current House Speaker Nancy Pelosi (D-Calif.), was given a virtual tour of the CIA’s overseas detention sites and the harsh techniques interrogators had devised to try to make their prisoners talk. Among the techniques described, said two officials present, was waterboarding, a practice that years later would be condemned as torture by Democrats and some Republicans on Capitol Hill. But on that day, no objections were raised. Instead, at least two lawmakers in the room asked the CIA to push harder, two U.S. officials said. “The briefer was specifically asked if the methods were tough enough,” said a U.S. official who witnessed the exchange. Intelligence Report: Pelosi Briefed on Use of Interrogation Tactics in Sept. ’02 ABC News’ Rick Klein reports: House Speaker Nancy Pelosi was briefed on the use of “enhanced interrogation techniques” on terrorist suspect Abu Zubaydah in September 2002, according to a report prepared by the Director of National Intelligence’s office and obtained by ABC News. ----snip---- …The report also details dozens of other meetings with members of Congress -- though not with Pelosi present -- where the use of waterboarding and other interrogation techniques was described. The Senate intelligence committee’s chairman and ranking member, Bob Graham and Richard Shelby, were given a briefing similar to the one with Pelosi and Goss on Sept. 27, 2002, according to the report. On Feb. 4, 2003, a briefing on “enhanced interrogation techniques” for Sen. Pat Roberts, R-Kan., and Sen. John D. Rockefeller IV, D-W.Va., revealed that interrogations of Abu Zubaydah and Abd Al-Rahim Al-Nashiri were taped. In addition, that briefing “described in considerable details” the techniques used, including “how the water board was used.” A similar briefing the following day included Goss and Rep. Jane Harman, D-Calif., who by that time had become the top Democrat on the House intelligence committee, when Pelosi moved on to become minority leader. The report is accompanied by a letter from CIA Director Leon Panetta to intelligence committee leaders that describes the way it was compiled: “This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents [memorandums for the record] completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review.” ---snip---", 
        "intTime": 20090508, 
        "postID": 1, 
        "quote": "", 
        "reply": "Why shouldn’t Nancy Pelosi and the other democrats who KNEW about these tortures be IMPEACHED and prosecuted? They SCREAMED about it throughout the war to prosecute Bush & Cheney and all the while flat-out LYING about their involvement. What a freaking disgrace… Osama Bin Laden must laughing is dusty crack off watching these arrogant idiots… These people are an embarrassment to humanity. Hill Briefed on Waterboarding in 2002 In Meetings, Spy Panels' Chiefs Did Not Protest, Officials Say By Joby Warrick and Dan Eggen Washington Post Staff Writers Sunday, December 9, 2007; A01 In September 2002, four members of Congress met in secret for a first look at a unique CIA program designed to wring vital information from reticent terrorism suspects in U.S. custody. For more than an hour, the bipartisan group, which included current House Speaker Nancy Pelosi (D-Calif.), was given a virtual tour of the CIA's overseas detention sites and the harsh techniques interrogators had devised to try to make their prisoners talk. Among the techniques described, said two officials present, was waterboarding, a practice that years later would be condemned as torture by Democrats and some Republicans on Capitol Hill. But on that day, no objections were raised. Instead, at least two lawmakers in the room asked the CIA to push harder, two U.S. officials said. \"The briefer was specifically asked if the methods were tough enough,\" said a U.S. official who witnessed the exchange. Congressional leaders from both parties would later seize on waterboarding as a symbol of the worst excesses of the Bush administration's counterterrorism effort. The CIA last week admitted that videotape of an interrogation of one of the waterboarded detainees was destroyed in 2005 against the advice of Justice Department and White House officials, provoking allegations that its actions were illegal and the destruction was a coverup. Yet long before \"waterboarding\" entered the public discourse, the CIA gave key legislative overseers about 30 private briefings, some of which included descriptions of that technique and other harsh interrogation methods, according to interviews with multiple U.S. officials with firsthand knowledge. ---snip--- Another source… - taken from the report… In September 2002, four members of Congress met in secret for a first look at a unique CIA program designed to wring vital information from reticent terrorism suspects in U.S. custody. For more than an hour, the bipartisan group, which included current House Speaker Nancy Pelosi (D-Calif.), was given a virtual tour of the CIA’s overseas detention sites and the harsh techniques interrogators had devised to try to make their prisoners talk. Among the techniques described, said two officials present, was waterboarding, a practice that years later would be condemned as torture by Democrats and some Republicans on Capitol Hill. But on that day, no objections were raised. Instead, at least two lawmakers in the room asked the CIA to push harder, two U.S. officials said. “The briefer was specifically asked if the methods were tough enough,” said a U.S. official who witnessed the exchange. Intelligence Report: Pelosi Briefed on Use of Interrogation Tactics in Sept. ’02 ABC News’ Rick Klein reports: House Speaker Nancy Pelosi was briefed on the use of “enhanced interrogation techniques” on terrorist suspect Abu Zubaydah in September 2002, according to a report prepared by the Director of National Intelligence’s office and obtained by ABC News. ----snip---- …The report also details dozens of other meetings with members of Congress -- though not with Pelosi present -- where the use of waterboarding and other interrogation techniques was described. The Senate intelligence committee’s chairman and ranking member, Bob Graham and Richard Shelby, were given a briefing similar to the one with Pelosi and Goss on Sept. 27, 2002, according to the report. On Feb. 4, 2003, a briefing on “enhanced interrogation techniques” for Sen. Pat Roberts, R-Kan., and Sen. John D. Rockefeller IV, D-W.Va., revealed that interrogations of Abu Zubaydah and Abd Al-Rahim Al-Nashiri were taped. In addition, that briefing “described in considerable details” the techniques used, including “how the water board was used.” A similar briefing the following day included Goss and Rep. Jane Harman, D-Calif., who by that time had become the top Democrat on the House intelligence committee, when Pelosi moved on to become minority leader. The report is accompanied by a letter from CIA Director Leon Panetta to intelligence committee leaders that describes the way it was compiled: “This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents [memorandums for the record] completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review.” ---snip---", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 16:30:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Works for me.", 
        "intTime": 20090508, 
        "postID": 2, 
        "quote": "", 
        "reply": "Works for me.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 16:40:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "thorin001"
    }, 
    {
        "content": "Scream! Yell! Cry! Panic! Heart Attack! Collapse!", 
        "intTime": 20090508, 
        "postID": 3, 
        "quote": "", 
        "reply": "Scream! Yell! Cry! Panic! Heart Attack! Collapse!", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 17:04:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "Boots_"
    }, 
    {
        "content": "So - you acknowledge that torture is illegal, then...", 
        "intTime": 20090508, 
        "postID": 4, 
        "quote": "", 
        "reply": "So - you acknowledge that torture is illegal, then...", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 17:10:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: So - you acknowledge that torture is illegal, then... Torture \"is\" illegal... What was done to enemy combatants was NOT torture - IMHO. However, BECAUSE Pelosi and fellow hypocrites in the senate were foaming at the mouth to do anything to destroy Bush - well, BUSH didn't TORTURE anyone nor did he approve it - THEY are the ones CLAIMING it is TORTURE and THEY ALLOWED IT and DID NOTHING... So, in my book - THEY are CONDENMED by their own hypocritical arrogant LYING mouths... and THEY should suffer the consequences for their belligerent audacious despicable LIES! They proclaimed the standard – and THEY should be HELD to it! As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…", 
        "intTime": 20090508, 
        "postID": 5, 
        "quote": "Originally posted by mcgreer: So - you acknowledge that torture is illegal, then...", 
        "reply": " Torture \"is\" illegal... What was done to enemy combatants was NOT torture - IMHO. However, BECAUSE Pelosi and fellow hypocrites in the senate were foaming at the mouth to do anything to destroy Bush - well, BUSH didn't TORTURE anyone nor did he approve it - THEY are the ones CLAIMING it is TORTURE and THEY ALLOWED IT and DID NOTHING... So, in my book - THEY are CONDENMED by their own hypocritical arrogant LYING mouths... and THEY should suffer the consequences for their belligerent audacious despicable LIES! They proclaimed the standard – and THEY should be HELD to it! As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 17:35:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools.", 
        "intTime": 20090508, 
        "postID": 6, 
        "quote": "", 
        "reply": "Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 17:53:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. I think we gave up the society when our people chose politics over community. I agree with you - so many Americans were swayed by the Obama \"rock star\" razzle-dazzle, bringing nothing but a byline of rhetorical \"change\" and no history of substance to bank it on. Now look what that foolishness has gotten us. In a hole...DEEP!", 
        "intTime": 20090508, 
        "postID": 7, 
        "quote": "Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools.", 
        "reply": " I think we gave up the society when our people chose politics over community. I agree with you - so many Americans were swayed by the Obama \"rock star\" razzle-dazzle, bringing nothing but a byline of rhetorical \"change\" and no history of substance to bank it on. Now look what that foolishness has gotten us. In a hole...DEEP!", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 18:02:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: Originally posted by thorin001: Works for me. Ditto.", 
        "intTime": 20090508, 
        "postID": 8, 
        "quote": "Originally posted by thorin001: Works for me.", 
        "reply": " Ditto.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 18:16:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Water boarding is not Torture......Period.", 
        "intTime": 20090508, 
        "postID": 9, 
        "quote": "Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools.", 
        "reply": " Water boarding is not Torture......Period.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 18:18:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Water boarding is not Torture......Period. Then there is nothing to impeach the wench on.", 
        "intTime": 20090508, 
        "postID": 10, 
        "quote": "Originally posted by Migbuster: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Water boarding is not Torture......Period.", 
        "reply": " Then there is nothing to impeach the wench on.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 18:37:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Regarding torture – IMHO – I would leave up to the military command. There are times when things must be done that the general public does NOT need to know. I would trust the judgment of Gen Petraeus and his decision in a given moment than any politician EVER. Fighting al Qaeda pretending they are some military enemy is suicide for this country. These people are NOT out to gain anything – they are NOT seeking peace – money – geography – power – etc… They are seeking our DEATH – PERIOD. Accommodating them, appeasing them, ignoring them, and/or “hoping” some Middle East Country will take care of it is SUICIDE. This is NOT a freaking army. In fact, I would not give them HUMAN status. They are worse than rabid animals and should EXTERMINATED from the planet. Saudi Arabia, Egypt, Iran, Syria, and every other country allowing these vermin to breathe should be put on notice. We will destroy them NO MATTER where they are – including the Palaces – Cities – or wherever they are suspected. We should fire-off a dozen missiles taking out ALL of Iran’s oil refineries and pumping stations. Then give them ONE stern warning – if they retaliate we WILL USE OUR NUCLEAR ARSENAL to eradicate Iran from the globe… If they do it anyway, then we SHOULD deliver our promise. Anyone thinks we can negotiate with militant twisted malcontents on a religious mission to destroy the infidels to usher in their coming end-times – well, we should simply accommodate their prophecy and eliminate them from the planet – sending them to their paradise. Hey, sorry, I’ll catch the next ride… We are NOT less-than or inhumane – or somehow reverting to barbarism simply because THOSE IDIOTS don’t get the message. They are planning right now to attack this country. When Iran gets its nukes – they will use them against Israel. They will NUKE that place to begin their world war. If not, then why in the hell don’t we pull out of A-stan & Iraq now – and let the Saudis and Egypt go in and pick up the pieces… they are after all their Muslim brothers – why aren’t they helping…? Why are we sending the freaking Palestinians 900-freaking million dollars? What kind of stupid idiot thinks they will use that money for anything decent? Hillary is a jackass for even considering something asinine like that… She should have gone over to the Saudis and told them – you are doing the whining get your freaking oil-rich butts over there and FIX the place… Otherwise – Israel should be given the go-ahead to remove ALL Palestinians from the region. If Syria even sneezes in that direction – bust them with about 50-bunker busters in the center of their cities – and tell them the next will one will GLOW… Only a fool thinks these people are going to negotiate and keep their word. The Saudis and some of the others may be won over years down the road however, until THEY start rooting out this twisted malcontents teaching their American hatred – then they should ALL be treated as suspect. It’s time to put up or shut up – and WE will do the shutting up if necessary. This country is too wide-open to keep screwing around with these idiots. How hard would it be to plant a dozen small nukes from Russia’s old arsenal in those Saudi yachts and park them around in NY, Miami, California, Baltimore, etc, and all attached to ONE big ALARM clock…? It is impossible for us to even detect something like that… I do NOT believe there is ANYTHING we should limit ourselves to when dealing with THESE animals. These people do NOT deserve to be treated like OTHER COUNTRIES at war. Doing so, is a huge mistake. We learned that already, didn’t we… 70% of those released have been killed or recaptured… I can tell you they WOULD NOT be captured again if I were on the field – I’d drop that bum – right there and then. Simply because we treat these animals harshly does NOT in anyway reduce our status in the world and it does NOT mean we would ever do that fighting a convential war. We have always treated our prisoners with respect. I refuse to be manipulated by the bs of what the \"world\" thinks about us. I don't CARE what we hear... These are NOT normal people we are fighting they are WORSE THAN ANY SWINE FLU and they will kill YOU at every opportunity - even killing themselves. They deserve NO MERCY and they are NOT human beings. They should be exterminated and removed from the planet. Just my thoughts", 
        "intTime": 20090508, 
        "postID": 11, 
        "quote": "Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools.", 
        "reply": " Regarding torture – IMHO – I would leave up to the military command. There are times when things must be done that the general public does NOT need to know. I would trust the judgment of Gen Petraeus and his decision in a given moment than any politician EVER. Fighting al Qaeda pretending they are some military enemy is suicide for this country. These people are NOT out to gain anything – they are NOT seeking peace – money – geography – power – etc… They are seeking our DEATH – PERIOD. Accommodating them, appeasing them, ignoring them, and/or “hoping” some Middle East Country will take care of it is SUICIDE. This is NOT a freaking army. In fact, I would not give them HUMAN status. They are worse than rabid animals and should EXTERMINATED from the planet. Saudi Arabia, Egypt, Iran, Syria, and every other country allowing these vermin to breathe should be put on notice. We will destroy them NO MATTER where they are – including the Palaces – Cities – or wherever they are suspected. We should fire-off a dozen missiles taking out ALL of Iran’s oil refineries and pumping stations. Then give them ONE stern warning – if they retaliate we WILL USE OUR NUCLEAR ARSENAL to eradicate Iran from the globe… If they do it anyway, then we SHOULD deliver our promise. Anyone thinks we can negotiate with militant twisted malcontents on a religious mission to destroy the infidels to usher in their coming end-times – well, we should simply accommodate their prophecy and eliminate them from the planet – sending them to their paradise. Hey, sorry, I’ll catch the next ride… We are NOT less-than or inhumane – or somehow reverting to barbarism simply because THOSE IDIOTS don’t get the message. They are planning right now to attack this country. When Iran gets its nukes – they will use them against Israel. They will NUKE that place to begin their world war. If not, then why in the hell don’t we pull out of A-stan & Iraq now – and let the Saudis and Egypt go in and pick up the pieces… they are after all their Muslim brothers – why aren’t they helping…? Why are we sending the freaking Palestinians 900-freaking million dollars? What kind of stupid idiot thinks they will use that money for anything decent? Hillary is a jackass for even considering something asinine like that… She should have gone over to the Saudis and told them – you are doing the whining get your freaking oil-rich butts over there and FIX the place… Otherwise – Israel should be given the go-ahead to remove ALL Palestinians from the region. If Syria even sneezes in that direction – bust them with about 50-bunker busters in the center of their cities – and tell them the next will one will GLOW… Only a fool thinks these people are going to negotiate and keep their word. The Saudis and some of the others may be won over years down the road however, until THEY start rooting out this twisted malcontents teaching their American hatred – then they should ALL be treated as suspect. It’s time to put up or shut up – and WE will do the shutting up if necessary. This country is too wide-open to keep screwing around with these idiots. How hard would it be to plant a dozen small nukes from Russia’s old arsenal in those Saudi yachts and park them around in NY, Miami, California, Baltimore, etc, and all attached to ONE big ALARM clock…? It is impossible for us to even detect something like that… I do NOT believe there is ANYTHING we should limit ourselves to when dealing with THESE animals. These people do NOT deserve to be treated like OTHER COUNTRIES at war. Doing so, is a huge mistake. We learned that already, didn’t we… 70% of those released have been killed or recaptured… I can tell you they WOULD NOT be captured again if I were on the field – I’d drop that bum – right there and then. Simply because we treat these animals harshly does NOT in anyway reduce our status in the world and it does NOT mean we would ever do that fighting a convential war. We have always treated our prisoners with respect. I refuse to be manipulated by the bs of what the \"world\" thinks about us. I don't CARE what we hear... These are NOT normal people we are fighting they are WORSE THAN ANY SWINE FLU and they will kill YOU at every opportunity - even killing themselves. They deserve NO MERCY and they are NOT human beings. They should be exterminated and removed from the planet. Just my thoughts", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 18:45:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Regarding torture – IMHO – I would leave up to the military command. There are times when things must be done that the general public does NOT need to know. I would trust the judgment of Gen Petraeus and his decision in a given moment than any politician EVER. Fighting al Qaeda pretending they are some military enemy is suicide for this country. These people are NOT out to gain anything – they are NOT seeking peace – money – geography – power – etc… They are seeking our DEATH – PERIOD. Accommodating them, appeasing them, ignoring them, and/or “hoping” some Middle East Country will take care of it is SUICIDE. This is NOT a freaking army. In fact, I would not give them HUMAN status. They are worse than rabid animals and should EXTERMINATED from the planet. Saudi Arabia, Egypt, Iran, Syria, and every other country allowing these vermin to breathe should be put on notice. We will destroy them NO MATTER where they are – including the Palaces – Cities – or wherever they are suspected. We should fire-off a dozen missiles taking out ALL of Iran’s oil refineries and pumping stations. Then give them ONE stern warning – if they retaliate we WILL USE OUR NUCLEAR ARSENAL to eradicate Iran from the globe… If they do it anyway, then we SHOULD deliver our promise. Anyone thinks we can negotiate with militant twisted malcontents on a religious mission to destroy the infidels to usher in their coming end-times – well, we should simply accommodate their prophecy and eliminate them from the planet – sending them to their paradise. Hey, sorry, I’ll catch the next ride… We are NOT less-than or inhumane – or somehow reverting to barbarism simply because THOSE IDIOTS don’t get the message. They are planning right now to attack this country. When Iran gets its nukes – they will use them against Israel. They will NUKE that place to begin their world war. If not, then why in the hell don’t we pull out of A-stan & Iraq now – and let the Saudis and Egypt go in and pick up the pieces… they are after all their Muslim brothers – why aren’t they helping…? Why are we sending the freaking Palestinians 900-freaking million dollars? What kind of stupid idiot thinks they will use that money for anything decent? Hillary is a jackass for even considering something asinine like that… She should have gone over to the Saudis and told them – you are doing the whining get your freaking oil-rich butts over there and FIX the place… Otherwise – Israel should be given the go-ahead to remove ALL Palestinians from the region. If Syria even sneezes in that direction – bust them with about 50-bunker busters in the center of their cities – and tell them the next will one will GLOW… Only a fool thinks these people are going to negotiate and keep their word. The Saudis and some of the others may be won over years down the road however, until THEY start rooting out this twisted malcontents teaching their American hatred – then they should ALL be treated as suspect. It’s time to put up or shut up – and WE will do the shutting up if necessary. This country is too wide-open to keep screwing around with these idiots. How hard would it be to plant a dozen small nukes from Russia’s old arsenal in those Saudi yachts and park them around in NY, Miami, California, Baltimore, etc, and all attached to ONE big ALARM clock…? It is impossible for us to even detect something like that… I do NOT believe there is ANYTHING we should limit ourselves to when dealing with THESE animals. These people do NOT deserve to be treated like OTHER COUNTRIES at war. Doing so, is a huge mistake. We learned that already, didn’t we… 70% of those released have been killed or recaptured… I can tell you they WOULD NOT be captured again if I were on the field – I’d drop that bum – right there and then. Simply because we treat these animals harshly does NOT in anyway reduce our status in the world and it does NOT mean we would ever do that fighting a convential war. We have always treated our prisoners with respect. I refuse to be manipulated by the bs of what the \"world\" thinks about us. I don't CARE what we hear... These are NOT normal people we are fighting they are WORSE THAN ANY SWINE FLU and they will kill YOU at every opportunity - even killing themselves. They deserve NO MERCY and they are NOT human beings. They should be exterminated and removed from the planet. Just my thoughts It's still illegal, and we don't get to choose those times when we can ignore the law.", 
        "intTime": 20090508, 
        "postID": 12, 
        "quote": "Originally posted by GlassOnion: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Regarding torture – IMHO – I would leave up to the military command. There are times when things must be done that the general public does NOT need to know. I would trust the judgment of Gen Petraeus and his decision in a given moment than any politician EVER. Fighting al Qaeda pretending they are some military enemy is suicide for this country. These people are NOT out to gain anything – they are NOT seeking peace – money – geography – power – etc… They are seeking our DEATH – PERIOD. Accommodating them, appeasing them, ignoring them, and/or “hoping” some Middle East Country will take care of it is SUICIDE. This is NOT a freaking army. In fact, I would not give them HUMAN status. They are worse than rabid animals and should EXTERMINATED from the planet. Saudi Arabia, Egypt, Iran, Syria, and every other country allowing these vermin to breathe should be put on notice. We will destroy them NO MATTER where they are – including the Palaces – Cities – or wherever they are suspected. We should fire-off a dozen missiles taking out ALL of Iran’s oil refineries and pumping stations. Then give them ONE stern warning – if they retaliate we WILL USE OUR NUCLEAR ARSENAL to eradicate Iran from the globe… If they do it anyway, then we SHOULD deliver our promise. Anyone thinks we can negotiate with militant twisted malcontents on a religious mission to destroy the infidels to usher in their coming end-times – well, we should simply accommodate their prophecy and eliminate them from the planet – sending them to their paradise. Hey, sorry, I’ll catch the next ride… We are NOT less-than or inhumane – or somehow reverting to barbarism simply because THOSE IDIOTS don’t get the message. They are planning right now to attack this country. When Iran gets its nukes – they will use them against Israel. They will NUKE that place to begin their world war. If not, then why in the hell don’t we pull out of A-stan & Iraq now – and let the Saudis and Egypt go in and pick up the pieces… they are after all their Muslim brothers – why aren’t they helping…? Why are we sending the freaking Palestinians 900-freaking million dollars? What kind of stupid idiot thinks they will use that money for anything decent? Hillary is a jackass for even considering something asinine like that… She should have gone over to the Saudis and told them – you are doing the whining get your freaking oil-rich butts over there and FIX the place… Otherwise – Israel should be given the go-ahead to remove ALL Palestinians from the region. If Syria even sneezes in that direction – bust them with about 50-bunker busters in the center of their cities – and tell them the next will one will GLOW… Only a fool thinks these people are going to negotiate and keep their word. The Saudis and some of the others may be won over years down the road however, until THEY start rooting out this twisted malcontents teaching their American hatred – then they should ALL be treated as suspect. It’s time to put up or shut up – and WE will do the shutting up if necessary. This country is too wide-open to keep screwing around with these idiots. How hard would it be to plant a dozen small nukes from Russia’s old arsenal in those Saudi yachts and park them around in NY, Miami, California, Baltimore, etc, and all attached to ONE big ALARM clock…? It is impossible for us to even detect something like that… I do NOT believe there is ANYTHING we should limit ourselves to when dealing with THESE animals. These people do NOT deserve to be treated like OTHER COUNTRIES at war. Doing so, is a huge mistake. We learned that already, didn’t we… 70% of those released have been killed or recaptured… I can tell you they WOULD NOT be captured again if I were on the field – I’d drop that bum – right there and then. Simply because we treat these animals harshly does NOT in anyway reduce our status in the world and it does NOT mean we would ever do that fighting a convential war. We have always treated our prisoners with respect. I refuse to be manipulated by the bs of what the \"world\" thinks about us. I don't CARE what we hear... These are NOT normal people we are fighting they are WORSE THAN ANY SWINE FLU and they will kill YOU at every opportunity - even killing themselves. They deserve NO MERCY and they are NOT human beings. They should be exterminated and removed from the planet. Just my thoughts", 
        "reply": " It's still illegal, and we don't get to choose those times when we can ignore the law.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 19:21:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by Migbuster: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Water boarding is not Torture......Period. Then there is nothing to impeach the wench on. ...unless they were to be impeached for what they accused President Bush of doing...\"lying to their constituency\"!", 
        "intTime": 20090508, 
        "postID": 13, 
        "quote": "Originally posted by thorin001: quote: Originally posted by Migbuster: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Water boarding is not Torture......Period. Then there is nothing to impeach the wench on.", 
        "reply": " ...unless they were to be impeached for what they accused President Bush of doing...\"lying to their constituency\"!", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 19:44:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "If you want her to go down for it then Bushie has to answer for the same...... Be careful what you wish for, you just might get it. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090508, 
        "postID": 14, 
        "quote": "", 
        "reply": "If you want her to go down for it then Bushie has to answer for the same...... Be careful what you wish for, you just might get it. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 19:55:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by GlassOnion: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Regarding torture – IMHO – I would leave up to the military command. There are times when things must be done that the general public does NOT need to know. I would trust the judgment of Gen Petraeus and his decision in a given moment than any politician EVER. Fighting al Qaeda pretending they are some military enemy is suicide for this country. These people are NOT out to gain anything – they are NOT seeking peace – money – geography – power – etc… They are seeking our DEATH – PERIOD. Accommodating them, appeasing them, ignoring them, and/or “hoping” some Middle East Country will take care of it is SUICIDE. This is NOT a freaking army. In fact, I would not give them HUMAN status. They are worse than rabid animals and should EXTERMINATED from the planet. Saudi Arabia, Egypt, Iran, Syria, and every other country allowing these vermin to breathe should be put on notice. We will destroy them NO MATTER where they are – including the Palaces – Cities – or wherever they are suspected. We should fire-off a dozen missiles taking out ALL of Iran’s oil refineries and pumping stations. Then give them ONE stern warning – if they retaliate we WILL USE OUR NUCLEAR ARSENAL to eradicate Iran from the globe… If they do it anyway, then we SHOULD deliver our promise. Anyone thinks we can negotiate with militant twisted malcontents on a religious mission to destroy the infidels to usher in their coming end-times – well, we should simply accommodate their prophecy and eliminate them from the planet – sending them to their paradise. Hey, sorry, I’ll catch the next ride… We are NOT less-than or inhumane – or somehow reverting to barbarism simply because THOSE IDIOTS don’t get the message. They are planning right now to attack this country. When Iran gets its nukes – they will use them against Israel. They will NUKE that place to begin their world war. If not, then why in the hell don’t we pull out of A-stan & Iraq now – and let the Saudis and Egypt go in and pick up the pieces… they are after all their Muslim brothers – why aren’t they helping…? Why are we sending the freaking Palestinians 900-freaking million dollars? What kind of stupid idiot thinks they will use that money for anything decent? Hillary is a jackass for even considering something asinine like that… She should have gone over to the Saudis and told them – you are doing the whining get your freaking oil-rich butts over there and FIX the place… Otherwise – Israel should be given the go-ahead to remove ALL Palestinians from the region. If Syria even sneezes in that direction – bust them with about 50-bunker busters in the center of their cities – and tell them the next will one will GLOW… Only a fool thinks these people are going to negotiate and keep their word. The Saudis and some of the others may be won over years down the road however, until THEY start rooting out this twisted malcontents teaching their American hatred – then they should ALL be treated as suspect. It’s time to put up or shut up – and WE will do the shutting up if necessary. This country is too wide-open to keep screwing around with these idiots. How hard would it be to plant a dozen small nukes from Russia’s old arsenal in those Saudi yachts and park them around in NY, Miami, California, Baltimore, etc, and all attached to ONE big ALARM clock…? It is impossible for us to even detect something like that… I do NOT believe there is ANYTHING we should limit ourselves to when dealing with THESE animals. These people do NOT deserve to be treated like OTHER COUNTRIES at war. Doing so, is a huge mistake. We learned that already, didn’t we… 70% of those released have been killed or recaptured… I can tell you they WOULD NOT be captured again if I were on the field – I’d drop that bum – right there and then. Simply because we treat these animals harshly does NOT in anyway reduce our status in the world and it does NOT mean we would ever do that fighting a convential war. We have always treated our prisoners with respect. I refuse to be manipulated by the bs of what the \"world\" thinks about us. I don't CARE what we hear... These are NOT normal people we are fighting they are WORSE THAN ANY SWINE FLU and they will kill YOU at every opportunity - even killing themselves. They deserve NO MERCY and they are NOT human beings. They should be exterminated and removed from the planet. Just my thoughts It's still illegal, and we don't get to choose those times when we can ignore the law. But didn't Nixon fix that - if the President does it then it isn't illegal...? but if the low-life democrats to - it is!", 
        "intTime": 20090508, 
        "postID": 15, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by GlassOnion: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. This is pathetic. What a bunch of fools. Regarding torture – IMHO – I would leave up to the military command. There are times when things must be done that the general public does NOT need to know. I would trust the judgment of Gen Petraeus and his decision in a given moment than any politician EVER. Fighting al Qaeda pretending they are some military enemy is suicide for this country. These people are NOT out to gain anything – they are NOT seeking peace – money – geography – power – etc… They are seeking our DEATH – PERIOD. Accommodating them, appeasing them, ignoring them, and/or “hoping” some Middle East Country will take care of it is SUICIDE. This is NOT a freaking army. In fact, I would not give them HUMAN status. They are worse than rabid animals and should EXTERMINATED from the planet. Saudi Arabia, Egypt, Iran, Syria, and every other country allowing these vermin to breathe should be put on notice. We will destroy them NO MATTER where they are – including the Palaces – Cities – or wherever they are suspected. We should fire-off a dozen missiles taking out ALL of Iran’s oil refineries and pumping stations. Then give them ONE stern warning – if they retaliate we WILL USE OUR NUCLEAR ARSENAL to eradicate Iran from the globe… If they do it anyway, then we SHOULD deliver our promise. Anyone thinks we can negotiate with militant twisted malcontents on a religious mission to destroy the infidels to usher in their coming end-times – well, we should simply accommodate their prophecy and eliminate them from the planet – sending them to their paradise. Hey, sorry, I’ll catch the next ride… We are NOT less-than or inhumane – or somehow reverting to barbarism simply because THOSE IDIOTS don’t get the message. They are planning right now to attack this country. When Iran gets its nukes – they will use them against Israel. They will NUKE that place to begin their world war. If not, then why in the hell don’t we pull out of A-stan & Iraq now – and let the Saudis and Egypt go in and pick up the pieces… they are after all their Muslim brothers – why aren’t they helping…? Why are we sending the freaking Palestinians 900-freaking million dollars? What kind of stupid idiot thinks they will use that money for anything decent? Hillary is a jackass for even considering something asinine like that… She should have gone over to the Saudis and told them – you are doing the whining get your freaking oil-rich butts over there and FIX the place… Otherwise – Israel should be given the go-ahead to remove ALL Palestinians from the region. If Syria even sneezes in that direction – bust them with about 50-bunker busters in the center of their cities – and tell them the next will one will GLOW… Only a fool thinks these people are going to negotiate and keep their word. The Saudis and some of the others may be won over years down the road however, until THEY start rooting out this twisted malcontents teaching their American hatred – then they should ALL be treated as suspect. It’s time to put up or shut up – and WE will do the shutting up if necessary. This country is too wide-open to keep screwing around with these idiots. How hard would it be to plant a dozen small nukes from Russia’s old arsenal in those Saudi yachts and park them around in NY, Miami, California, Baltimore, etc, and all attached to ONE big ALARM clock…? It is impossible for us to even detect something like that… I do NOT believe there is ANYTHING we should limit ourselves to when dealing with THESE animals. These people do NOT deserve to be treated like OTHER COUNTRIES at war. Doing so, is a huge mistake. We learned that already, didn’t we… 70% of those released have been killed or recaptured… I can tell you they WOULD NOT be captured again if I were on the field – I’d drop that bum – right there and then. Simply because we treat these animals harshly does NOT in anyway reduce our status in the world and it does NOT mean we would ever do that fighting a convential war. We have always treated our prisoners with respect. I refuse to be manipulated by the bs of what the \"world\" thinks about us. I don't CARE what we hear... These are NOT normal people we are fighting they are WORSE THAN ANY SWINE FLU and they will kill YOU at every opportunity - even killing themselves. They deserve NO MERCY and they are NOT human beings. They should be exterminated and removed from the planet. Just my thoughts It's still illegal, and we don't get to choose those times when we can ignore the law.", 
        "reply": " But didn't Nixon fix that - if the President does it then it isn't illegal...? but if the low-life democrats to - it is!", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 20:34:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: If you want her to go down for it then Bushie has to answer for the same...... Be careful what you wish for, you just might get it. Bush didn't claim it was torture and he wasn't looking to hang anyone for it. He was trying to protect the country. Pelosi and commrades not only LIED they attempted to impeach the President for the VERY SAME THING they claimed were ILLEGAL. THEY DID IT - AND - declared it was illegal. THEY should be hung for it not Bush. That's only reason they should be prosecuted. THEY LIED and attempted to take-down the President for the very same thing they accused him of doing. Her & Harry \"the war is lost\" Reid should share the same rope...! That is blatantly arrogant. Accusing the President of something illegal WHILE at the SAME TIME they WERE DOING IT - watching giggling about it - making FALSE accusations against our SOLDIERS for doing it - and SHE KNEW... Sorry, that is below despicable - she should be FORCED out of office... What was the idiot lawyer in NY then became a politician ONLY TO BE CAUGHT doing the same thing he was prosecuting politicians for doing? THAT is exactly what Pelosi has done... She's a disgrace to our country and gov...", 
        "intTime": 20090508, 
        "postID": 16, 
        "quote": "Originally posted by mmulder67: If you want her to go down for it then Bushie has to answer for the same...... Be careful what you wish for, you just might get it.", 
        "reply": " Bush didn't claim it was torture and he wasn't looking to hang anyone for it. He was trying to protect the country. Pelosi and commrades not only LIED they attempted to impeach the President for the VERY SAME THING they claimed were ILLEGAL. THEY DID IT - AND - declared it was illegal. THEY should be hung for it not Bush. That's only reason they should be prosecuted. THEY LIED and attempted to take-down the President for the very same thing they accused him of doing. Her & Harry \"the war is lost\" Reid should share the same rope...! That is blatantly arrogant. Accusing the President of something illegal WHILE at the SAME TIME they WERE DOING IT - watching giggling about it - making FALSE accusations against our SOLDIERS for doing it - and SHE KNEW... Sorry, that is below despicable - she should be FORCED out of office... What was the idiot lawyer in NY then became a politician ONLY TO BE CAUGHT doing the same thing he was prosecuting politicians for doing? THAT is exactly what Pelosi has done... She's a disgrace to our country and gov...", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-08 20:42:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. Perfect post. I have nothing to add to this. Torture is not a partisan issue, folks. Get a grip. This is pathetic. What a bunch of fools.", 
        "intTime": 20090509, 
        "postID": 17, 
        "quote": "Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere.", 
        "reply": " Perfect post. I have nothing to add to this. Torture is not a partisan issue, folks. Get a grip. This is pathetic. What a bunch of fools.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 09:16:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. Perfect post. I have nothing to add to this. Torture is not a partisan issue, folks. Get a grip. This is pathetic. What a bunch of fools. Waterboarding is not torture.", 
        "intTime": 20090509, 
        "postID": 18, 
        "quote": "Originally posted by Bleah: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. Perfect post. I have nothing to add to this. Torture is not a partisan issue, folks. Get a grip. This is pathetic. What a bunch of fools.", 
        "reply": " Waterboarding is not torture.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 09:25:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by Bleah: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. Perfect post. I have nothing to add to this. Torture is not a partisan issue, folks. Get a grip. This is pathetic. What a bunch of fools. Waterboarding is not torture. I'm not going to rehash 25 pages of argument with you, other than to say, YES. It IS. By the definition of torture that WE, the USA, foisted upon the rest of the world, it is torture. In fact, that's WHY we do it to some of our servicemembers - because they may face similar torture overseas if captured.", 
        "intTime": 20090509, 
        "postID": 19, 
        "quote": "Originally posted by threerings: quote: Originally posted by Bleah: quote: Originally posted by mcgreer: Fine. I don't care who gets taken down for it. Torture is torture. It's against the law in the United States of America, and all the noise about it has once again suckered the susceptible into thinking that it's okay under certain circumstances. It's really disheartening to see how easily so many Americans can be swayed. People will go along with anything... This is a crucial point in our nation's history where we have to understand that our choices will cause us to either fail or succeed as a society, and we can't even focus on what the problems are. You can talk about this Democrat/Republican/conservative/liberal nonsense all you want - it gets us nowhere. Perfect post. I have nothing to add to this. Torture is not a partisan issue, folks. Get a grip. This is pathetic. What a bunch of fools. Waterboarding is not torture.", 
        "reply": " I'm not going to rehash 25 pages of argument with you, other than to say, YES. It IS. By the definition of torture that WE, the USA, foisted upon the rest of the world, it is torture. In fact, that's WHY we do it to some of our servicemembers - because they may face similar torture overseas if captured.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 09:36:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "Bleah"
    }, 
    {
        "content": "Pelosi and Congress was informed of enhanced interrogations in 2002! That is why Obama does not want prosecutions...the present AG under Obama, Eric Holder was the US Deputy Attorney General under Clinton and Bush...until he left in 01.... Politics has strange bedfellows or we are being conned!", 
        "intTime": 20090509, 
        "postID": 20, 
        "quote": "", 
        "reply": "Pelosi and Congress was informed of enhanced interrogations in 2002! That is why Obama does not want prosecutions...the present AG under Obama, Eric Holder was the US Deputy Attorney General under Clinton and Bush...until he left in 01.... Politics has strange bedfellows or we are being conned!", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 11:31:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: If you want her to go down for it then Bushie has to answer for the same...... Be careful what you wish for, you just might get it. I could care less as long as ALL of those involved are brought to justice. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 21, 
        "quote": "Originally posted by mmulder67: If you want her to go down for it then Bushie has to answer for the same...... Be careful what you wish for, you just might get it.", 
        "reply": " I could care less as long as ALL of those involved are brought to justice. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 11:48:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "L0A1"
    }, 
    {
        "content": "This isn't a right vs left issue, it's a right vs wrong issue. It gets right to the heart of what makes most of us proud to be Americans - it's about honor and commitment. The plain truth is that torture is wrong and it is against our laws and international treaties we are bound by. Using euphemisms for torture and splitting legal hairs in no way alter that basic truth. I want this fully investigated, and let the chips fall where they will. Anyone who was involved in planning, approving, and implementing these torture policies should be made to answer for their actions, no matter what their party affiliation. If there are no consequences this will undoubtedly happen again. IMO purely partisan retribution will not serve this country well. Any accounting will be a sham unless it is applied evenly across party lines.", 
        "intTime": 20090509, 
        "postID": 22, 
        "quote": "", 
        "reply": "This isn't a right vs left issue, it's a right vs wrong issue. It gets right to the heart of what makes most of us proud to be Americans - it's about honor and commitment. The plain truth is that torture is wrong and it is against our laws and international treaties we are bound by. Using euphemisms for torture and splitting legal hairs in no way alter that basic truth. I want this fully investigated, and let the chips fall where they will. Anyone who was involved in planning, approving, and implementing these torture policies should be made to answer for their actions, no matter what their party affiliation. If there are no consequences this will undoubtedly happen again. IMO purely partisan retribution will not serve this country well. Any accounting will be a sham unless it is applied evenly across party lines.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 12:10:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "Indeed , it is about right and wrong. Here are a few examples of \"Wrong\". \"\"http://www.husseinandterror.com/ \"\"http://www.youtube.com/watch?v=y65U6i6XYqc \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk \"\"http://www.youtube.com/watch?v=mwR51TtfIIk&feature=PlayList&p=6BE072E889FDEF0B&index=33&playnext=2&playnext_from=PL All the while pretending there is a moral equilivence between this shown on youtube and the form of warerboarding used in training of AMERICAN soldiers is somehow the same as the Japanseese water torture of the WW2 era. The similarity beginds and ends with the fact thaT WATER is involved in both.", 
        "intTime": 20090509, 
        "postID": 23, 
        "quote": "", 
        "reply": "Indeed , it is about right and wrong. Here are a few examples of \"Wrong\". \"\"http://www.husseinandterror.com/ \"\"http://www.youtube.com/watch?v=y65U6i6XYqc \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk \"\"http://www.youtube.com/watch?v=mwR51TtfIIk&feature=PlayList&p=6BE072E889FDEF0B&index=33&playnext=2&playnext_from=PL All the while pretending there is a moral equilivence between this shown on youtube and the form of warerboarding used in training of AMERICAN soldiers is somehow the same as the Japanseese water torture of the WW2 era. The similarity beginds and ends with the fact thaT WATER is involved in both.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 13:38:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Indeed , it is about right and wrong. Here are a few examples of \"Wrong\". \"\"http://www.husseinandterror.com/ \"\"http://www.youtube.com/watch?v=y65U6i6XYqc \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk \"\"http://www.youtube.com/watch?v=mwR51TtfIIk&feature=PlayList&p=6BE072E889FDEF0B&index=33&playnext=2&playnext_from=PL All the while pretending there is a moral equilivence between this shown on youtube and the form of warerboarding used in training of AMERICAN soldiers is somehow the same as the Japanseese water torture of the WW2 era. The similarity beginds and ends with the fact thaT WATER is involved in both. Your reliance on strawmen shows you just don't get it. It's not about terrorists or your thoroughly disproven links between Saddam & OBL. It's about America and we're better than that, or at least we were.", 
        "intTime": 20090509, 
        "postID": 24, 
        "quote": "Originally posted by peter3_1: Indeed , it is about right and wrong. Here are a few examples of \"Wrong\". \"\"http://www.husseinandterror.com/ \"\"http://www.youtube.com/watch?v=y65U6i6XYqc \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk \"\"http://www.youtube.com/watch?v=mwR51TtfIIk&feature=PlayList&p=6BE072E889FDEF0B&index=33&playnext=2&playnext_from=PL All the while pretending there is a moral equilivence between this shown on youtube and the form of warerboarding used in training of AMERICAN soldiers is somehow the same as the Japanseese water torture of the WW2 era. The similarity beginds and ends with the fact thaT WATER is involved in both.", 
        "reply": " Your reliance on strawmen shows you just don't get it. It's not about terrorists or your thoroughly disproven links between Saddam & OBL. It's about America and we're better than that, or at least we were.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 14:28:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by peter3_1: Indeed , it is about right and wrong. Here are a few examples of \"Wrong\". \"\"http://www.husseinandterror.com/ \"\"http://www.youtube.com/watch?v=y65U6i6XYqc \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk \"\"http://www.youtube.com/watch?v=mwR51TtfIIk&feature=PlayList&p=6BE072E889FDEF0B&index=33&playnext=2&playnext_from=PL All the while pretending there is a moral equilivence between this shown on youtube and the form of warerboarding used in training of AMERICAN soldiers is somehow the same as the Japanseese water torture of the WW2 era. The similarity beginds and ends with the fact thaT WATER is involved in both. Your reliance on strawmen shows you just don't get it. It's not about terrorists or your thoroughly disproven links between Saddam & OBL. It's about America and we're better than that, or at least we were. I disagree – the STRAWMAN is this fallacious notion that simply because “WE” used enhanced techniques – tightly controlled and administered by “professionals” that we somehow lost our moral compass… I mean, honestly… what kind of logic is that? Guilt manipulation is somewhat tiring after a while… It has absolutely NOTHING to do with a freaking popularity contest. It is absurd to assert the United States of America has lowered her standards simply because she will use whatever means necessary to protect her citizens. Leaping to hyper-exaggerations implying as if we regularly practice heinous torture techniques upon any & all – at random – is kind-a absurd. First of all – it is quite an exaggeration to simply “proclaim” we were “torturing” as if it were a hobby and done for the hell of it. The insinuation is a disingenuous and a disservice to our country and it is implied every time the subject broached. It’s as if there was some special torture HD channel setup so all Americans get their blood-lust fix… Secondly – the techniques used are subjective at best and one would think that SHOULD probably be the norm within THOSE particular circumstances. I mean honestly, isn’t the idea to portray - whatever is necessary will be done – while NOT telling them it only goes up to the “infamous” imaginary line? When untold lives may be at risk there are times when innovative techniques may be required. Or should we hand out torture preparation booklets for the enemy so they can train and be ready? Thirdly, regardless “what” we do to this enemy (short of extermination) – they will continue coming until they kill, maim, and destroy all infidels. This is not an enemy seeking to conquer, riches, or territory. They seek only to kill & destroy. Do you think if we’re nice to them they’ll be nice to us – maybe only take out ONE building next time..? Finally, it is disingenuous and absurd to assert that “AMERICA” is somehow lesser than because we are forced to use such tactics that this enemy seems to comprehend. Maybe Nancy, Harry, and Kerry, could fly over and talk with those dysfunctional misunderstood boys. Maybe Obama could fly over and do some type of BLAME AMERICA TOUR throughout the ME… He seems to be good at that… The rationale behind this schism is WRONG! If they did nothing and we were attacked in LA killing thousands more people, this same crowd would screaming CRUCIFY HIM – CRUCIFY HIM! When those at GITMO are finally released – and this nation is attacked by one or two of them – who will you blame – Bush for making them mad – or – Obama for releasing them? Kind-a funny how Nancy & Reid swore they end the war in Iraq and bring our soldiers home – 2005 – and golly-gee we’re still there… Hypocrisy in this instance – regarding the lying democrats claiming Bush & Cheney should prosecuted for “torturing” when all along those lying hypocrites thought that because those meetings were classified NO ONE would find out about them… Bush did what he did because he was trying to do whatever possible to protect us. So, can ANYONE tell me why NANCY and fellow LIARS allowed the TORTURING? And please, don’t claim it isn’t clear if she knew about it – WE ALL KNOW SHE and the rest KNEW ALL ALONG… What does that say about THEM? Lying to your face – swearing Bush is so freaking evil – then all along she is pandering and calculatingly deceiving the AMERICAN PEOPLE… THAT is more heinous than ANYTHING Bush has even been FALSELY ACCUSED of doing… Why?", 
        "intTime": 20090509, 
        "postID": 25, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by peter3_1: Indeed , it is about right and wrong. Here are a few examples of \"Wrong\". \"\"http://www.husseinandterror.com/ \"\"http://www.youtube.com/watch?v=y65U6i6XYqc \"\"http://www.youtube.com/watch?v=bh2ee2Vciwk \"\"http://www.youtube.com/watch?v=mwR51TtfIIk&feature=PlayList&p=6BE072E889FDEF0B&index=33&playnext=2&playnext_from=PL All the while pretending there is a moral equilivence between this shown on youtube and the form of warerboarding used in training of AMERICAN soldiers is somehow the same as the Japanseese water torture of the WW2 era. The similarity beginds and ends with the fact thaT WATER is involved in both. Your reliance on strawmen shows you just don't get it. It's not about terrorists or your thoroughly disproven links between Saddam & OBL. It's about America and we're better than that, or at least we were.", 
        "reply": " I disagree – the STRAWMAN is this fallacious notion that simply because “WE” used enhanced techniques – tightly controlled and administered by “professionals” that we somehow lost our moral compass… I mean, honestly… what kind of logic is that? Guilt manipulation is somewhat tiring after a while… It has absolutely NOTHING to do with a freaking popularity contest. It is absurd to assert the United States of America has lowered her standards simply because she will use whatever means necessary to protect her citizens. Leaping to hyper-exaggerations implying as if we regularly practice heinous torture techniques upon any & all – at random – is kind-a absurd. First of all – it is quite an exaggeration to simply “proclaim” we were “torturing” as if it were a hobby and done for the hell of it. The insinuation is a disingenuous and a disservice to our country and it is implied every time the subject broached. It’s as if there was some special torture HD channel setup so all Americans get their blood-lust fix… Secondly – the techniques used are subjective at best and one would think that SHOULD probably be the norm within THOSE particular circumstances. I mean honestly, isn’t the idea to portray - whatever is necessary will be done – while NOT telling them it only goes up to the “infamous” imaginary line? When untold lives may be at risk there are times when innovative techniques may be required. Or should we hand out torture preparation booklets for the enemy so they can train and be ready? Thirdly, regardless “what” we do to this enemy (short of extermination) – they will continue coming until they kill, maim, and destroy all infidels. This is not an enemy seeking to conquer, riches, or territory. They seek only to kill & destroy. Do you think if we’re nice to them they’ll be nice to us – maybe only take out ONE building next time..? Finally, it is disingenuous and absurd to assert that “AMERICA” is somehow lesser than because we are forced to use such tactics that this enemy seems to comprehend. Maybe Nancy, Harry, and Kerry, could fly over and talk with those dysfunctional misunderstood boys. Maybe Obama could fly over and do some type of BLAME AMERICA TOUR throughout the ME… He seems to be good at that… The rationale behind this schism is WRONG! If they did nothing and we were attacked in LA killing thousands more people, this same crowd would screaming CRUCIFY HIM – CRUCIFY HIM! When those at GITMO are finally released – and this nation is attacked by one or two of them – who will you blame – Bush for making them mad – or – Obama for releasing them? Kind-a funny how Nancy & Reid swore they end the war in Iraq and bring our soldiers home – 2005 – and golly-gee we’re still there… Hypocrisy in this instance – regarding the lying democrats claiming Bush & Cheney should prosecuted for “torturing” when all along those lying hypocrites thought that because those meetings were classified NO ONE would find out about them… Bush did what he did because he was trying to do whatever possible to protect us. So, can ANYONE tell me why NANCY and fellow LIARS allowed the TORTURING? And please, don’t claim it isn’t clear if she knew about it – WE ALL KNOW SHE and the rest KNEW ALL ALONG… What does that say about THEM? Lying to your face – swearing Bush is so freaking evil – then all along she is pandering and calculatingly deceiving the AMERICAN PEOPLE… THAT is more heinous than ANYTHING Bush has even been FALSELY ACCUSED of doing… Why?", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 15:56:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: I don't want her impeached, just to admit that she did wrong and apologize to the Nation. No need to be that harsh, I would settle for drawing and quartering.", 
        "intTime": 20090509, 
        "postID": 26, 
        "quote": "Originally posted by klassylady25: I don't want her impeached, just to admit that she did wrong and apologize to the Nation.", 
        "reply": " No need to be that harsh, I would settle for drawing and quartering.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 16:33:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: I disagree – the STRAWMAN is this fallacious notion that simply because “WE” used enhanced techniques – tightly controlled and administered by “professionals” that we somehow lost our moral compass… I mean, honestly… what kind of logic is that? Guilt manipulation is somewhat tiring after a while… It has absolutely NOTHING to do with a freaking popularity contest. It is absurd to assert the United States of America has lowered her standards simply because she will use whatever means necessary to protect her citizens. Leaping to hyper-exaggerations implying as if we regularly practice heinous torture techniques upon any & all – at random – is kind-a absurd. Actually, we are defined by the moral choices we make as well as the ones we allow others to make for us. The real question here is how to define torture, and whether or not the assorted \"enhanced techniques\" count. It does not speak well for us that the vast majority of our allies think so, and that we also decried similar techniques when used on US personnel in the past. It also legititmatizes these techniques - while hard-core terrorists had already moved past this level, there are a whole host of opportunities for lesser baddies (and other governments) to skip these in on us now. The issue of it having been \"tightly controlled and administered by professionals\" is meaningless - we allowed it, it was our elected officials acting on our behalf. Whatever there sins are, high or low, we share them. quote: Originally posted by GlassOnion: First of all – it is quite an exaggeration to simply “proclaim” we were “torturing” as if it were a hobby and done for the hell of it. The insinuation is a disingenuous and a disservice to our country and it is implied every time the subject broached. It’s as if there was some special torture HD channel setup so all Americans get their blood-lust fix… The word \"torture\" applies for several different motivations. While I think most would agree that a sadist doing it for fun is worse, we don't get to call what we did something else just because we didn't do it for kicks. Further, proclaiming we DIDN'T do it for kicks is almost certainly a little false - I would be quite surprised if the interrogators did not find it a little satisfying. Rage and anger was natural after 9/11 - but that didn't make it right. quote: Originally posted by GlassOnion: Secondly – the techniques used are subjective at best and one would think that SHOULD probably be the norm within THOSE particular circumstances. I mean honestly, isn’t the idea to portray - whatever is necessary will be done – while NOT telling them it only goes up to the “infamous” imaginary line? When untold lives may be at risk there are times when innovative techniques may be required. Or should we hand out torture preparation booklets for the enemy so they can train and be ready? No, it is not to our advantage to have that information out in the open. As you said, it provides our enemies with a standard against which to prepare. But just as people in court must expose there secret finances and affairs, so too did we need to expose our operations in the court of public opinion. We sacrificed that advantage in an attempt to regain standing with our allies at home and abroad. Feel free to disagree with that decision - there is no answer that does not cost us something important. quote: Originally posted by GlassOnion: Thirdly, regardless “what” we do to this enemy (short of extermination) – they will continue coming until they kill, maim, and destroy all infidels. This is not an enemy seeking to conquer, riches, or territory. They seek only to kill & destroy. Do you think if we’re nice to them they’ll be nice to us – maybe only take out ONE building next time..? Well, as usual the answer is not black and white. There are terrorists and other enemies who will only be stopped by extensive high-velocity lead therapy. But they are supported by a hundred times as many who can be swayed, or who are merely desperate. Too heavy a hand creates more of this lesser rank than we can handle, just as too light a hand gives the Osama's of the world free rein. Remember too that the Generals on the ground in Iraq and Afghanistan have stated over and over again that we cannot win the war on terror (I hate that phrase) through military action - military can only provide the calm needed for social and civic programs to make the actual progress. quote: Originally posted by GlassOnion: Finally, it is disingenuous and absurd to assert that “AMERICA” is somehow lesser than because we are forced to use such tactics that this enemy seems to comprehend. Maybe Nancy, Harry, and Kerry, could fly over and talk with those dysfunctional misunderstood boys. Maybe Obama could fly over and do some type of BLAME AMERICA TOUR throughout the ME… He seems to be good at that… The rationale behind this schism is WRONG! If they did nothing and we were attacked in LA killing thousands more people, this same crowd would screaming CRUCIFY HIM – CRUCIFY HIM! When those at GITMO are finally released – and this nation is attacked by one or two of them – who will you blame – Bush for making them mad – or – Obama for releasing them? Kind-a funny how Nancy & Reid swore they end the war in Iraq and bring our soldiers home – 2005 – and golly-gee we’re still there… What is the exchange rate on our principles, then? Let's say that waterboarding prevented 10,000 American deaths - how many do I have to say were saved before I can REALLY torture someone, the hard stuff, the pulling out fingernails and hooking their nuts up to a car battery? 100,000? If I say a million will be saved, am I allowed to draw and quarter? This is the problem. When you compromise your principles you become less. There are times when you have to choose between the lesser of two evils, but when that happens you must still admit that the choices were evil. Being lesser does not make it good. quote: Originally posted by GlassOnion: Hypocrisy in this instance – regarding the lying democrats claiming Bush & Cheney should prosecuted for “torturing” when all along those lying hypocrites thought that because those meetings were classified NO ONE would find out about them… Bush did what he did because he was trying to do whatever possible to protect us. So, can ANYONE tell me why NANCY and fellow LIARS allowed the TORTURING? And please, don’t claim it isn’t clear if she knew about it – WE ALL KNOW SHE and the rest KNEW ALL ALONG… What does that say about THEM? Lying to your face – swearing Bush is so freaking evil – then all along she is pandering and calculatingly deceiving the AMERICAN PEOPLE… THAT is more heinous than ANYTHING Bush has even been FALSELY ACCUSED of doing… Why? I almost agree with you here - I have never seen anything to indicate that politicians have any great moral compass, and they doubtless cared more for their careers than for such vagaries as morality. If it was torture, let them all face the music. Bush's crew who made it happen, and Pelosi's crew who let it happen and then cried murder. We cannot blame one and not the other, although both the White House and Congress make sure that such allegations can never be more than \"he said - she said\" - nothing will ever be proven one way or the other. But your assertion that we can go after Pelosi criminally for being morally vacant is faulty. The most we can do to a politician for being slimy is re-elect them. Just like we always do.", 
        "intTime": 20090509, 
        "postID": 27, 
        "quote": "Originally posted by GlassOnion: I disagree – the STRAWMAN is this fallacious notion that simply because “WE” used enhanced techniques – tightly controlled and administered by “professionals” that we somehow lost our moral compass… I mean, honestly… what kind of logic is that? Guilt manipulation is somewhat tiring after a while… It has absolutely NOTHING to do with a freaking popularity contest. It is absurd to assert the United States of America has lowered her standards simply because she will use whatever means necessary to protect her citizens. Leaping to hyper-exaggerations implying as if we regularly practice heinous torture techniques upon any & all – at random – is kind-a absurd.", 
        "reply": " Actually, we are defined by the moral choices we make as well as the ones we allow others to make for us. The real question here is how to define torture, and whether or not the assorted \"enhanced techniques\" count. It does not speak well for us that the vast majority of our allies think so, and that we also decried similar techniques when used on US personnel in the past. It also legititmatizes these techniques - while hard-core terrorists had already moved past this level, there are a whole host of opportunities for lesser baddies (and other governments) to skip these in on us now. The issue of it having been \"tightly controlled and administered by professionals\" is meaningless - we allowed it, it was our elected officials acting on our behalf. Whatever there sins are, high or low, we share them. quote: Originally posted by GlassOnion: First of all – it is quite an exaggeration to simply “proclaim” we were “torturing” as if it were a hobby and done for the hell of it. The insinuation is a disingenuous and a disservice to our country and it is implied every time the subject broached. It’s as if there was some special torture HD channel setup so all Americans get their blood-lust fix… The word \"torture\" applies for several different motivations. While I think most would agree that a sadist doing it for fun is worse, we don't get to call what we did something else just because we didn't do it for kicks. Further, proclaiming we DIDN'T do it for kicks is almost certainly a little false - I would be quite surprised if the interrogators did not find it a little satisfying. Rage and anger was natural after 9/11 - but that didn't make it right. quote: Originally posted by GlassOnion: Secondly – the techniques used are subjective at best and one would think that SHOULD probably be the norm within THOSE particular circumstances. I mean honestly, isn’t the idea to portray - whatever is necessary will be done – while NOT telling them it only goes up to the “infamous” imaginary line? When untold lives may be at risk there are times when innovative techniques may be required. Or should we hand out torture preparation booklets for the enemy so they can train and be ready? No, it is not to our advantage to have that information out in the open. As you said, it provides our enemies with a standard against which to prepare. But just as people in court must expose there secret finances and affairs, so too did we need to expose our operations in the court of public opinion. We sacrificed that advantage in an attempt to regain standing with our allies at home and abroad. Feel free to disagree with that decision - there is no answer that does not cost us something important. quote: Originally posted by GlassOnion: Thirdly, regardless “what” we do to this enemy (short of extermination) – they will continue coming until they kill, maim, and destroy all infidels. This is not an enemy seeking to conquer, riches, or territory. They seek only to kill & destroy. Do you think if we’re nice to them they’ll be nice to us – maybe only take out ONE building next time..? Well, as usual the answer is not black and white. There are terrorists and other enemies who will only be stopped by extensive high-velocity lead therapy. But they are supported by a hundred times as many who can be swayed, or who are merely desperate. Too heavy a hand creates more of this lesser rank than we can handle, just as too light a hand gives the Osama's of the world free rein. Remember too that the Generals on the ground in Iraq and Afghanistan have stated over and over again that we cannot win the war on terror (I hate that phrase) through military action - military can only provide the calm needed for social and civic programs to make the actual progress. quote: Originally posted by GlassOnion: Finally, it is disingenuous and absurd to assert that “AMERICA” is somehow lesser than because we are forced to use such tactics that this enemy seems to comprehend. Maybe Nancy, Harry, and Kerry, could fly over and talk with those dysfunctional misunderstood boys. Maybe Obama could fly over and do some type of BLAME AMERICA TOUR throughout the ME… He seems to be good at that… The rationale behind this schism is WRONG! If they did nothing and we were attacked in LA killing thousands more people, this same crowd would screaming CRUCIFY HIM – CRUCIFY HIM! When those at GITMO are finally released – and this nation is attacked by one or two of them – who will you blame – Bush for making them mad – or – Obama for releasing them? Kind-a funny how Nancy & Reid swore they end the war in Iraq and bring our soldiers home – 2005 – and golly-gee we’re still there… What is the exchange rate on our principles, then? Let's say that waterboarding prevented 10,000 American deaths - how many do I have to say were saved before I can REALLY torture someone, the hard stuff, the pulling out fingernails and hooking their nuts up to a car battery? 100,000? If I say a million will be saved, am I allowed to draw and quarter? This is the problem. When you compromise your principles you become less. There are times when you have to choose between the lesser of two evils, but when that happens you must still admit that the choices were evil. Being lesser does not make it good. quote: Originally posted by GlassOnion: Hypocrisy in this instance – regarding the lying democrats claiming Bush & Cheney should prosecuted for “torturing” when all along those lying hypocrites thought that because those meetings were classified NO ONE would find out about them… Bush did what he did because he was trying to do whatever possible to protect us. So, can ANYONE tell me why NANCY and fellow LIARS allowed the TORTURING? And please, don’t claim it isn’t clear if she knew about it – WE ALL KNOW SHE and the rest KNEW ALL ALONG… What does that say about THEM? Lying to your face – swearing Bush is so freaking evil – then all along she is pandering and calculatingly deceiving the AMERICAN PEOPLE… THAT is more heinous than ANYTHING Bush has even been FALSELY ACCUSED of doing… Why? I almost agree with you here - I have never seen anything to indicate that politicians have any great moral compass, and they doubtless cared more for their careers than for such vagaries as morality. If it was torture, let them all face the music. Bush's crew who made it happen, and Pelosi's crew who let it happen and then cried murder. We cannot blame one and not the other, although both the White House and Congress make sure that such allegations can never be more than \"he said - she said\" - nothing will ever be proven one way or the other. But your assertion that we can go after Pelosi criminally for being morally vacant is faulty. The most we can do to a politician for being slimy is re-elect them. Just like we always do.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 16:53:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: Actually, we are defined by the moral choices we make as well as the ones we allow others to make for us. The real question here is how to define torture, and whether or not the assorted \"enhanced techniques\" count. It does not speak well for us that the vast majority of our allies think so, and that we also decried similar techniques when used on US personnel in the past. It also legititmatizes these techniques - while hard-core terrorists had already moved past this level, there are a whole host of opportunities for lesser baddies (and other governments) to skip these in on us now. The issue of it having been \"tightly controlled and administered by professionals\" is meaningless - we allowed it, it was our elected officials acting on our behalf. Whatever there sins are, high or low, we share them. Morality – Jihadist – Morality – Terrorist – have you ever heard of a MORAL terrorist? Do you know the difference between those we are fighting now from when we attacked Saddam? Do you believe there is a difference? Who do we negotiate with to arrange their surrender? What depot do we bomb to remove their weaponry? Who is that new neighbor down the street driving by taking pictures of the schools, bridges, and government buildings..? Morality sure seems mysterious these days. Rule number ONE! - A DEAD society is NOT a MORAL society and has NO NEED FOR MORALS…! A moral society is a DEAD SOCIETY if it ever attempts or believes it can wage a MORAL WAR! WAR is NOT MORAL! The conclusion to such rationale means, - a solider is a murderer while taking out the enemy… a policeman is a murderer when he takes out the bank robber… a father should be sentenced to life in prison for defending his family from the murderous intruder..? Seems to me society is able to reconcile the difference between those circumstances – otherwise all of the above would be guilty of immoral murder. So, let’s take it down a notch – say we have a group of known terrorists… they are sentenced to life in prison – Nancy’s daughter takes over her mom’s thrown and declares – life in prison is inhumane – it is an indirect form of torture… therefore we should NOT hold human species in confined areas for more than one year… It is after-all a “moral” choice – it might be a ******* moral choice but it is a moral choice – so, where do you draw that line. Does that mean then that we’ve reached the pinnacle of morality if we could just learn that shooting back at terrorists is also torture – because after all – if the subjective opinion were left up to a true/blue pacifist – it is “immoral” to return violence with violence… or are you saying “your” morals are better than the pacifist’s morals? Allies – MOST of our ALLIES would have REALLY TORTURED them. Again your logic is flawed – to accept what you are saying means that – if a policeman takes out the bank robber – shoots him dead because he refused to throw down his weapon – your logic is – that policeman should be removed from service because he/she are so “tainted” by killing the first person – they can no longer restrain themselves from drawing their weapon at every bank robbery – in fact, it is progressive so eventually, that cop will start shooting people for speeding… You may not agree BUT THAT is what you are saying…! If we went to war with Iran tomorrow, do you think our military would immediately start grabbing the Iranian prisoners and torturing them? Suppose it was Russia – do you think we’d just start torturing Russian soldiers…? I don’t think so… Comparing what we did – and the effort that went into “assuring” minimum long term damage – to what Saddam or al Qaeda have done - is ridiculous! If you can’t tell the difference than THAT is exactly WHY the public shouldn’t KNOW some of the necessary ugly things are done. I saw a clip a few years ago of an insurgent running straight towards an Abrams with a grenade launcher - I’m not sure WHAT they shot him with – the clip shows him running straight up the dirt road directly at the tank – the gunner shot in front of him – I assume hoping the knucklehead would STOP… Sadly, he kept coming and trying to get the grenade launcher ready – I don’t know what they shot him with but what I distinctly remember was watching his torso and legs still running forward – but there was NO BODY attached… Our guys DID the RIGHT THING – was it moral – YES… IS THAT MORAL – NO! Do you understand the difference? quote: Originally posted by cosmicfish: The word \"torture\" applies for several different motivations. While I think most would agree that a sadist doing it for fun is worse, we don't get to call what we did something else just because we didn't do it for kicks. Further, proclaiming we DIDN'T do it for kicks is almost certainly a little false - I would be quite surprised if the interrogators did not find it a little satisfying. Rage and anger was natural after 9/11 - but that didn't make it right. I won’t even comment on that – I trust our military men & women to be the best in the world. Do we screw up – YEP – but I am NOT going to second guess them. They are professional enough to handle their own problems. Have you ever had a gun stuck in your face by some half-twisted nit-wit? quote: Originally posted by cosmicfish: No, it is not to our advantage to have that information out in the open. As you said, it provides our enemies with a standard against which to prepare. But just as people in court must expose there secret finances and affairs, so too did we need to expose our operations in the court of public opinion. We sacrificed that advantage in an attempt to regain standing with our allies at home and abroad. Feel free to disagree with that decision - there is no answer that does not cost us something important. Kind-a strange how the democrats REPEATEDLY – ANNOUNCED every DETAIL to the enemy OVER & OVER & OVER – proclaiming to the world our soldiers were torturers, malcontents, liars, thieves, rapists, undisciplined thugs, - NANCY – HILLARY – HARRY – SCHUMER – DURBIN – MURTHA – FIENGOLD – LEVIN – and the list goes on… but I could never figure out why the WAITED AN ENTIRE YEAR AFTER our military was investigating the problems – already disciplined some – but the DEMOCRATS couldn’t help themselves – overcome by moral confession I guess – they announced to everywhere they went. In fact, I still think some carry pictures in the wallet – just in case a camera shows up – LOOK – LOOK what OUR SOLDIERS DID – but BUSH MADE THEM DO IT… and people want to talk about MORALS? quote: Originally posted by cosmicfish: Well, as usual the answer is not black and white. There are terrorists and other enemies who will only be stopped by extensive high-velocity lead therapy. But they are supported by a hundred times as many who can be swayed, or who are merely desperate. Too heavy a hand creates more of this lesser rank than we can handle, just as too light a hand gives the Osama's of the world free rein. Remember too that the Generals on the ground in Iraq and Afghanistan have stated over and over again that we cannot win the war on terror (I hate that phrase) through military action - military can only provide the calm needed for social and civic programs to make the actual progress. I like that “high velocity lead therapy” … that’s a good saying… I agree it is NOT black & white – if we can’t trust our military to make the right decisions regarding this then we sure as hell should NOT trust them with a freaking gun! You make it way to complicated for folks to comprehend. We SHOOT TO KILL and we SHOOT ALL who SHOOT AT US… Do you know that many Iraqis were “laughing” at what they heard had happened at Abu Garb – sure there were some things gone too far – I used to have several clips from a young Iraq guy who was making small short films and the folks he talked with chuckled at those being held… THEY WERE KILLING THEIR KIDS – they didn’t give a rats-a$$ about what we did with them – until our DEMOCRAT SENATORS made sure the WORLD knew it. quote: Originally posted by cosmicfish: What is the exchange rate on our principles, then? Let's say that waterboarding prevented 10,000 American deaths - how many do I have to say were saved before I can REALLY torture someone, the hard stuff, the pulling out fingernails and hooking their nuts up to a car battery? 100,000? If I say a million will be saved, am I allowed to draw and quarter? This is the problem. When you compromise your principles you become less. There are times when you have to choose between the lesser of two evils, but when that happens you must still admit that the choices were evil. Being lesser does not make it good. Exchange Rate – THAT is the POINT – the exchange rate is always on a sliding scale – there are times when extreme circumstances require extreme measures. It is NOT my job to second guess our men & women in uniform – without FIRST allowing their leaders to handle the situation. Principle – are you telling me that water-boarding some terrorist is WORSE than saving 10k LIVES? That really isn’t a problem – DON’T DO IT – take a walk while others take care of business… Let me ask you something – this isn’t meant to be offensive – but has it occurred to you that maybe you’re being a little “self-righteous” about this “torture” stuff… Truthfully, why do you think those who proclaim these methods are evil NO MATTER WHAT – doesn’t that sound a bit arrogant? The problem is NOT if we compromise – come-on – how many nukes have we dropped since Japan… Compromise – seriously – 10-thousand TERRORISTS are worth life of ONE INNOCENT Iraqi or American citizen – NOT ONE. Call it compromise – call it whatever you want.", 
        "intTime": 20090509, 
        "postID": 28, 
        "quote": "Originally posted by cosmicfish: Actually, we are defined by the moral choices we make as well as the ones we allow others to make for us. The real question here is how to define torture, and whether or not the assorted \"enhanced techniques\" count. It does not speak well for us that the vast majority of our allies think so, and that we also decried similar techniques when used on US personnel in the past. It also legititmatizes these techniques - while hard-core terrorists had already moved past this level, there are a whole host of opportunities for lesser baddies (and other governments) to skip these in on us now. The issue of it having been \"tightly controlled and administered by professionals\" is meaningless - we allowed it, it was our elected officials acting on our behalf. Whatever there sins are, high or low, we share them.", 
        "reply": " Morality – Jihadist – Morality – Terrorist – have you ever heard of a MORAL terrorist? Do you know the difference between those we are fighting now from when we attacked Saddam? Do you believe there is a difference? Who do we negotiate with to arrange their surrender? What depot do we bomb to remove their weaponry? Who is that new neighbor down the street driving by taking pictures of the schools, bridges, and government buildings..? Morality sure seems mysterious these days. Rule number ONE! - A DEAD society is NOT a MORAL society and has NO NEED FOR MORALS…! A moral society is a DEAD SOCIETY if it ever attempts or believes it can wage a MORAL WAR! WAR is NOT MORAL! The conclusion to such rationale means, - a solider is a murderer while taking out the enemy… a policeman is a murderer when he takes out the bank robber… a father should be sentenced to life in prison for defending his family from the murderous intruder..? Seems to me society is able to reconcile the difference between those circumstances – otherwise all of the above would be guilty of immoral murder. So, let’s take it down a notch – say we have a group of known terrorists… they are sentenced to life in prison – Nancy’s daughter takes over her mom’s thrown and declares – life in prison is inhumane – it is an indirect form of torture… therefore we should NOT hold human species in confined areas for more than one year… It is after-all a “moral” choice – it might be a ******* moral choice but it is a moral choice – so, where do you draw that line. Does that mean then that we’ve reached the pinnacle of morality if we could just learn that shooting back at terrorists is also torture – because after all – if the subjective opinion were left up to a true/blue pacifist – it is “immoral” to return violence with violence… or are you saying “your” morals are better than the pacifist’s morals? Allies – MOST of our ALLIES would have REALLY TORTURED them. Again your logic is flawed – to accept what you are saying means that – if a policeman takes out the bank robber – shoots him dead because he refused to throw down his weapon – your logic is – that policeman should be removed from service because he/she are so “tainted” by killing the first person – they can no longer restrain themselves from drawing their weapon at every bank robbery – in fact, it is progressive so eventually, that cop will start shooting people for speeding… You may not agree BUT THAT is what you are saying…! If we went to war with Iran tomorrow, do you think our military would immediately start grabbing the Iranian prisoners and torturing them? Suppose it was Russia – do you think we’d just start torturing Russian soldiers…? I don’t think so… Comparing what we did – and the effort that went into “assuring” minimum long term damage – to what Saddam or al Qaeda have done - is ridiculous! If you can’t tell the difference than THAT is exactly WHY the public shouldn’t KNOW some of the necessary ugly things are done. I saw a clip a few years ago of an insurgent running straight towards an Abrams with a grenade launcher - I’m not sure WHAT they shot him with – the clip shows him running straight up the dirt road directly at the tank – the gunner shot in front of him – I assume hoping the knucklehead would STOP… Sadly, he kept coming and trying to get the grenade launcher ready – I don’t know what they shot him with but what I distinctly remember was watching his torso and legs still running forward – but there was NO BODY attached… Our guys DID the RIGHT THING – was it moral – YES… IS THAT MORAL – NO! Do you understand the difference? quote: Originally posted by cosmicfish: The word \"torture\" applies for several different motivations. While I think most would agree that a sadist doing it for fun is worse, we don't get to call what we did something else just because we didn't do it for kicks. Further, proclaiming we DIDN'T do it for kicks is almost certainly a little false - I would be quite surprised if the interrogators did not find it a little satisfying. Rage and anger was natural after 9/11 - but that didn't make it right. I won’t even comment on that – I trust our military men & women to be the best in the world. Do we screw up – YEP – but I am NOT going to second guess them. They are professional enough to handle their own problems. Have you ever had a gun stuck in your face by some half-twisted nit-wit? quote: Originally posted by cosmicfish: No, it is not to our advantage to have that information out in the open. As you said, it provides our enemies with a standard against which to prepare. But just as people in court must expose there secret finances and affairs, so too did we need to expose our operations in the court of public opinion. We sacrificed that advantage in an attempt to regain standing with our allies at home and abroad. Feel free to disagree with that decision - there is no answer that does not cost us something important. Kind-a strange how the democrats REPEATEDLY – ANNOUNCED every DETAIL to the enemy OVER & OVER & OVER – proclaiming to the world our soldiers were torturers, malcontents, liars, thieves, rapists, undisciplined thugs, - NANCY – HILLARY – HARRY – SCHUMER – DURBIN – MURTHA – FIENGOLD – LEVIN – and the list goes on… but I could never figure out why the WAITED AN ENTIRE YEAR AFTER our military was investigating the problems – already disciplined some – but the DEMOCRATS couldn’t help themselves – overcome by moral confession I guess – they announced to everywhere they went. In fact, I still think some carry pictures in the wallet – just in case a camera shows up – LOOK – LOOK what OUR SOLDIERS DID – but BUSH MADE THEM DO IT… and people want to talk about MORALS? quote: Originally posted by cosmicfish: Well, as usual the answer is not black and white. There are terrorists and other enemies who will only be stopped by extensive high-velocity lead therapy. But they are supported by a hundred times as many who can be swayed, or who are merely desperate. Too heavy a hand creates more of this lesser rank than we can handle, just as too light a hand gives the Osama's of the world free rein. Remember too that the Generals on the ground in Iraq and Afghanistan have stated over and over again that we cannot win the war on terror (I hate that phrase) through military action - military can only provide the calm needed for social and civic programs to make the actual progress. I like that “high velocity lead therapy” … that’s a good saying… I agree it is NOT black & white – if we can’t trust our military to make the right decisions regarding this then we sure as hell should NOT trust them with a freaking gun! You make it way to complicated for folks to comprehend. We SHOOT TO KILL and we SHOOT ALL who SHOOT AT US… Do you know that many Iraqis were “laughing” at what they heard had happened at Abu Garb – sure there were some things gone too far – I used to have several clips from a young Iraq guy who was making small short films and the folks he talked with chuckled at those being held… THEY WERE KILLING THEIR KIDS – they didn’t give a rats-a$$ about what we did with them – until our DEMOCRAT SENATORS made sure the WORLD knew it. quote: Originally posted by cosmicfish: What is the exchange rate on our principles, then? Let's say that waterboarding prevented 10,000 American deaths - how many do I have to say were saved before I can REALLY torture someone, the hard stuff, the pulling out fingernails and hooking their nuts up to a car battery? 100,000? If I say a million will be saved, am I allowed to draw and quarter? This is the problem. When you compromise your principles you become less. There are times when you have to choose between the lesser of two evils, but when that happens you must still admit that the choices were evil. Being lesser does not make it good. Exchange Rate – THAT is the POINT – the exchange rate is always on a sliding scale – there are times when extreme circumstances require extreme measures. It is NOT my job to second guess our men & women in uniform – without FIRST allowing their leaders to handle the situation. Principle – are you telling me that water-boarding some terrorist is WORSE than saving 10k LIVES? That really isn’t a problem – DON’T DO IT – take a walk while others take care of business… Let me ask you something – this isn’t meant to be offensive – but has it occurred to you that maybe you’re being a little “self-righteous” about this “torture” stuff… Truthfully, why do you think those who proclaim these methods are evil NO MATTER WHAT – doesn’t that sound a bit arrogant? The problem is NOT if we compromise – come-on – how many nukes have we dropped since Japan… Compromise – seriously – 10-thousand TERRORISTS are worth life of ONE INNOCENT Iraqi or American citizen – NOT ONE. Call it compromise – call it whatever you want.", 
        "threadID": "409192893_4840048222001", 
        "time": "2009-05-09 19:43:00", 
        "title": "IMPEACH PELOSI & THE OTHER DEMOCRATS WHO KNEW TORTURE WAS USED..", 
        "userID": "GlassOnion"
    }
]