[
    {
        "content": "An economics professor at Texas Tech said he had never failed a single student, but had once failed an entire class. The class (students) insisted that socialism worked since no one would be poor and no one would be rich, a great equalizer. The professor then said, \"OK, we will have an experiment in this class on socialism. All grades will be averaged and everyone will receive the same grade so no one will fail and no one will receive an A.\" After the first test the grades were averaged and everyone got a B. The students who had studied hard were upset while the students who had studied very little were happy. But, as the second test rolled around, the students who had studied little studied even less, and the ones who had studied hard decided that since they couldn't make an A, they also studied less. The second test average was a D. No one was happy. When the 3rd test rolled around the average grade was an F. The scores never increased as bickering, blame, name calling, all resulted in hard feelings and no one would study for anyone else. Misery was shared equally. To their great chagrin, all failed. The professor told them that socialism would ultimately fail in the same way. One has only to look at collectivist nations, before they begin to move toward reward of individual effort, to see how bad economies can become. The greater their reward, the more people will try to succeed (capitalism), but when a government takes more and more of the reward away, far fewer will try to succeed (socialism).", 
        "intTime": 20090330, 
        "postID": 1, 
        "quote": "", 
        "reply": "An economics professor at Texas Tech said he had never failed a single student, but had once failed an entire class. The class (students) insisted that socialism worked since no one would be poor and no one would be rich, a great equalizer. The professor then said, \"OK, we will have an experiment in this class on socialism. All grades will be averaged and everyone will receive the same grade so no one will fail and no one will receive an A.\" After the first test the grades were averaged and everyone got a B. The students who had studied hard were upset while the students who had studied very little were happy. But, as the second test rolled around, the students who had studied little studied even less, and the ones who had studied hard decided that since they couldn't make an A, they also studied less. The second test average was a D. No one was happy. When the 3rd test rolled around the average grade was an F. The scores never increased as bickering, blame, name calling, all resulted in hard feelings and no one would study for anyone else. Misery was shared equally. To their great chagrin, all failed. The professor told them that socialism would ultimately fail in the same way. One has only to look at collectivist nations, before they begin to move toward reward of individual effort, to see how bad economies can become. The greater their reward, the more people will try to succeed (capitalism), but when a government takes more and more of the reward away, far fewer will try to succeed (socialism).", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 11:55:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "RRR52"
    }, 
    {
        "content": "", 
        "intTime": 20090330, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 11:57:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by RRR52: An economics professor at Texas Tech said he had never failed a single student, but had once failed an entire class. The class (students) insisted that socialism worked since no one would be poor and no one would be rich, a great equalizer. The professor then said, \"OK, we will have an experiment in this class on socialism. All grades will be averaged and everyone will receive the same grade so no one will fail and no one will receive an A.\" After the first test the grades were averaged and everyone got a B. The students who had studied hard were upset while the students who had studied very little were happy. But, as the second test rolled around, the students who had studied little studied even less, and the ones who had studied hard decided that since they couldn't make an A, they also studied less. The second test average was a D. No one was happy. When the 3rd test rolled around the average grade was an F. The scores never increased as bickering, blame, name calling, all resulted in hard feelings and no one would study for anyone else. Misery was shared equally. To their great chagrin, all failed. The professor told them that socialism would ultimately fail in the same way. One has only to look at collectivist nations, before they begin to move toward reward of individual effort, to see how bad economies can become. The greater their reward, the more people will try to succeed (capitalism), but when a government takes more and more of the reward away, far fewer will try to succeed (socialism). Nice story, but no proof it ever happen. Have a link?", 
        "intTime": 20090330, 
        "postID": 3, 
        "quote": "Originally posted by RRR52: An economics professor at Texas Tech said he had never failed a single student, but had once failed an entire class. The class (students) insisted that socialism worked since no one would be poor and no one would be rich, a great equalizer. The professor then said, \"OK, we will have an experiment in this class on socialism. All grades will be averaged and everyone will receive the same grade so no one will fail and no one will receive an A.\" After the first test the grades were averaged and everyone got a B. The students who had studied hard were upset while the students who had studied very little were happy. But, as the second test rolled around, the students who had studied little studied even less, and the ones who had studied hard decided that since they couldn't make an A, they also studied less. The second test average was a D. No one was happy. When the 3rd test rolled around the average grade was an F. The scores never increased as bickering, blame, name calling, all resulted in hard feelings and no one would study for anyone else. Misery was shared equally. To their great chagrin, all failed. The professor told them that socialism would ultimately fail in the same way. One has only to look at collectivist nations, before they begin to move toward reward of individual effort, to see how bad economies can become. The greater their reward, the more people will try to succeed (capitalism), but when a government takes more and more of the reward away, far fewer will try to succeed (socialism).", 
        "reply": " Nice story, but no proof it ever happen. Have a link?", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 11:59:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "Tangler"
    }, 
    {
        "content": "Dear Steve: Thanks for writing me with your concerns about your daughter’s recent visit home from college. I don’t have a daughter but I can understand the concern you have after seeing such dramatic changes in her after just six months at a public university. After all, you didn’t save money for eighteen long years in order to pay someone to teach her to despise the values you taught for, well, eighteen long years. First of all, I want you to understand that many of the crazy ideas you hear your daughter espousing are commonplace on college campuses. Nonetheless, it must have been shocking for you to hear that she supported Barack Obama in the last election principally because of his ideas about “the redistribution of wealth.” I know you were also disappointed to hear of her sudden opposition to the War on Terror and her sudden embrace of the United Nations. Most of all, I know you are disappointed that she has stopped going to church altogether. Now that your daughter is not going to church it will be easier to get her to accept other policies based on economic and cultural Marxism. Socialist professors like the fact that average church attendance drops dramatically after just one year of college. God and socialism are simply incompatible. One cannot worship both Jesus Christ and Karl Marx. But there is good news, Steve. I think I can implement a program that will cure your daughter’s Socialist Teaching Disorder (STD) in just a few short days. In case you were wondering, I define STD as the sudden infatuation with socialism brought on by exposure to pro-socialist ideas without a corresponding exposure to anti-socialist ideas. Although not recognized by the APA, this emotional disorder is running rampant at American universities. The solution to your daughter’s STD is to be found in your decision to award her a sum of $4000 if she returns from her freshman year with a 3.5 GPA or above. Previously, you explained to me that you decided to do this for two reasons: 1) Your daughter had earned a $4000 scholarship, which meant you had the extra money, and 2) Your only son had gone to college five years ago and flunked out after one year. Now that your daughter has maintained a 3.6 GPA (so far) you are happy. But you are unhappy that you are about to reward her newfound love of socialism when you had only intended to reward her studiousness. I have a solution that involves three steps. If you follow these steps (in order) we’ll have this little problem cured in no time: 1. When your daughter returns from college in early May (presumably with a GPA over 3.5) I want you to tell her that you lied. Put simply, when she asks about her $4000 just tell her that you never really had any intention of delivering on your promises. This revelation will, no doubt, cause significant consternation and outrage. But when she protests, simply point out that her choice for president, Barack Obama, also lied to her. Note that his lies about earmarks and line-by-line analysis of the budget will probably end up costing her more than $4000. She might say, “But you’re my father.” If she does, respond by saying “But I’m not your president.” If things get too uncomfortable, just tell her the $4000 promise was technically “last year’s business.” 2. When your daughter has cooled down somewhat from the realization that her father is a confessed liar I want you to strike again. Since your son, now 23, still lives at home it will be possible for you to implement step two in the presence of both children. This step will involve simply taking out your wallet and writing a $2000 check to your son. This action will, no doubt, cause even more consternation and outrage for your daughter. She may well point out that her brother is unemployed. She may also point out that he has been in rehab twice and that he once punched you in the face while under the influence of drugs. But, when she protests, simply say that it was Barack Obama who taught you to reward failure. She may well say “But that’s half of the money I was supposed to get.” If so, point out that it is Barack Obama who would like to take other people’s money – at least half, if not more – and use much of it to reward bad behavior. By this time, she will probably hate socialism and the lesson will have saved you a lot of money. But, just in case the point is not yet made, there is a third step to my plan. And this is where I get actively involved. 3. I’m going to take your daughter and the remaining $2000 - in the form of one hundred $20 bills – to the “hood.” Specifically, I am going to take her to places where crack cocaine is sold here in Wilmington in the middle of the afternoon. This will include grocery stores and actual crack houses. Don’t worry about your daughter’s safety as I will be armed with a .357 magnum loaded with 145-grain silver tipped hollow point bullets. When I approach a crack head I will first ask whether he paid income taxes last year. If he says “no” I will hand him $20. If your daughter asks me why I give money to people who don’t pay taxes I’ll remind her that this is what President Obama does. Then I’ll ask her if she still believes in “spreading the wealth” without regard to individual merit. By the end of the afternoon, I can guarantee your daughter will be cured of her STD. Sorry if I sound overly optimistic, Steve. I got my optimism from the same place I got my love of capitalism. I learned it from Ronald Reagan, not Barack Obama.", 
        "intTime": 20090330, 
        "postID": 4, 
        "quote": "", 
        "reply": "Dear Steve: Thanks for writing me with your concerns about your daughter’s recent visit home from college. I don’t have a daughter but I can understand the concern you have after seeing such dramatic changes in her after just six months at a public university. After all, you didn’t save money for eighteen long years in order to pay someone to teach her to despise the values you taught for, well, eighteen long years. First of all, I want you to understand that many of the crazy ideas you hear your daughter espousing are commonplace on college campuses. Nonetheless, it must have been shocking for you to hear that she supported Barack Obama in the last election principally because of his ideas about “the redistribution of wealth.” I know you were also disappointed to hear of her sudden opposition to the War on Terror and her sudden embrace of the United Nations. Most of all, I know you are disappointed that she has stopped going to church altogether. Now that your daughter is not going to church it will be easier to get her to accept other policies based on economic and cultural Marxism. Socialist professors like the fact that average church attendance drops dramatically after just one year of college. God and socialism are simply incompatible. One cannot worship both Jesus Christ and Karl Marx. But there is good news, Steve. I think I can implement a program that will cure your daughter’s Socialist Teaching Disorder (STD) in just a few short days. In case you were wondering, I define STD as the sudden infatuation with socialism brought on by exposure to pro-socialist ideas without a corresponding exposure to anti-socialist ideas. Although not recognized by the APA, this emotional disorder is running rampant at American universities. The solution to your daughter’s STD is to be found in your decision to award her a sum of $4000 if she returns from her freshman year with a 3.5 GPA or above. Previously, you explained to me that you decided to do this for two reasons: 1) Your daughter had earned a $4000 scholarship, which meant you had the extra money, and 2) Your only son had gone to college five years ago and flunked out after one year. Now that your daughter has maintained a 3.6 GPA (so far) you are happy. But you are unhappy that you are about to reward her newfound love of socialism when you had only intended to reward her studiousness. I have a solution that involves three steps. If you follow these steps (in order) we’ll have this little problem cured in no time: 1. When your daughter returns from college in early May (presumably with a GPA over 3.5) I want you to tell her that you lied. Put simply, when she asks about her $4000 just tell her that you never really had any intention of delivering on your promises. This revelation will, no doubt, cause significant consternation and outrage. But when she protests, simply point out that her choice for president, Barack Obama, also lied to her. Note that his lies about earmarks and line-by-line analysis of the budget will probably end up costing her more than $4000. She might say, “But you’re my father.” If she does, respond by saying “But I’m not your president.” If things get too uncomfortable, just tell her the $4000 promise was technically “last year’s business.” 2. When your daughter has cooled down somewhat from the realization that her father is a confessed liar I want you to strike again. Since your son, now 23, still lives at home it will be possible for you to implement step two in the presence of both children. This step will involve simply taking out your wallet and writing a $2000 check to your son. This action will, no doubt, cause even more consternation and outrage for your daughter. She may well point out that her brother is unemployed. She may also point out that he has been in rehab twice and that he once punched you in the face while under the influence of drugs. But, when she protests, simply say that it was Barack Obama who taught you to reward failure. She may well say “But that’s half of the money I was supposed to get.” If so, point out that it is Barack Obama who would like to take other people’s money – at least half, if not more – and use much of it to reward bad behavior. By this time, she will probably hate socialism and the lesson will have saved you a lot of money. But, just in case the point is not yet made, there is a third step to my plan. And this is where I get actively involved. 3. I’m going to take your daughter and the remaining $2000 - in the form of one hundred $20 bills – to the “hood.” Specifically, I am going to take her to places where crack cocaine is sold here in Wilmington in the middle of the afternoon. This will include grocery stores and actual crack houses. Don’t worry about your daughter’s safety as I will be armed with a .357 magnum loaded with 145-grain silver tipped hollow point bullets. When I approach a crack head I will first ask whether he paid income taxes last year. If he says “no” I will hand him $20. If your daughter asks me why I give money to people who don’t pay taxes I’ll remind her that this is what President Obama does. Then I’ll ask her if she still believes in “spreading the wealth” without regard to individual merit. By the end of the afternoon, I can guarantee your daughter will be cured of her STD. Sorry if I sound overly optimistic, Steve. I got my optimism from the same place I got my love of capitalism. I learned it from Ronald Reagan, not Barack Obama.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 12:12:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: Dear Steve: Thanks for writing me with your concerns about your daughter’s recent visit home from college. I don’t have a daughter but I can understand the concern you have after seeing such dramatic changes in her after just six months at a public university. After all, you didn’t save money for eighteen long years in order to pay someone to teach her to despise the values you taught for, well, eighteen long years. First of all, I want you to understand that many of the crazy ideas you hear your daughter espousing are commonplace on college campuses. Nonetheless, it must have been shocking for you to hear that she supported Barack Obama in the last election principally because of his ideas about “the redistribution of wealth.” I know you were also disappointed to hear of her sudden opposition to the War on Terror and her sudden embrace of the United Nations. Most of all, I know you are disappointed that she has stopped going to church altogether. Now that your daughter is not going to church it will be easier to get her to accept other policies based on economic and cultural Marxism. Socialist professors like the fact that average church attendance drops dramatically after just one year of college. God and socialism are simply incompatible. One cannot worship both Jesus Christ and Karl Marx. But there is good news, Steve. I think I can implement a program that will cure your daughter’s Socialist Teaching Disorder (STD) in just a few short days. In case you were wondering, I define STD as the sudden infatuation with socialism brought on by exposure to pro-socialist ideas without a corresponding exposure to anti-socialist ideas. Although not recognized by the APA, this emotional disorder is running rampant at American universities. The solution to your daughter’s STD is to be found in your decision to award her a sum of $4000 if she returns from her freshman year with a 3.5 GPA or above. Previously, you explained to me that you decided to do this for two reasons: 1) Your daughter had earned a $4000 scholarship, which meant you had the extra money, and 2) Your only son had gone to college five years ago and flunked out after one year. Now that your daughter has maintained a 3.6 GPA (so far) you are happy. But you are unhappy that you are about to reward her newfound love of socialism when you had only intended to reward her studiousness. I have a solution that involves three steps. If you follow these steps (in order) we’ll have this little problem cured in no time: 1. When your daughter returns from college in early May (presumably with a GPA over 3.5) I want you to tell her that you lied. Put simply, when she asks about her $4000 just tell her that you never really had any intention of delivering on your promises. This revelation will, no doubt, cause significant consternation and outrage. But when she protests, simply point out that her choice for president, Barack Obama, also lied to her. Note that his lies about earmarks and line-by-line analysis of the budget will probably end up costing her more than $4000. She might say, “But you’re my father.” If she does, respond by saying “But I’m not your president.” If things get too uncomfortable, just tell her the $4000 promise was technically “last year’s business.” 2. When your daughter has cooled down somewhat from the realization that her father is a confessed liar I want you to strike again. Since your son, now 23, still lives at home it will be possible for you to implement step two in the presence of both children. This step will involve simply taking out your wallet and writing a $2000 check to your son. This action will, no doubt, cause even more consternation and outrage for your daughter. She may well point out that her brother is unemployed. She may also point out that he has been in rehab twice and that he once punched you in the face while under the influence of drugs. But, when she protests, simply say that it was Barack Obama who taught you to reward failure. She may well say “But that’s half of the money I was supposed to get.” If so, point out that it is Barack Obama who would like to take other people’s money – at least half, if not more – and use much of it to reward bad behavior. By this time, she will probably hate socialism and the lesson will have saved you a lot of money. But, just in case the point is not yet made, there is a third step to my plan. And this is where I get actively involved. 3. I’m going to take your daughter and the remaining $2000 - in the form of one hundred $20 bills – to the “hood.” Specifically, I am going to take her to places where crack cocaine is sold here in Wilmington in the middle of the afternoon. This will include grocery stores and actual crack houses. Don’t worry about your daughter’s safety as I will be armed with a .357 magnum loaded with 145-grain silver tipped hollow point bullets. When I approach a crack head I will first ask whether he paid income taxes last year. If he says “no” I will hand him $20. If your daughter asks me why I give money to people who don’t pay taxes I’ll remind her that this is what President Obama does. Then I’ll ask her if she still believes in “spreading the wealth” without regard to individual merit. By the end of the afternoon, I can guarantee your daughter will be cured of her STD. Sorry if I sound overly optimistic, Steve. I got my optimism from the same place I got my love of capitalism. I learned it from Ronald Reagan, not Barack Obama. Nice story,again, but no proof it ever happen. Have a link?", 
        "intTime": 20090330, 
        "postID": 5, 
        "quote": "Originally posted by RRR52: Dear Steve: Thanks for writing me with your concerns about your daughter’s recent visit home from college. I don’t have a daughter but I can understand the concern you have after seeing such dramatic changes in her after just six months at a public university. After all, you didn’t save money for eighteen long years in order to pay someone to teach her to despise the values you taught for, well, eighteen long years. First of all, I want you to understand that many of the crazy ideas you hear your daughter espousing are commonplace on college campuses. Nonetheless, it must have been shocking for you to hear that she supported Barack Obama in the last election principally because of his ideas about “the redistribution of wealth.” I know you were also disappointed to hear of her sudden opposition to the War on Terror and her sudden embrace of the United Nations. Most of all, I know you are disappointed that she has stopped going to church altogether. Now that your daughter is not going to church it will be easier to get her to accept other policies based on economic and cultural Marxism. Socialist professors like the fact that average church attendance drops dramatically after just one year of college. God and socialism are simply incompatible. One cannot worship both Jesus Christ and Karl Marx. But there is good news, Steve. I think I can implement a program that will cure your daughter’s Socialist Teaching Disorder (STD) in just a few short days. In case you were wondering, I define STD as the sudden infatuation with socialism brought on by exposure to pro-socialist ideas without a corresponding exposure to anti-socialist ideas. Although not recognized by the APA, this emotional disorder is running rampant at American universities. The solution to your daughter’s STD is to be found in your decision to award her a sum of $4000 if she returns from her freshman year with a 3.5 GPA or above. Previously, you explained to me that you decided to do this for two reasons: 1) Your daughter had earned a $4000 scholarship, which meant you had the extra money, and 2) Your only son had gone to college five years ago and flunked out after one year. Now that your daughter has maintained a 3.6 GPA (so far) you are happy. But you are unhappy that you are about to reward her newfound love of socialism when you had only intended to reward her studiousness. I have a solution that involves three steps. If you follow these steps (in order) we’ll have this little problem cured in no time: 1. When your daughter returns from college in early May (presumably with a GPA over 3.5) I want you to tell her that you lied. Put simply, when she asks about her $4000 just tell her that you never really had any intention of delivering on your promises. This revelation will, no doubt, cause significant consternation and outrage. But when she protests, simply point out that her choice for president, Barack Obama, also lied to her. Note that his lies about earmarks and line-by-line analysis of the budget will probably end up costing her more than $4000. She might say, “But you’re my father.” If she does, respond by saying “But I’m not your president.” If things get too uncomfortable, just tell her the $4000 promise was technically “last year’s business.” 2. When your daughter has cooled down somewhat from the realization that her father is a confessed liar I want you to strike again. Since your son, now 23, still lives at home it will be possible for you to implement step two in the presence of both children. This step will involve simply taking out your wallet and writing a $2000 check to your son. This action will, no doubt, cause even more consternation and outrage for your daughter. She may well point out that her brother is unemployed. She may also point out that he has been in rehab twice and that he once punched you in the face while under the influence of drugs. But, when she protests, simply say that it was Barack Obama who taught you to reward failure. She may well say “But that’s half of the money I was supposed to get.” If so, point out that it is Barack Obama who would like to take other people’s money – at least half, if not more – and use much of it to reward bad behavior. By this time, she will probably hate socialism and the lesson will have saved you a lot of money. But, just in case the point is not yet made, there is a third step to my plan. And this is where I get actively involved. 3. I’m going to take your daughter and the remaining $2000 - in the form of one hundred $20 bills – to the “hood.” Specifically, I am going to take her to places where crack cocaine is sold here in Wilmington in the middle of the afternoon. This will include grocery stores and actual crack houses. Don’t worry about your daughter’s safety as I will be armed with a .357 magnum loaded with 145-grain silver tipped hollow point bullets. When I approach a crack head I will first ask whether he paid income taxes last year. If he says “no” I will hand him $20. If your daughter asks me why I give money to people who don’t pay taxes I’ll remind her that this is what President Obama does. Then I’ll ask her if she still believes in “spreading the wealth” without regard to individual merit. By the end of the afternoon, I can guarantee your daughter will be cured of her STD. Sorry if I sound overly optimistic, Steve. I got my optimism from the same place I got my love of capitalism. I learned it from Ronald Reagan, not Barack Obama.", 
        "reply": " Nice story,again, but no proof it ever happen. Have a link?", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 12:18:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "Tangler"
    }, 
    {
        "content": "Tangler, got a link to the contrary?", 
        "intTime": 20090330, 
        "postID": 6, 
        "quote": "", 
        "reply": "Tangler, got a link to the contrary?", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 12:37:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Good thing we do not live in a socialist country.", 
        "intTime": 20090330, 
        "postID": 7, 
        "quote": "", 
        "reply": "Good thing we do not live in a socialist country.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 12:39:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Tangler, got a link to the contrary? Well gee Re-peter3_1, I ask because I couldn't find anything about this suposed happening and knowing the joys of made up storys that people(s) often offer as support for their favorite cause, I requested a link for the original... You have a problem with this?", 
        "intTime": 20090330, 
        "postID": 8, 
        "quote": "Originally posted by peter3_1: Tangler, got a link to the contrary?", 
        "reply": " Well gee Re-peter3_1, I ask because I couldn't find anything about this suposed happening and knowing the joys of made up storys that people(s) often offer as support for their favorite cause, I requested a link for the original... You have a problem with this?", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 13:24:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "Tangler"
    }, 
    {
        "content": "The allure of a free lunch (or at least a lunch at someone else's expense ) is too much for the \"I am entitled\" segment of our society to resist.", 
        "intTime": 20090330, 
        "postID": 9, 
        "quote": "", 
        "reply": "The allure of a free lunch (or at least a lunch at someone else's expense ) is too much for the \"I am entitled\" segment of our society to resist.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 14:30:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "Vorpal"
    }, 
    {
        "content": "these are the stupidest ******* \"stories\" in the world the amish are communists and they seem to have done ok for the past couple hundred years", 
        "intTime": 20090330, 
        "postID": 10, 
        "quote": "", 
        "reply": "these are the stupidest ******* \"stories\" in the world the amish are communists and they seem to have done ok for the past couple hundred years", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 18:04:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Tangler, got a link to the contrary? I do. It's someone's fictitious column from Townhall.com \"http://townhall.com/Columnists/MikeSAdams/2009/03/30/how_to_cure_your_daughter%E2%80%99s_std?page=1\" As far as the Texas Tech story goes, the person names the school, but doesn't name the professor. Further, the person tries to weasel out of responsibility by saying the anonymous teacher said it happened. By doing such a thing, it makes disproving the story difficult. Thirdly, the anonymous Texas Tech professor says that he never failed a single student, but he did fail an entire class. What is that? This is also a b.s. story - and this, like the other story, is used to hook the susceptible who are unable to reason for themselves.", 
        "intTime": 20090330, 
        "postID": 11, 
        "quote": "Originally posted by peter3_1: Tangler, got a link to the contrary?", 
        "reply": " I do. It's someone's fictitious column from Townhall.com \"http://townhall.com/Columnists/MikeSAdams/2009/03/30/how_to_cure_your_daughter%E2%80%99s_std?page=1\" As far as the Texas Tech story goes, the person names the school, but doesn't name the professor. Further, the person tries to weasel out of responsibility by saying the anonymous teacher said it happened. By doing such a thing, it makes disproving the story difficult. Thirdly, the anonymous Texas Tech professor says that he never failed a single student, but he did fail an entire class. What is that? This is also a b.s. story - and this, like the other story, is used to hook the susceptible who are unable to reason for themselves.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 20:02:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by peter3_1: Tangler, got a link to the contrary? Well gee Re-peter3_1, I ask because I couldn't find anything about this suposed happening and knowing the joys of made up storys that people(s) often offer as support for their favorite cause, I requested a link for the original... You have a problem with this? Tangler, Link, LINK, we don need no stinken LINK!!! However the rules are pretty much dependent on mod interpenetration, here at P/CP pretty much anything goes. Sometimes if it's beyond the pale it gets kicked over to the Conspiracy link. You'll figure out the ones who post BS just for the hell of it. Source be damned. Just and carry on...", 
        "intTime": 20090330, 
        "postID": 12, 
        "quote": "Originally posted by Tangler: quote: Originally posted by peter3_1: Tangler, got a link to the contrary? Well gee Re-peter3_1, I ask because I couldn't find anything about this suposed happening and knowing the joys of made up storys that people(s) often offer as support for their favorite cause, I requested a link for the original... You have a problem with this?", 
        "reply": " Tangler, Link, LINK, we don need no stinken LINK!!! However the rules are pretty much dependent on mod interpenetration, here at P/CP pretty much anything goes. Sometimes if it's beyond the pale it gets kicked over to the Conspiracy link. You'll figure out the ones who post BS just for the hell of it. Source be damned. Just and carry on...", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-30 21:28:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by liberal90: these are the stupidest ******* \"stories\" in the world the amish are communists and they seem to have done ok for the past couple hundred years And they have grown HUGE! Oh wait no they have not. A small group with a shared belief set is very different from a large group with mixed value sets. Forget the dog, Beware of Owner", 
        "intTime": 20090331, 
        "postID": 13, 
        "quote": "Originally posted by liberal90: these are the stupidest ******* \"stories\" in the world the amish are communists and they seem to have done ok for the past couple hundred years", 
        "reply": " And they have grown HUGE! Oh wait no they have not. A small group with a shared belief set is very different from a large group with mixed value sets. Forget the dog, Beware of Owner", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 09:35:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "Tomcatt"
    }, 
    {
        "content": "quote: Originally posted by xerello: Good thing we do not live in a socialist country. ... YET", 
        "intTime": 20090331, 
        "postID": 14, 
        "quote": "Originally posted by xerello: Good thing we do not live in a socialist country.", 
        "reply": " ... YET", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 09:44:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by Tangler: quote: Originally posted by peter3_1: Tangler, got a link to the contrary? Well gee Re-peter3_1, I ask because I couldn't find anything about this suposed happening and knowing the joys of made up storys that people(s) often offer as support for their favorite cause, I requested a link for the original... You have a problem with this? Tangler, Link, LINK, we don need no stinken LINK!!! However the rules are pretty much dependent on mod interpenetration, here at P/CP pretty much anything goes. Sometimes if it's beyond the pale it gets kicked over to the Conspiracy link. You'll figure out the ones who post BS just for the hell of it. Source be damned. Just and carry on... True or not, it's still a nice illustration of Obama's socialism.", 
        "intTime": 20090331, 
        "postID": 15, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by Tangler: quote: Originally posted by peter3_1: Tangler, got a link to the contrary? Well gee Re-peter3_1, I ask because I couldn't find anything about this suposed happening and knowing the joys of made up storys that people(s) often offer as support for their favorite cause, I requested a link for the original... You have a problem with this? Tangler, Link, LINK, we don need no stinken LINK!!! However the rules are pretty much dependent on mod interpenetration, here at P/CP pretty much anything goes. Sometimes if it's beyond the pale it gets kicked over to the Conspiracy link. You'll figure out the ones who post BS just for the hell of it. Source be damned. Just and carry on...", 
        "reply": " True or not, it's still a nice illustration of Obama's socialism.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 09:45:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by Tomcatt: quote: Originally posted by liberal90: these are the stupidest ******* \"stories\" in the world the amish are communists and they seem to have done ok for the past couple hundred years And they have grown HUGE! Oh wait no they have not. A small group with a shared belief set is very different from a large group with mixed value sets. Excellent point. Families are an example of communism/socialism. Get outside the family and....the socialistic principles tend to break down. Churches are another example in which socialism to a smaller degree can work, but....the larger the application of socialism becomes, the more the principles of socialism fail UNLESS....they're enforced by very punitive governmental oversight.", 
        "intTime": 20090331, 
        "postID": 16, 
        "quote": "Originally posted by Tomcatt: quote: Originally posted by liberal90: these are the stupidest ******* \"stories\" in the world the amish are communists and they seem to have done ok for the past couple hundred years And they have grown HUGE! Oh wait no they have not. A small group with a shared belief set is very different from a large group with mixed value sets.", 
        "reply": " Excellent point. Families are an example of communism/socialism. Get outside the family and....the socialistic principles tend to break down. Churches are another example in which socialism to a smaller degree can work, but....the larger the application of socialism becomes, the more the principles of socialism fail UNLESS....they're enforced by very punitive governmental oversight.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 09:59:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "19022583"
    }, 
    {
        "content": "quote: Originally posted by RRR52: An economics professor at Texas Tech said he had never failed a single student, but had once failed an entire class. The class (students) insisted that socialism worked since no one would be poor and no one would be rich, a great equalizer. The professor then said, \"OK, we will have an experiment in this class on socialism. All grades will be averaged and everyone will receive the same grade so no one will fail and no one will receive an A.\" After the first test the grades were averaged and everyone got a B. The students who had studied hard were upset while the students who had studied very little were happy. But, as the second test rolled around, the students who had studied little studied even less, and the ones who had studied hard decided that since they couldn't make an A, they also studied less. The second test average was a D. No one was happy. When the 3rd test rolled around the average grade was an F. The scores never increased as bickering, blame, name calling, all resulted in hard feelings and no one would study for anyone else. Misery was shared equally. To their great chagrin, all failed. The professor told them that socialism would ultimately fail in the same way. One has only to look at collectivist nations, before they begin to move toward reward of individual effort, to see how bad economies can become. The greater their reward, the more people will try to succeed (capitalism), but when a government takes more and more of the reward away, far fewer will try to succeed (socialism). A total BS story. Anyone can make up a story to prove anything. Now for a real life example of what NO government control of businesses means look up the Robber Baron era and what the people controlling the Railroads did.", 
        "intTime": 20090331, 
        "postID": 17, 
        "quote": "Originally posted by RRR52: An economics professor at Texas Tech said he had never failed a single student, but had once failed an entire class. The class (students) insisted that socialism worked since no one would be poor and no one would be rich, a great equalizer. The professor then said, \"OK, we will have an experiment in this class on socialism. All grades will be averaged and everyone will receive the same grade so no one will fail and no one will receive an A.\" After the first test the grades were averaged and everyone got a B. The students who had studied hard were upset while the students who had studied very little were happy. But, as the second test rolled around, the students who had studied little studied even less, and the ones who had studied hard decided that since they couldn't make an A, they also studied less. The second test average was a D. No one was happy. When the 3rd test rolled around the average grade was an F. The scores never increased as bickering, blame, name calling, all resulted in hard feelings and no one would study for anyone else. Misery was shared equally. To their great chagrin, all failed. The professor told them that socialism would ultimately fail in the same way. One has only to look at collectivist nations, before they begin to move toward reward of individual effort, to see how bad economies can become. The greater their reward, the more people will try to succeed (capitalism), but when a government takes more and more of the reward away, far fewer will try to succeed (socialism).", 
        "reply": " A total BS story. Anyone can make up a story to prove anything. Now for a real life example of what NO government control of businesses means look up the Robber Baron era and what the people controlling the Railroads did.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 10:08:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: the amish are communists and they seem to have done ok for the past couple hundred years And their space program is going great guns! No,....wait. Despite the rhetoric, we neither live in a purely capitalist nor socialist society. There are elements of both, to varying degrees. While I agree capitalism is the engine that drives our civilization (as per Ferdinand Braudel), unbridled capitalism is just as dangerous a beast as the various forms of socialism that have been tried. Sullivan013", 
        "intTime": 20090331, 
        "postID": 18, 
        "quote": "the amish are communists and they seem to have done ok for the past couple hundred years", 
        "reply": " And their space program is going great guns! No,....wait. Despite the rhetoric, we neither live in a purely capitalist nor socialist society. There are elements of both, to varying degrees. While I agree capitalism is the engine that drives our civilization (as per Ferdinand Braudel), unbridled capitalism is just as dangerous a beast as the various forms of socialism that have been tried. Sullivan013", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 10:23:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "sullivan013"
    }, 
    {
        "content": "These aren't stories. They are parables in the new world order bible. Hay, I got my $15 a week extra in my pay check. That Obama guy is pretty good at keeping his word. Now we have to wait until he saves the world at the G-20 summit. All is good.", 
        "intTime": 20090331, 
        "postID": 19, 
        "quote": "", 
        "reply": "These aren't stories. They are parables in the new world order bible. Hay, I got my $15 a week extra in my pay check. That Obama guy is pretty good at keeping his word. Now we have to wait until he saves the world at the G-20 summit. All is good.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 10:44:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "THAT'S THE FREEKING POINT! All of Aesops fables were made up too, unless you think there are reasoning foxes, frogs, etc etc. Or that Jesus's parables refered to actual servants, lost sons, and famlies that lived down the block. THEY ARE EXERCISES IN REASONING. There are NO \"LINKS\" to them and there need not be! Don't agree, LET'S HEAR YOUR REASONING! Thanks mcgreer, for helping prove my point. And, Ray, these are ILLUSTRATIVE PARABLES that have been used for THOUSANDS of years that we know of, right back to the days of Ur. YOUR point, Ray, should be your REASONABLE and well thought out counter argument. Unfortunately, there are none it this world, as even the \"successful\" socialist examples are failing and the real world has examples to the contrary, Stalin, Mao, Pol Pot , Hitler (National scocialism), Uncle Ho, etc etc. These peoples ability to create a living hell is thoroughly documented. And there is even a link to the totaling of the murders by government that a few of you socialuist apologists would do well to read,m several times. Start here: \"\"http://www.hawaii.edu/powerkills/ and this is a must read: \"\"http://www.hawaii.edu/powerkills/CHINA.CHAP1.HTM \"\"http://www.hawaii.edu/powerkills/SOD.CHAP12.HTM Oh, and chapters 1 thru 23 as noted on the rt side of these pages. The only was socialism can be \"successful\" in a scociety such as ours is at gunpoint, becayuse the MAJORITY do not agree with the socialist life. Unfortunately, the socialist model has proved an exceptionally powerful magnent to those who are the Stalinist types. You see, in this free CAPITALIST scociety you are FEREE to be Amish, or any type of Socialists you want, there are millions of square miles where you can build your socialist utopia, JUST PLEASE LEAVE US OUT. But that's impossible for the statists among you, isn't it?", 
        "intTime": 20090331, 
        "postID": 20, 
        "quote": "", 
        "reply": "THAT'S THE FREEKING POINT! All of Aesops fables were made up too, unless you think there are reasoning foxes, frogs, etc etc. Or that Jesus's parables refered to actual servants, lost sons, and famlies that lived down the block. THEY ARE EXERCISES IN REASONING. There are NO \"LINKS\" to them and there need not be! Don't agree, LET'S HEAR YOUR REASONING! Thanks mcgreer, for helping prove my point. And, Ray, these are ILLUSTRATIVE PARABLES that have been used for THOUSANDS of years that we know of, right back to the days of Ur. YOUR point, Ray, should be your REASONABLE and well thought out counter argument. Unfortunately, there are none it this world, as even the \"successful\" socialist examples are failing and the real world has examples to the contrary, Stalin, Mao, Pol Pot , Hitler (National scocialism), Uncle Ho, etc etc. These peoples ability to create a living hell is thoroughly documented. And there is even a link to the totaling of the murders by government that a few of you socialuist apologists would do well to read,m several times. Start here: \"\"http://www.hawaii.edu/powerkills/ and this is a must read: \"\"http://www.hawaii.edu/powerkills/CHINA.CHAP1.HTM \"\"http://www.hawaii.edu/powerkills/SOD.CHAP12.HTM Oh, and chapters 1 thru 23 as noted on the rt side of these pages. The only was socialism can be \"successful\" in a scociety such as ours is at gunpoint, becayuse the MAJORITY do not agree with the socialist life. Unfortunately, the socialist model has proved an exceptionally powerful magnent to those who are the Stalinist types. You see, in this free CAPITALIST scociety you are FEREE to be Amish, or any type of Socialists you want, there are millions of square miles where you can build your socialist utopia, JUST PLEASE LEAVE US OUT. But that's impossible for the statists among you, isn't it?", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 10:49:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: THAT'S THE FREEKING POINT! All of Aesops fables were made up too, unless you think there are reasoning foxes, frogs, etc etc. Or that Jesus's parables refered to actual servants, lost sons, and famlies that lived down the block. THEY ARE EXERCISES IN REASONING. There are NO \"LINKS\" to them and there need not be! Don't agree, LET'S HEAR YOUR REASONING! Thanks mcgreer, for helping prove my point. And, Ray, these are ILLUSTRATIVE PARABLES that have been used for THOUSANDS of years that we know of, right back to the days of Ur. YOUR point, Ray, should be your REASONABLE and well thought out counter argument. Unfortunately, there are none it this world, as even the \"successful\" socialist examples are failing and the real world has examples to the contrary, Stalin, Mao, Pol Pot , Hitler (National scocialism), Uncle Ho, etc etc. These peoples ability to create a living hell is thoroughly documented. And there is even a link to the totaling of the murders by government that a few of you socialuist apologists would do well to read,m several times. Start here: \"\"http://www.hawaii.edu/powerkills/ and this is a must read: \"\"http://www.hawaii.edu/powerkills/CHINA.CHAP1.HTM \"\"http://www.hawaii.edu/powerkills/SOD.CHAP12.HTM Oh, and chapters 1 thru 23 as noted on the rt side of these pages. The only was socialism can be \"successful\" in a scociety such as ours is at gunpoint, becayuse the MAJORITY do not agree with the socialist life. Unfortunately, the socialist model has proved an exceptionally powerful magnent to those who are the Stalinist types. You see, in this free CAPITALIST scociety you are FEREE to be Amish, or any type of Socialists you want, there are millions of square miles where you can build your socialist utopia, JUST PLEASE LEAVE US OUT. But that's impossible for the statists among you, isn't it? If is is a parable then the POSTER should NOT have posted it as a true story now should he? If your position requires you to lie to support it you might want to look at your assumptions.", 
        "intTime": 20090331, 
        "postID": 21, 
        "quote": "Originally posted by peter3_1: THAT'S THE FREEKING POINT! All of Aesops fables were made up too, unless you think there are reasoning foxes, frogs, etc etc. Or that Jesus's parables refered to actual servants, lost sons, and famlies that lived down the block. THEY ARE EXERCISES IN REASONING. There are NO \"LINKS\" to them and there need not be! Don't agree, LET'S HEAR YOUR REASONING! Thanks mcgreer, for helping prove my point. And, Ray, these are ILLUSTRATIVE PARABLES that have been used for THOUSANDS of years that we know of, right back to the days of Ur. YOUR point, Ray, should be your REASONABLE and well thought out counter argument. Unfortunately, there are none it this world, as even the \"successful\" socialist examples are failing and the real world has examples to the contrary, Stalin, Mao, Pol Pot , Hitler (National scocialism), Uncle Ho, etc etc. These peoples ability to create a living hell is thoroughly documented. And there is even a link to the totaling of the murders by government that a few of you socialuist apologists would do well to read,m several times. Start here: \"\"http://www.hawaii.edu/powerkills/ and this is a must read: \"\"http://www.hawaii.edu/powerkills/CHINA.CHAP1.HTM \"\"http://www.hawaii.edu/powerkills/SOD.CHAP12.HTM Oh, and chapters 1 thru 23 as noted on the rt side of these pages. The only was socialism can be \"successful\" in a scociety such as ours is at gunpoint, becayuse the MAJORITY do not agree with the socialist life. Unfortunately, the socialist model has proved an exceptionally powerful magnent to those who are the Stalinist types. You see, in this free CAPITALIST scociety you are FEREE to be Amish, or any type of Socialists you want, there are millions of square miles where you can build your socialist utopia, JUST PLEASE LEAVE US OUT. But that's impossible for the statists among you, isn't it?", 
        "reply": " If is is a parable then the POSTER should NOT have posted it as a true story now should he? If your position requires you to lie to support it you might want to look at your assumptions.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 11:16:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "rayld2"
    }, 
    {
        "content": "Pretty free with the term \"lie\" arn't you, Ray? Parables are not lies, but LESSONS. Either you LEARN THE LESSON, or argue logically a different view. But you seem to find that impossible, so you resort to name calling. How mature.", 
        "intTime": 20090331, 
        "postID": 22, 
        "quote": "", 
        "reply": "Pretty free with the term \"lie\" arn't you, Ray? Parables are not lies, but LESSONS. Either you LEARN THE LESSON, or argue logically a different view. But you seem to find that impossible, so you resort to name calling. How mature.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 11:30:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Ah, yes, so the whiners and weenies of the wimpy leftist looneybin have NOTHING by which to refute the solid lesson of the Internet parable. The underlying behavior of free people--and, surprisingly, the economic activities even of those who live for years in penitentiaries and POW camps--reinforces the lesson. What the leftists seek is anti-freedom, anti-American, an insipid, mediocre life for all. The weakness of mind and spirit of those who seek such shared misery is an abomination of the opportunity and individual dignity that life can offer--if only the weak sisters among us have the guts to seek the tremendous possibilities. . . instead of the certain waste of enforced collectivism and thieving attitudes of covetousness, greed, and envy embodied in the obamanation.", 
        "intTime": 20090331, 
        "postID": 23, 
        "quote": "", 
        "reply": "Ah, yes, so the whiners and weenies of the wimpy leftist looneybin have NOTHING by which to refute the solid lesson of the Internet parable. The underlying behavior of free people--and, surprisingly, the economic activities even of those who live for years in penitentiaries and POW camps--reinforces the lesson. What the leftists seek is anti-freedom, anti-American, an insipid, mediocre life for all. The weakness of mind and spirit of those who seek such shared misery is an abomination of the opportunity and individual dignity that life can offer--if only the weak sisters among us have the guts to seek the tremendous possibilities. . . instead of the certain waste of enforced collectivism and thieving attitudes of covetousness, greed, and envy embodied in the obamanation.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 11:37:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by rayld2: If is is a parable then the POSTER should NOT have posted it as a true story now should he? If your position requires you to lie to support it you might want to look at your assumptions. No one stated the parable was true. You sucked it down that way, friend. Enjoy! (And by your standard, anything someone is too obtuse to understand is a \"lie?\" Evidently, a major part of your world is essentially all lies, then? Tsk. )", 
        "intTime": 20090331, 
        "postID": 24, 
        "quote": "Originally posted by rayld2: If is is a parable then the POSTER should NOT have posted it as a true story now should he? If your position requires you to lie to support it you might want to look at your assumptions.", 
        "reply": " No one stated the parable was true. You sucked it down that way, friend. Enjoy! (And by your standard, anything someone is too obtuse to understand is a \"lie?\" Evidently, a major part of your world is essentially all lies, then? Tsk. )", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 11:40:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: rayld2: If your position requires you to lie to support it you might want to look at your assumptions. You mean like the assumptions of what HOPE AND CHANGE really means?", 
        "intTime": 20090331, 
        "postID": 25, 
        "quote": "rayld2: If your position requires you to lie to support it you might want to look at your assumptions.", 
        "reply": " You mean like the assumptions of what HOPE AND CHANGE really means?", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 12:24:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by rayld2: If is is a parable then the POSTER should NOT have posted it as a true story now should he? If your position requires you to lie to support it you might want to look at your assumptions. No one stated the parable was true. You sucked it down that way, friend. Enjoy! (And by your standard, anything someone is too obtuse to understand is a \"lie?\" Evidently, a major part of your world is essentially all lies, then? Tsk. ) No I saw it as a poorly done attempt to make the usual attack on a group the poster disagrees with.", 
        "intTime": 20090331, 
        "postID": 26, 
        "quote": "Originally posted by RRR52: quote: Originally posted by rayld2: If is is a parable then the POSTER should NOT have posted it as a true story now should he? If your position requires you to lie to support it you might want to look at your assumptions. No one stated the parable was true. You sucked it down that way, friend. Enjoy! (And by your standard, anything someone is too obtuse to understand is a \"lie?\" Evidently, a major part of your world is essentially all lies, then? Tsk. )", 
        "reply": " No I saw it as a poorly done attempt to make the usual attack on a group the poster disagrees with.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-03-31 13:43:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by RRR52: quote: Originally posted by rayld2: If is is a parable then the POSTER should NOT have posted it as a true story now should he? If your position requires you to lie to support it you might want to look at your assumptions. No one stated the parable was true. You sucked it down that way, friend. Enjoy! (And by your standard, anything someone is too obtuse to understand is a \"lie?\" Evidently, a major part of your world is essentially all lies, then? Tsk. ) No I saw it as a poorly done attempt to make the usual attack on a group the poster disagrees with. It was appropriately done; it sure got your attention. Had it merited no response, you shouldn't have. I attack no one in this case. I attack a bankrupt, anti-freedom weltanschauung; an enforced, generally unnatural economic system.", 
        "intTime": 20090401, 
        "postID": 27, 
        "quote": "Originally posted by rayld2: quote: Originally posted by RRR52: quote: Originally posted by rayld2: If is is a parable then the POSTER should NOT have posted it as a true story now should he? If your position requires you to lie to support it you might want to look at your assumptions. No one stated the parable was true. You sucked it down that way, friend. Enjoy! (And by your standard, anything someone is too obtuse to understand is a \"lie?\" Evidently, a major part of your world is essentially all lies, then? Tsk. ) No I saw it as a poorly done attempt to make the usual attack on a group the poster disagrees with.", 
        "reply": " It was appropriately done; it sure got your attention. Had it merited no response, you shouldn't have. I attack no one in this case. I attack a bankrupt, anti-freedom weltanschauung; an enforced, generally unnatural economic system.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-04-01 18:12:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "RRR52"
    }, 
    {
        "content": "MOD HAT ON The personal comments in this thread are getting out of hand. If y'all don't stop it, I will.", 
        "intTime": 20090401, 
        "postID": 28, 
        "quote": "", 
        "reply": "MOD HAT ON The personal comments in this thread are getting out of hand. If y'all don't stop it, I will.", 
        "threadID": "409192893_1520053912001", 
        "time": "2009-04-01 18:27:00", 
        "title": "No Rationalizations Can Thwart Human Economic Behavior", 
        "userID": "stillkit"
    }
]