[
    {
        "content": "Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation.", 
        "intTime": 20090529, 
        "postID": 1, 
        "quote": "", 
        "reply": "Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 13:24:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it?", 
        "intTime": 20090529, 
        "postID": 2, 
        "quote": "Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation.", 
        "reply": " So what are you going to do about it?", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 13:26:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "1WW"
    }, 
    {
        "content": "Replace them in 3y 8 mos., and try and get fiscally responsible people in the Congress, regardless the party. Nothing else to be done.", 
        "intTime": 20090529, 
        "postID": 3, 
        "quote": "", 
        "reply": "Replace them in 3y 8 mos., and try and get fiscally responsible people in the Congress, regardless the party. Nothing else to be done.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 13:30:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it? Continue to buy Toyota, never vote again, and move and retire in Panama. What about you?", 
        "intTime": 20090529, 
        "postID": 4, 
        "quote": "Originally posted by 1WW: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it?", 
        "reply": " Continue to buy Toyota, never vote again, and move and retire in Panama. What about you?", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 13:37:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"?", 
        "intTime": 20090529, 
        "postID": 5, 
        "quote": "Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation.", 
        "reply": " Could you provide the quote that Obama said bankruptcy was \"not an option\"?", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 13:39:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by 1WW: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it? Continue to buy Toyota, never vote again, and move and retire in Panama. What about you? LOL - Duster, you're such a master of sarcasm! Me -- I'm staying right here, in the Good Old USA, keep on voting my conscience, and supporting the military like the good patriot I am. I don't give up.", 
        "intTime": 20090529, 
        "postID": 6, 
        "quote": "Originally posted by Duster6: quote: Originally posted by 1WW: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it? Continue to buy Toyota, never vote again, and move and retire in Panama. What about you?", 
        "reply": " LOL - Duster, you're such a master of sarcasm! Me -- I'm staying right here, in the Good Old USA, keep on voting my conscience, and supporting the military like the good patriot I am. I don't give up.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 13:40:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. You are too correct. The leftists are extrenely stuck on themselves, imagining that they are oh-so smart and hypocritically moral, when in fact they are pretty damned dumb in what they do, IF the good of the nation as a whole is teh driving force in their actions. But since power and control over others--in contravention of real freedom as the Founders sought--it is what the jackasses crave above all else, equal opportunity is a joke. What too many people refuse to accept is that slick talk is not the same as wise decision-making and enhancement of traditional American freedom. Cutesie teleprompter talking heads are not at all the same as careful analysis of problems and effective decision-making.", 
        "intTime": 20090529, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation.", 
        "reply": " You are too correct. The leftists are extrenely stuck on themselves, imagining that they are oh-so smart and hypocritically moral, when in fact they are pretty damned dumb in what they do, IF the good of the nation as a whole is teh driving force in their actions. But since power and control over others--in contravention of real freedom as the Founders sought--it is what the jackasses crave above all else, equal opportunity is a joke. What too many people refuse to accept is that slick talk is not the same as wise decision-making and enhancement of traditional American freedom. Cutesie teleprompter talking heads are not at all the same as careful analysis of problems and effective decision-making.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 16:02:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by Duster6: quote: Originally posted by 1WW: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it? Continue to buy Toyota, never vote again, and move and retire in Panama. What about you? LOL - Duster, you're such a master of sarcasm! Me -- I'm staying right here, in the Good Old USA, keep on voting my conscience, and supporting the military like the good patriot I am. I don't give up. I can support the military from Panama. I can vote from Panama(Absentee), but I don't want to anymore. And I don't consider it giving up. I think of it as teaching the crooks a lesson. I'd be glad to return and fight once I see Barney Frank, Pelosi and the rest of those crooks tarred and feather and put on display on NBC or CBS.", 
        "intTime": 20090529, 
        "postID": 8, 
        "quote": "Originally posted by 1WW: quote: Originally posted by Duster6: quote: Originally posted by 1WW: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it? Continue to buy Toyota, never vote again, and move and retire in Panama. What about you? LOL - Duster, you're such a master of sarcasm! Me -- I'm staying right here, in the Good Old USA, keep on voting my conscience, and supporting the military like the good patriot I am. I don't give up.", 
        "reply": " I can support the military from Panama. I can vote from Panama(Absentee), but I don't want to anymore. And I don't consider it giving up. I think of it as teaching the crooks a lesson. I'd be glad to return and fight once I see Barney Frank, Pelosi and the rest of those crooks tarred and feather and put on display on NBC or CBS.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 17:29:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Duster6"
    }, 
    {
        "content": "I'll have to locate the article I read this morning.. The \"NEW GM\" will be owned by: Drum roll please... quote: The U.S. Treasury, which already has loaned GM $19.4 billion, would get 72.5 percent of the new company's stock and provide $30 billion in additional financing to keep the new GM operating under bankruptcy protection. Canada's government is expected to provide an additional $9 billion, a senior Obama administration official said. A United Auto Workers trust that will take over retiree health care expenses will get 17.5 percent, and the old GM, effectively owned by the bondholders, would get a 10 percent stake. GM's existing shareholders will probably lose everything. \"It's fair to say that there would be little to no recovery,\" an administration official said. \"http://www.pressofatlanticcity.com/news/ap/nation/article_f48dafbc-52c2-553b-a892-5a10cf76ce9c.html\"", 
        "intTime": 20090529, 
        "postID": 9, 
        "quote": "The U.S. Treasury, which already has loaned GM $19.4 billion, would get 72.5 percent of the new company's stock and provide $30 billion in additional financing to keep the new GM operating under bankruptcy protection. Canada's government is expected to provide an additional $9 billion, a senior Obama administration official said. A United Auto Workers trust that will take over retiree health care expenses will get 17.5 percent, and the old GM, effectively owned by the bondholders, would get a 10 percent stake. GM's existing shareholders will probably lose everything. \"It's fair to say that there would be little to no recovery,\" an administration official said.", 
        "reply": "I'll have to locate the article I read this morning.. The \"NEW GM\" will be owned by: Drum roll please...  \"http://www.pressofatlanticcity.com/news/ap/nation/article_f48dafbc-52c2-553b-a892-5a10cf76ce9c.html\"", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 18:14:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: I'll have to locate the article I read this morning.. The \"NEW GM\" will be owned by: Drum roll please... quote: The U.S. Treasury, which already has loaned GM $19.4 billion, would get 72.5 percent of the new company's stock and provide $30 billion in additional financing to keep the new GM operating under bankruptcy protection. Canada's government is expected to provide an additional $9 billion, a senior Obama administration official said. A United Auto Workers trust that will take over retiree health care expenses will get 17.5 percent, and the old GM, effectively owned by the bondholders, would get a 10 percent stake. GM's existing shareholders will probably lose everything. \"It's fair to say that there would be little to no recovery,\" an administration official said. \"http://www.pressofatlanticcity.com/news/ap/nation/article_f48dafbc-52c2-553b-a892-5a10cf76ce9c.html\" So since the Union workers will own the company, all the union supporters ought to start buying up those stocks now, while they are so low..", 
        "intTime": 20090529, 
        "postID": 10, 
        "quote": "Originally posted by 3678131: I'll have to locate the article I read this morning.. The \"NEW GM\" will be owned by: Drum roll please... quote: The U.S. Treasury, which already has loaned GM $19.4 billion, would get 72.5 percent of the new company's stock and provide $30 billion in additional financing to keep the new GM operating under bankruptcy protection. Canada's government is expected to provide an additional $9 billion, a senior Obama administration official said. A United Auto Workers trust that will take over retiree health care expenses will get 17.5 percent, and the old GM, effectively owned by the bondholders, would get a 10 percent stake. GM's existing shareholders will probably lose everything. \"It's fair to say that there would be little to no recovery,\" an administration official said. \"http://www.pressofatlanticcity.com/news/ap/nation/article_f48dafbc-52c2-553b-a892-5a10cf76ce9c.html\"", 
        "reply": " So since the Union workers will own the company, all the union supporters ought to start buying up those stocks now, while they are so low..", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 18:19:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: I'll have to locate the article I read this morning.. The \"NEW GM\" will be owned by: Drum roll please... quote: The U.S. Treasury, which already has loaned GM $19.4 billion, would get 72.5 percent of the new company's stock and provide $30 billion in additional financing to keep the new GM operating under bankruptcy protection. Canada's government is expected to provide an additional $9 billion, a senior Obama administration official said. A United Auto Workers trust that will take over retiree health care expenses will get 17.5 percent, and the old GM, effectively owned by the bondholders, would get a 10 percent stake. GM's existing shareholders will probably lose everything. \"It's fair to say that there would be little to no recovery,\" an administration official said. \"http://www.pressofatlanticcity.com/news/ap/nation/article_f48dafbc-52c2-553b-a892-5a10cf76ce9c.html\" No one was kidding when they said Obama wants to design your new cars and trucks...FUG that... I'll rather buy Japanese than support his socialist automobile company...Won't be long before we see garbage 50hp russian style crap with the GM logo on it..", 
        "intTime": 20090529, 
        "postID": 11, 
        "quote": "Originally posted by 3678131: I'll have to locate the article I read this morning.. The \"NEW GM\" will be owned by: Drum roll please... quote: The U.S. Treasury, which already has loaned GM $19.4 billion, would get 72.5 percent of the new company's stock and provide $30 billion in additional financing to keep the new GM operating under bankruptcy protection. Canada's government is expected to provide an additional $9 billion, a senior Obama administration official said. A United Auto Workers trust that will take over retiree health care expenses will get 17.5 percent, and the old GM, effectively owned by the bondholders, would get a 10 percent stake. GM's existing shareholders will probably lose everything. \"It's fair to say that there would be little to no recovery,\" an administration official said. \"http://www.pressofatlanticcity.com/news/ap/nation/article_f48dafbc-52c2-553b-a892-5a10cf76ce9c.html\"", 
        "reply": " No one was kidding when they said Obama wants to design your new cars and trucks...FUG that... I'll rather buy Japanese than support his socialist automobile company...Won't be long before we see garbage 50hp russian style crap with the GM logo on it..", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 18:22:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Leave now...with all this drama in American politics to leave is to pass up on a unique opportunity to live trough one of the worst series of elections in the history of the country starting about twenty years ago... We have lost touch with the knack to move our government by democratic principles we were founded on and lack the initiative to tar a feather the lobbyists (and elected officials) and foriegn influence that has train wrecked our system... Time to see it through and make sure the grandkids have a nation to be proud of. Any thoughts as to when we start and where?", 
        "intTime": 20090529, 
        "postID": 12, 
        "quote": "", 
        "reply": "Leave now...with all this drama in American politics to leave is to pass up on a unique opportunity to live trough one of the worst series of elections in the history of the country starting about twenty years ago... We have lost touch with the knack to move our government by democratic principles we were founded on and lack the initiative to tar a feather the lobbyists (and elected officials) and foriegn influence that has train wrecked our system... Time to see it through and make sure the grandkids have a nation to be proud of. Any thoughts as to when we start and where?", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-29 22:34:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "It is going to be up to the Veterans of the Iraq and Afghanistan war to stand up and protest what is going on in our country. They are fighting for our safety and for freedom of others. While they are off fighting, some on their 5th deployment, our freedoms are being taken away from us by the same people who swore an oath to protect them. Once the current Veterans take a stand and simply say they are fed up then and only then will I stand next to them and sling arms.", 
        "intTime": 20090530, 
        "postID": 13, 
        "quote": "", 
        "reply": "It is going to be up to the Veterans of the Iraq and Afghanistan war to stand up and protest what is going on in our country. They are fighting for our safety and for freedom of others. While they are off fighting, some on their 5th deployment, our freedoms are being taken away from us by the same people who swore an oath to protect them. Once the current Veterans take a stand and simply say they are fed up then and only then will I stand next to them and sling arms.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 03:14:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"? Auto Industry Collapse Is Not an Option, Obama Says Article Comments (5) MORE IN POLITICS » EmailPrinter FriendlyShare: Yahoo Buzz ↓ More Save This ↓ More Text By CHRISTOPHER CONKEY President-elect Barack Obama suggested that bankruptcy wasn't a good option for Detroit's Big Three automakers, saying \"these aren't ordinary times\" given the country's current economic problems. \"The Big Three automakers have made repeated strategic mistakes,\" Mr. Obama said. \"But what I've also said is that the auto industry is the backbone of American manufacturing. … I don't think it's an option to simply allow it to collapse.\" Does this help a little? I get so tired of doing other people's homework at times. People on Mil.Com who know me Know that I tell the truth 87% of the time.", 
        "intTime": 20090530, 
        "postID": 14, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"?", 
        "reply": " Auto Industry Collapse Is Not an Option, Obama Says Article Comments (5) MORE IN POLITICS » EmailPrinter FriendlyShare: Yahoo Buzz ↓ More Save This ↓ More Text By CHRISTOPHER CONKEY President-elect Barack Obama suggested that bankruptcy wasn't a good option for Detroit's Big Three automakers, saying \"these aren't ordinary times\" given the country's current economic problems. \"The Big Three automakers have made repeated strategic mistakes,\" Mr. Obama said. \"But what I've also said is that the auto industry is the backbone of American manufacturing. … I don't think it's an option to simply allow it to collapse.\" Does this help a little? I get so tired of doing other people's homework at times. People on Mil.Com who know me Know that I tell the truth 87% of the time.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 03:30:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"? Second paragraph. For anyone who was listening in January, February and March of this year bankruptcy was clearly not the favored option of the administration. \"http://www.timesdispatch.com/rtd/business/companies/article/obama_bankruptcy_filing_new_lease_on_life_for_chrysler/264735/\"", 
        "intTime": 20090530, 
        "postID": 15, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"?", 
        "reply": " Second paragraph. For anyone who was listening in January, February and March of this year bankruptcy was clearly not the favored option of the administration. \"http://www.timesdispatch.com/rtd/business/companies/article/obama_bankruptcy_filing_new_lease_on_life_for_chrysler/264735/\"", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 04:00:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by 1WW: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it? Continue to buy Toyota, never vote again, and move and retire in Panama. What about you? Duster6: If you're thinking about Central America, check out Playa del CoCo, Nicoyan Peninsula, Guanacaste Province, Costa Rica. It's on the Pacific side, GREAT fishing, GREAT diving, and a HUGE retired Military community....I lived there for most of '98...And sometimes wonder WHY THE HELL I left...To the original topic: Obama and Pelosi are DEFINITELY lacking in the intelligence Dept. And the Leadership dept. And the Character dept. And the Patriotism dept. And the....Well, you get the picture.... Duane A. Brinson \"Oscar Mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 16, 
        "quote": "Originally posted by Duster6: quote: Originally posted by 1WW: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. So what are you going to do about it? Continue to buy Toyota, never vote again, and move and retire in Panama. What about you?", 
        "reply": " Duster6: If you're thinking about Central America, check out Playa del CoCo, Nicoyan Peninsula, Guanacaste Province, Costa Rica. It's on the Pacific side, GREAT fishing, GREAT diving, and a HUGE retired Military community....I lived there for most of '98...And sometimes wonder WHY THE HELL I left...To the original topic: Obama and Pelosi are DEFINITELY lacking in the intelligence Dept. And the Leadership dept. And the Character dept. And the Patriotism dept. And the....Well, you get the picture.... Duane A. Brinson \"Oscar Mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 04:05:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Hi ProudformerMarine; I have been to Costa Rica and although nice it can be expensive to live there. The city of David in Panama is not too far from Costa Rica and I could drive across the boarder within an hour. Panama allows retirees many benefits such as no home owners taxes for the first 20 years. No income taxes, 50% off hotel rooms during the week, 30% discount on food bought in restaurants. Discounts on prescriptions, a good VA medical clinic. Some great 5 star restaurants and beer cost $0.43 a bottle! The $400.00 a month I pay in taxes here in the US could go for a full time maid/cook and Gardner in Panama. When I was stationed in Panama back in 1981, I fell in love with the ocean, jungle, and the little road side bars that I stopped at to get a bite to eat and a cold one. Sure things have changed but some have not. I'm just hanging on till the wife retires from Civil Service. My remains will still be scattered over the out field at Yankee Stadium when I die.", 
        "intTime": 20090530, 
        "postID": 17, 
        "quote": "", 
        "reply": "Hi ProudformerMarine; I have been to Costa Rica and although nice it can be expensive to live there. The city of David in Panama is not too far from Costa Rica and I could drive across the boarder within an hour. Panama allows retirees many benefits such as no home owners taxes for the first 20 years. No income taxes, 50% off hotel rooms during the week, 30% discount on food bought in restaurants. Discounts on prescriptions, a good VA medical clinic. Some great 5 star restaurants and beer cost $0.43 a bottle! The $400.00 a month I pay in taxes here in the US could go for a full time maid/cook and Gardner in Panama. When I was stationed in Panama back in 1981, I fell in love with the ocean, jungle, and the little road side bars that I stopped at to get a bite to eat and a cold one. Sure things have changed but some have not. I'm just hanging on till the wife retires from Civil Service. My remains will still be scattered over the out field at Yankee Stadium when I die.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 06:46:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Yankee Stadium? Duster your in deep trouble... what happens when they re-sod", 
        "intTime": 20090530, 
        "postID": 18, 
        "quote": "", 
        "reply": "Yankee Stadium? Duster your in deep trouble... what happens when they re-sod", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 09:41:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Hi ProudformerMarine; I have been to Costa Rica and although nice it can be expensive to live there. The city of David in Panama is not too far from Costa Rica and I could drive across the boarder within an hour. Panama allows retirees many benefits such as no home owners taxes for the first 20 years. No income taxes, 50% off hotel rooms during the week, 30% discount on food bought in restaurants. Discounts on prescriptions, a good VA medical clinic. Some great 5 star restaurants and beer cost $0.43 a bottle! The $400.00 a month I pay in taxes here in the US could go for a full time maid/cook and Gardner in Panama. When I was stationed in Panama back in 1981, I fell in love with the ocean, jungle, and the little road side bars that I stopped at to get a bite to eat and a cold one. Sure things have changed but some have not. I'm just hanging on till the wife retires from Civil Service. My remains will still be scattered over the out field at Yankee Stadium when I die. Roger That Duster! I was with C/4-20th (M) Infantry at Fort Clayton from AUG80 to end of JUN82. I've been eyeing a little piece of heaven 45 minutes drive out of Panana City and 15 minutes inland from Pacific Ocean... Everything you've mentioned above is \"spot on!\" Eh..., except the Yankee Stadium bit...", 
        "intTime": 20090530, 
        "postID": 19, 
        "quote": "Originally posted by Duster6: Hi ProudformerMarine; I have been to Costa Rica and although nice it can be expensive to live there. The city of David in Panama is not too far from Costa Rica and I could drive across the boarder within an hour. Panama allows retirees many benefits such as no home owners taxes for the first 20 years. No income taxes, 50% off hotel rooms during the week, 30% discount on food bought in restaurants. Discounts on prescriptions, a good VA medical clinic. Some great 5 star restaurants and beer cost $0.43 a bottle! The $400.00 a month I pay in taxes here in the US could go for a full time maid/cook and Gardner in Panama. When I was stationed in Panama back in 1981, I fell in love with the ocean, jungle, and the little road side bars that I stopped at to get a bite to eat and a cold one. Sure things have changed but some have not. I'm just hanging on till the wife retires from Civil Service. My remains will still be scattered over the out field at Yankee Stadium when I die.", 
        "reply": " Roger That Duster! I was with C/4-20th (M) Infantry at Fort Clayton from AUG80 to end of JUN82. I've been eyeing a little piece of heaven 45 minutes drive out of Panana City and 15 minutes inland from Pacific Ocean... Everything you've mentioned above is \"spot on!\" Eh..., except the Yankee Stadium bit...", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 11:35:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Replace them in 3y 8 mos., and try and get fiscally responsible people in the Congress, regardless the party. Nothing else to be done. AFFIRMATIVE PETE", 
        "intTime": 20090530, 
        "postID": 20, 
        "quote": "Originally posted by peter3_1: Replace them in 3y 8 mos., and try and get fiscally responsible people in the Congress, regardless the party. Nothing else to be done.", 
        "reply": " AFFIRMATIVE PETE", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 11:39:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "peter3_1; quote: Replace them in 3y 8 mos., and try and get fiscally responsible people in the Congress, regardless the party. Nothing else to be done. Some of them can be replaced before then..", 
        "intTime": 20090530, 
        "postID": 21, 
        "quote": "Replace them in 3y 8 mos., and try and get fiscally responsible people in the Congress, regardless the party. Nothing else to be done.", 
        "reply": "peter3_1;  Some of them can be replaced before then..", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 13:46:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "3678131"
    }, 
    {
        "content": "Obama and Pelosi = Tweedle Dee and Tweedle Dumb? \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 22, 
        "quote": "", 
        "reply": "Obama and Pelosi = Tweedle Dee and Tweedle Dumb? \"The World's Finest\"", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 14:19:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Duster6: It is going to be up to the Veterans of the Iraq and Afghanistan war to stand up and protest what is going on in our country. They are fighting for our safety and for freedom of others. While they are off fighting, some on their 5th deployment, our freedoms are being taken away from us by the same people who swore an oath to protect them. Once the current Veterans take a stand and simply say they are fed up then and only then will I stand next to them and sling arms. Count me in brah..... Duane A. Brinson \"Oscar Mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 23, 
        "quote": "Originally posted by Duster6: It is going to be up to the Veterans of the Iraq and Afghanistan war to stand up and protest what is going on in our country. They are fighting for our safety and for freedom of others. While they are off fighting, some on their 5th deployment, our freedoms are being taken away from us by the same people who swore an oath to protect them. Once the current Veterans take a stand and simply say they are fed up then and only then will I stand next to them and sling arms.", 
        "reply": " Count me in brah..... Duane A. Brinson \"Oscar Mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 19:01:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"? Second paragraph. For anyone who was listening in January, February and March of this year bankruptcy was clearly not the favored option of the administration. \"http://www.timesdispatch.com/rtd/business/companies/article/obama_bankruptcy_filing_new_lease_on_life_for_chrysler/264735/\" So what your saying is, it was always an option. I thought so. Perhaps Duster has the quote where Obama stated it wasn't an option.", 
        "intTime": 20090530, 
        "postID": 24, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"? Second paragraph. For anyone who was listening in January, February and March of this year bankruptcy was clearly not the favored option of the administration. \"http://www.timesdispatch.com/rtd/business/companies/article/obama_bankruptcy_filing_new_lease_on_life_for_chrysler/264735/\"", 
        "reply": " So what your saying is, it was always an option. I thought so. Perhaps Duster has the quote where Obama stated it wasn't an option.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-30 20:33:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"? Second paragraph. For anyone who was listening in January, February and March of this year bankruptcy was clearly not the favored option of the administration. \"http://www.timesdispatch.com/rtd/business/companies/article/obama_bankruptcy_filing_new_lease_on_life_for_chrysler/264735/\" So what your saying is, it was always an option. I thought so. Perhaps Duster has the quote where Obama stated it wasn't an option. Why is it so important that reality be edited to suit your partisan needs? In Jan and Feb Obama was adamant that the \"Big 3\" not be allowed to enter bankruptcy as it would be catastrophic for the economy. Billions of dollars later we are experiencing what most believed was inevitable and apparently it is necessary that for some the words of The One be changed to reflect the new reality. By all means reply with a forceful psyho-rant, it will not, however, change reality.", 
        "intTime": 20090531, 
        "postID": 25, 
        "quote": "Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"? Second paragraph. For anyone who was listening in January, February and March of this year bankruptcy was clearly not the favored option of the administration. \"http://www.timesdispatch.com/rtd/business/companies/article/obama_bankruptcy_filing_new_lease_on_life_for_chrysler/264735/\" So what your saying is, it was always an option. I thought so. Perhaps Duster has the quote where Obama stated it wasn't an option.", 
        "reply": " Why is it so important that reality be edited to suit your partisan needs? In Jan and Feb Obama was adamant that the \"Big 3\" not be allowed to enter bankruptcy as it would be catastrophic for the economy. Billions of dollars later we are experiencing what most believed was inevitable and apparently it is necessary that for some the words of The One be changed to reflect the new reality. By all means reply with a forceful psyho-rant, it will not, however, change reality.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-31 03:27:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Ever get the feeling Barry has no idea what he is doing? The new Progressive school of thought of throwing money at problems seems an awful lot like the old liberal school of thought of throwing money at problems. Seems to working as just as well, as well. \"Quis custodiet ipsos custodies\"", 
        "intTime": 20090531, 
        "postID": 26, 
        "quote": "", 
        "reply": "Ever get the feeling Barry has no idea what he is doing? The new Progressive school of thought of throwing money at problems seems an awful lot like the old liberal school of thought of throwing money at problems. Seems to working as just as well, as well. \"Quis custodiet ipsos custodies\"", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-31 14:08:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "Azurerepublic"
    }, 
    {
        "content": "quote: Originally posted by Azurerepublic: Ever get the feeling Barry has no idea what he is doing? The new Progressive school of thought of throwing money at problems seems an awful lot like the old liberal school of thought of throwing money at problems. Seems to working as just as well, as well. No. Were you asleep for the last 8 years or is that selective memory kicking in?? Try honesty for a change.", 
        "intTime": 20090531, 
        "postID": 27, 
        "quote": "Originally posted by Azurerepublic: Ever get the feeling Barry has no idea what he is doing? The new Progressive school of thought of throwing money at problems seems an awful lot like the old liberal school of thought of throwing money at problems. Seems to working as just as well, as well.", 
        "reply": " No. Were you asleep for the last 8 years or is that selective memory kicking in?? Try honesty for a change.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-31 18:06:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"? Second paragraph. For anyone who was listening in January, February and March of this year bankruptcy was clearly not the favored option of the administration. \"http://www.timesdispatch.com/rtd/business/companies/article/obama_bankruptcy_filing_new_lease_on_life_for_chrysler/264735/\" So what your saying is, it was always an option. I thought so. Perhaps Duster has the quote where Obama stated it wasn't an option. Why is it so important that reality be edited to suit your partisan needs? In Jan and Feb Obama was adamant that the \"Big 3\" not be allowed to enter bankruptcy as it would be catastrophic for the economy. Billions of dollars later we are experiencing what most believed was inevitable and apparently it is necessary that for some the words of The One be changed to reflect the new reality. By all means reply with a forceful psyho-rant, it will not, however, change reality. You could save a lot of time if you'd just provide the quote instead of what you think you heard.", 
        "intTime": 20090531, 
        "postID": 28, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by adminnco1: quote: Originally posted by WepsFP: quote: Originally posted by Duster6: Obama said on National TV when first elected that he was not in the car manufacturing business and that he did not think bankrupcy was an option. A few days later Nancy tells the world that bankrupcy is not an option for chrysler and GM. Well, Monday GM joins Chrysler in going into bankrupcy. Now if it wasn't an option a few months ago why is it an option now? Where is Tim Geithner? Wasn't he picked by Barry to lead us out of the depression that Bush put us in? I'm telling you all this right now. If you all thought Bush was messed up an Obama and his side kicks are the answer then we are doomed as a nation. Could you provide the quote that Obama said bankruptcy was \"not an option\"? Second paragraph. For anyone who was listening in January, February and March of this year bankruptcy was clearly not the favored option of the administration. \"http://www.timesdispatch.com/rtd/business/companies/article/obama_bankruptcy_filing_new_lease_on_life_for_chrysler/264735/\" So what your saying is, it was always an option. I thought so. Perhaps Duster has the quote where Obama stated it wasn't an option. Why is it so important that reality be edited to suit your partisan needs? In Jan and Feb Obama was adamant that the \"Big 3\" not be allowed to enter bankruptcy as it would be catastrophic for the economy. Billions of dollars later we are experiencing what most believed was inevitable and apparently it is necessary that for some the words of The One be changed to reflect the new reality. By all means reply with a forceful psyho-rant, it will not, however, change reality.", 
        "reply": " You could save a lot of time if you'd just provide the quote instead of what you think you heard.", 
        "threadID": "409192893_8100026422001", 
        "time": "2009-05-31 18:07:00", 
        "title": "Obama and Pelosi are lacking in the intelligence dept.", 
        "userID": "WepsFP"
    }
]