[
    {
        "content": "- Wow, this is a pretty interesting Op Ed, written by a Marine Iraq vet. His three main points are that, 1) the Air Force should be scrapped, 2) the military promotion system should be radically changed, and 3) some kind of national service program should be created. Lots to chew on here! ++http://www.nytimes.com/2009/04/21/opinion/21kane.html?_r=1 -", 
        "intTime": 20090421, 
        "postID": 1, 
        "quote": "", 
        "reply": "- Wow, this is a pretty interesting Op Ed, written by a Marine Iraq vet. His three main points are that, 1) the Air Force should be scrapped, 2) the military promotion system should be radically changed, and 3) some kind of national service program should be created. Lots to chew on here! ++http://www.nytimes.com/2009/04/21/opinion/21kane.html?_r=1 -", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-21 16:41:00", 
        "title": "Scrap the Air Force", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "Good article by a sharp cookie. I'll sign off on all 3 items...oh, wait... it's not my business to decide", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "", 
        "reply": "Good article by a sharp cookie. I'll sign off on all 3 items...oh, wait... it's not my business to decide", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-21 16:54:00", 
        "title": "Scrap the Air Force", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "Dumb Jar-Head.......must have failed to become a piolt/ didn't get promoted fastenought......JMHO.", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "", 
        "reply": "Dumb Jar-Head.......must have failed to become a piolt/ didn't get promoted fastenought......JMHO.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-21 20:04:00", 
        "title": "Scrap the Air Force", 
        "userID": "Migbuster"
    }, 
    {
        "content": "I began having problems with the story in the second paragraph. \"Not since Henry Stimson’s tenure from 1940 to ’45 has a defense secretary been faced to the same degree with simultaneously fighting a war and carrying out far-reaching reforms.\" What reforms were carried out during WWII? Ending segregation in the armed forces? That happened uner Truman; after the war. Of course the Army Air Corp became thwe Army Air Force; one step closer to an independent branch of the armed forces. At the moment, the Army, Navy and Marine Corps are at war, but the Air Force is not. This is not the fault of the Air Force: it is simply not structured to be in the fights in Iraq and Afghanistan. And since the Air Force is not as involved in the current war as the author would like, we abolish it. That's being very shortsighted. The result is an “up or out” system that demands service members move up the ladder simply to stay in the military. Any soldier passed over for promotion twice must leave or retire. This is one segment of the editorial that makes sence. If a service member is competent at a certain level, they should be able to stay in at that level.", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "", 
        "reply": "I began having problems with the story in the second paragraph. \"Not since Henry Stimson’s tenure from 1940 to ’45 has a defense secretary been faced to the same degree with simultaneously fighting a war and carrying out far-reaching reforms.\" What reforms were carried out during WWII? Ending segregation in the armed forces? That happened uner Truman; after the war. Of course the Army Air Corp became thwe Army Air Force; one step closer to an independent branch of the armed forces. At the moment, the Army, Navy and Marine Corps are at war, but the Air Force is not. This is not the fault of the Air Force: it is simply not structured to be in the fights in Iraq and Afghanistan. And since the Air Force is not as involved in the current war as the author would like, we abolish it. That's being very shortsighted. The result is an “up or out” system that demands service members move up the ladder simply to stay in the military. Any soldier passed over for promotion twice must leave or retire. This is one segment of the editorial that makes sence. If a service member is competent at a certain level, they should be able to stay in at that level.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 01:04:00", 
        "title": "Scrap the Air Force", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Part of the harsh feelings towards the Air Force from the other service branches come from the perception that the USAF wants to control all fixed wing (non-helicopter) aviation and space/satellite assets - a perception which is partially false. There are a couple steps that the USAF could take towards ending this: 1. Turning dedicated Close Air Support assets (in particular the A-10 Warthog) over to the Army/USMC. 2. Take an equal part and share of the warfighting burden from the other 3 services - to include budget cuts if need be so that the soldier/Marine on the ground has ALL needed equipment. Yes, I know that means that some stateside Airman may have to do without their leather massage chair, but sacrifices must be made. 3. Let the other 3 services develop fixed wing aviation and space assets without interference.", 
        "intTime": 20090422, 
        "postID": 5, 
        "quote": "", 
        "reply": "Part of the harsh feelings towards the Air Force from the other service branches come from the perception that the USAF wants to control all fixed wing (non-helicopter) aviation and space/satellite assets - a perception which is partially false. There are a couple steps that the USAF could take towards ending this: 1. Turning dedicated Close Air Support assets (in particular the A-10 Warthog) over to the Army/USMC. 2. Take an equal part and share of the warfighting burden from the other 3 services - to include budget cuts if need be so that the soldier/Marine on the ground has ALL needed equipment. Yes, I know that means that some stateside Airman may have to do without their leather massage chair, but sacrifices must be made. 3. Let the other 3 services develop fixed wing aviation and space assets without interference.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 01:42:00", 
        "title": "Scrap the Air Force", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "The USAF is not at war? Seems to me they have acft in theater. A-10, F-15E, F-16, B-1, B-52, AC-130s, etc all flying combat missions. C-130s, C-17, etc. flying into field where they take fire. USAF CSAR helos deployed. Whining abut promotions. Maybe he should read up on how they were done years ago, kiss azz and get promoted. Go PCS, have to start all over again. Thinks the country will accept national service of anykind. What we have here is someone who thinks his part of the world is the only one that exists.", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "", 
        "reply": "The USAF is not at war? Seems to me they have acft in theater. A-10, F-15E, F-16, B-1, B-52, AC-130s, etc all flying combat missions. C-130s, C-17, etc. flying into field where they take fire. USAF CSAR helos deployed. Whining abut promotions. Maybe he should read up on how they were done years ago, kiss azz and get promoted. Go PCS, have to start all over again. Thinks the country will accept national service of anykind. What we have here is someone who thinks his part of the world is the only one that exists.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 07:33:00", 
        "title": "Scrap the Air Force", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Part of the harsh feelings towards the Air Force from the other service branches come from the perception that the USAF wants to control all fixed wing (non-helicopter) aviation and space/satellite assets - a perception which is partially false. All fixed wing? When did the USAF try to grab USN/USMC assets? Does the USAF believe in all air assets being controlled from a central point, an air componenet commander? Yes. But so do other services as well. There are a couple steps that the USAF could take towards ending this: 1. Turning dedicated Close Air Support assets (in particular the A-10 Warthog) over to the Army/USMC. Great, divide the assets up. Good move. We all just know how well the Army and USMC will get along sharing them. BTW - The A-10 is getting old and according to DoD, The F-35 will be more than able to replace it and the AV-8B. Another great idea 2. Take an equal part and share of the warfighting burden from the other 3 services - to include budget cuts if need be so that the soldier/Marine on the ground has ALL needed equipment. Yes, I know that means that some stateside Airman may have to do without their leather massage chair you can shove this statement up your azz. In 23 years I never had one. Talking about perpetuation of BS and myth. , but sacrifices must be made. This was written by some who has not a flippin' clue about the USAF other than the garbage he reads. How much experience do you have with the USAF Phoenix? Read the news lately? USAF is taking LARGE budget hits. Very limited new air superiority assets, no new long range strike platforms, no upgrade in CSAR capability, ICBMS very old and getting older, ANG acft not being addressed, etc. 3. Let the other 3 services develop fixed wing aviation and space assets without interference. Take a look - two of them, the USN and USMC already HAVE fixed wing assets and DO develop their own. Other services DO develop space based assets. They DO have their own sattellites. Keep talking, Phoenix. It just proves how little you know about this subject.", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "Originally posted by PhoenixDark: Part of the harsh feelings towards the Air Force from the other service branches come from the perception that the USAF wants to control all fixed wing (non-helicopter) aviation and space/satellite assets - a perception which is partially false. All fixed wing? When did the USAF try to grab USN/USMC assets? Does the USAF believe in all air assets being controlled from a central point, an air componenet commander? Yes. But so do other services as well. There are a couple steps that the USAF could take towards ending this: 1. Turning dedicated Close Air Support assets (in particular the A-10 Warthog) over to the Army/USMC. Great, divide the assets up. Good move. We all just know how well the Army and USMC will get along sharing them. BTW - The A-10 is getting old and according to DoD, The F-35 will be more than able to replace it and the AV-8B. Another great idea 2. Take an equal part and share of the warfighting burden from the other 3 services - to include budget cuts if need be so that the soldier/Marine on the ground has ALL needed equipment. Yes, I know that means that some stateside Airman may have to do without their leather massage chair you can shove this statement up your azz. In 23 years I never had one. Talking about perpetuation of BS and myth. , but sacrifices must be made. This was written by some who has not a flippin' clue about the USAF other than the garbage he reads. How much experience do you have with the USAF Phoenix? Read the news lately? USAF is taking LARGE budget hits. Very limited new air superiority assets, no new long range strike platforms, no upgrade in CSAR capability, ICBMS very old and getting older, ANG acft not being addressed, etc. 3. Let the other 3 services develop fixed wing aviation and space assets without interference. Take a look - two of them, the USN and USMC already HAVE fixed wing assets and DO develop their own. Other services DO develop space based assets. They DO have their own sattellites.", 
        "reply": " Keep talking, Phoenix. It just proves how little you know about this subject.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 07:45:00", 
        "title": "Scrap the Air Force", 
        "userID": "sw614"
    }, 
    {
        "content": "no we need the airforce... it is apart of our military and necessary... proud to be the son of 1st generation air force service member and dfc recipient... [ This message has been edited. Last edited by: outlaws93, Wed 22 April 2009 03:49 PM", 
        "intTime": 20090422, 
        "postID": 8, 
        "quote": "", 
        "reply": "no we need the airforce... it is apart of our military and necessary... proud to be the son of 1st generation air force service member and dfc recipient... [ This message has been edited. Last edited by: outlaws93, Wed 22 April 2009 03:49 PM", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 07:47:00", 
        "title": "Scrap the Air Force", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: Dumb Jar-Head.......must have failed to become a piolt/ didn't get promoted fastenought......JMHO. Yup, that was my take on it almost immediately. It is the many layered redundancy of our military that makes it such a befuddling target to potential enemies. The Air Force was moved out of the control of the Army to give it more flexibility, while allowing the Army to focus on the ground war. This need was made evident in both Europe and the Pacific during World War II. B-17s and B-29s had no reason or business being controlled by people focused on fighting the local, tactical war. Navy and Marine assets are mostly tactical for direct support of their operations, as they should be. Air Force Tactical Assets can and do provide direct support of Army and other operations as need by immediate request, but Army leaders should not be burdened with the maintenance of Air Fields at great distance form where the fighting is. That would be a unneeded nightmare... In hard times and lean times, there may be some fat to be cut away, but to suggest the Air Force should be cut up into pieces and doled out to the other services is pretty shallow-thinking and stupid - - Wandering and Wondering", 
        "intTime": 20090422, 
        "postID": 9, 
        "quote": "Originally posted by Migbuster: Dumb Jar-Head.......must have failed to become a piolt/ didn't get promoted fastenought......JMHO.", 
        "reply": " Yup, that was my take on it almost immediately. It is the many layered redundancy of our military that makes it such a befuddling target to potential enemies. The Air Force was moved out of the control of the Army to give it more flexibility, while allowing the Army to focus on the ground war. This need was made evident in both Europe and the Pacific during World War II. B-17s and B-29s had no reason or business being controlled by people focused on fighting the local, tactical war. Navy and Marine assets are mostly tactical for direct support of their operations, as they should be. Air Force Tactical Assets can and do provide direct support of Army and other operations as need by immediate request, but Army leaders should not be burdened with the maintenance of Air Fields at great distance form where the fighting is. That would be a unneeded nightmare... In hard times and lean times, there may be some fat to be cut away, but to suggest the Air Force should be cut up into pieces and doled out to the other services is pretty shallow-thinking and stupid - - Wandering and Wondering", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 07:48:00", 
        "title": "Scrap the Air Force", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by Migbuster: Dumb Jar-Head.......must have failed to become a piolt/ didn't get promoted fastenought......JMHO. Yup, that was my take on it almost immediately. It is the many layered redundancy of our military that makes it such a befuddling target to potential enemies. The Air Force was moved out of the control of the Army to give it more flexibility, while allowing the Army to focus on the ground war. This need was made evident in both Europe and the Pacific during World War II. B-17s and B-29s had no reason or business being controlled by people focused on fighting the local, tactical war. Navy and Marine assets are mostly tactical for direct support of their operations, as they should be. Air Force Tactical Assets can and do provide direct support of Army and other operations as need by immediate request, but Army leaders should not be burdened with the maintenance of Air Fields at great distance form where the fighting is. That would be a unneeded nightmare... In hard times and lean times, there may be some fat to be cut away, but to suggest the Air Force should be cut up into pieces and doled out to the other services is pretty shallow-thinking and stupid - - thanks GWG", 
        "intTime": 20090422, 
        "postID": 10, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by Migbuster: Dumb Jar-Head.......must have failed to become a piolt/ didn't get promoted fastenought......JMHO. Yup, that was my take on it almost immediately. It is the many layered redundancy of our military that makes it such a befuddling target to potential enemies. The Air Force was moved out of the control of the Army to give it more flexibility, while allowing the Army to focus on the ground war. This need was made evident in both Europe and the Pacific during World War II. B-17s and B-29s had no reason or business being controlled by people focused on fighting the local, tactical war. Navy and Marine assets are mostly tactical for direct support of their operations, as they should be. Air Force Tactical Assets can and do provide direct support of Army and other operations as need by immediate request, but Army leaders should not be burdened with the maintenance of Air Fields at great distance form where the fighting is. That would be a unneeded nightmare... In hard times and lean times, there may be some fat to be cut away, but to suggest the Air Force should be cut up into pieces and doled out to the other services is pretty shallow-thinking and stupid - -", 
        "reply": " thanks GWG", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 07:51:00", 
        "title": "Scrap the Air Force", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: The result is an “up or out” system that demands service members move up the ladder simply to stay in the military. Any soldier passed over for promotion twice must leave or retire. This is one segment of the editorial that makes sence. If a service member is competent at a certain level, they should be able to stay in at that level. The Navy is implementing a version of this, though the officer communities have had this for a loooong time. All Navy enlisted will be required to apply and complete for a limited number of reenlistment slots based on current manning needs in individual ratings (MOSs for you non-Sailors.) Any E-7 and above beyond retirement age will also be required to go before a continuation board every three years, which has the option of retiring them or keeping them in place.", 
        "intTime": 20090422, 
        "postID": 11, 
        "quote": "Originally posted by scooter_mech: The result is an “up or out” system that demands service members move up the ladder simply to stay in the military. Any soldier passed over for promotion twice must leave or retire. This is one segment of the editorial that makes sence. If a service member is competent at a certain level, they should be able to stay in at that level.", 
        "reply": " The Navy is implementing a version of this, though the officer communities have had this for a loooong time. All Navy enlisted will be required to apply and complete for a limited number of reenlistment slots based on current manning needs in individual ratings (MOSs for you non-Sailors.) Any E-7 and above beyond retirement age will also be required to go before a continuation board every three years, which has the option of retiring them or keeping them in place.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 09:19:00", 
        "title": "Scrap the Air Force", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: At the moment, the Army, Navy and Marine Corps are at war, but the Air Force is not. This is not the fault of the Air Force: it is simply not structured to be in the fights in Iraq and Afghanistan. Maybe the writer should break this news to the families and colleagues of SrA Jason Cunningham and TSgt John Chapman.", 
        "intTime": 20090422, 
        "postID": 12, 
        "quote": "At the moment, the Army, Navy and Marine Corps are at war, but the Air Force is not. This is not the fault of the Air Force: it is simply not structured to be in the fights in Iraq and Afghanistan.", 
        "reply": " Maybe the writer should break this news to the families and colleagues of SrA Jason Cunningham and TSgt John Chapman.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 09:43:00", 
        "title": "Scrap the Air Force", 
        "userID": "Jimmy_Tee"
    }, 
    {
        "content": "LOL Who is this guy? Let's play Devil's Advocate (I have tremendous respect for the Marines Corps)... Has he ever stopped to think that, under the same logic(?) he's employing here, the Army with its Airborne and Special Forces makes the Marines redundant? Marine Air in the presence of Naval Air and Air Force assets is costly and unnecessary? What, exactly, do the Marines bring that the other services can't? I'd like to hear him answer this question. This guy must not have served in the military long enough to understand that there are unique aspects of each of the Services' missions to make each of them vital and necessary to national security. Sounds like he was a victim of the \"up and out\" that he's whining about...", 
        "intTime": 20090422, 
        "postID": 13, 
        "quote": "", 
        "reply": "LOL Who is this guy? Let's play Devil's Advocate (I have tremendous respect for the Marines Corps)... Has he ever stopped to think that, under the same logic(?) he's employing here, the Army with its Airborne and Special Forces makes the Marines redundant? Marine Air in the presence of Naval Air and Air Force assets is costly and unnecessary? What, exactly, do the Marines bring that the other services can't? I'd like to hear him answer this question. This guy must not have served in the military long enough to understand that there are unique aspects of each of the Services' missions to make each of them vital and necessary to national security. Sounds like he was a victim of the \"up and out\" that he's whining about...", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 10:33:00", 
        "title": "Scrap the Air Force", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: LOL Who is this guy? Let's play Devil's Advocate (I have tremendous respect for the Marines Corps)... Has he ever stopped to think that, under the same logic(?) he's employing here, the Army with its Airborne and Special Forces makes the Marines redundant? Marine Air in the presence of Naval Air and Air Force assets is costly and unnecessary? What, exactly, do the Marines bring that the other services can't? I'd like to hear him answer this question. This guy must not have served in the military long enough to understand that there are unique aspects of each of the Services' missions to make each of them vital and necessary to national security. Sounds like he was a victim of the \"up and out\" that he's whining about... This was my thought too! The USMC is an admirable group, and have done great things, but they have spread out to the point that they are redundent. If any group should be \"reallocated\" it is them, but they have a lot of sentiment on their side. No one will vote to eliminate or significantly reduce such a justly proud organization. I agree with his statement on \"up or out\" - however much it seems to come from his own bad experience. The only advantage I see to this policy is that it feeds veterans back into the civilian world, but does so at the cost of our active military. This is the only one of his proposals with a snowball's chance of passing. \"National Service\"? NOT ... GOING ... TO ... HAPPEN! Barring WWIII, Congress will not commit the mass suicide of instituting a draft.", 
        "intTime": 20090422, 
        "postID": 14, 
        "quote": "Originally posted by mcgreer: LOL Who is this guy? Let's play Devil's Advocate (I have tremendous respect for the Marines Corps)... Has he ever stopped to think that, under the same logic(?) he's employing here, the Army with its Airborne and Special Forces makes the Marines redundant? Marine Air in the presence of Naval Air and Air Force assets is costly and unnecessary? What, exactly, do the Marines bring that the other services can't? I'd like to hear him answer this question. This guy must not have served in the military long enough to understand that there are unique aspects of each of the Services' missions to make each of them vital and necessary to national security. Sounds like he was a victim of the \"up and out\" that he's whining about...", 
        "reply": " This was my thought too! The USMC is an admirable group, and have done great things, but they have spread out to the point that they are redundent. If any group should be \"reallocated\" it is them, but they have a lot of sentiment on their side. No one will vote to eliminate or significantly reduce such a justly proud organization. I agree with his statement on \"up or out\" - however much it seems to come from his own bad experience. The only advantage I see to this policy is that it feeds veterans back into the civilian world, but does so at the cost of our active military. This is the only one of his proposals with a snowball's chance of passing. \"National Service\"? NOT ... GOING ... TO ... HAPPEN! Barring WWIII, Congress will not commit the mass suicide of instituting a draft.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 11:46:00", 
        "title": "Scrap the Air Force", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: LOL Who is this guy? Let's play Devil's Advocate (I have tremendous respect for the Marines Corps)... Has he ever stopped to think that, under the same logic(?) he's employing here, the Army with its Airborne and Special Forces makes the Marines redundant? Marine Air in the presence of Naval Air and Air Force assets is costly and unnecessary? What, exactly, do the Marines bring that the other services can't? I'd like to hear him answer this question. This guy must not have served in the military long enough to understand that there are unique aspects of each of the Services' missions to make each of them vital and necessary to national security. Sounds like he was a victim of the \"up and out\" that he's whining about... One thing about Marine culture that i have learned on these forums is that there is a sizable group of Marines who feel that only Marines are \"real military,\" and the rest of us in the service are somehow less deseerving of respect. I will state my response as politely as I can: That is horse-****.", 
        "intTime": 20090422, 
        "postID": 15, 
        "quote": "Originally posted by mcgreer: LOL Who is this guy? Let's play Devil's Advocate (I have tremendous respect for the Marines Corps)... Has he ever stopped to think that, under the same logic(?) he's employing here, the Army with its Airborne and Special Forces makes the Marines redundant? Marine Air in the presence of Naval Air and Air Force assets is costly and unnecessary? What, exactly, do the Marines bring that the other services can't? I'd like to hear him answer this question. This guy must not have served in the military long enough to understand that there are unique aspects of each of the Services' missions to make each of them vital and necessary to national security. Sounds like he was a victim of the \"up and out\" that he's whining about...", 
        "reply": " One thing about Marine culture that i have learned on these forums is that there is a sizable group of Marines who feel that only Marines are \"real military,\" and the rest of us in the service are somehow less deseerving of respect. I will state my response as politely as I can: That is horse-****.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 12:07:00", 
        "title": "Scrap the Air Force", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by mcgreer: LOL Who is this guy? Let's play Devil's Advocate (I have tremendous respect for the Marines Corps)... Has he ever stopped to think that, under the same logic(?) he's employing here, the Army with its Airborne and Special Forces makes the Marines redundant? Marine Air in the presence of Naval Air and Air Force assets is costly and unnecessary? What, exactly, do the Marines bring that the other services can't? I'd like to hear him answer this question. This guy must not have served in the military long enough to understand that there are unique aspects of each of the Services' missions to make each of them vital and necessary to national security. Sounds like he was a victim of the \"up and out\" that he's whining about... This was my thought too! The USMC is an admirable group, and have done great things, but they have spread out to the point that they are redundent. If any group should be \"reallocated\" it is them, but they have a lot of sentiment on their side. No one will vote to eliminate or significantly reduce such a justly proud organization. I agree with his statement on \"up or out\" - however much it seems to come from his own bad experience. The only advantage I see to this policy is that it feeds veterans back into the civilian world, but does so at the cost of our active military. This is the only one of his proposals with a snowball's chance of passing. \"National Service\"? NOT ... GOING ... TO ... HAPPEN! Barring WWIII, Congress will not commit the mass suicide of instituting a draft. My thinking exactly, gentlemen. I am forever reading how the USAf can be disbanded, but yet I never see these guys recommend similar action for their own services. I generally find it is total ignorance of understanding waht a total force is all about. Plus I have been reading this crap for 32 years which explains my general pizz-off attitude everytime one of these posts comes up. Burns my azz more than a flame 4 foot high. The up-or-out sitiuation is a double-edged sword. Why force out an O-4 if all he wants to do is fly acft? If he is good at it, let him roll. But he does continually fill a slot someone esle will not be promoted into. Same with enlisted that is why there is/was a HYT policy. The USN board thing sounds a bit too much, but if it works for them.....", 
        "intTime": 20090422, 
        "postID": 16, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by mcgreer: LOL Who is this guy? Let's play Devil's Advocate (I have tremendous respect for the Marines Corps)... Has he ever stopped to think that, under the same logic(?) he's employing here, the Army with its Airborne and Special Forces makes the Marines redundant? Marine Air in the presence of Naval Air and Air Force assets is costly and unnecessary? What, exactly, do the Marines bring that the other services can't? I'd like to hear him answer this question. This guy must not have served in the military long enough to understand that there are unique aspects of each of the Services' missions to make each of them vital and necessary to national security. Sounds like he was a victim of the \"up and out\" that he's whining about... This was my thought too! The USMC is an admirable group, and have done great things, but they have spread out to the point that they are redundent. If any group should be \"reallocated\" it is them, but they have a lot of sentiment on their side. No one will vote to eliminate or significantly reduce such a justly proud organization. I agree with his statement on \"up or out\" - however much it seems to come from his own bad experience. The only advantage I see to this policy is that it feeds veterans back into the civilian world, but does so at the cost of our active military. This is the only one of his proposals with a snowball's chance of passing. \"National Service\"? NOT ... GOING ... TO ... HAPPEN! Barring WWIII, Congress will not commit the mass suicide of instituting a draft.", 
        "reply": " My thinking exactly, gentlemen. I am forever reading how the USAf can be disbanded, but yet I never see these guys recommend similar action for their own services. I generally find it is total ignorance of understanding waht a total force is all about. Plus I have been reading this crap for 32 years which explains my general pizz-off attitude everytime one of these posts comes up. Burns my azz more than a flame 4 foot high. The up-or-out sitiuation is a double-edged sword. Why force out an O-4 if all he wants to do is fly acft? If he is good at it, let him roll. But he does continually fill a slot someone esle will not be promoted into. Same with enlisted that is why there is/was a HYT policy. The USN board thing sounds a bit too much, but if it works for them.....", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 12:15:00", 
        "title": "Scrap the Air Force", 
        "userID": "sw614"
    }, 
    {
        "content": "Also with every Army unit is an Air Force Weather detachment. \"DEATH ON CALL\"", 
        "intTime": 20090422, 
        "postID": 17, 
        "quote": "", 
        "reply": "Also with every Army unit is an Air Force Weather detachment. \"DEATH ON CALL\"", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 12:44:00", 
        "title": "Scrap the Air Force", 
        "userID": "Combatmix"
    }, 
    {
        "content": "What annoyed me about this article (of which I don't think I agreed with even one sentence), besides the many points already brought up, was that his numbers are terrible. 5% of \"troops in Iraq\"? How about \"Troops in Support of OIF\"? 'Cause when you calculate that the numbers more than double (12%, if I recall). He's using numbers that don't count an airman running flights daily from Baghdad to Ramstein (perhaps carrying wounded Marines to Landstuhl) as being in Iraq, as that airman is stationed in Germany. Sure, these guys are in theater nearly every day and puts his ass on the line, but he doesn't count purely on the Jarhead standard that only folks who sleep in Iraq for the whole tour count as being \"at war\". Same goes, I guess, for a fighter pilot flying CAS out of a base in Kuwait (though who knows... He might have cherry picked his numbers to include 5th Fleet but exclude USAF from EUCOM or CONUS who support OIF, which may or may not mean that Kuwait counts). National Service (let alone an actual draft) is obviously nonsensical for anyone who's studied the issue. I mean, is the problem that our unit morale or capability hasn't sunk to the level of draftee army's like the Russians? Why would anyone want to go back to having an Army made up of kids who don't want to be there and just didn't have daddies rich enough to pull the right strings? As for promotions... Do we really want to go back to the old way of doing things where veterans just stayed around as long as they wanted? Where guys like LTC Eisenhower have been sitting around waiting for the old guys to die or finally retire? (unless a war comes, in which case you quickly promote the people you should have promoted in the first place 4 or 5 grades) Do we want to return to the days where guys like U.S. Grant and W.T. Sherman left the Army as O-3's due to lack of opportunity for advancement (the Army being run at the time by a veteran of the War of 1812, who would be 74 years old before he retired)? What a terrible op-ed...", 
        "intTime": 20090422, 
        "postID": 18, 
        "quote": "", 
        "reply": "What annoyed me about this article (of which I don't think I agreed with even one sentence), besides the many points already brought up, was that his numbers are terrible. 5% of \"troops in Iraq\"? How about \"Troops in Support of OIF\"? 'Cause when you calculate that the numbers more than double (12%, if I recall). He's using numbers that don't count an airman running flights daily from Baghdad to Ramstein (perhaps carrying wounded Marines to Landstuhl) as being in Iraq, as that airman is stationed in Germany. Sure, these guys are in theater nearly every day and puts his ass on the line, but he doesn't count purely on the Jarhead standard that only folks who sleep in Iraq for the whole tour count as being \"at war\". Same goes, I guess, for a fighter pilot flying CAS out of a base in Kuwait (though who knows... He might have cherry picked his numbers to include 5th Fleet but exclude USAF from EUCOM or CONUS who support OIF, which may or may not mean that Kuwait counts). National Service (let alone an actual draft) is obviously nonsensical for anyone who's studied the issue. I mean, is the problem that our unit morale or capability hasn't sunk to the level of draftee army's like the Russians? Why would anyone want to go back to having an Army made up of kids who don't want to be there and just didn't have daddies rich enough to pull the right strings? As for promotions... Do we really want to go back to the old way of doing things where veterans just stayed around as long as they wanted? Where guys like LTC Eisenhower have been sitting around waiting for the old guys to die or finally retire? (unless a war comes, in which case you quickly promote the people you should have promoted in the first place 4 or 5 grades) Do we want to return to the days where guys like U.S. Grant and W.T. Sherman left the Army as O-3's due to lack of opportunity for advancement (the Army being run at the time by a veteran of the War of 1812, who would be 74 years old before he retired)? What a terrible op-ed...", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 15:45:00", 
        "title": "Scrap the Air Force", 
        "userID": "Guinnessmonkey"
    }, 
    {
        "content": "So let me get this straight, in layman's terms his points are: If I'm not using a tool right at this moment, I don't need it ever. <Guess I'll keep just my Phillip's head screwdriver, since it's the tool I'm using right now, all the others can go in the trash> If another tool looks similar and can be used in the same manner, why have two? <A pipe wrench is about the same weight as a hammer, why do I need both?> If we've invested in good mechanics to use these tools, when the shop is empty of work, I should go on paying them all lest they start working somewhere else? <Uh, OK. \"That'll be $400 for labor to change your windshield wipers, Ma'am. After all, I've got these 22 mechanics in the shop to feed...\"> Tell me again, why didn't this guy become the Marine Corps Commandant? Sullivan013", 
        "intTime": 20090422, 
        "postID": 19, 
        "quote": "", 
        "reply": "So let me get this straight, in layman's terms his points are: If I'm not using a tool right at this moment, I don't need it ever. <Guess I'll keep just my Phillip's head screwdriver, since it's the tool I'm using right now, all the others can go in the trash> If another tool looks similar and can be used in the same manner, why have two? <A pipe wrench is about the same weight as a hammer, why do I need both?> If we've invested in good mechanics to use these tools, when the shop is empty of work, I should go on paying them all lest they start working somewhere else? <Uh, OK. \"That'll be $400 for labor to change your windshield wipers, Ma'am. After all, I've got these 22 mechanics in the shop to feed...\"> Tell me again, why didn't this guy become the Marine Corps Commandant? Sullivan013", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 16:04:00", 
        "title": "Scrap the Air Force", 
        "userID": "sullivan013"
    }, 
    {
        "content": "The have to keep the Air Force...the Army needs our DoD money to keep going", 
        "intTime": 20090422, 
        "postID": 20, 
        "quote": "", 
        "reply": "The have to keep the Air Force...the Army needs our DoD money to keep going", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-22 17:50:00", 
        "title": "Scrap the Air Force", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Jimmy_Tee: quote: At the moment, the Army, Navy and Marine Corps are at war, but the Air Force is not. This is not the fault of the Air Force: it is simply not structured to be in the fights in Iraq and Afghanistan. Maybe the writer should break this news to the families and colleagues of SrA Jason Cunningham and TSgt John Chapman.", 
        "intTime": 20090424, 
        "postID": 21, 
        "quote": "Originally posted by Jimmy_Tee: quote: At the moment, the Army, Navy and Marine Corps are at war, but the Air Force is not. This is not the fault of the Air Force: it is simply not structured to be in the fights in Iraq and Afghanistan. Maybe the writer should break this news to the families and colleagues of SrA Jason Cunningham and TSgt John Chapman.", 
        "reply": "", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 09:38:00", 
        "title": "Scrap the Air Force", 
        "userID": "Bsnizzle"
    }, 
    {
        "content": "quote: Originally posted by sw614: The up-or-out sitiuation is a double-edged sword. Why force out an O-4 if all he wants to do is fly acft? If he is good at it, let him roll. But he does continually fill a slot someone esle will not be promoted into. Same with enlisted that is why there is/was a HYT policy. The USN board thing sounds a bit too much, but if it works for them..... quote: Originally posted by Guinnessmonkey: As for promotions... Do we really want to go back to the old way of doing things where veterans just stayed around as long as they wanted? Where guys like LTC Eisenhower have been sitting around waiting for the old guys to die or finally retire? (unless a war comes, in which case you quickly promote the people you should have promoted in the first place 4 or 5 grades) Do we want to return to the days where guys like U.S. Grant and W.T. Sherman left the Army as O-3's due to lack of opportunity for advancement (the Army being run at the time by a veteran of the War of 1812, who would be 74 years old before he retired)? This is the big disadvantage of getting rid of up-or-out. Doing it practically would require something in the middle, like most corporations do: When you reach your plateau, you start competing to retain your position against the youngsters potential. If you are not going anywhere, and they need your spot for some talented youngster who IS going somewhere, they move you laterally or even down if necessary. This could be set up by the demand in each field - if not enough are pushing to get in, let people linger. If the field is in high demand, let people know that they will not be able to linger as long but may be given opportunities for lateral transfers.", 
        "intTime": 20090424, 
        "postID": 22, 
        "quote": "Originally posted by sw614: The up-or-out sitiuation is a double-edged sword. Why force out an O-4 if all he wants to do is fly acft? If he is good at it, let him roll. But he does continually fill a slot someone esle will not be promoted into. Same with enlisted that is why there is/was a HYT policy. The USN board thing sounds a bit too much, but if it works for them.....", 
        "reply": " quote: Originally posted by Guinnessmonkey: As for promotions... Do we really want to go back to the old way of doing things where veterans just stayed around as long as they wanted? Where guys like LTC Eisenhower have been sitting around waiting for the old guys to die or finally retire? (unless a war comes, in which case you quickly promote the people you should have promoted in the first place 4 or 5 grades) Do we want to return to the days where guys like U.S. Grant and W.T. Sherman left the Army as O-3's due to lack of opportunity for advancement (the Army being run at the time by a veteran of the War of 1812, who would be 74 years old before he retired)? This is the big disadvantage of getting rid of up-or-out. Doing it practically would require something in the middle, like most corporations do: When you reach your plateau, you start competing to retain your position against the youngsters potential. If you are not going anywhere, and they need your spot for some talented youngster who IS going somewhere, they move you laterally or even down if necessary. This could be set up by the demand in each field - if not enough are pushing to get in, let people linger. If the field is in high demand, let people know that they will not be able to linger as long but may be given opportunities for lateral transfers.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 10:32:00", 
        "title": "Scrap the Air Force", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: At the moment, the Army, Navy and Marine Corps are at war, but the Air Force is not. This is not the fault of the Air Force: it is simply not structured to be in the fights in Iraq and Afghanistan. BULLSHYTE!, My former stepson just got back from Iraq, his convoy was hit nearly everyweek. He is in the AF. Also tell that to the Airmen that have died in Iraq and Afganistan, though the numbers are low in comparison, we are still there. We are also supporting the war by supplying air refueling, air cover, logistics, security, sec ops, supplies, medical, the list goes on. And we are in bases all over Iraq, Afganistan, Also supporting the war from Turkey, Kuwait, Qatar, Kyrtistan(spelling wrong) and other bases in the region. Tea party supporter.", 
        "intTime": 20090424, 
        "postID": 23, 
        "quote": "At the moment, the Army, Navy and Marine Corps are at war, but the Air Force is not. This is not the fault of the Air Force: it is simply not structured to be in the fights in Iraq and Afghanistan.", 
        "reply": " BULLSHYTE!, My former stepson just got back from Iraq, his convoy was hit nearly everyweek. He is in the AF. Also tell that to the Airmen that have died in Iraq and Afganistan, though the numbers are low in comparison, we are still there. We are also supporting the war by supplying air refueling, air cover, logistics, security, sec ops, supplies, medical, the list goes on. And we are in bases all over Iraq, Afganistan, Also supporting the war from Turkey, Kuwait, Qatar, Kyrtistan(spelling wrong) and other bases in the region. Tea party supporter.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 11:25:00", 
        "title": "Scrap the Air Force", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "Leave the Airforce alone folks, they are our sisters and brothers. I can remember a few times I was glad to have them around. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090424, 
        "postID": 24, 
        "quote": "", 
        "reply": "Leave the Airforce alone folks, they are our sisters and brothers. I can remember a few times I was glad to have them around. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 12:15:00", 
        "title": "Scrap the Air Force", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Leave the Airforce alone folks, they are our sisters and brothers. I can remember a few times I was glad to have them around.", 
        "intTime": 20090424, 
        "postID": 25, 
        "quote": "Originally posted by L0A1: Leave the Airforce alone folks, they are our sisters and brothers. I can remember a few times I was glad to have them around.", 
        "reply": "", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 13:08:00", 
        "title": "Scrap the Air Force", 
        "userID": "sw614"
    }, 
    {
        "content": "Keep the Air Force. The other branches need something to be envious of.", 
        "intTime": 20090424, 
        "postID": 26, 
        "quote": "", 
        "reply": "Keep the Air Force. The other branches need something to be envious of.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 13:11:00", 
        "title": "Scrap the Air Force", 
        "userID": "18830518"
    }, 
    {
        "content": "Another Unification nut !! Seeking control of Nuclear secrets !!....He`s unaware that you can`t put a 52 on a Flat-Top !!", 
        "intTime": 20090424, 
        "postID": 27, 
        "quote": "", 
        "reply": "Another Unification nut !! Seeking control of Nuclear secrets !!....He`s unaware that you can`t put a 52 on a Flat-Top !!", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 13:19:00", 
        "title": "Scrap the Air Force", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "quote: Originally posted by OddBall1st: Another Unification nut !! Seeking control of Nuclear secrets !!....He`s unaware that you can`t put a 52 on a Flat-Top !! Build a bigger flat top? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090424, 
        "postID": 28, 
        "quote": "Originally posted by OddBall1st: Another Unification nut !! Seeking control of Nuclear secrets !!....He`s unaware that you can`t put a 52 on a Flat-Top !!", 
        "reply": " Build a bigger flat top? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 13:31:00", 
        "title": "Scrap the Air Force", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Combatmix: Also with every Army unit is an Air Force Weather detachment. And TAC Air Liaison Officer/NCO who can call in Fire and Brimstone, Hell and Damnation on anyone or anything that belligerently gets in the way of an Infantry or Armor Battalion that's in the mood to go somewhere!! YUP!! Wandering and Wondering", 
        "intTime": 20090424, 
        "postID": 29, 
        "quote": "Originally posted by Combatmix: Also with every Army unit is an Air Force Weather detachment.", 
        "reply": " And TAC Air Liaison Officer/NCO who can call in Fire and Brimstone, Hell and Damnation on anyone or anything that belligerently gets in the way of an Infantry or Armor Battalion that's in the mood to go somewhere!! YUP!! Wandering and Wondering", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-24 16:49:00", 
        "title": "Scrap the Air Force", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Sounds like the author was a few ASVAB points away from crossing into the blue (******* I hated that tag line). Sorry haters, the AF isn't going anywhere. Damn this massage chair makes it hard to write.", 
        "intTime": 20090426, 
        "postID": 30, 
        "quote": "", 
        "reply": "Sounds like the author was a few ASVAB points away from crossing into the blue (******* I hated that tag line). Sorry haters, the AF isn't going anywhere. Damn this massage chair makes it hard to write.", 
        "threadID": "409192893_2220014122001", 
        "time": "2009-04-26 20:51:00", 
        "title": "Scrap the Air Force", 
        "userID": "Vorpal"
    }
]