[
    {
        "content": "\"http://www.youtube.com/watch?v=35eRxxZ-Ar0\" I think a fun drinking game would be to take a drink every time someone says \"socialism\".", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.youtube.com/watch?v=35eRxxZ-Ar0\" I think a fun drinking game would be to take a drink every time someone says \"socialism\".", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 00:41:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "100 days, 100 mistakes... Source \"http://www.nypost.com/seven/04252009/postopinion/opedcolumnists/ 100_days__100_mistakes_166177.htm\" \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "100 days, 100 mistakes... Source \"http://www.nypost.com/seven/04252009/postopinion/opedcolumnists/ 100_days__100_mistakes_166177.htm\" \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 02:55:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: 100 days, 100 mistakes... \"JOE SCARBOROUGH, GLENN BECK AND OTHERS..\" Don't worry. They're all in the video I posted.", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "100 days, 100 mistakes...", 
        "reply": " \"JOE SCARBOROUGH, GLENN BECK AND OTHERS..\" Don't worry. They're all in the video I posted.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 03:40:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=35eRxxZ-Ar0 Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance.", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "http://www.youtube.com/watch?v=35eRxxZ-Ar0", 
        "reply": " Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 05:06:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "", 
        "reply": "Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 05:14:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words?", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth.", 
        "reply": " You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words?", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 05:17:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words? lol....socialism is like a poison. A small amount won't kill ya. But, drink too much kool aid and next thing ya know....you're just like the old USSR, China and the other countries with low standards of living!", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words?", 
        "reply": " lol....socialism is like a poison. A small amount won't kill ya. But, drink too much kool aid and next thing ya know....you're just like the old USSR, China and the other countries with low standards of living!", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 09:58:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "21194237"
    }, 
    {
        "content": "Yep, some people disagree with your fawning worship and adulation of The One, karl. I know it's hard to believe that anyone could oppose the extreme-left agenda of Saint Barack, but many of us do.", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yep, some people disagree with your fawning worship and adulation of The One, karl. I know it's hard to believe that anyone could oppose the extreme-left agenda of Saint Barack, but many of us do.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:06:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words? Another thud for a content-free response. If you don't understand simple English, I'm not going to translate, give definitions, etc. \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 9, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words?", 
        "reply": " Another thud for a content-free response. If you don't understand simple English, I'm not going to translate, give definitions, etc. \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:15:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Norman Matton Thomas (November 20, 1884 - December 19, 1968) was a leading American socialist, pacifist, and six-time presidential candidate for the Socialist Party of America. He was ordained as a Presbyterian minister in 1911. As a candidate for President of the U. S., Norman Thomas said, in a 1944 epoch speech: \"The American people will never knowingly adopt socialism. But, under the name of \"liberalism\", they will adopt every fragment of the socialist program, until one day America will be a socialist nation, without knowing how it happened.\" He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 10, 
        "quote": "", 
        "reply": "Norman Matton Thomas (November 20, 1884 - December 19, 1968) was a leading American socialist, pacifist, and six-time presidential candidate for the Socialist Party of America. He was ordained as a Presbyterian minister in 1911. As a candidate for President of the U. S., Norman Thomas said, in a 1944 epoch speech: \"The American people will never knowingly adopt socialism. But, under the name of \"liberalism\", they will adopt every fragment of the socialist program, until one day America will be a socialist nation, without knowing how it happened.\" He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:19:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words? Another thud for a content-free response. If you don't understand simple English, I'm not going to translate, give definitions, etc. Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace.", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words? Another thud for a content-free response. If you don't understand simple English, I'm not going to translate, give definitions, etc.", 
        "reply": " Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:43:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\"", 
        "intTime": 20090430, 
        "postID": 12, 
        "quote": "He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\"", 
        "reply": " Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:43:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace. Your MO is apparently one of shadowing, flaming, and calling out posters. Your posts usually do not consist of any substance, and are only for the sole purpose of calling posters you disagree with, names. This is typical flamer and troll behavior. I pretty much got you pegged, don't I? \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 13, 
        "quote": "Originally posted by Thud357L: Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace.", 
        "reply": " Your MO is apparently one of shadowing, flaming, and calling out posters. Your posts usually do not consist of any substance, and are only for the sole purpose of calling posters you disagree with, names. This is typical flamer and troll behavior. I pretty much got you pegged, don't I? \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:59:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace. Your MO is apparently one of shadowing, flaming, and calling out posters. Your posts usually do not consist of any substance, and are only for the sole purpose of calling posters you disagree with, names. This is typical flamer and troll behavior. I pretty much got you pegged, don't I? How dense can you be? I responded to OP's post, you jumped in with your usual numbnuts BS, I challenged you to justify it and you punked out like you always do. You think I'm a troll, then twang your magic twanger froggie. That's what it's for.", 
        "intTime": 20090430, 
        "postID": 14, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace. Your MO is apparently one of shadowing, flaming, and calling out posters. Your posts usually do not consist of any substance, and are only for the sole purpose of calling posters you disagree with, names. This is typical flamer and troll behavior. I pretty much got you pegged, don't I?", 
        "reply": " How dense can you be? I responded to OP's post, you jumped in with your usual numbnuts BS, I challenged you to justify it and you punked out like you always do. You think I'm a troll, then twang your magic twanger froggie. That's what it's for.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 12:05:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "There was a Poll yesterday on NBC and out of 347,000 plus. Obama got a 45% A & B approvals, the rest C, D, and F's made up the other 55%. For his first 100 days. The people are starting to see this person for what he really is...a puppet for the democrat party. He has yet to make a deceision on anything except to release classify info on the CIA, therefore destroying the CIA. The CIA should now be disband for it serves no purpose anymore, it is finish (John Kerry likes that, he was once quoted as saying \"We don't need Intell\")Hmmmmmmm..maybe thats why the Intell was so screw up when Bush took over as President, John Kerry was on the Intell committee, and swore up and down that Iraq had WMD's!!!! We all just need to set back and wait for the next attack the CIA is finished... Just like you liberals and democrats wanted. Now you got it..and guess who will get the blame when we are attack? I bet your own people turn on you like a pack of rats...", 
        "intTime": 20090430, 
        "postID": 15, 
        "quote": "", 
        "reply": "There was a Poll yesterday on NBC and out of 347,000 plus. Obama got a 45% A & B approvals, the rest C, D, and F's made up the other 55%. For his first 100 days. The people are starting to see this person for what he really is...a puppet for the democrat party. He has yet to make a deceision on anything except to release classify info on the CIA, therefore destroying the CIA. The CIA should now be disband for it serves no purpose anymore, it is finish (John Kerry likes that, he was once quoted as saying \"We don't need Intell\")Hmmmmmmm..maybe thats why the Intell was so screw up when Bush took over as President, John Kerry was on the Intell committee, and swore up and down that Iraq had WMD's!!!! We all just need to set back and wait for the next attack the CIA is finished... Just like you liberals and democrats wanted. Now you got it..and guess who will get the blame when we are attack? I bet your own people turn on you like a pack of rats...", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 12:20:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: There was a Poll yesterday on NBC and out of 347,000 plus. Obama got a 45% A & B approvals, the rest C, D, and F's made up the other 55%. For his first 100 days. The people are starting to see this person for what he really is...a puppet for the democrat party. He has yet to make a deceision on anything except to release classify info on the CIA, therefore destroying the CIA. The CIA should now be disband for it serves no purpose anymore, it is finish (John Kerry likes that, he was once quoted as saying \"We don't need Intell\")Hmmmmmmm..maybe thats why the Intell was so screw up when Bush took over as President, John Kerry was on the Intell committee, and swore up and down that Iraq had WMD's!!!! We all just need to set back and wait for the next attack the CIA is finished... Just like you liberals and democrats wanted. Now you got it..and guess who will get the blame when we are attack? I bet your own people turn on you like a pack of rats... Dude, you can't just make stuff up and change reality. Do I have the wrong NBC poll? Could you show me one that backs up what you said? WASHINGTON - As he enters his 100th day in office, President Barack Obama enjoys higher marks from the American public than his most recent predecessors did at similar points in their presidencies, according to the latest NBC News/Wall Street Journal poll. More than six in 10 approve of Obama's job, nearly two-thirds view him favorably, and a majority believe he has gotten off to a solid start during his first three months on the job. Perhaps most significantly, Americans so far find him to be likeable. More than 80 percent in the poll say they personally like Obama, even if they don’t agree with all of his policies. And respondents give him high scores on his personality, demeanor and leadership qualities. Republican pollster Bill McInturff, who conducted this survey with Democratic pollster Peter D. Hart, says these numbers suggest “someone who is wearing well” with the public at this stage of his presidency. McInturff, in fact, even compares Obama’s early likeability to Ronald Reagan’s in the 1980s. >http://www.nbcwashington.com/news/us_world/Poll__Obama_gets_high_early_marks.html", 
        "intTime": 20090430, 
        "postID": 16, 
        "quote": "Originally posted by dman1948: There was a Poll yesterday on NBC and out of 347,000 plus. Obama got a 45% A & B approvals, the rest C, D, and F's made up the other 55%. For his first 100 days. The people are starting to see this person for what he really is...a puppet for the democrat party. He has yet to make a deceision on anything except to release classify info on the CIA, therefore destroying the CIA. The CIA should now be disband for it serves no purpose anymore, it is finish (John Kerry likes that, he was once quoted as saying \"We don't need Intell\")Hmmmmmmm..maybe thats why the Intell was so screw up when Bush took over as President, John Kerry was on the Intell committee, and swore up and down that Iraq had WMD's!!!! We all just need to set back and wait for the next attack the CIA is finished... Just like you liberals and democrats wanted. Now you got it..and guess who will get the blame when we are attack? I bet your own people turn on you like a pack of rats...", 
        "reply": " Dude, you can't just make stuff up and change reality. Do I have the wrong NBC poll? Could you show me one that backs up what you said? WASHINGTON - As he enters his 100th day in office, President Barack Obama enjoys higher marks from the American public than his most recent predecessors did at similar points in their presidencies, according to the latest NBC News/Wall Street Journal poll. More than six in 10 approve of Obama's job, nearly two-thirds view him favorably, and a majority believe he has gotten off to a solid start during his first three months on the job. Perhaps most significantly, Americans so far find him to be likeable. More than 80 percent in the poll say they personally like Obama, even if they don’t agree with all of his policies. And respondents give him high scores on his personality, demeanor and leadership qualities. Republican pollster Bill McInturff, who conducted this survey with Democratic pollster Peter D. Hart, says these numbers suggest “someone who is wearing well” with the public at this stage of his presidency. McInturff, in fact, even compares Obama’s early likeability to Ronald Reagan’s in the 1980s. >http://www.nbcwashington.com/news/us_world/Poll__Obama_gets_high_early_marks.html", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 12:29:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\" The quote stands, even under your source. Speaking of your source, it goes on to quote Thomas two years after his death. Maybe esample should be checking his sources, instead of having diharrea of the mouth.", 
        "intTime": 20090430, 
        "postID": 17, 
        "quote": "Originally posted by esample1: quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\"", 
        "reply": " The quote stands, even under your source. Speaking of your source, it goes on to quote Thomas two years after his death. Maybe esample should be checking his sources, instead of having diharrea of the mouth.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 12:49:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance. Hmmm. Yes we do. And it is bad. It is NOT what made America great. It has to have the building blocks of a strong well built country to survive. Socialism could not be started if there were not successful business people who were not protected by a government. \"People often make lists of different types of countries in the world on the basis of their official names, ruling parties, or other indefinitive characteristics. The most realistic way to devise a list of Socialist countries is to base it upon which nations have substantial amounts of state-run industry, numerous govt. social programs, or other traits which make them actually Socialist.\" Cuba: Paradise North Korea: Very Friendly people Venezuela: Great place to own a business China: Stupid Dali Lama and every country needs mandatory abortion Vietnam: They got it now they don't want it LOL Syria: Now here is a strong Nation who looks to promotes the health of it's citizens and surrounding neighbors. Belarus: Never heard of it till now Sweden: Heard girls are pretty. I do remember them leading the charge against Nazism, Japanese Imperialism, and stood strong against the USSR. So Thud...Which is your favorite Country? \"http://www.associatedcontent.com/article/56207/list_of_socialist_countries_with_individual.html\"", 
        "intTime": 20090430, 
        "postID": 18, 
        "quote": "Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance.", 
        "reply": " Hmmm. Yes we do. And it is bad. It is NOT what made America great. It has to have the building blocks of a strong well built country to survive. Socialism could not be started if there were not successful business people who were not protected by a government. \"People often make lists of different types of countries in the world on the basis of their official names, ruling parties, or other indefinitive characteristics. The most realistic way to devise a list of Socialist countries is to base it upon which nations have substantial amounts of state-run industry, numerous govt. social programs, or other traits which make them actually Socialist.\" Cuba: Paradise North Korea: Very Friendly people Venezuela: Great place to own a business China: Stupid Dali Lama and every country needs mandatory abortion Vietnam: They got it now they don't want it LOL Syria: Now here is a strong Nation who looks to promotes the health of it's citizens and surrounding neighbors. Belarus: Never heard of it till now Sweden: Heard girls are pretty. I do remember them leading the charge against Nazism, Japanese Imperialism, and stood strong against the USSR. So Thud...Which is your favorite Country? \"http://www.associatedcontent.com/article/56207/list_of_socialist_countries_with_individual.html\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 13:47:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "ACR26"
    }, 
    {
        "content": "What have Swedens ww2 realpolitik to do with this? If I remember correct loots of country did hope that the warstorm would miss them... including US....", 
        "intTime": 20090430, 
        "postID": 19, 
        "quote": "", 
        "reply": "What have Swedens ww2 realpolitik to do with this? If I remember correct loots of country did hope that the warstorm would miss them... including US....", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 15:31:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "a77"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by esample1: quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\" The quote stands, even under your source. Speaking of your source, it goes on to quote Thomas two years after his death. Maybe esample should be checking his sources, instead of having diharrea of the mouth. \"The quote stands\" only on opinion blogs and other forums. Try finding the quote's source and in context. You'll be searching for a while. The source doesn't quote Thomas after his death. It says he was in agreement with Gus Hall, who died in 2000. Since you want to stand by the quote, why don't YOU prove the source it came from.", 
        "intTime": 20090430, 
        "postID": 20, 
        "quote": "Originally posted by transport1: quote: Originally posted by esample1: quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\" The quote stands, even under your source. Speaking of your source, it goes on to quote Thomas two years after his death. Maybe esample should be checking his sources, instead of having diharrea of the mouth.", 
        "reply": " \"The quote stands\" only on opinion blogs and other forums. Try finding the quote's source and in context. You'll be searching for a while. The source doesn't quote Thomas after his death. It says he was in agreement with Gus Hall, who died in 2000. Since you want to stand by the quote, why don't YOU prove the source it came from.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 16:24:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance. Hmmm. Yes we do. And it is bad. It is NOT what made America great. It has to have the building blocks of a strong well built country to survive. Socialism could not be started if there were not successful business people who were not protected by a government. \"People often make lists of different types of countries in the world on the basis of their official names, ruling parties, or other indefinitive characteristics. The most realistic way to devise a list of Socialist countries is to base it upon which nations have substantial amounts of state-run industry, numerous govt. social programs, or other traits which make them actually Socialist.\" Cuba: Paradise North Korea: Very Friendly people Venezuela: Great place to own a business China: Stupid Dali Lama and every country needs mandatory abortion Vietnam: They got it now they don't want it LOL Syria: Now here is a strong Nation who looks to promotes the health of it's citizens and surrounding neighbors. Belarus: Never heard of it till now Sweden: Heard girls are pretty. I do remember them leading the charge against Nazism, Japanese Imperialism, and stood strong against the USSR. So Thud...Which is your favorite Country? \"http://www.associatedcontent.com/article/56207/list_of_socialist_countries_with_individual.html\" My favorite country is the one I swore to protect and defend. And though your list is faintly amusing, I wonder if you could elaborate on this statement: \"Socialism could not be started if there were not successful business people who were not protected by a government.\" So far, I think you're just throwing stuff up against the wall.", 
        "intTime": 20090430, 
        "postID": 21, 
        "quote": "Originally posted by ACR26: quote: Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance. Hmmm. Yes we do. And it is bad. It is NOT what made America great. It has to have the building blocks of a strong well built country to survive. Socialism could not be started if there were not successful business people who were not protected by a government. \"People often make lists of different types of countries in the world on the basis of their official names, ruling parties, or other indefinitive characteristics. The most realistic way to devise a list of Socialist countries is to base it upon which nations have substantial amounts of state-run industry, numerous govt. social programs, or other traits which make them actually Socialist.\" Cuba: Paradise North Korea: Very Friendly people Venezuela: Great place to own a business China: Stupid Dali Lama and every country needs mandatory abortion Vietnam: They got it now they don't want it LOL Syria: Now here is a strong Nation who looks to promotes the health of it's citizens and surrounding neighbors. Belarus: Never heard of it till now Sweden: Heard girls are pretty. I do remember them leading the charge against Nazism, Japanese Imperialism, and stood strong against the USSR. So Thud...Which is your favorite Country? \"http://www.associatedcontent.com/article/56207/list_of_socialist_countries_with_individual.html\"", 
        "reply": " My favorite country is the one I swore to protect and defend. And though your list is faintly amusing, I wonder if you could elaborate on this statement: \"Socialism could not be started if there were not successful business people who were not protected by a government.\" So far, I think you're just throwing stuff up against the wall.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 17:54:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking", 
        "intTime": 20090430, 
        "postID": 22, 
        "quote": "", 
        "reply": "I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 19:54:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Yep, some people disagree with your fawning worship and adulation of The One, karl. I know it's hard to believe that anyone could oppose the extreme-left agenda of Saint Barack, but many of us do. what amuses me so is that you consider \"fawning worship and adulation\" to be the same as \"He's not a commie hell bent on destroying America\" I have no problem with anyone who \"opposes his agenda\". The problem is that I hear no criticisms based on reality or alternative solutions other than \"lower taxes for the rich\".", 
        "intTime": 20090430, 
        "postID": 23, 
        "quote": "Yep, some people disagree with your fawning worship and adulation of The One, karl. I know it's hard to believe that anyone could oppose the extreme-left agenda of Saint Barack, but many of us do.", 
        "reply": " what amuses me so is that you consider \"fawning worship and adulation\" to be the same as \"He's not a commie hell bent on destroying America\" I have no problem with anyone who \"opposes his agenda\". The problem is that I hear no criticisms based on reality or alternative solutions other than \"lower taxes for the rich\".", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 21:30:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: http://www.youtube.com/watch?v=35eRxxZ-Ar0 Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance. Socialism is any society that is controlled by the government. The factories, transportation system and labor all come under government control. This includes both prices and wages. You pay what the government says you will and you earn what the government says you will. It is just the opposite under capitalism. Society is controlled by the law of supply and demand.People with critical skills get the big bucks. Critical meaning most in demand weither it means brain surgery or the ability to hit 40 home runs in a season. The higher the demand for a given product compared to the supply, the higher the price. Diamonds are valuable; dirt is cheap. These are the definitions of this \"wingnut.\" Now perhaps thud will give us his.", 
        "intTime": 20090430, 
        "postID": 24, 
        "quote": "Originally posted by Thud357L: quote: http://www.youtube.com/watch?v=35eRxxZ-Ar0 Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance.", 
        "reply": " Socialism is any society that is controlled by the government. The factories, transportation system and labor all come under government control. This includes both prices and wages. You pay what the government says you will and you earn what the government says you will. It is just the opposite under capitalism. Society is controlled by the law of supply and demand.People with critical skills get the big bucks. Critical meaning most in demand weither it means brain surgery or the ability to hit 40 home runs in a season. The higher the demand for a given product compared to the supply, the higher the price. Diamonds are valuable; dirt is cheap. These are the definitions of this \"wingnut.\" Now perhaps thud will give us his.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 23:10:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: I have no problem with anyone who \"opposes his agenda\". The problem is that I hear no criticisms based on reality or alternative solutions other than \"lower taxes for the rich\". karlhungusjr How about Americans like me who think the 800 billion dollar stimulus package is not only wasteful, it's simply a bad idea? A 3.5 trillion dollar budget? Same thing. Others may point out that naming no less than 4 persons with tax issues to the cabinet is a bad idea. Closing Gitmo may seem like a great idea till it comes time to decide where to put the prisoners. Don't do or promise anything till we know. Lower taxes accross the board as far is practical is what I would like to see. Gee Karl, I must have missed the call for \"lower taxes for the rich.\" Perhaps you could point out who think this is a good idea are. Feel free to name names and quote them.", 
        "intTime": 20090430, 
        "postID": 25, 
        "quote": "I have no problem with anyone who \"opposes his agenda\". The problem is that I hear no criticisms based on reality or alternative solutions other than \"lower taxes for the rich\". karlhungusjr", 
        "reply": " How about Americans like me who think the 800 billion dollar stimulus package is not only wasteful, it's simply a bad idea? A 3.5 trillion dollar budget? Same thing. Others may point out that naming no less than 4 persons with tax issues to the cabinet is a bad idea. Closing Gitmo may seem like a great idea till it comes time to decide where to put the prisoners. Don't do or promise anything till we know. Lower taxes accross the board as far is practical is what I would like to see. Gee Karl, I must have missed the call for \"lower taxes for the rich.\" Perhaps you could point out who think this is a good idea are. Feel free to name names and quote them.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 23:37:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: How about Americans like me who think the 800 billion dollar stimulus package is not only wasteful, it's simply a bad idea? A 3.5 trillion dollar budget? Same thing. wonderful. fine. now explain how we get the nation out of a deep recession, without banks failing and the FDIC going bankrupt trying to cover the losses. quote: Others may point out that naming no less than 4 persons with tax issues to the cabinet is a bad idea. yes that was politically a very bad move. quote: Closing Gitmo may seem like a great idea till it comes time to decide where to put the prisoners. Don't do or promise anything till we know. I have no problem with were we put them. If a federal prison was ok for McVeigh then its good enough for a goat herder. quote: Lower taxes accross the board as far is practical is what I would like to see. lower taxes across the board is the main reason we ran a deficit for the last 8 years and partially the reason we are in the situation we are in. quote: Gee Karl, I must have missed the call for \"lower taxes for the rich.\" Perhaps you could point out who think this is a good idea are.Feel free to name names and quote them. no problem. You did one sentence ago. \"Lower taxes accross the board as far is practical is what I would like to see.\" unless \"across the board\" means \"everyone but the rich\". and if thats the case you'll soon get your wish.", 
        "intTime": 20090501, 
        "postID": 26, 
        "quote": "How about Americans like me who think the 800 billion dollar stimulus package is not only wasteful, it's simply a bad idea? A 3.5 trillion dollar budget? Same thing.", 
        "reply": " wonderful. fine. now explain how we get the nation out of a deep recession, without banks failing and the FDIC going bankrupt trying to cover the losses. quote: Others may point out that naming no less than 4 persons with tax issues to the cabinet is a bad idea. yes that was politically a very bad move. quote: Closing Gitmo may seem like a great idea till it comes time to decide where to put the prisoners. Don't do or promise anything till we know. I have no problem with were we put them. If a federal prison was ok for McVeigh then its good enough for a goat herder. quote: Lower taxes accross the board as far is practical is what I would like to see. lower taxes across the board is the main reason we ran a deficit for the last 8 years and partially the reason we are in the situation we are in. quote: Gee Karl, I must have missed the call for \"lower taxes for the rich.\" Perhaps you could point out who think this is a good idea are.Feel free to name names and quote them. no problem. You did one sentence ago. \"Lower taxes accross the board as far is practical is what I would like to see.\" unless \"across the board\" means \"everyone but the rich\". and if thats the case you'll soon get your wish.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-05-01 00:05:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: \"http://www.youtube.com/watch?v=35eRxxZ-Ar0\" I think a fun drinking game would be to take a drink every time someone says \"socialism\". Wow! what a great idea but I don't have that much beer in the house;I have an ample supply stashed in the basement fridge. I suppose if everybody went out & got enough to cover the amount of times \"socialism\" in uttered the stock prices for the beer makers would go up signifigantly. So the market goes up & we get totally tanked. sounds like a win-win scenario to me", 
        "intTime": 20090501, 
        "postID": 27, 
        "quote": "Originally posted by karlhungusjr: \"http://www.youtube.com/watch?v=35eRxxZ-Ar0\" I think a fun drinking game would be to take a drink every time someone says \"socialism\".", 
        "reply": " Wow! what a great idea but I don't have that much beer in the house;I have an ample supply stashed in the basement fridge. I suppose if everybody went out & got enough to cover the amount of times \"socialism\" in uttered the stock prices for the beer makers would go up signifigantly. So the market goes up & we get totally tanked. sounds like a win-win scenario to me", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-05-01 05:31:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "TacEvacRet"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking Socialism is not, repeat not, a political system. Socialism is a delivery system. When \"government\" in it's classical form is involved, it is no longer pure socialism, it becomes some sort of hybrid. I could care less about Venezuela and I know little of their history but most successful systems are some sort of hybrid combining aspects of capitalism and socialism. That's what we have here in the United States. The weak point of classical socialism is the same as laissez-faire capitalism - human nature.", 
        "intTime": 20090501, 
        "postID": 28, 
        "quote": "Originally posted by ACR26: I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking", 
        "reply": " Socialism is not, repeat not, a political system. Socialism is a delivery system. When \"government\" in it's classical form is involved, it is no longer pure socialism, it becomes some sort of hybrid. I could care less about Venezuela and I know little of their history but most successful systems are some sort of hybrid combining aspects of capitalism and socialism. That's what we have here in the United States. The weak point of classical socialism is the same as laissez-faire capitalism - human nature.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-05-01 06:56:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by ACR26: I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking Socialism is not, repeat not, a political system. Socialism is a delivery system. When \"government\" in it's classical form is involved, it is no longer pure socialism, it becomes some sort of hybrid. I could care less about Venezuela and I know little of their history but most successful systems are some sort of hybrid combining aspects of capitalism and socialism. That's what we have here in the United States. The weak point of classical socialism is the same as laissez-faire capitalism - human nature. It amazes me that you DEFINE the weakpoint, correclty, yet utterly fail to articulate a common sense counter to that weakpoint.. Or just fail to see that capitalism IS the counter?", 
        "intTime": 20090501, 
        "postID": 29, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by ACR26: I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking Socialism is not, repeat not, a political system. Socialism is a delivery system. When \"government\" in it's classical form is involved, it is no longer pure socialism, it becomes some sort of hybrid. I could care less about Venezuela and I know little of their history but most successful systems are some sort of hybrid combining aspects of capitalism and socialism. That's what we have here in the United States. The weak point of classical socialism is the same as laissez-faire capitalism - human nature.", 
        "reply": " It amazes me that you DEFINE the weakpoint, correclty, yet utterly fail to articulate a common sense counter to that weakpoint.. Or just fail to see that capitalism IS the counter?", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-05-01 07:33:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "threerings"
    }, 
    {
        "content": "\"http://www.youtube.com/watch?v=35eRxxZ-Ar0\" I think a fun drinking game would be to take a drink every time someone says \"socialism\".", 
        "intTime": 20090430, 
        "postID": 30, 
        "quote": "", 
        "reply": "\"http://www.youtube.com/watch?v=35eRxxZ-Ar0\" I think a fun drinking game would be to take a drink every time someone says \"socialism\".", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 00:41:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "100 days, 100 mistakes... Source \"http://www.nypost.com/seven/04252009/postopinion/opedcolumnists/ 100_days__100_mistakes_166177.htm\" \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 31, 
        "quote": "", 
        "reply": "100 days, 100 mistakes... Source \"http://www.nypost.com/seven/04252009/postopinion/opedcolumnists/ 100_days__100_mistakes_166177.htm\" \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 02:55:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: 100 days, 100 mistakes... \"JOE SCARBOROUGH, GLENN BECK AND OTHERS..\" Don't worry. They're all in the video I posted.", 
        "intTime": 20090430, 
        "postID": 32, 
        "quote": "100 days, 100 mistakes...", 
        "reply": " \"JOE SCARBOROUGH, GLENN BECK AND OTHERS..\" Don't worry. They're all in the video I posted.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 03:40:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=35eRxxZ-Ar0 Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance.", 
        "intTime": 20090430, 
        "postID": 33, 
        "quote": "http://www.youtube.com/watch?v=35eRxxZ-Ar0", 
        "reply": " Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 05:06:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 34, 
        "quote": "", 
        "reply": "Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 05:14:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words?", 
        "intTime": 20090430, 
        "postID": 35, 
        "quote": "Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth.", 
        "reply": " You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words?", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 05:17:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words? lol....socialism is like a poison. A small amount won't kill ya. But, drink too much kool aid and next thing ya know....you're just like the old USSR, China and the other countries with low standards of living!", 
        "intTime": 20090430, 
        "postID": 36, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words?", 
        "reply": " lol....socialism is like a poison. A small amount won't kill ya. But, drink too much kool aid and next thing ya know....you're just like the old USSR, China and the other countries with low standards of living!", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 09:58:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "21194237"
    }, 
    {
        "content": "Yep, some people disagree with your fawning worship and adulation of The One, karl. I know it's hard to believe that anyone could oppose the extreme-left agenda of Saint Barack, but many of us do.", 
        "intTime": 20090430, 
        "postID": 37, 
        "quote": "", 
        "reply": "Yep, some people disagree with your fawning worship and adulation of The One, karl. I know it's hard to believe that anyone could oppose the extreme-left agenda of Saint Barack, but many of us do.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:06:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words? Another thud for a content-free response. If you don't understand simple English, I'm not going to translate, give definitions, etc. \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 38, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words?", 
        "reply": " Another thud for a content-free response. If you don't understand simple English, I'm not going to translate, give definitions, etc. \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:15:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Norman Matton Thomas (November 20, 1884 - December 19, 1968) was a leading American socialist, pacifist, and six-time presidential candidate for the Socialist Party of America. He was ordained as a Presbyterian minister in 1911. As a candidate for President of the U. S., Norman Thomas said, in a 1944 epoch speech: \"The American people will never knowingly adopt socialism. But, under the name of \"liberalism\", they will adopt every fragment of the socialist program, until one day America will be a socialist nation, without knowing how it happened.\" He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 39, 
        "quote": "", 
        "reply": "Norman Matton Thomas (November 20, 1884 - December 19, 1968) was a leading American socialist, pacifist, and six-time presidential candidate for the Socialist Party of America. He was ordained as a Presbyterian minister in 1911. As a candidate for President of the U. S., Norman Thomas said, in a 1944 epoch speech: \"The American people will never knowingly adopt socialism. But, under the name of \"liberalism\", they will adopt every fragment of the socialist program, until one day America will be a socialist nation, without knowing how it happened.\" He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:19:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words? Another thud for a content-free response. If you don't understand simple English, I'm not going to translate, give definitions, etc. Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace.", 
        "intTime": 20090430, 
        "postID": 40, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: quote: Originally posted by Kegler300: Most left-wits haven't a clue about the capitalism and individuality that's driven this country to become the strongest, wealthiest nation on earth. You just pulled that out of your back brain cavity. I'll bet you don't have a clue either, they're just code words to you. How about an operational definition in your own words? Another thud for a content-free response. If you don't understand simple English, I'm not going to translate, give definitions, etc.", 
        "reply": " Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:43:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\"", 
        "intTime": 20090430, 
        "postID": 41, 
        "quote": "He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\"", 
        "reply": " Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:43:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace. Your MO is apparently one of shadowing, flaming, and calling out posters. Your posts usually do not consist of any substance, and are only for the sole purpose of calling posters you disagree with, names. This is typical flamer and troll behavior. I pretty much got you pegged, don't I? \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 42, 
        "quote": "Originally posted by Thud357L: Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace.", 
        "reply": " Your MO is apparently one of shadowing, flaming, and calling out posters. Your posts usually do not consist of any substance, and are only for the sole purpose of calling posters you disagree with, names. This is typical flamer and troll behavior. I pretty much got you pegged, don't I? \"The World's Finest\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 10:59:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Thud357L: Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace. Your MO is apparently one of shadowing, flaming, and calling out posters. Your posts usually do not consist of any substance, and are only for the sole purpose of calling posters you disagree with, names. This is typical flamer and troll behavior. I pretty much got you pegged, don't I? How dense can you be? I responded to OP's post, you jumped in with your usual numbnuts BS, I challenged you to justify it and you punked out like you always do. You think I'm a troll, then twang your magic twanger froggie. That's what it's for.", 
        "intTime": 20090430, 
        "postID": 43, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Thud357L: Because you haven't the foggiest notion of what you're talking about. You're just parroting the words. You're just a cut & paste ace. Your MO is apparently one of shadowing, flaming, and calling out posters. Your posts usually do not consist of any substance, and are only for the sole purpose of calling posters you disagree with, names. This is typical flamer and troll behavior. I pretty much got you pegged, don't I?", 
        "reply": " How dense can you be? I responded to OP's post, you jumped in with your usual numbnuts BS, I challenged you to justify it and you punked out like you always do. You think I'm a troll, then twang your magic twanger froggie. That's what it's for.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 12:05:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "There was a Poll yesterday on NBC and out of 347,000 plus. Obama got a 45% A & B approvals, the rest C, D, and F's made up the other 55%. For his first 100 days. The people are starting to see this person for what he really is...a puppet for the democrat party. He has yet to make a deceision on anything except to release classify info on the CIA, therefore destroying the CIA. The CIA should now be disband for it serves no purpose anymore, it is finish (John Kerry likes that, he was once quoted as saying \"We don't need Intell\")Hmmmmmmm..maybe thats why the Intell was so screw up when Bush took over as President, John Kerry was on the Intell committee, and swore up and down that Iraq had WMD's!!!! We all just need to set back and wait for the next attack the CIA is finished... Just like you liberals and democrats wanted. Now you got it..and guess who will get the blame when we are attack? I bet your own people turn on you like a pack of rats...", 
        "intTime": 20090430, 
        "postID": 44, 
        "quote": "", 
        "reply": "There was a Poll yesterday on NBC and out of 347,000 plus. Obama got a 45% A & B approvals, the rest C, D, and F's made up the other 55%. For his first 100 days. The people are starting to see this person for what he really is...a puppet for the democrat party. He has yet to make a deceision on anything except to release classify info on the CIA, therefore destroying the CIA. The CIA should now be disband for it serves no purpose anymore, it is finish (John Kerry likes that, he was once quoted as saying \"We don't need Intell\")Hmmmmmmm..maybe thats why the Intell was so screw up when Bush took over as President, John Kerry was on the Intell committee, and swore up and down that Iraq had WMD's!!!! We all just need to set back and wait for the next attack the CIA is finished... Just like you liberals and democrats wanted. Now you got it..and guess who will get the blame when we are attack? I bet your own people turn on you like a pack of rats...", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 12:20:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: There was a Poll yesterday on NBC and out of 347,000 plus. Obama got a 45% A & B approvals, the rest C, D, and F's made up the other 55%. For his first 100 days. The people are starting to see this person for what he really is...a puppet for the democrat party. He has yet to make a deceision on anything except to release classify info on the CIA, therefore destroying the CIA. The CIA should now be disband for it serves no purpose anymore, it is finish (John Kerry likes that, he was once quoted as saying \"We don't need Intell\")Hmmmmmmm..maybe thats why the Intell was so screw up when Bush took over as President, John Kerry was on the Intell committee, and swore up and down that Iraq had WMD's!!!! We all just need to set back and wait for the next attack the CIA is finished... Just like you liberals and democrats wanted. Now you got it..and guess who will get the blame when we are attack? I bet your own people turn on you like a pack of rats... Dude, you can't just make stuff up and change reality. Do I have the wrong NBC poll? Could you show me one that backs up what you said? WASHINGTON - As he enters his 100th day in office, President Barack Obama enjoys higher marks from the American public than his most recent predecessors did at similar points in their presidencies, according to the latest NBC News/Wall Street Journal poll. More than six in 10 approve of Obama's job, nearly two-thirds view him favorably, and a majority believe he has gotten off to a solid start during his first three months on the job. Perhaps most significantly, Americans so far find him to be likeable. More than 80 percent in the poll say they personally like Obama, even if they don’t agree with all of his policies. And respondents give him high scores on his personality, demeanor and leadership qualities. Republican pollster Bill McInturff, who conducted this survey with Democratic pollster Peter D. Hart, says these numbers suggest “someone who is wearing well” with the public at this stage of his presidency. McInturff, in fact, even compares Obama’s early likeability to Ronald Reagan’s in the 1980s. >http://www.nbcwashington.com/news/us_world/Poll__Obama_gets_high_early_marks.html", 
        "intTime": 20090430, 
        "postID": 45, 
        "quote": "Originally posted by dman1948: There was a Poll yesterday on NBC and out of 347,000 plus. Obama got a 45% A & B approvals, the rest C, D, and F's made up the other 55%. For his first 100 days. The people are starting to see this person for what he really is...a puppet for the democrat party. He has yet to make a deceision on anything except to release classify info on the CIA, therefore destroying the CIA. The CIA should now be disband for it serves no purpose anymore, it is finish (John Kerry likes that, he was once quoted as saying \"We don't need Intell\")Hmmmmmmm..maybe thats why the Intell was so screw up when Bush took over as President, John Kerry was on the Intell committee, and swore up and down that Iraq had WMD's!!!! We all just need to set back and wait for the next attack the CIA is finished... Just like you liberals and democrats wanted. Now you got it..and guess who will get the blame when we are attack? I bet your own people turn on you like a pack of rats...", 
        "reply": " Dude, you can't just make stuff up and change reality. Do I have the wrong NBC poll? Could you show me one that backs up what you said? WASHINGTON - As he enters his 100th day in office, President Barack Obama enjoys higher marks from the American public than his most recent predecessors did at similar points in their presidencies, according to the latest NBC News/Wall Street Journal poll. More than six in 10 approve of Obama's job, nearly two-thirds view him favorably, and a majority believe he has gotten off to a solid start during his first three months on the job. Perhaps most significantly, Americans so far find him to be likeable. More than 80 percent in the poll say they personally like Obama, even if they don’t agree with all of his policies. And respondents give him high scores on his personality, demeanor and leadership qualities. Republican pollster Bill McInturff, who conducted this survey with Democratic pollster Peter D. Hart, says these numbers suggest “someone who is wearing well” with the public at this stage of his presidency. McInturff, in fact, even compares Obama’s early likeability to Ronald Reagan’s in the 1980s. >http://www.nbcwashington.com/news/us_world/Poll__Obama_gets_high_early_marks.html", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 12:29:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\" The quote stands, even under your source. Speaking of your source, it goes on to quote Thomas two years after his death. Maybe esample should be checking his sources, instead of having diharrea of the mouth.", 
        "intTime": 20090430, 
        "postID": 46, 
        "quote": "Originally posted by esample1: quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\"", 
        "reply": " The quote stands, even under your source. Speaking of your source, it goes on to quote Thomas two years after his death. Maybe esample should be checking his sources, instead of having diharrea of the mouth.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 12:49:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance. Hmmm. Yes we do. And it is bad. It is NOT what made America great. It has to have the building blocks of a strong well built country to survive. Socialism could not be started if there were not successful business people who were not protected by a government. \"People often make lists of different types of countries in the world on the basis of their official names, ruling parties, or other indefinitive characteristics. The most realistic way to devise a list of Socialist countries is to base it upon which nations have substantial amounts of state-run industry, numerous govt. social programs, or other traits which make them actually Socialist.\" Cuba: Paradise North Korea: Very Friendly people Venezuela: Great place to own a business China: Stupid Dali Lama and every country needs mandatory abortion Vietnam: They got it now they don't want it LOL Syria: Now here is a strong Nation who looks to promotes the health of it's citizens and surrounding neighbors. Belarus: Never heard of it till now Sweden: Heard girls are pretty. I do remember them leading the charge against Nazism, Japanese Imperialism, and stood strong against the USSR. So Thud...Which is your favorite Country? \"http://www.associatedcontent.com/article/56207/list_of_socialist_countries_with_individual.html\"", 
        "intTime": 20090430, 
        "postID": 47, 
        "quote": "Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance.", 
        "reply": " Hmmm. Yes we do. And it is bad. It is NOT what made America great. It has to have the building blocks of a strong well built country to survive. Socialism could not be started if there were not successful business people who were not protected by a government. \"People often make lists of different types of countries in the world on the basis of their official names, ruling parties, or other indefinitive characteristics. The most realistic way to devise a list of Socialist countries is to base it upon which nations have substantial amounts of state-run industry, numerous govt. social programs, or other traits which make them actually Socialist.\" Cuba: Paradise North Korea: Very Friendly people Venezuela: Great place to own a business China: Stupid Dali Lama and every country needs mandatory abortion Vietnam: They got it now they don't want it LOL Syria: Now here is a strong Nation who looks to promotes the health of it's citizens and surrounding neighbors. Belarus: Never heard of it till now Sweden: Heard girls are pretty. I do remember them leading the charge against Nazism, Japanese Imperialism, and stood strong against the USSR. So Thud...Which is your favorite Country? \"http://www.associatedcontent.com/article/56207/list_of_socialist_countries_with_individual.html\"", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 13:47:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "ACR26"
    }, 
    {
        "content": "What have Swedens ww2 realpolitik to do with this? If I remember correct loots of country did hope that the warstorm would miss them... including US....", 
        "intTime": 20090430, 
        "postID": 48, 
        "quote": "", 
        "reply": "What have Swedens ww2 realpolitik to do with this? If I remember correct loots of country did hope that the warstorm would miss them... including US....", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 15:31:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "a77"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by esample1: quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\" The quote stands, even under your source. Speaking of your source, it goes on to quote Thomas two years after his death. Maybe esample should be checking his sources, instead of having diharrea of the mouth. \"The quote stands\" only on opinion blogs and other forums. Try finding the quote's source and in context. You'll be searching for a while. The source doesn't quote Thomas after his death. It says he was in agreement with Gus Hall, who died in 2000. Since you want to stand by the quote, why don't YOU prove the source it came from.", 
        "intTime": 20090430, 
        "postID": 49, 
        "quote": "Originally posted by transport1: quote: Originally posted by esample1: quote: He went on to say: \"I no longer need to run as a Presidential Candidate for the Socialist Party. The Democratic Party has adopted our platform..\" Any quote used by the right that starts with 'He went on to say'...usually means he never said it. 1948 - from an interview during the presidential campaign, [Ed. note: Norman Thomas and Gus Hall, the U.S. Communist Party Candidate, both quit American politics, agreeing that the Republican and Democratic parties by 1970 had adopted every plank on the Communist/Socialist and they no longer had an alternate party platform on which to run.] \"http://quotes.liberty-tree.ca/quote/norman_thomas_quote_ffb1\" The quote stands, even under your source. Speaking of your source, it goes on to quote Thomas two years after his death. Maybe esample should be checking his sources, instead of having diharrea of the mouth.", 
        "reply": " \"The quote stands\" only on opinion blogs and other forums. Try finding the quote's source and in context. You'll be searching for a while. The source doesn't quote Thomas after his death. It says he was in agreement with Gus Hall, who died in 2000. Since you want to stand by the quote, why don't YOU prove the source it came from.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 16:24:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance. Hmmm. Yes we do. And it is bad. It is NOT what made America great. It has to have the building blocks of a strong well built country to survive. Socialism could not be started if there were not successful business people who were not protected by a government. \"People often make lists of different types of countries in the world on the basis of their official names, ruling parties, or other indefinitive characteristics. The most realistic way to devise a list of Socialist countries is to base it upon which nations have substantial amounts of state-run industry, numerous govt. social programs, or other traits which make them actually Socialist.\" Cuba: Paradise North Korea: Very Friendly people Venezuela: Great place to own a business China: Stupid Dali Lama and every country needs mandatory abortion Vietnam: They got it now they don't want it LOL Syria: Now here is a strong Nation who looks to promotes the health of it's citizens and surrounding neighbors. Belarus: Never heard of it till now Sweden: Heard girls are pretty. I do remember them leading the charge against Nazism, Japanese Imperialism, and stood strong against the USSR. So Thud...Which is your favorite Country? \"http://www.associatedcontent.com/article/56207/list_of_socialist_countries_with_individual.html\" My favorite country is the one I swore to protect and defend. And though your list is faintly amusing, I wonder if you could elaborate on this statement: \"Socialism could not be started if there were not successful business people who were not protected by a government.\" So far, I think you're just throwing stuff up against the wall.", 
        "intTime": 20090430, 
        "postID": 50, 
        "quote": "Originally posted by ACR26: quote: Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance. Hmmm. Yes we do. And it is bad. It is NOT what made America great. It has to have the building blocks of a strong well built country to survive. Socialism could not be started if there were not successful business people who were not protected by a government. \"People often make lists of different types of countries in the world on the basis of their official names, ruling parties, or other indefinitive characteristics. The most realistic way to devise a list of Socialist countries is to base it upon which nations have substantial amounts of state-run industry, numerous govt. social programs, or other traits which make them actually Socialist.\" Cuba: Paradise North Korea: Very Friendly people Venezuela: Great place to own a business China: Stupid Dali Lama and every country needs mandatory abortion Vietnam: They got it now they don't want it LOL Syria: Now here is a strong Nation who looks to promotes the health of it's citizens and surrounding neighbors. Belarus: Never heard of it till now Sweden: Heard girls are pretty. I do remember them leading the charge against Nazism, Japanese Imperialism, and stood strong against the USSR. So Thud...Which is your favorite Country? \"http://www.associatedcontent.com/article/56207/list_of_socialist_countries_with_individual.html\"", 
        "reply": " My favorite country is the one I swore to protect and defend. And though your list is faintly amusing, I wonder if you could elaborate on this statement: \"Socialism could not be started if there were not successful business people who were not protected by a government.\" So far, I think you're just throwing stuff up against the wall.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 17:54:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking", 
        "intTime": 20090430, 
        "postID": 51, 
        "quote": "", 
        "reply": "I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 19:54:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Yep, some people disagree with your fawning worship and adulation of The One, karl. I know it's hard to believe that anyone could oppose the extreme-left agenda of Saint Barack, but many of us do. what amuses me so is that you consider \"fawning worship and adulation\" to be the same as \"He's not a commie hell bent on destroying America\" I have no problem with anyone who \"opposes his agenda\". The problem is that I hear no criticisms based on reality or alternative solutions other than \"lower taxes for the rich\".", 
        "intTime": 20090430, 
        "postID": 52, 
        "quote": "Yep, some people disagree with your fawning worship and adulation of The One, karl. I know it's hard to believe that anyone could oppose the extreme-left agenda of Saint Barack, but many of us do.", 
        "reply": " what amuses me so is that you consider \"fawning worship and adulation\" to be the same as \"He's not a commie hell bent on destroying America\" I have no problem with anyone who \"opposes his agenda\". The problem is that I hear no criticisms based on reality or alternative solutions other than \"lower taxes for the rich\".", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 21:30:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: http://www.youtube.com/watch?v=35eRxxZ-Ar0 Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance. Socialism is any society that is controlled by the government. The factories, transportation system and labor all come under government control. This includes both prices and wages. You pay what the government says you will and you earn what the government says you will. It is just the opposite under capitalism. Society is controlled by the law of supply and demand.People with critical skills get the big bucks. Critical meaning most in demand weither it means brain surgery or the ability to hit 40 home runs in a season. The higher the demand for a given product compared to the supply, the higher the price. Diamonds are valuable; dirt is cheap. These are the definitions of this \"wingnut.\" Now perhaps thud will give us his.", 
        "intTime": 20090430, 
        "postID": 53, 
        "quote": "Originally posted by Thud357L: quote: http://www.youtube.com/watch?v=35eRxxZ-Ar0 Most of the wingnuts who rail against socialism haven't the foggiest idea of what it really is. They think socialism is just another word for communism or fascism and they will even argue their ignorance.", 
        "reply": " Socialism is any society that is controlled by the government. The factories, transportation system and labor all come under government control. This includes both prices and wages. You pay what the government says you will and you earn what the government says you will. It is just the opposite under capitalism. Society is controlled by the law of supply and demand.People with critical skills get the big bucks. Critical meaning most in demand weither it means brain surgery or the ability to hit 40 home runs in a season. The higher the demand for a given product compared to the supply, the higher the price. Diamonds are valuable; dirt is cheap. These are the definitions of this \"wingnut.\" Now perhaps thud will give us his.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 23:10:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: I have no problem with anyone who \"opposes his agenda\". The problem is that I hear no criticisms based on reality or alternative solutions other than \"lower taxes for the rich\". karlhungusjr How about Americans like me who think the 800 billion dollar stimulus package is not only wasteful, it's simply a bad idea? A 3.5 trillion dollar budget? Same thing. Others may point out that naming no less than 4 persons with tax issues to the cabinet is a bad idea. Closing Gitmo may seem like a great idea till it comes time to decide where to put the prisoners. Don't do or promise anything till we know. Lower taxes accross the board as far is practical is what I would like to see. Gee Karl, I must have missed the call for \"lower taxes for the rich.\" Perhaps you could point out who think this is a good idea are. Feel free to name names and quote them.", 
        "intTime": 20090430, 
        "postID": 54, 
        "quote": "I have no problem with anyone who \"opposes his agenda\". The problem is that I hear no criticisms based on reality or alternative solutions other than \"lower taxes for the rich\". karlhungusjr", 
        "reply": " How about Americans like me who think the 800 billion dollar stimulus package is not only wasteful, it's simply a bad idea? A 3.5 trillion dollar budget? Same thing. Others may point out that naming no less than 4 persons with tax issues to the cabinet is a bad idea. Closing Gitmo may seem like a great idea till it comes time to decide where to put the prisoners. Don't do or promise anything till we know. Lower taxes accross the board as far is practical is what I would like to see. Gee Karl, I must have missed the call for \"lower taxes for the rich.\" Perhaps you could point out who think this is a good idea are. Feel free to name names and quote them.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-04-30 23:37:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: How about Americans like me who think the 800 billion dollar stimulus package is not only wasteful, it's simply a bad idea? A 3.5 trillion dollar budget? Same thing. wonderful. fine. now explain how we get the nation out of a deep recession, without banks failing and the FDIC going bankrupt trying to cover the losses. quote: Others may point out that naming no less than 4 persons with tax issues to the cabinet is a bad idea. yes that was politically a very bad move. quote: Closing Gitmo may seem like a great idea till it comes time to decide where to put the prisoners. Don't do or promise anything till we know. I have no problem with were we put them. If a federal prison was ok for McVeigh then its good enough for a goat herder. quote: Lower taxes accross the board as far is practical is what I would like to see. lower taxes across the board is the main reason we ran a deficit for the last 8 years and partially the reason we are in the situation we are in. quote: Gee Karl, I must have missed the call for \"lower taxes for the rich.\" Perhaps you could point out who think this is a good idea are.Feel free to name names and quote them. no problem. You did one sentence ago. \"Lower taxes accross the board as far is practical is what I would like to see.\" unless \"across the board\" means \"everyone but the rich\". and if thats the case you'll soon get your wish.", 
        "intTime": 20090501, 
        "postID": 55, 
        "quote": "How about Americans like me who think the 800 billion dollar stimulus package is not only wasteful, it's simply a bad idea? A 3.5 trillion dollar budget? Same thing.", 
        "reply": " wonderful. fine. now explain how we get the nation out of a deep recession, without banks failing and the FDIC going bankrupt trying to cover the losses. quote: Others may point out that naming no less than 4 persons with tax issues to the cabinet is a bad idea. yes that was politically a very bad move. quote: Closing Gitmo may seem like a great idea till it comes time to decide where to put the prisoners. Don't do or promise anything till we know. I have no problem with were we put them. If a federal prison was ok for McVeigh then its good enough for a goat herder. quote: Lower taxes accross the board as far is practical is what I would like to see. lower taxes across the board is the main reason we ran a deficit for the last 8 years and partially the reason we are in the situation we are in. quote: Gee Karl, I must have missed the call for \"lower taxes for the rich.\" Perhaps you could point out who think this is a good idea are.Feel free to name names and quote them. no problem. You did one sentence ago. \"Lower taxes accross the board as far is practical is what I would like to see.\" unless \"across the board\" means \"everyone but the rich\". and if thats the case you'll soon get your wish.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-05-01 00:05:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: \"http://www.youtube.com/watch?v=35eRxxZ-Ar0\" I think a fun drinking game would be to take a drink every time someone says \"socialism\". Wow! what a great idea but I don't have that much beer in the house;I have an ample supply stashed in the basement fridge. I suppose if everybody went out & got enough to cover the amount of times \"socialism\" in uttered the stock prices for the beer makers would go up signifigantly. So the market goes up & we get totally tanked. sounds like a win-win scenario to me", 
        "intTime": 20090501, 
        "postID": 56, 
        "quote": "Originally posted by karlhungusjr: \"http://www.youtube.com/watch?v=35eRxxZ-Ar0\" I think a fun drinking game would be to take a drink every time someone says \"socialism\".", 
        "reply": " Wow! what a great idea but I don't have that much beer in the house;I have an ample supply stashed in the basement fridge. I suppose if everybody went out & got enough to cover the amount of times \"socialism\" in uttered the stock prices for the beer makers would go up signifigantly. So the market goes up & we get totally tanked. sounds like a win-win scenario to me", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-05-01 05:31:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "TacEvacRet"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking Socialism is not, repeat not, a political system. Socialism is a delivery system. When \"government\" in it's classical form is involved, it is no longer pure socialism, it becomes some sort of hybrid. I could care less about Venezuela and I know little of their history but most successful systems are some sort of hybrid combining aspects of capitalism and socialism. That's what we have here in the United States. The weak point of classical socialism is the same as laissez-faire capitalism - human nature.", 
        "intTime": 20090501, 
        "postID": 57, 
        "quote": "Originally posted by ACR26: I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking", 
        "reply": " Socialism is not, repeat not, a political system. Socialism is a delivery system. When \"government\" in it's classical form is involved, it is no longer pure socialism, it becomes some sort of hybrid. I could care less about Venezuela and I know little of their history but most successful systems are some sort of hybrid combining aspects of capitalism and socialism. That's what we have here in the United States. The weak point of classical socialism is the same as laissez-faire capitalism - human nature.", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-05-01 06:56:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by ACR26: I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking Socialism is not, repeat not, a political system. Socialism is a delivery system. When \"government\" in it's classical form is involved, it is no longer pure socialism, it becomes some sort of hybrid. I could care less about Venezuela and I know little of their history but most successful systems are some sort of hybrid combining aspects of capitalism and socialism. That's what we have here in the United States. The weak point of classical socialism is the same as laissez-faire capitalism - human nature. It amazes me that you DEFINE the weakpoint, correclty, yet utterly fail to articulate a common sense counter to that weakpoint.. Or just fail to see that capitalism IS the counter?", 
        "intTime": 20090501, 
        "postID": 58, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by ACR26: I guess that is why you do not understand the statement. Which came first to Venezuela... Free Market or Socialism? Try that with a whole host of countries and see what you come up with. Stuff up against the wall looks like it is sticking Socialism is not, repeat not, a political system. Socialism is a delivery system. When \"government\" in it's classical form is involved, it is no longer pure socialism, it becomes some sort of hybrid. I could care less about Venezuela and I know little of their history but most successful systems are some sort of hybrid combining aspects of capitalism and socialism. That's what we have here in the United States. The weak point of classical socialism is the same as laissez-faire capitalism - human nature.", 
        "reply": " It amazes me that you DEFINE the weakpoint, correclty, yet utterly fail to articulate a common sense counter to that weakpoint.. Or just fail to see that capitalism IS the counter?", 
        "threadID": "409192893_5040031222001", 
        "time": "2009-05-01 07:33:00", 
        "title": "The first 100 days.....according to Fox News", 
        "userID": "threerings"
    }
]