[
    {
        "content": "President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": "President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 13:44:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "The CIA reports? National security took a big hit. And it's going to get worse. Rosa Brooks will see to that. An Obama apointee to the Pentagon. Was Michael Moore unavailable?", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "", 
        "reply": "The CIA reports? National security took a big hit. And it's going to get worse. Rosa Brooks will see to that. An Obama apointee to the Pentagon. Was Michael Moore unavailable?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 15:17:00", 
        "title": "Secret Presidential records released", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:18:00", 
        "title": "Secret Presidential records released", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone? Aw...C'mon there Pete, you can't expect the \"Coveted One\" to honor ALL his campaign promises . . .", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "Originally posted by peter3_1: Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "reply": " Aw...C'mon there Pete, you can't expect the \"Coveted One\" to honor ALL his campaign promises . . .", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:28:00", 
        "title": "Secret Presidential records released", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand.", 
        "reply": " Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:41:00", 
        "title": "Secret Presidential records released", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals... Maddoff will never see a cell. He is waiting in his penthouse till they convert his White collar crime cottage into a mini mansion so he can enjoy his retirement years in the luxury he's become accostumed to.Fact is Im surprised he didnt buy the whole farm and tear down all those other cottages. Wealth has its privaleges.", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "reply": " Maddoff will never see a cell. He is waiting in his penthouse till they convert his White collar crime cottage into a mini mansion so he can enjoy his retirement years in the luxury he's become accostumed to.Fact is Im surprised he didnt buy the whole farm and tear down all those other cottages. Wealth has its privaleges.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 17:12:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "Ya mean the ones that tell us if he was ever a U.S.citizen or renounced it when he got his passport from Indonesia when he was young......Those the records you talkin' about?????", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "", 
        "reply": "Ya mean the ones that tell us if he was ever a U.S.citizen or renounced it when he got his passport from Indonesia when he was young......Those the records you talkin' about?????", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 17:18:00", 
        "title": "Secret Presidential records released", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? BTW, what did he do wrong again? Who has the proof? That is neccessary in a court, you know?", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "reply": " What if George Bush isn't guilty of all that you suggest? BTW, what did he do wrong again? Who has the proof? That is neccessary in a court, you know?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 18:20:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? Well Then he has nothing to worry about and his name wont even come up. BTW, what did he do wrong again? We all know what hes been accused of Now its just a matter of proving it one way or the other. Who has the proof? Of what his guilt or innocence? Plenty of proffesionals and groups claim to and thats why we need an independant investigation to prove or dismiss these claims once and for all. That is neccessary in a court, you know? If it ever gets that far.", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "Originally posted by _cash_: quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? Well Then he has nothing to worry about and his name wont even come up. BTW, what did he do wrong again? We all know what hes been accused of Now its just a matter of proving it one way or the other. Who has the proof? Of what his guilt or innocence? Plenty of proffesionals and groups claim to and thats why we need an independant investigation to prove or dismiss these claims once and for all. That is neccessary in a court, you know? If it ever gets that far.", 
        "reply": "", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:40:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Absolutely I think this is one of the most dangerous things that a war -- president has done in the history of this country what we have done is we have given Osama bin Laden. Through it through the release of these documents.\" \" The limits of our interrogation techniques vital information that they can use them to train they're terrorists they're terrorists to resist interrogation when they're captured by the United States this is is that thin and neck and -- FDR during the Second World War had sent the war plans to Berlin. Give an example of one of the techniques that that we've we may not use waterboarding anymore -- of the tape did techniques it's commonly used by law enforcement and also by -- interrogation is sleep deprivation. They need need need the memos describe how it these -- sleep deprivation has to stop. If a terrorist start showing hallucinations well now they're going to trained -- hallucinations. So they can avoid interrogation and hold back information that could save America.\" KL there is not a thing we could teach the terrorists about torture they dont already dont know. they could probably teach us a trick or two.", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "Originally posted by klassylady25: Absolutely I think this is one of the most dangerous things that a war -- president has done in the history of this country what we have done is we have given Osama bin Laden. Through it through the release of these documents.\" \" The limits of our interrogation techniques vital information that they can use them to train they're terrorists they're terrorists to resist interrogation when they're captured by the United States this is is that thin and neck and -- FDR during the Second World War had sent the war plans to Berlin. Give an example of one of the techniques that that we've we may not use waterboarding anymore -- of the tape did techniques it's commonly used by law enforcement and also by -- interrogation is sleep deprivation. They need need need the memos describe how it these -- sleep deprivation has to stop. If a terrorist start showing hallucinations well now they're going to trained -- hallucinations. So they can avoid interrogation and hold back information that could save America.\"", 
        "reply": " KL there is not a thing we could teach the terrorists about torture they dont already dont know. they could probably teach us a trick or two.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:49:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\" Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. We never had a plan to hand over thats was the problem and is why were still there. The B&G bumbler even declared mission accomplished when it didnt even begin. Then it was hearts and minds,No exit stategy, ROEs that worked against the troops, and now the surge.", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\"", 
        "reply": " Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. We never had a plan to hand over thats was the problem and is why were still there. The B&G bumbler even declared mission accomplished when it didnt even begin. Then it was hearts and minds,No exit stategy, ROEs that worked against the troops, and now the surge.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:57:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\" good post", 
        "intTime": 20090418, 
        "postID": 12, 
        "quote": "Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\"", 
        "reply": " good post", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 06:15:00", 
        "title": "Secret Presidential records released", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "intTime": 20090418, 
        "postID": 13, 
        "quote": "Originally posted by scooter_mech: The CIA reports? National security took a big hit...", 
        "reply": " How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 06:58:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "intTime": 20090418, 
        "postID": 14, 
        "quote": "Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "reply": " Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:23:00", 
        "title": "Secret Presidential records released", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried. Thats my daily prayer. Every so often I post articles that prove my theory of conditioning by the responses. No doubt in my mind", 
        "intTime": 20090418, 
        "postID": 15, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried.", 
        "reply": " Thats my daily prayer. Every so often I post articles that prove my theory of conditioning by the responses. No doubt in my mind", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:28:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors. Hang on....in a couple of years everyone will want to try Obama for all of his alleged crimes....maybe you can set up a twofer?", 
        "intTime": 20090418, 
        "postID": 16, 
        "quote": "Originally posted by skinman13: quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "reply": " Hang on....in a couple of years everyone will want to try Obama for all of his alleged crimes....maybe you can set up a twofer?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:29:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "intTime": 20090418, 
        "postID": 17, 
        "quote": "", 
        "reply": "The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:34:00", 
        "title": "Secret Presidential records released", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "intTime": 20090418, 
        "postID": 18, 
        "quote": "Originally posted by stillkit: The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "reply": "", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:37:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "To Stillkit (without reposting his post)", 
        "intTime": 20090418, 
        "postID": 19, 
        "quote": "", 
        "reply": "To Stillkit (without reposting his post)", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:39:00", 
        "title": "Secret Presidential records released", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Oh our poor, poor enemies! I lose so much sleep worrying that they'll be branded and tortured for their roll in beheadings and terrorism. Oops! Terrorism? We don't say that anymore!", 
        "intTime": 20090418, 
        "postID": 20, 
        "quote": "", 
        "reply": "Oh our poor, poor enemies! I lose so much sleep worrying that they'll be branded and tortured for their roll in beheadings and terrorism. Oops! Terrorism? We don't say that anymore!", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:56:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... While we see it as being a gentler nation, that is not the way that the 'not quite so civilized\" world will see us. Weak is not a safe place. Being a bully is not being strong...it is being weak. Teddy Roosevelt said it best, \"Walk softly and carry a big stick.\" Our last president was a frat-boy bully and did it the other way around and now the world is not a safer place as a result.", 
        "intTime": 20090418, 
        "postID": 21, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... While we see it as being a gentler nation, that is not the way that the 'not quite so civilized\" world will see us. Weak is not a safe place.", 
        "reply": " Being a bully is not being strong...it is being weak. Teddy Roosevelt said it best, \"Walk softly and carry a big stick.\" Our last president was a frat-boy bully and did it the other way around and now the world is not a safer place as a result.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 09:09:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... Obama should start being worried...", 
        "intTime": 20090418, 
        "postID": 22, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "reply": " Obama should start being worried...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 09:09:00", 
        "title": "Secret Presidential records released", 
        "userID": "threerings"
    }, 
    {
        "content": "President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "intTime": 20090417, 
        "postID": 23, 
        "quote": "", 
        "reply": "President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 13:44:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "The CIA reports? National security took a big hit. And it's going to get worse. Rosa Brooks will see to that. An Obama apointee to the Pentagon. Was Michael Moore unavailable?", 
        "intTime": 20090417, 
        "postID": 24, 
        "quote": "", 
        "reply": "The CIA reports? National security took a big hit. And it's going to get worse. Rosa Brooks will see to that. An Obama apointee to the Pentagon. Was Michael Moore unavailable?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 15:17:00", 
        "title": "Secret Presidential records released", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "intTime": 20090417, 
        "postID": 25, 
        "quote": "", 
        "reply": "Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:18:00", 
        "title": "Secret Presidential records released", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone? Aw...C'mon there Pete, you can't expect the \"Coveted One\" to honor ALL his campaign promises . . .", 
        "intTime": 20090417, 
        "postID": 26, 
        "quote": "Originally posted by peter3_1: Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "reply": " Aw...C'mon there Pete, you can't expect the \"Coveted One\" to honor ALL his campaign promises . . .", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:28:00", 
        "title": "Secret Presidential records released", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "intTime": 20090417, 
        "postID": 27, 
        "quote": "Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand.", 
        "reply": " Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:41:00", 
        "title": "Secret Presidential records released", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals... Maddoff will never see a cell. He is waiting in his penthouse till they convert his White collar crime cottage into a mini mansion so he can enjoy his retirement years in the luxury he's become accostumed to.Fact is Im surprised he didnt buy the whole farm and tear down all those other cottages. Wealth has its privaleges.", 
        "intTime": 20090417, 
        "postID": 28, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "reply": " Maddoff will never see a cell. He is waiting in his penthouse till they convert his White collar crime cottage into a mini mansion so he can enjoy his retirement years in the luxury he's become accostumed to.Fact is Im surprised he didnt buy the whole farm and tear down all those other cottages. Wealth has its privaleges.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 17:12:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "Ya mean the ones that tell us if he was ever a U.S.citizen or renounced it when he got his passport from Indonesia when he was young......Those the records you talkin' about?????", 
        "intTime": 20090417, 
        "postID": 29, 
        "quote": "", 
        "reply": "Ya mean the ones that tell us if he was ever a U.S.citizen or renounced it when he got his passport from Indonesia when he was young......Those the records you talkin' about?????", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 17:18:00", 
        "title": "Secret Presidential records released", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? BTW, what did he do wrong again? Who has the proof? That is neccessary in a court, you know?", 
        "intTime": 20090417, 
        "postID": 30, 
        "quote": "Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "reply": " What if George Bush isn't guilty of all that you suggest? BTW, what did he do wrong again? Who has the proof? That is neccessary in a court, you know?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 18:20:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? Well Then he has nothing to worry about and his name wont even come up. BTW, what did he do wrong again? We all know what hes been accused of Now its just a matter of proving it one way or the other. Who has the proof? Of what his guilt or innocence? Plenty of proffesionals and groups claim to and thats why we need an independant investigation to prove or dismiss these claims once and for all. That is neccessary in a court, you know? If it ever gets that far.", 
        "intTime": 20090417, 
        "postID": 31, 
        "quote": "Originally posted by _cash_: quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? Well Then he has nothing to worry about and his name wont even come up. BTW, what did he do wrong again? We all know what hes been accused of Now its just a matter of proving it one way or the other. Who has the proof? Of what his guilt or innocence? Plenty of proffesionals and groups claim to and thats why we need an independant investigation to prove or dismiss these claims once and for all. That is neccessary in a court, you know? If it ever gets that far.", 
        "reply": "", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:40:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Absolutely I think this is one of the most dangerous things that a war -- president has done in the history of this country what we have done is we have given Osama bin Laden. Through it through the release of these documents.\" \" The limits of our interrogation techniques vital information that they can use them to train they're terrorists they're terrorists to resist interrogation when they're captured by the United States this is is that thin and neck and -- FDR during the Second World War had sent the war plans to Berlin. Give an example of one of the techniques that that we've we may not use waterboarding anymore -- of the tape did techniques it's commonly used by law enforcement and also by -- interrogation is sleep deprivation. They need need need the memos describe how it these -- sleep deprivation has to stop. If a terrorist start showing hallucinations well now they're going to trained -- hallucinations. So they can avoid interrogation and hold back information that could save America.\" KL there is not a thing we could teach the terrorists about torture they dont already dont know. they could probably teach us a trick or two.", 
        "intTime": 20090417, 
        "postID": 32, 
        "quote": "Originally posted by klassylady25: Absolutely I think this is one of the most dangerous things that a war -- president has done in the history of this country what we have done is we have given Osama bin Laden. Through it through the release of these documents.\" \" The limits of our interrogation techniques vital information that they can use them to train they're terrorists they're terrorists to resist interrogation when they're captured by the United States this is is that thin and neck and -- FDR during the Second World War had sent the war plans to Berlin. Give an example of one of the techniques that that we've we may not use waterboarding anymore -- of the tape did techniques it's commonly used by law enforcement and also by -- interrogation is sleep deprivation. They need need need the memos describe how it these -- sleep deprivation has to stop. If a terrorist start showing hallucinations well now they're going to trained -- hallucinations. So they can avoid interrogation and hold back information that could save America.\"", 
        "reply": " KL there is not a thing we could teach the terrorists about torture they dont already dont know. they could probably teach us a trick or two.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:49:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\" Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. We never had a plan to hand over thats was the problem and is why were still there. The B&G bumbler even declared mission accomplished when it didnt even begin. Then it was hearts and minds,No exit stategy, ROEs that worked against the troops, and now the surge.", 
        "intTime": 20090417, 
        "postID": 33, 
        "quote": "Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\"", 
        "reply": " Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. We never had a plan to hand over thats was the problem and is why were still there. The B&G bumbler even declared mission accomplished when it didnt even begin. Then it was hearts and minds,No exit stategy, ROEs that worked against the troops, and now the surge.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:57:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\" good post", 
        "intTime": 20090418, 
        "postID": 34, 
        "quote": "Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\"", 
        "reply": " good post", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 06:15:00", 
        "title": "Secret Presidential records released", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "intTime": 20090418, 
        "postID": 35, 
        "quote": "Originally posted by scooter_mech: The CIA reports? National security took a big hit...", 
        "reply": " How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 06:58:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "intTime": 20090418, 
        "postID": 36, 
        "quote": "Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "reply": " Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:23:00", 
        "title": "Secret Presidential records released", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried. Thats my daily prayer. Every so often I post articles that prove my theory of conditioning by the responses. No doubt in my mind", 
        "intTime": 20090418, 
        "postID": 37, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried.", 
        "reply": " Thats my daily prayer. Every so often I post articles that prove my theory of conditioning by the responses. No doubt in my mind", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:28:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors. Hang on....in a couple of years everyone will want to try Obama for all of his alleged crimes....maybe you can set up a twofer?", 
        "intTime": 20090418, 
        "postID": 38, 
        "quote": "Originally posted by skinman13: quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "reply": " Hang on....in a couple of years everyone will want to try Obama for all of his alleged crimes....maybe you can set up a twofer?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:29:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "intTime": 20090418, 
        "postID": 39, 
        "quote": "", 
        "reply": "The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:34:00", 
        "title": "Secret Presidential records released", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "intTime": 20090418, 
        "postID": 40, 
        "quote": "Originally posted by stillkit: The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "reply": "", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:37:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "To Stillkit (without reposting his post)", 
        "intTime": 20090418, 
        "postID": 41, 
        "quote": "", 
        "reply": "To Stillkit (without reposting his post)", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:39:00", 
        "title": "Secret Presidential records released", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Oh our poor, poor enemies! I lose so much sleep worrying that they'll be branded and tortured for their roll in beheadings and terrorism. Oops! Terrorism? We don't say that anymore!", 
        "intTime": 20090418, 
        "postID": 42, 
        "quote": "", 
        "reply": "Oh our poor, poor enemies! I lose so much sleep worrying that they'll be branded and tortured for their roll in beheadings and terrorism. Oops! Terrorism? We don't say that anymore!", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:56:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... While we see it as being a gentler nation, that is not the way that the 'not quite so civilized\" world will see us. Weak is not a safe place. Being a bully is not being strong...it is being weak. Teddy Roosevelt said it best, \"Walk softly and carry a big stick.\" Our last president was a frat-boy bully and did it the other way around and now the world is not a safer place as a result.", 
        "intTime": 20090418, 
        "postID": 43, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... While we see it as being a gentler nation, that is not the way that the 'not quite so civilized\" world will see us. Weak is not a safe place.", 
        "reply": " Being a bully is not being strong...it is being weak. Teddy Roosevelt said it best, \"Walk softly and carry a big stick.\" Our last president was a frat-boy bully and did it the other way around and now the world is not a safer place as a result.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 09:09:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... Obama should start being worried...", 
        "intTime": 20090418, 
        "postID": 44, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "reply": " Obama should start being worried...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 09:09:00", 
        "title": "Secret Presidential records released", 
        "userID": "threerings"
    }, 
    {
        "content": "President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "intTime": 20090417, 
        "postID": 45, 
        "quote": "", 
        "reply": "President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 13:44:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "The CIA reports? National security took a big hit. And it's going to get worse. Rosa Brooks will see to that. An Obama apointee to the Pentagon. Was Michael Moore unavailable?", 
        "intTime": 20090417, 
        "postID": 46, 
        "quote": "", 
        "reply": "The CIA reports? National security took a big hit. And it's going to get worse. Rosa Brooks will see to that. An Obama apointee to the Pentagon. Was Michael Moore unavailable?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 15:17:00", 
        "title": "Secret Presidential records released", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "intTime": 20090417, 
        "postID": 47, 
        "quote": "", 
        "reply": "Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:18:00", 
        "title": "Secret Presidential records released", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone? Aw...C'mon there Pete, you can't expect the \"Coveted One\" to honor ALL his campaign promises . . .", 
        "intTime": 20090417, 
        "postID": 48, 
        "quote": "Originally posted by peter3_1: Didn't Mr. Obama say that the killing or Capture of Usama bin Ladin would be job one? How's that job going, anyone?", 
        "reply": " Aw...C'mon there Pete, you can't expect the \"Coveted One\" to honor ALL his campaign promises . . .", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:28:00", 
        "title": "Secret Presidential records released", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "intTime": 20090417, 
        "postID": 49, 
        "quote": "Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand.", 
        "reply": " Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 16:41:00", 
        "title": "Secret Presidential records released", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals... Maddoff will never see a cell. He is waiting in his penthouse till they convert his White collar crime cottage into a mini mansion so he can enjoy his retirement years in the luxury he's become accostumed to.Fact is Im surprised he didnt buy the whole farm and tear down all those other cottages. Wealth has its privaleges.", 
        "intTime": 20090417, 
        "postID": 50, 
        "quote": "Originally posted by ELLIOTT1980: quote: Originally posted by klassylady25: Gosh Elliott, I was wondering about that too. Are they going to keep him in Gitmo? Good care, citizenship... beats the sand. Naw...Klassy, I do believe UBL and ole Bernie Madoff may become cellmates . . .EXCEPT..., UBL will get his cursory prayer rug, hand stitched by a virgin..., and special religious-dietary meals...", 
        "reply": " Maddoff will never see a cell. He is waiting in his penthouse till they convert his White collar crime cottage into a mini mansion so he can enjoy his retirement years in the luxury he's become accostumed to.Fact is Im surprised he didnt buy the whole farm and tear down all those other cottages. Wealth has its privaleges.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 17:12:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "Ya mean the ones that tell us if he was ever a U.S.citizen or renounced it when he got his passport from Indonesia when he was young......Those the records you talkin' about?????", 
        "intTime": 20090417, 
        "postID": 51, 
        "quote": "", 
        "reply": "Ya mean the ones that tell us if he was ever a U.S.citizen or renounced it when he got his passport from Indonesia when he was young......Those the records you talkin' about?????", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 17:18:00", 
        "title": "Secret Presidential records released", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? BTW, what did he do wrong again? Who has the proof? That is neccessary in a court, you know?", 
        "intTime": 20090417, 
        "postID": 52, 
        "quote": "Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs.", 
        "reply": " What if George Bush isn't guilty of all that you suggest? BTW, what did he do wrong again? Who has the proof? That is neccessary in a court, you know?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 18:20:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by _cash_: quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? Well Then he has nothing to worry about and his name wont even come up. BTW, what did he do wrong again? We all know what hes been accused of Now its just a matter of proving it one way or the other. Who has the proof? Of what his guilt or innocence? Plenty of proffesionals and groups claim to and thats why we need an independant investigation to prove or dismiss these claims once and for all. That is neccessary in a court, you know? If it ever gets that far.", 
        "intTime": 20090417, 
        "postID": 53, 
        "quote": "Originally posted by _cash_: quote: Originally posted by john2x: President Obama certainly to a giant step in the proper direction as he promised to. If he continues on this path it will certainly restore the needed confidence in government. I hope this is just the begining and will lead to further investigations. Not that I give a rats azz about the terrorists but the bigger picture is far more important. Our Constitution was violated once again and that cannot be tolerated. There must be consequences. We cant just accept that which we agree with or what will be next? In releasing those first documents he broke from the cast system of politicians that cover politicians and for that alone should be commended. I only hope its the begining of more to come and eventually lead to a full scale independant 9/11 investigation That will answer all the questions. After 8 years 3 wars and thousands of dead and wounded plus a bankrupted nation we are no closer to those answers that we were 8 years ago. OBL who is allegedly the mastermind is still at large and no one has been tried, convicted, and hung in an American court for the 9/11 tragedy and attack on the USA. Thats what these tea parties should be about then watch the turn outs. What if George Bush isn't guilty of all that you suggest? Well Then he has nothing to worry about and his name wont even come up. BTW, what did he do wrong again? We all know what hes been accused of Now its just a matter of proving it one way or the other. Who has the proof? Of what his guilt or innocence? Plenty of proffesionals and groups claim to and thats why we need an independant investigation to prove or dismiss these claims once and for all. That is neccessary in a court, you know? If it ever gets that far.", 
        "reply": "", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:40:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Absolutely I think this is one of the most dangerous things that a war -- president has done in the history of this country what we have done is we have given Osama bin Laden. Through it through the release of these documents.\" \" The limits of our interrogation techniques vital information that they can use them to train they're terrorists they're terrorists to resist interrogation when they're captured by the United States this is is that thin and neck and -- FDR during the Second World War had sent the war plans to Berlin. Give an example of one of the techniques that that we've we may not use waterboarding anymore -- of the tape did techniques it's commonly used by law enforcement and also by -- interrogation is sleep deprivation. They need need need the memos describe how it these -- sleep deprivation has to stop. If a terrorist start showing hallucinations well now they're going to trained -- hallucinations. So they can avoid interrogation and hold back information that could save America.\" KL there is not a thing we could teach the terrorists about torture they dont already dont know. they could probably teach us a trick or two.", 
        "intTime": 20090417, 
        "postID": 54, 
        "quote": "Originally posted by klassylady25: Absolutely I think this is one of the most dangerous things that a war -- president has done in the history of this country what we have done is we have given Osama bin Laden. Through it through the release of these documents.\" \" The limits of our interrogation techniques vital information that they can use them to train they're terrorists they're terrorists to resist interrogation when they're captured by the United States this is is that thin and neck and -- FDR during the Second World War had sent the war plans to Berlin. Give an example of one of the techniques that that we've we may not use waterboarding anymore -- of the tape did techniques it's commonly used by law enforcement and also by -- interrogation is sleep deprivation. They need need need the memos describe how it these -- sleep deprivation has to stop. If a terrorist start showing hallucinations well now they're going to trained -- hallucinations. So they can avoid interrogation and hold back information that could save America.\"", 
        "reply": " KL there is not a thing we could teach the terrorists about torture they dont already dont know. they could probably teach us a trick or two.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:49:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\" Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. We never had a plan to hand over thats was the problem and is why were still there. The B&G bumbler even declared mission accomplished when it didnt even begin. Then it was hearts and minds,No exit stategy, ROEs that worked against the troops, and now the surge.", 
        "intTime": 20090417, 
        "postID": 55, 
        "quote": "Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\"", 
        "reply": " Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. We never had a plan to hand over thats was the problem and is why were still there. The B&G bumbler even declared mission accomplished when it didnt even begin. Then it was hearts and minds,No exit stategy, ROEs that worked against the troops, and now the surge.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-17 22:57:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\" good post", 
        "intTime": 20090418, 
        "postID": 56, 
        "quote": "Originally posted by klassylady25: Once you hand the enemy the plans for the battle, the battle is over. Raise the white flag of surrender. See article here: 'http://www.rferl.org/content/The_End_Of_The_US_War_On_Terror/1609936.html' Written April 16, 2009 Radio Free Europe \"Do you remember where you were the day the \"global war on terror\" ended? Like most people, you probably didn't even notice that it had. And that may be because the \"war\" didn't end the way the man who started it -- former U.S. President George W. Bush -- often predicted it would: with \"complete victory\" in the \"great struggle between the forces of freedom and the forces of terror.\" It ended with an e-mail, sent under a new administration led by President Barack Obama. Sometime during the week of March 25, the government agency that reviews the public statements of administration officials before they're disseminated sent an e-mail to employees of the U.S. Defense Department. The e-mail read: \"This administration prefers to avoid using the term 'long war' or 'global war on terror.' Please use 'Overseas Contingency Operation.'\"", 
        "reply": " good post", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 06:15:00", 
        "title": "Secret Presidential records released", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "intTime": 20090418, 
        "postID": 57, 
        "quote": "Originally posted by scooter_mech: The CIA reports? National security took a big hit...", 
        "reply": " How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 06:58:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "intTime": 20090418, 
        "postID": 58, 
        "quote": "Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "reply": " Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:23:00", 
        "title": "Secret Presidential records released", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried. Thats my daily prayer. Every so often I post articles that prove my theory of conditioning by the responses. No doubt in my mind", 
        "intTime": 20090418, 
        "postID": 59, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried.", 
        "reply": " Thats my daily prayer. Every so often I post articles that prove my theory of conditioning by the responses. No doubt in my mind", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:28:00", 
        "title": "Secret Presidential records released", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by skinman13: quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors. Hang on....in a couple of years everyone will want to try Obama for all of his alleged crimes....maybe you can set up a twofer?", 
        "intTime": 20090418, 
        "postID": 60, 
        "quote": "Originally posted by skinman13: quote: Originally posted by scooter_mech: The CIA reports? National security took a big hit... How so? Before we can regain the trust and respect of the rest of the world, we have to admit that the last administration was not working in the best interests of America or the rest of the world, or complying with our laws and international laws, but acting in his own self-interests and pressing his myopic agenda. We must clean house inside and out, and that includes airing our dirty laundry. All if this would not have been necessary if the last administration had shown the proper respect and stood up for our Constitution and legally enacted and ratified international treaties. Instead he acted like a Third-World despot and called himself the, \"Decider,\" and tossed out or just ignored any law that stood in his way...including our Constitution and the Geneva Convention. He and his henchmen are lucky that they are not being charged and tried as traitors.", 
        "reply": " Hang on....in a couple of years everyone will want to try Obama for all of his alleged crimes....maybe you can set up a twofer?", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:29:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "intTime": 20090418, 
        "postID": 61, 
        "quote": "", 
        "reply": "The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:34:00", 
        "title": "Secret Presidential records released", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "intTime": 20090418, 
        "postID": 62, 
        "quote": "Originally posted by stillkit: The \"official\" talking point from the past administration and their supporters, apparently is that Obama has now tied the hands of not only himself, but future President's as well. Let's hope so! Let's pray our nation never goes down that rabbit hole again. And, let's pressure the White House to pardon those little people who are in jail now, the Privates and Sergeants who are serving time for the same crimes for which their masters will not be held accountable. If those who ordered it can escape prosecution, it's dishonorable and unfair to continue punishing the underlings who carried out the policy. All are equally guilty, so the punishment, or lack thereof, should be equal too. What's most striking about it is just what Andrew Sullivan points out in his article in the current edtion of The Atlantic and what someone once referred to as the \"banality of evil\" in relation to Nazi Germany. The people who authorized, and conducted, these things are not bad people, nor are they recognizable monsters. They are just like you and I and could be standing behind you in line at the store and you'd never notice them. I always warned my kids and grandkids that child molesters do not come with a giant neon sign on their head which says, \"Warning!\" Neither do psychotics and the players in this little drama bear witness to that fact. Mukasey, McMullen, Bush, Cheney, Yoo, Bybee, Gonzales. Look at them. What do you see? Pleasant looking men, friendly neighbors whom you'd invite over for a beer. They're not jack-booted thugs wielding a cat o' nine tails, but nondescript, regular Joe's, the kind of people you want to trust. But, they aren't trustworthy. They are monsters, though they'll never see, nor understand their own culpability. Like the Nazi's who went to the gallows convinced of their own innocence, they're bewildered by the outrage directed against them and will die without ever comprehending what they've done. If nothing else good comes from all this, I hope we American's finally recognize that we are no different than anyone else, that the moral superiority we think we have is a chimera, a lie we've told ourselves to shield us from the truth of our own evil. The dark impulses which drove the Nazi's or Pol Pot or Joe Stalin exists within our own breasts too. Our hearts are as black as the most heinous criminals in history and it only requires the right set of circumstances to reveal it. However, I'm not optimistic in that regard. We, as a people, have been guilty of far worse in our history, yet still don't recognize the truth, so why should we this time? If we can still excuse Wounded Knee or McCarthyism; if we can still justify separate but equal and apply it not to blacks, but to homosexuals; if we accept the term \"collateral damage\" without blinking, why would these revelations about torturing in the name of The People cause us to look inward and see our own guilt? After all, it was once again someone else who did it, not us. But, it WAS us and is STILL us. If our whole people can take the credit when things go right, why shouldn't we all bear the guilt when things go wrong? If WE won WWII, didn't WE also aid and abet the torturing of our enemies today? Of course we did but, like those who authorized it, we'll never see our own guilt because we're not....like them. But, we are.", 
        "reply": "", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:37:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "To Stillkit (without reposting his post)", 
        "intTime": 20090418, 
        "postID": 63, 
        "quote": "", 
        "reply": "To Stillkit (without reposting his post)", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:39:00", 
        "title": "Secret Presidential records released", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Oh our poor, poor enemies! I lose so much sleep worrying that they'll be branded and tortured for their roll in beheadings and terrorism. Oops! Terrorism? We don't say that anymore!", 
        "intTime": 20090418, 
        "postID": 64, 
        "quote": "", 
        "reply": "Oh our poor, poor enemies! I lose so much sleep worrying that they'll be branded and tortured for their roll in beheadings and terrorism. Oops! Terrorism? We don't say that anymore!", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 07:56:00", 
        "title": "Secret Presidential records released", 
        "userID": "_cash_"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... While we see it as being a gentler nation, that is not the way that the 'not quite so civilized\" world will see us. Weak is not a safe place. Being a bully is not being strong...it is being weak. Teddy Roosevelt said it best, \"Walk softly and carry a big stick.\" Our last president was a frat-boy bully and did it the other way around and now the world is not a safer place as a result.", 
        "intTime": 20090418, 
        "postID": 65, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... While we see it as being a gentler nation, that is not the way that the 'not quite so civilized\" world will see us. Weak is not a safe place.", 
        "reply": " Being a bully is not being strong...it is being weak. Teddy Roosevelt said it best, \"Walk softly and carry a big stick.\" Our last president was a frat-boy bully and did it the other way around and now the world is not a safer place as a result.", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 09:09:00", 
        "title": "Secret Presidential records released", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing... Obama should start being worried...", 
        "intTime": 20090418, 
        "postID": 66, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by skinman13: He and his henchmen are lucky that they are not being charged and tried as traitors. Let's just hope they get tried for something. Obviously Cheney is worried about being tried for torturing...", 
        "reply": " Obama should start being worried...", 
        "threadID": "409192893_6830050122001", 
        "time": "2009-04-18 09:09:00", 
        "title": "Secret Presidential records released", 
        "userID": "threerings"
    }
]