[
    {
        "content": "Coleen, I've sent you a couple of messages (here and tagged) Bryan quote: Originally posted by CalDreaming02: Note: Use spellchecker - tout not taut. When the check that's \"in the mail\" is in my bank account (as \"direct deposit\" promised but not delivered) and therefore able to be spent on something American - like housing or food or education - then I will be thankful for the something. Until then I will just be P.O.'d that the government said \"direct deposit\" but didn't mention the processing clause to paid preparers or e-file software accounts that were deducted from the initial refunds would make it NOT a direct deposit. So much for a stimulus package delivered \"early.\" This morning's disappointment is best compared to the seemingly great date on Saturday night that promised to call early in the week and then didn't. I never was one for sitting next to my phone just waiting ...", 
        "intTime": 20090511, 
        "postID": 9, 
        "quote": "Originally posted by CalDreaming02: Note: Use spellchecker - tout not taut. When the check that's \"in the mail\" is in my bank account (as \"direct deposit\" promised but not delivered) and therefore able to be spent on something American - like housing or food or education - then I will be thankful for the something. Until then I will just be P.O.'d that the government said \"direct deposit\" but didn't mention the processing clause to paid preparers or e-file software accounts that were deducted from the initial refunds would make it NOT a direct deposit. So much for a stimulus package delivered \"early.\" This morning's disappointment is best compared to the seemingly great date on Saturday night that promised to call early in the week and then didn't. I never was one for sitting next to my phone just waiting ...", 
        "reply": "Coleen, I've sent you a couple of messages (here and tagged) Bryan ", 
        "threadID": "409192893_9370055281001", 
        "time": "2009-05-11 12:45:00", 
        "title": "After tauting the bipartisan tax rebate economic stimulus package ...", 
        "userID": "USNGunner1"
    }
]