[
    {
        "content": "Obama has three choices with the budget before him: 1: Sign it, even though he admits it is full of waste, fraud, and abuse.. 2: Veto it, setting up a fight with his party and giving the GOP a rally point. 3: Recession (sp?) in which he can PROVE he is everything he claims, he CAN show that he IS hope and change, and a new way of doing business. If he goes this route he can act like he does have a line item veto, circle offensive spending, send the bill back to congress and say: Get rid of what I've circled and I'll sign this bill. In so doing he will usher in a new day! A new way of doing business in which He will put the people first, he will stand up against the abuses of the past. I'm so proud to have Obama as my Commander in Chief!", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "Obama has three choices with the budget before him: 1: Sign it, even though he admits it is full of waste, fraud, and abuse.. 2: Veto it, setting up a fight with his party and giving the GOP a rally point. 3: Recession (sp?) in which he can PROVE he is everything he claims, he CAN show that he IS hope and change, and a new way of doing business. If he goes this route he can act like he does have a line item veto, circle offensive spending, send the bill back to congress and say: Get rid of what I've circled and I'll sign this bill. In so doing he will usher in a new day! A new way of doing business in which He will put the people first, he will stand up against the abuses of the past. I'm so proud to have Obama as my Commander in Chief!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 12:56:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "And which choice do YOU want him to make?", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "And which choice do YOU want him to make?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:05:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "shuman14"
    }, 
    {
        "content": "Right, because you HOPE he's the man he said he was and we've seen a huge CHANGE in the way politics are in Washington... starting with his administration, right?", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "", 
        "reply": "Right, because you HOPE he's the man he said he was and we've seen a huge CHANGE in the way politics are in Washington... starting with his administration, right?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by shuman14: And which choice do YOU want him to make? Three! Let a day be born! Let every seantor with his or her hand out know, beyond a shadow of a doubt, that they shall not fleece us anymore!", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by shuman14: And which choice do YOU want him to make?", 
        "reply": " Three! Let a day be born! Let every seantor with his or her hand out know, beyond a shadow of a doubt, that they shall not fleece us anymore!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:13:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "", 
        "reply": "Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:15:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word.", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "reply": " Never, Obama is a man of his word.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:26:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right?", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word.", 
        "reply": " Your joking right?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:28:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right?", 
        "reply": " Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:39:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "reply": " Ooops, HE SIGNED IT. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:42:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "reply": " Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:42:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be.", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "reply": " HE SIGNED IT! NO, how can that be.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL I LOVE / HATE it when I'm right about him ...", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL", 
        "reply": " I LOVE / HATE it when I'm right about him ...", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "What does his title as CinC have to do with earmarks?", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "", 
        "reply": "What does his title as CinC have to do with earmarks?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Same as the title \"leader\" has to do with Obama.", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks?", 
        "reply": " Same as the title \"leader\" has to do with Obama.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:44:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be.", 
        "reply": " LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:45:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Yeah, but this guy's REALLLY pushing over the top....", 
        "intTime": 20090311, 
        "postID": 16, 
        "quote": "Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites.", 
        "reply": " Yeah, but this guy's REALLLY pushing over the top....", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:46:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC or Earmark..", 
        "intTime": 20090311, 
        "postID": 17, 
        "quote": "Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks?", 
        "reply": " Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC or Earmark..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:47:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "intTime": 20090311, 
        "postID": 18, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark..", 
        "reply": " Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:51:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks..", 
        "intTime": 20090311, 
        "postID": 19, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " LOL.. I needed that.. Thanks..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:53:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? A new age has dawned, An era of hope!", 
        "intTime": 20090311, 
        "postID": 20, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " A new age has dawned, An era of hope!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:54:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? I find it intersting that you're complaining about the TITLE of the thread and NOT addressing the substance of it. That being Obama has signed a SECOND pork ladened spending bill.", 
        "intTime": 20090311, 
        "postID": 21, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " I find it intersting that you're complaining about the TITLE of the thread and NOT addressing the substance of it. That being Obama has signed a SECOND pork ladened spending bill.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:00:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke?", 
        "intTime": 20090311, 
        "postID": 22, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks..", 
        "reply": " Well why don't you let me in on your little joke?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:01:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "intTime": 20090311, 
        "postID": 23, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke?", 
        "reply": " Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:05:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "intTime": 20090311, 
        "postID": 24, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "reply": " I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "intTime": 20090311, 
        "postID": 25, 
        "quote": "Originally posted by FrJohn1123: Well why don't you let me in on your little joke?", 
        "reply": " Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. It is apolitical. It describes a special relationship service members have with the POTUS.", 
        "intTime": 20090311, 
        "postID": 26, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "reply": " On this forum CinC is not an irrelevant title. It is apolitical. It describes a special relationship service members have with the POTUS.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:12:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me, AND I get the jist of this thread. I'd explain it to you, but it will probably just go over your head. Sorry.", 
        "intTime": 20090311, 
        "postID": 27, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "reply": " The sentence makes perfect sense to me, AND I get the jist of this thread. I'd explain it to you, but it will probably just go over your head. Sorry.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:14:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that..", 
        "intTime": 20090311, 
        "postID": 28, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title.", 
        "reply": " From this point forward your arguing with yourself.. Have fun with that..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:14:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that.. We never argued about anything. If you had a point, there may have been an argument. Anywho the question was directed to the author of the thread. He has yet to answer.", 
        "intTime": 20090311, 
        "postID": 29, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that..", 
        "reply": " We never argued about anything. If you had a point, there may have been an argument. Anywho the question was directed to the author of the thread. He has yet to answer.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:19:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me I am sure it does.", 
        "intTime": 20090311, 
        "postID": 30, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me", 
        "reply": " I am sure it does.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:20:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Obama has three choices with the budget before him: 1: Sign it, even though he admits it is full of waste, fraud, and abuse.. 2: Veto it, setting up a fight with his party and giving the GOP a rally point. 3: Recession (sp?) in which he can PROVE he is everything he claims, he CAN show that he IS hope and change, and a new way of doing business. If he goes this route he can act like he does have a line item veto, circle offensive spending, send the bill back to congress and say: Get rid of what I've circled and I'll sign this bill. In so doing he will usher in a new day! A new way of doing business in which He will put the people first, he will stand up against the abuses of the past. I'm so proud to have Obama as my Commander in Chief!", 
        "intTime": 20090311, 
        "postID": 31, 
        "quote": "", 
        "reply": "Obama has three choices with the budget before him: 1: Sign it, even though he admits it is full of waste, fraud, and abuse.. 2: Veto it, setting up a fight with his party and giving the GOP a rally point. 3: Recession (sp?) in which he can PROVE he is everything he claims, he CAN show that he IS hope and change, and a new way of doing business. If he goes this route he can act like he does have a line item veto, circle offensive spending, send the bill back to congress and say: Get rid of what I've circled and I'll sign this bill. In so doing he will usher in a new day! A new way of doing business in which He will put the people first, he will stand up against the abuses of the past. I'm so proud to have Obama as my Commander in Chief!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 12:56:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "And which choice do YOU want him to make?", 
        "intTime": 20090311, 
        "postID": 32, 
        "quote": "", 
        "reply": "And which choice do YOU want him to make?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:05:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "shuman14"
    }, 
    {
        "content": "Right, because you HOPE he's the man he said he was and we've seen a huge CHANGE in the way politics are in Washington... starting with his administration, right?", 
        "intTime": 20090311, 
        "postID": 33, 
        "quote": "", 
        "reply": "Right, because you HOPE he's the man he said he was and we've seen a huge CHANGE in the way politics are in Washington... starting with his administration, right?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by shuman14: And which choice do YOU want him to make? Three! Let a day be born! Let every seantor with his or her hand out know, beyond a shadow of a doubt, that they shall not fleece us anymore!", 
        "intTime": 20090311, 
        "postID": 34, 
        "quote": "Originally posted by shuman14: And which choice do YOU want him to make?", 
        "reply": " Three! Let a day be born! Let every seantor with his or her hand out know, beyond a shadow of a doubt, that they shall not fleece us anymore!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:13:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "intTime": 20090311, 
        "postID": 35, 
        "quote": "", 
        "reply": "Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:15:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word.", 
        "intTime": 20090311, 
        "postID": 36, 
        "quote": "Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "reply": " Never, Obama is a man of his word.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:26:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right?", 
        "intTime": 20090311, 
        "postID": 37, 
        "quote": "Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word.", 
        "reply": " Your joking right?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:28:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "intTime": 20090311, 
        "postID": 38, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right?", 
        "reply": " Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:39:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090311, 
        "postID": 39, 
        "quote": "Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "reply": " Ooops, HE SIGNED IT. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:42:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "intTime": 20090311, 
        "postID": 40, 
        "quote": "Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "reply": " Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:42:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be.", 
        "intTime": 20090311, 
        "postID": 41, 
        "quote": "Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "reply": " HE SIGNED IT! NO, how can that be.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL I LOVE / HATE it when I'm right about him ...", 
        "intTime": 20090311, 
        "postID": 42, 
        "quote": "Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL", 
        "reply": " I LOVE / HATE it when I'm right about him ...", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "What does his title as CinC have to do with earmarks?", 
        "intTime": 20090311, 
        "postID": 43, 
        "quote": "", 
        "reply": "What does his title as CinC have to do with earmarks?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Same as the title \"leader\" has to do with Obama.", 
        "intTime": 20090311, 
        "postID": 44, 
        "quote": "Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks?", 
        "reply": " Same as the title \"leader\" has to do with Obama.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:44:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090311, 
        "postID": 45, 
        "quote": "Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be.", 
        "reply": " LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:45:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Yeah, but this guy's REALLLY pushing over the top....", 
        "intTime": 20090311, 
        "postID": 46, 
        "quote": "Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites.", 
        "reply": " Yeah, but this guy's REALLLY pushing over the top....", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:46:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC or Earmark..", 
        "intTime": 20090311, 
        "postID": 47, 
        "quote": "Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks?", 
        "reply": " Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC or Earmark..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:47:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "intTime": 20090311, 
        "postID": 48, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark..", 
        "reply": " Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:51:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks..", 
        "intTime": 20090311, 
        "postID": 49, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " LOL.. I needed that.. Thanks..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:53:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? A new age has dawned, An era of hope!", 
        "intTime": 20090311, 
        "postID": 50, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " A new age has dawned, An era of hope!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:54:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? I find it intersting that you're complaining about the TITLE of the thread and NOT addressing the substance of it. That being Obama has signed a SECOND pork ladened spending bill.", 
        "intTime": 20090311, 
        "postID": 51, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " I find it intersting that you're complaining about the TITLE of the thread and NOT addressing the substance of it. That being Obama has signed a SECOND pork ladened spending bill.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:00:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke?", 
        "intTime": 20090311, 
        "postID": 52, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks..", 
        "reply": " Well why don't you let me in on your little joke?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:01:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "intTime": 20090311, 
        "postID": 53, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke?", 
        "reply": " Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:05:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "intTime": 20090311, 
        "postID": 54, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "reply": " I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "intTime": 20090311, 
        "postID": 55, 
        "quote": "Originally posted by FrJohn1123: Well why don't you let me in on your little joke?", 
        "reply": " Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. It is apolitical. It describes a special relationship service members have with the POTUS.", 
        "intTime": 20090311, 
        "postID": 56, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "reply": " On this forum CinC is not an irrelevant title. It is apolitical. It describes a special relationship service members have with the POTUS.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:12:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me, AND I get the jist of this thread. I'd explain it to you, but it will probably just go over your head. Sorry.", 
        "intTime": 20090311, 
        "postID": 57, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "reply": " The sentence makes perfect sense to me, AND I get the jist of this thread. I'd explain it to you, but it will probably just go over your head. Sorry.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:14:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that..", 
        "intTime": 20090311, 
        "postID": 58, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title.", 
        "reply": " From this point forward your arguing with yourself.. Have fun with that..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:14:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that.. We never argued about anything. If you had a point, there may have been an argument. Anywho the question was directed to the author of the thread. He has yet to answer.", 
        "intTime": 20090311, 
        "postID": 59, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that..", 
        "reply": " We never argued about anything. If you had a point, there may have been an argument. Anywho the question was directed to the author of the thread. He has yet to answer.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:19:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me I am sure it does.", 
        "intTime": 20090311, 
        "postID": 60, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me", 
        "reply": " I am sure it does.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:20:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Obama has three choices with the budget before him: 1: Sign it, even though he admits it is full of waste, fraud, and abuse.. 2: Veto it, setting up a fight with his party and giving the GOP a rally point. 3: Recession (sp?) in which he can PROVE he is everything he claims, he CAN show that he IS hope and change, and a new way of doing business. If he goes this route he can act like he does have a line item veto, circle offensive spending, send the bill back to congress and say: Get rid of what I've circled and I'll sign this bill. In so doing he will usher in a new day! A new way of doing business in which He will put the people first, he will stand up against the abuses of the past. I'm so proud to have Obama as my Commander in Chief!", 
        "intTime": 20090311, 
        "postID": 61, 
        "quote": "", 
        "reply": "Obama has three choices with the budget before him: 1: Sign it, even though he admits it is full of waste, fraud, and abuse.. 2: Veto it, setting up a fight with his party and giving the GOP a rally point. 3: Recession (sp?) in which he can PROVE he is everything he claims, he CAN show that he IS hope and change, and a new way of doing business. If he goes this route he can act like he does have a line item veto, circle offensive spending, send the bill back to congress and say: Get rid of what I've circled and I'll sign this bill. In so doing he will usher in a new day! A new way of doing business in which He will put the people first, he will stand up against the abuses of the past. I'm so proud to have Obama as my Commander in Chief!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 12:56:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "And which choice do YOU want him to make?", 
        "intTime": 20090311, 
        "postID": 62, 
        "quote": "", 
        "reply": "And which choice do YOU want him to make?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:05:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "shuman14"
    }, 
    {
        "content": "Right, because you HOPE he's the man he said he was and we've seen a huge CHANGE in the way politics are in Washington... starting with his administration, right?", 
        "intTime": 20090311, 
        "postID": 63, 
        "quote": "", 
        "reply": "Right, because you HOPE he's the man he said he was and we've seen a huge CHANGE in the way politics are in Washington... starting with his administration, right?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by shuman14: And which choice do YOU want him to make? Three! Let a day be born! Let every seantor with his or her hand out know, beyond a shadow of a doubt, that they shall not fleece us anymore!", 
        "intTime": 20090311, 
        "postID": 64, 
        "quote": "Originally posted by shuman14: And which choice do YOU want him to make?", 
        "reply": " Three! Let a day be born! Let every seantor with his or her hand out know, beyond a shadow of a doubt, that they shall not fleece us anymore!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:13:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "intTime": 20090311, 
        "postID": 65, 
        "quote": "", 
        "reply": "Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:15:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word.", 
        "intTime": 20090311, 
        "postID": 66, 
        "quote": "Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "reply": " Never, Obama is a man of his word.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:26:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right?", 
        "intTime": 20090311, 
        "postID": 67, 
        "quote": "Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word.", 
        "reply": " Your joking right?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:28:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "intTime": 20090311, 
        "postID": 68, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right?", 
        "reply": " Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:39:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090311, 
        "postID": 69, 
        "quote": "Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "reply": " Ooops, HE SIGNED IT. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:42:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "intTime": 20090311, 
        "postID": 70, 
        "quote": "Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "reply": " Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:42:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be.", 
        "intTime": 20090311, 
        "postID": 71, 
        "quote": "Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "reply": " HE SIGNED IT! NO, how can that be.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL I LOVE / HATE it when I'm right about him ...", 
        "intTime": 20090311, 
        "postID": 72, 
        "quote": "Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL", 
        "reply": " I LOVE / HATE it when I'm right about him ...", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "What does his title as CinC have to do with earmarks?", 
        "intTime": 20090311, 
        "postID": 73, 
        "quote": "", 
        "reply": "What does his title as CinC have to do with earmarks?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Same as the title \"leader\" has to do with Obama.", 
        "intTime": 20090311, 
        "postID": 74, 
        "quote": "Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks?", 
        "reply": " Same as the title \"leader\" has to do with Obama.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:44:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090311, 
        "postID": 75, 
        "quote": "Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be.", 
        "reply": " LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:45:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Yeah, but this guy's REALLLY pushing over the top....", 
        "intTime": 20090311, 
        "postID": 76, 
        "quote": "Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites.", 
        "reply": " Yeah, but this guy's REALLLY pushing over the top....", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:46:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC or Earmark..", 
        "intTime": 20090311, 
        "postID": 77, 
        "quote": "Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks?", 
        "reply": " Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC or Earmark..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:47:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "intTime": 20090311, 
        "postID": 78, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark..", 
        "reply": " Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:51:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks..", 
        "intTime": 20090311, 
        "postID": 79, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " LOL.. I needed that.. Thanks..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:53:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? A new age has dawned, An era of hope!", 
        "intTime": 20090311, 
        "postID": 80, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " A new age has dawned, An era of hope!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:54:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? I find it intersting that you're complaining about the TITLE of the thread and NOT addressing the substance of it. That being Obama has signed a SECOND pork ladened spending bill.", 
        "intTime": 20090311, 
        "postID": 81, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " I find it intersting that you're complaining about the TITLE of the thread and NOT addressing the substance of it. That being Obama has signed a SECOND pork ladened spending bill.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:00:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke?", 
        "intTime": 20090311, 
        "postID": 82, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks..", 
        "reply": " Well why don't you let me in on your little joke?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:01:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "intTime": 20090311, 
        "postID": 83, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke?", 
        "reply": " Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:05:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "intTime": 20090311, 
        "postID": 84, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "reply": " I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "intTime": 20090311, 
        "postID": 85, 
        "quote": "Originally posted by FrJohn1123: Well why don't you let me in on your little joke?", 
        "reply": " Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. It is apolitical. It describes a special relationship service members have with the POTUS.", 
        "intTime": 20090311, 
        "postID": 86, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "reply": " On this forum CinC is not an irrelevant title. It is apolitical. It describes a special relationship service members have with the POTUS.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:12:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me, AND I get the jist of this thread. I'd explain it to you, but it will probably just go over your head. Sorry.", 
        "intTime": 20090311, 
        "postID": 87, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "reply": " The sentence makes perfect sense to me, AND I get the jist of this thread. I'd explain it to you, but it will probably just go over your head. Sorry.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:14:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that..", 
        "intTime": 20090311, 
        "postID": 88, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title.", 
        "reply": " From this point forward your arguing with yourself.. Have fun with that..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:14:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that.. We never argued about anything. If you had a point, there may have been an argument. Anywho the question was directed to the author of the thread. He has yet to answer.", 
        "intTime": 20090311, 
        "postID": 89, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that..", 
        "reply": " We never argued about anything. If you had a point, there may have been an argument. Anywho the question was directed to the author of the thread. He has yet to answer.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:19:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me I am sure it does.", 
        "intTime": 20090311, 
        "postID": 90, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me", 
        "reply": " I am sure it does.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:20:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Obama has three choices with the budget before him: 1: Sign it, even though he admits it is full of waste, fraud, and abuse.. 2: Veto it, setting up a fight with his party and giving the GOP a rally point. 3: Recession (sp?) in which he can PROVE he is everything he claims, he CAN show that he IS hope and change, and a new way of doing business. If he goes this route he can act like he does have a line item veto, circle offensive spending, send the bill back to congress and say: Get rid of what I've circled and I'll sign this bill. In so doing he will usher in a new day! A new way of doing business in which He will put the people first, he will stand up against the abuses of the past. I'm so proud to have Obama as my Commander in Chief!", 
        "intTime": 20090311, 
        "postID": 91, 
        "quote": "", 
        "reply": "Obama has three choices with the budget before him: 1: Sign it, even though he admits it is full of waste, fraud, and abuse.. 2: Veto it, setting up a fight with his party and giving the GOP a rally point. 3: Recession (sp?) in which he can PROVE he is everything he claims, he CAN show that he IS hope and change, and a new way of doing business. If he goes this route he can act like he does have a line item veto, circle offensive spending, send the bill back to congress and say: Get rid of what I've circled and I'll sign this bill. In so doing he will usher in a new day! A new way of doing business in which He will put the people first, he will stand up against the abuses of the past. I'm so proud to have Obama as my Commander in Chief!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 12:56:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "And which choice do YOU want him to make?", 
        "intTime": 20090311, 
        "postID": 92, 
        "quote": "", 
        "reply": "And which choice do YOU want him to make?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:05:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "shuman14"
    }, 
    {
        "content": "Right, because you HOPE he's the man he said he was and we've seen a huge CHANGE in the way politics are in Washington... starting with his administration, right?", 
        "intTime": 20090311, 
        "postID": 93, 
        "quote": "", 
        "reply": "Right, because you HOPE he's the man he said he was and we've seen a huge CHANGE in the way politics are in Washington... starting with his administration, right?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by shuman14: And which choice do YOU want him to make? Three! Let a day be born! Let every seantor with his or her hand out know, beyond a shadow of a doubt, that they shall not fleece us anymore!", 
        "intTime": 20090311, 
        "postID": 94, 
        "quote": "Originally posted by shuman14: And which choice do YOU want him to make?", 
        "reply": " Three! Let a day be born! Let every seantor with his or her hand out know, beyond a shadow of a doubt, that they shall not fleece us anymore!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:13:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "intTime": 20090311, 
        "postID": 95, 
        "quote": "", 
        "reply": "Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:15:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word.", 
        "intTime": 20090311, 
        "postID": 96, 
        "quote": "Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different.", 
        "reply": " Never, Obama is a man of his word.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:26:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right?", 
        "intTime": 20090311, 
        "postID": 97, 
        "quote": "Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word.", 
        "reply": " Your joking right?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:28:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "intTime": 20090311, 
        "postID": 98, 
        "quote": "Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right?", 
        "reply": " Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:39:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090311, 
        "postID": 99, 
        "quote": "Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "reply": " Ooops, HE SIGNED IT. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:42:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "intTime": 20090311, 
        "postID": 100, 
        "quote": "Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's!", 
        "reply": " Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:42:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be.", 
        "intTime": 20090311, 
        "postID": 101, 
        "quote": "Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE!", 
        "reply": " HE SIGNED IT! NO, how can that be.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL I LOVE / HATE it when I'm right about him ...", 
        "intTime": 20090311, 
        "postID": 102, 
        "quote": "Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Ooops, HE SIGNED IT. LOL", 
        "reply": " I LOVE / HATE it when I'm right about him ...", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "What does his title as CinC have to do with earmarks?", 
        "intTime": 20090311, 
        "postID": 103, 
        "quote": "", 
        "reply": "What does his title as CinC have to do with earmarks?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Same as the title \"leader\" has to do with Obama.", 
        "intTime": 20090311, 
        "postID": 104, 
        "quote": "Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks?", 
        "reply": " Same as the title \"leader\" has to do with Obama.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:44:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090311, 
        "postID": 105, 
        "quote": "Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be.", 
        "reply": " LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:45:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites. Yeah, but this guy's REALLLY pushing over the top....", 
        "intTime": 20090311, 
        "postID": 106, 
        "quote": "Originally posted by L0A1: quote: Originally posted by threerings: quote: Originally posted by navy8086: quote: Originally posted by threerings: quote: Originally posted by GRAYMAN: quote: Originally posted by threerings: quote: Originally posted by navy8086: Unfortunately, my money is that he'll opt for #1, becuase he hasn't shown us anything different. Never, Obama is a man of his word. Your joking right? Juest WATCH! This is going to be a brilliant move! He'll define himself as the anwser to the problem of greedy, arrogrant politcal hacks! He'll make the GOP look like the party of big spenders! He'll lend creditability to his admin, his office, and the dem's! Rings, Dude, put DOWN the purple haze already! That stuff has already given you BRAIN DAMAGE! HE SIGNED IT! NO, how can that be. LOL, is this anything like Bush 1's goof on \"No New Taxes.\" Again our Politicians prove to be liars and hypocrites.", 
        "reply": " Yeah, but this guy's REALLLY pushing over the top....", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:46:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC or Earmark..", 
        "intTime": 20090311, 
        "postID": 107, 
        "quote": "Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks?", 
        "reply": " Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC or Earmark..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:47:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "intTime": 20090311, 
        "postID": 108, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark..", 
        "reply": " Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:51:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks..", 
        "intTime": 20090311, 
        "postID": 109, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " LOL.. I needed that.. Thanks..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:53:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? A new age has dawned, An era of hope!", 
        "intTime": 20090311, 
        "postID": 110, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " A new age has dawned, An era of hope!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 13:54:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? I find it intersting that you're complaining about the TITLE of the thread and NOT addressing the substance of it. That being Obama has signed a SECOND pork ladened spending bill.", 
        "intTime": 20090311, 
        "postID": 111, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill?", 
        "reply": " I find it intersting that you're complaining about the TITLE of the thread and NOT addressing the substance of it. That being Obama has signed a SECOND pork ladened spending bill.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:00:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke?", 
        "intTime": 20090311, 
        "postID": 112, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks..", 
        "reply": " Well why don't you let me in on your little joke?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:01:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "intTime": 20090311, 
        "postID": 113, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke?", 
        "reply": " Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:05:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "intTime": 20090311, 
        "postID": 114, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS.", 
        "reply": " I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "intTime": 20090311, 
        "postID": 115, 
        "quote": "Originally posted by FrJohn1123: Well why don't you let me in on your little joke?", 
        "reply": " Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:10:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. It is apolitical. It describes a special relationship service members have with the POTUS.", 
        "intTime": 20090311, 
        "postID": 116, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny!", 
        "reply": " On this forum CinC is not an irrelevant title. It is apolitical. It describes a special relationship service members have with the POTUS.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:12:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me, AND I get the jist of this thread. I'd explain it to you, but it will probably just go over your head. Sorry.", 
        "intTime": 20090311, 
        "postID": 117, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill?", 
        "reply": " The sentence makes perfect sense to me, AND I get the jist of this thread. I'd explain it to you, but it will probably just go over your head. Sorry.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:14:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that..", 
        "intTime": 20090311, 
        "postID": 118, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title.", 
        "reply": " From this point forward your arguing with yourself.. Have fun with that..", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:14:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that.. We never argued about anything. If you had a point, there may have been an argument. Anywho the question was directed to the author of the thread. He has yet to answer.", 
        "intTime": 20090311, 
        "postID": 119, 
        "quote": "Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: Well why don't you let me in on your little joke? Is the word President a title? What does it have to do with wasteful spending? NOTHING! Because this thread is describing the actions of a person and the TITLE is irrelevant! But if you want to argue with yourself over NOTHING.. Well thats funny! On this forum CinC is not an irrelevant title. From this point forward your arguing with yourself.. Have fun with that..", 
        "reply": " We never argued about anything. If you had a point, there may have been an argument. Anywho the question was directed to the author of the thread. He has yet to answer.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:19:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me I am sure it does.", 
        "intTime": 20090311, 
        "postID": 120, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: quote: Originally posted by floersh: quote: Originally posted by FrJohn1123: What does his title as CinC have to do with earmarks? Now that takes the cake as the worst bait and switch of all time. Are you even posting this in the right thread? Your post was the first in the thread to make use of the words CinC & Earmark.. Yes it is in the title of the thread and my questions is pretty clear. What does his title as CinC have to do with him signing a omnibus bill? LOL.. I needed that.. Thanks.. Well why don't you let me in on your little joke? Too bad the Democrats let us ALL in the joke that is our current POTUS. I suppose that sentence makes sense to you? I am sure if you read it out loud a few times it will make less sense. Still I asked a simple statement: What does the presidents title of CinC have to do with him signing a omnibus spending bill? The sentence makes perfect sense to me", 
        "reply": " I am sure it does.", 
        "threadID": "409192893_1050065712001", 
        "time": "2009-03-11 14:20:00", 
        "title": "My Commander in Chief is about to be a hero!", 
        "userID": "FrJohn1123"
    }
]