[
    {
        "content": "This guy looks Psychotic!! United States Attorney George E.B. Holding announced that on February 25, 2009, a Federal Grand Jury returned a single count indictment charging Kody Ray Brittingham, 20, of Camp Lejeune, North Carolina, with threatening the President-Elect of the United States, in violation of Title 18, United States Code, Section 871, which has a maximum penalty of 5 years imprisonment followed by up to three years of supervised release and a fine of up to $250,000.", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "This guy looks Psychotic!! United States Attorney George E.B. Holding announced that on February 25, 2009, a Federal Grand Jury returned a single count indictment charging Kody Ray Brittingham, 20, of Camp Lejeune, North Carolina, with threatening the President-Elect of the United States, in violation of Title 18, United States Code, Section 871, which has a maximum penalty of 5 years imprisonment followed by up to three years of supervised release and a fine of up to $250,000.", 
        "threadID": "409192893_3960015712001", 
        "time": "2009-03-11 06:15:00", 
        "title": "Camp LeJeune Marine Indicted For Threatening President Obama", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: This guy looks Psychotic!! Yeh, ok you can tell that from a pic. Tell us what makes him look that way will you. Anyway enjoy your 5 yrs numbnutts. And he is an Ex-Marine.", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "This guy looks Psychotic!!", 
        "reply": " Yeh, ok you can tell that from a pic. Tell us what makes him look that way will you. Anyway enjoy your 5 yrs numbnutts. And he is an Ex-Marine.", 
        "threadID": "409192893_3960015712001", 
        "time": "2009-03-11 06:18:00", 
        "title": "Camp LeJeune Marine Indicted For Threatening President Obama", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Scary...", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "", 
        "reply": "Scary...", 
        "threadID": "409192893_3960015712001", 
        "time": "2009-03-11 07:22:00", 
        "title": "Camp LeJeune Marine Indicted For Threatening President Obama", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: This guy looks Psychotic!! Yeh, ok you can tell that from a pic. Tell us what makes him look that way will you. Anyway enjoy your 5 yrs numbnutts. And he is an Ex-Marine. He's got a flat, dead look in his eyes but that may be because he's wearing that snazzy orange jumpsuit.", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by GunnyRet03: quote: This guy looks Psychotic!! Yeh, ok you can tell that from a pic. Tell us what makes him look that way will you. Anyway enjoy your 5 yrs numbnutts. And he is an Ex-Marine.", 
        "reply": " He's got a flat, dead look in his eyes but that may be because he's wearing that snazzy orange jumpsuit.", 
        "threadID": "409192893_3960015712001", 
        "time": "2009-03-11 11:01:00", 
        "title": "Camp LeJeune Marine Indicted For Threatening President Obama", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by GunnyRet03: quote: This guy looks Psychotic!! Yeh, ok you can tell that from a pic. Tell us what makes him look that way will you. Anyway enjoy your 5 yrs numbnutts. And he is an Ex-Marine. He's got a flat, dead look in his eyes but that may be because he's wearing that snazzy orange jumpsuit. ...or he just found out the value of his spincter is one pack of Newports. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by GunnyRet03: quote: This guy looks Psychotic!! Yeh, ok you can tell that from a pic. Tell us what makes him look that way will you. Anyway enjoy your 5 yrs numbnutts. And he is an Ex-Marine. He's got a flat, dead look in his eyes but that may be because he's wearing that snazzy orange jumpsuit.", 
        "reply": " ...or he just found out the value of his spincter is one pack of Newports. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_3960015712001", 
        "time": "2009-03-11 13:19:00", 
        "title": "Camp LeJeune Marine Indicted For Threatening President Obama", 
        "userID": "EngrOpsNCO"
    }
]