[
    {
        "content": "Meanwhile Dems end school vouchers in DC. quote: 'http://chronicle.com/news/article/6092/clinton-announces-million-dollar-scholarship-program-for-palestinian-students' Clinton Announces Million-Dollar Scholarship Program for Palestinian Students Ramallah, West Bank — Secretary of State Hillary Rodham Clinton has announced a new million-dollar scholarship program to help Palestinian students enroll at Palestinian and American universities. Mrs. Clinton announced the Middle East Partnership Initiative during a visit to this Palestinian town last week. The four-year program will support about 10 scholarships each year for disadvantaged students to attend four-year courses at Palestinian universities. The program will also offer 25 “opportunity grants” to enable promising but disadvantaged young Palestinians to apply to American-accredited institutions in the United States or the Middle East, a State Department official told The Chronicle. Once funds are approved by Congress, Mrs. Clinton hopes to begin the program in the 2010-11 academic year. The money is in addition to $900-million in aid to the Palestinian Authority announced by the secretary last week at the donors’ conference, in Sharm el Sheikh, Egypt.", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "'http://chronicle.com/news/article/6092/clinton-announces-million-dollar-scholarship-program-for-palestinian-students' Clinton Announces Million-Dollar Scholarship Program for Palestinian Students Ramallah, West Bank — Secretary of State Hillary Rodham Clinton has announced a new million-dollar scholarship program to help Palestinian students enroll at Palestinian and American universities. Mrs. Clinton announced the Middle East Partnership Initiative during a visit to this Palestinian town last week. The four-year program will support about 10 scholarships each year for disadvantaged students to attend four-year courses at Palestinian universities. The program will also offer 25 “opportunity grants” to enable promising but disadvantaged young Palestinians to apply to American-accredited institutions in the United States or the Middle East, a State Department official told The Chronicle. Once funds are approved by Congress, Mrs. Clinton hopes to begin the program in the 2010-11 academic year. The money is in addition to $900-million in aid to the Palestinian Authority announced by the secretary last week at the donors’ conference, in Sharm el Sheikh, Egypt.", 
        "reply": "Meanwhile Dems end school vouchers in DC. ", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 05:30:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "A mind is a terrible thing to waste!", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "A mind is a terrible thing to waste!", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 05:40:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC.", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "Originally posted by samh32: A mind is a terrible thing to waste!", 
        "reply": " And they will be wasting away in DC.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 05:47:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC. So the one million dollar scholarship will have a major impact on schools in Washington D.C. I thought the right always complained about pouring money into failing schools was a waste anyway!", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC.", 
        "reply": " So the one million dollar scholarship will have a major impact on schools in Washington D.C. I thought the right always complained about pouring money into failing schools was a waste anyway!", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 05:59:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by GunnyRet03: quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC. So the one million dollar scholarship will have a major impact on schools in Washington D.C. I thought the right always complained about pouring money into failing schools was a waste anyway! Priorities. And if you're going to dump money into the system at least give students and parents a choice of schools. I guess libs dont like choice when it comes to schools just abortions.", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "Originally posted by samh32: quote: Originally posted by GunnyRet03: quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC. So the one million dollar scholarship will have a major impact on schools in Washington D.C. I thought the right always complained about pouring money into failing schools was a waste anyway!", 
        "reply": " Priorities. And if you're going to dump money into the system at least give students and parents a choice of schools. I guess libs dont like choice when it comes to schools just abortions.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 06:16:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": ".........educate them over here so they can kill us over there...... oops, should have said... educate them over here so they learn how to kill us over here. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "", 
        "reply": ".........educate them over here so they can kill us over there...... oops, should have said... educate them over here so they learn how to kill us over here. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 20:08:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Clinton is an embarrassment to this nation.", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "", 
        "reply": "Clinton is an embarrassment to this nation.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 20:15:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "intTime": 20090312, 
        "postID": 8, 
        "quote": "", 
        "reply": "Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:08:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends. Bravo", 
        "intTime": 20090312, 
        "postID": 9, 
        "quote": "Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "reply": " Bravo", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:18:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study.", 
        "intTime": 20090312, 
        "postID": 10, 
        "quote": "Palestinians might seek a constructive future, were their young people offered a chance at one.", 
        "reply": " Then they should consider Christianity as it would be more useful for them to study.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:31:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs!", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study.", 
        "reply": " So let me get this straight...Change their religion, to what satisfy your beliefs!", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:35:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace...", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs!", 
        "reply": " Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace...", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:50:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!!", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace...", 
        "reply": " Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!!", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:57:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation. She is just obeying Obama's orders. A day with out Obama giving away millions is like a day with out sunshine. So far thats all he is good for.", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation.", 
        "reply": " She is just obeying Obama's orders. A day with out Obama giving away millions is like a day with out sunshine. So far thats all he is good for.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:02:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. There are a lot more bad guys than just Hamas in Palestine. Any dime going into Palestine is suspect in how it is used. FYI, There are Palestinians already in school here in the states. On the OSU campus in Ohio they were constantly chalking bad things about this country, the Jews, on and on. The campus did nothing to curb but constantly threatened to pull the rights of the ROTC program.", 
        "intTime": 20090312, 
        "postID": 15, 
        "quote": "Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers.", 
        "reply": " There are a lot more bad guys than just Hamas in Palestine. Any dime going into Palestine is suspect in how it is used. FYI, There are Palestinians already in school here in the states. On the OSU campus in Ohio they were constantly chalking bad things about this country, the Jews, on and on. The campus did nothing to curb but constantly threatened to pull the rights of the ROTC program.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:10:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "ACR26"
    }, 
    {
        "content": "thats dumb ... hey lets pay for terrorist to come here and infest our school system... but hey at lease it will open the door so they can attacks us and use gov grants to open up business so they can fund their jihad against us like the clintons did in the 90s ....", 
        "intTime": 20090312, 
        "postID": 16, 
        "quote": "", 
        "reply": "thats dumb ... hey lets pay for terrorist to come here and infest our school system... but hey at lease it will open the door so they can attacks us and use gov grants to open up business so they can fund their jihad against us like the clintons did in the 90s ....", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:37:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. There are a lot more bad guys than just Hamas in Palestine. Any dime going into Palestine is suspect in how it is used. FYI, There are Palestinians already in school here in the states. On the OSU campus in Ohio they were constantly chalking bad things about this country, the Jews, on and on. The campus did nothing to curb but constantly threatened to pull the rights of the ROTC program. yea i remember them in the 90s... they were working here and sending money back home to fund terrorism....", 
        "intTime": 20090312, 
        "postID": 17, 
        "quote": "Originally posted by ACR26: quote: Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. There are a lot more bad guys than just Hamas in Palestine. Any dime going into Palestine is suspect in how it is used. FYI, There are Palestinians already in school here in the states. On the OSU campus in Ohio they were constantly chalking bad things about this country, the Jews, on and on. The campus did nothing to curb but constantly threatened to pull the rights of the ROTC program.", 
        "reply": " yea i remember them in the 90s... they were working here and sending money back home to fund terrorism....", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:39:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!! yea i guess you felt in the 1st crusade they should of just let the Christians who were going to the holyland to worship to get slaughter by the masses... you tend to forget about the muslim in that... yea i guess the christains dont have a right to worship in their holyland?? naw they are the bad guys always... huh ..", 
        "intTime": 20090312, 
        "postID": 18, 
        "quote": "Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!!", 
        "reply": " yea i guess you felt in the 1st crusade they should of just let the Christians who were going to the holyland to worship to get slaughter by the masses... you tend to forget about the muslim in that... yea i guess the christains dont have a right to worship in their holyland?? naw they are the bad guys always... huh ..", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:43:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends. yea too bad thats not what they want... go and spend a few years chatting with a few ... they want to cut out your heart and cut off your mind....thats heart and minds with the pals...", 
        "intTime": 20090312, 
        "postID": 19, 
        "quote": "Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "reply": " yea too bad thats not what they want... go and spend a few years chatting with a few ... they want to cut out your heart and cut off your mind....thats heart and minds with the pals...", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:45:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation. yes she is... a disgrace also... oh well the holyland loved her and slick willy... the ones i knew in the 90s praised them... hell it was federal grants created by the clintons that made it possible for them to fund their jihad....", 
        "intTime": 20090312, 
        "postID": 20, 
        "quote": "Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation.", 
        "reply": " yes she is... a disgrace also... oh well the holyland loved her and slick willy... the ones i knew in the 90s praised them... hell it was federal grants created by the clintons that made it possible for them to fund their jihad....", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:47:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation. yes she is... a disgrace also... oh well the holyland loved her and slick willy... the ones i knew in the 90s praised them... hell it was federal grants created by the clintons that made it possible for them to fund their jihad.... Interesting point....butttttttttttttttt Where are all the republicans that beat up on the Clintons while he was president? In the dust bin of history...WAIT!!!! Newt is still trying to crawl out... Bill and Hillary still rule the school", 
        "intTime": 20090312, 
        "postID": 21, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation. yes she is... a disgrace also... oh well the holyland loved her and slick willy... the ones i knew in the 90s praised them... hell it was federal grants created by the clintons that made it possible for them to fund their jihad....", 
        "reply": " Interesting point....butttttttttttttttt Where are all the republicans that beat up on the Clintons while he was president? In the dust bin of history...WAIT!!!! Newt is still trying to crawl out... Bill and Hillary still rule the school", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 21:34:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right??", 
        "intTime": 20090312, 
        "postID": 22, 
        "quote": "Bill and Hillary still rule the school", 
        "reply": " yup a school that gave terrorist a means to fund terrorism... but hey who cares right??", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 21:37:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right?? ok ok ok...Were the Jews who took on the British in Palestine heroes or terrorists?...Depends who you ask? I'll ask a Jew....you ask a Brit", 
        "intTime": 20090312, 
        "postID": 23, 
        "quote": "Originally posted by outlaws93: quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right??", 
        "reply": " ok ok ok...Were the Jews who took on the British in Palestine heroes or terrorists?...Depends who you ask? I'll ask a Jew....you ask a Brit", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 22:14:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by outlaws93: quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right?? ok ok ok...Were the Jews who took on the British in Palestine heroes or terrorists?...Depends who you ask? I'll ask a Jew....you ask a Brit How about the ones that are killing AMERICANS now ???? Or are they just poor, misunderstood, beheading, terroists?", 
        "intTime": 20090313, 
        "postID": 24, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by outlaws93: quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right?? ok ok ok...Were the Jews who took on the British in Palestine heroes or terrorists?...Depends who you ask? I'll ask a Jew....you ask a Brit", 
        "reply": " How about the ones that are killing AMERICANS now ???? Or are they just poor, misunderstood, beheading, terroists?", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 07:02:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!! Please, tell us all about the Crusades...", 
        "intTime": 20090313, 
        "postID": 25, 
        "quote": "Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!!", 
        "reply": " Please, tell us all about the Crusades...", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 07:25:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "Philhelm"
    }, 
    {
        "content": "here is something intersting... more hate from the religion of peace.. ===http://www.israelnationalnews.com/News/News.aspx/130414 PA TV Celebrates Most Murderous Terror Attack in Israeli History Adar 17, 5769, 13 March 09 10:11by Gil Ronen(IsraelNN.com) The Palestinian Authority (PA) celebrated the single most murderous attack against Israeli civilians by broadcasting an hour-long special Wednesday on its official television station. Arabs who penetrated into Israel by rubber dinghies from Lebanon carried out the attack, known in Israel as the Coastal Road Terror Attack, on March 11, 1978. They hijacked a tourist bus and killed 38 civilians, 13 of them children. PA TV celebrated the attack on the anniversary of the hijacking with an hour-long special. The program included interviews with terrorists who described the planning and implementation of the murder spree. Palestinian Media Watch reported that the program opened with the narrator glorifying the attack as: “…one of the most important and most prominent special actions, executed by the Palestinian revolution by sea, on the coast between Haifa and Tel Aviv. This action, which was carried out by a group of heroes and led by the heroic fighter Dalal Mughrabi, had a great impact on continuing events of the Arab-Israeli conflict.\" Mughrabi and 11 other terrorists landed by Zodiac boats on a beach near Ma'agan Michael, north of Tel Aviv. They fatally shot American photographer Gail Rubin who was taking nature photographs nearby, reached the Coastal Highway and commandeered a bus that was carrying Egged bus drivers and their families on a day outing. Passengers burned alive The bus continued driving south on the Coastal Road (Highway 2) while the terrorists fired and threw grenades at passing cars, shot passengers and dumped at least one body out of the bus. At one point, they hijacked another bus and forced the passengers from the first bus to board it. An explosion caused either by an exploding fuel tank or a grenade set the bus on fire, killing 38 civilians, 13 of them children. 71 Israelis were wounded.", 
        "intTime": 20090313, 
        "postID": 26, 
        "quote": "", 
        "reply": "here is something intersting... more hate from the religion of peace.. ===http://www.israelnationalnews.com/News/News.aspx/130414 PA TV Celebrates Most Murderous Terror Attack in Israeli History Adar 17, 5769, 13 March 09 10:11by Gil Ronen(IsraelNN.com) The Palestinian Authority (PA) celebrated the single most murderous attack against Israeli civilians by broadcasting an hour-long special Wednesday on its official television station. Arabs who penetrated into Israel by rubber dinghies from Lebanon carried out the attack, known in Israel as the Coastal Road Terror Attack, on March 11, 1978. They hijacked a tourist bus and killed 38 civilians, 13 of them children. PA TV celebrated the attack on the anniversary of the hijacking with an hour-long special. The program included interviews with terrorists who described the planning and implementation of the murder spree. Palestinian Media Watch reported that the program opened with the narrator glorifying the attack as: “…one of the most important and most prominent special actions, executed by the Palestinian revolution by sea, on the coast between Haifa and Tel Aviv. This action, which was carried out by a group of heroes and led by the heroic fighter Dalal Mughrabi, had a great impact on continuing events of the Arab-Israeli conflict.\" Mughrabi and 11 other terrorists landed by Zodiac boats on a beach near Ma'agan Michael, north of Tel Aviv. They fatally shot American photographer Gail Rubin who was taking nature photographs nearby, reached the Coastal Highway and commandeered a bus that was carrying Egged bus drivers and their families on a day outing. Passengers burned alive The bus continued driving south on the Coastal Road (Highway 2) while the terrorists fired and threw grenades at passing cars, shot passengers and dumped at least one body out of the bus. At one point, they hijacked another bus and forced the passengers from the first bus to board it. An explosion caused either by an exploding fuel tank or a grenade set the bus on fire, killing 38 civilians, 13 of them children. 71 Israelis were wounded.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 09:16:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: quote: Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!! Please, tell us all about the Crusades... well he cant because he hasnt got a clue about them himself...", 
        "intTime": 20090313, 
        "postID": 27, 
        "quote": "Originally posted by Philhelm: quote: Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!! Please, tell us all about the Crusades...", 
        "reply": " well he cant because he hasnt got a clue about them himself...", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 09:17:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Once again, Arafat died with a personal fortune of between $900,000,000 and $1 billion. From ALL sources, the \"Palestinians\" recieve about $23,000 per capata in foreign aid PER YEAR, while the AVERAGE \"palestinian\" earns less that $2,000 PER YEAR. So we need to send them still more money? Seems to me they already recieve more than enough, if the $ is used as intended, to have a pretty nice little mini-State going on, no poverty, nice hotels on the Med. Sea, good schools, yes, if they were not dedicated to MURDERING their NEIGHBORS becaus they are Jews and Christians and apostates, they'd hav e a pretty nice life. It is 60 years past time we stopped making excuses for them, don't you think, and fixed the problem?", 
        "intTime": 20090313, 
        "postID": 28, 
        "quote": "", 
        "reply": "Once again, Arafat died with a personal fortune of between $900,000,000 and $1 billion. From ALL sources, the \"Palestinians\" recieve about $23,000 per capata in foreign aid PER YEAR, while the AVERAGE \"palestinian\" earns less that $2,000 PER YEAR. So we need to send them still more money? Seems to me they already recieve more than enough, if the $ is used as intended, to have a pretty nice little mini-State going on, no poverty, nice hotels on the Med. Sea, good schools, yes, if they were not dedicated to MURDERING their NEIGHBORS becaus they are Jews and Christians and apostates, they'd hav e a pretty nice life. It is 60 years past time we stopped making excuses for them, don't you think, and fixed the problem?", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 10:06:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "intTime": 20090313, 
        "postID": 29, 
        "quote": "Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "reply": "", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 10:06:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "Knele"
    }, 
    {
        "content": "So, Ru..., what exactly would you do to get the hearts and minds of people who hav e been dressed up as future suicide bombers and glorified as much since they were 18 months of life.", 
        "intTime": 20090313, 
        "postID": 30, 
        "quote": "", 
        "reply": "So, Ru..., what exactly would you do to get the hearts and minds of people who hav e been dressed up as future suicide bombers and glorified as much since they were 18 months of life.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 10:11:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Meanwhile Dems end school vouchers in DC. quote: 'http://chronicle.com/news/article/6092/clinton-announces-million-dollar-scholarship-program-for-palestinian-students' Clinton Announces Million-Dollar Scholarship Program for Palestinian Students Ramallah, West Bank — Secretary of State Hillary Rodham Clinton has announced a new million-dollar scholarship program to help Palestinian students enroll at Palestinian and American universities. Mrs. Clinton announced the Middle East Partnership Initiative during a visit to this Palestinian town last week. The four-year program will support about 10 scholarships each year for disadvantaged students to attend four-year courses at Palestinian universities. The program will also offer 25 “opportunity grants” to enable promising but disadvantaged young Palestinians to apply to American-accredited institutions in the United States or the Middle East, a State Department official told The Chronicle. Once funds are approved by Congress, Mrs. Clinton hopes to begin the program in the 2010-11 academic year. The money is in addition to $900-million in aid to the Palestinian Authority announced by the secretary last week at the donors’ conference, in Sharm el Sheikh, Egypt.", 
        "intTime": 20090311, 
        "postID": 31, 
        "quote": "'http://chronicle.com/news/article/6092/clinton-announces-million-dollar-scholarship-program-for-palestinian-students' Clinton Announces Million-Dollar Scholarship Program for Palestinian Students Ramallah, West Bank — Secretary of State Hillary Rodham Clinton has announced a new million-dollar scholarship program to help Palestinian students enroll at Palestinian and American universities. Mrs. Clinton announced the Middle East Partnership Initiative during a visit to this Palestinian town last week. The four-year program will support about 10 scholarships each year for disadvantaged students to attend four-year courses at Palestinian universities. The program will also offer 25 “opportunity grants” to enable promising but disadvantaged young Palestinians to apply to American-accredited institutions in the United States or the Middle East, a State Department official told The Chronicle. Once funds are approved by Congress, Mrs. Clinton hopes to begin the program in the 2010-11 academic year. The money is in addition to $900-million in aid to the Palestinian Authority announced by the secretary last week at the donors’ conference, in Sharm el Sheikh, Egypt.", 
        "reply": "Meanwhile Dems end school vouchers in DC. ", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 05:30:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "A mind is a terrible thing to waste!", 
        "intTime": 20090311, 
        "postID": 32, 
        "quote": "", 
        "reply": "A mind is a terrible thing to waste!", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 05:40:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC.", 
        "intTime": 20090311, 
        "postID": 33, 
        "quote": "Originally posted by samh32: A mind is a terrible thing to waste!", 
        "reply": " And they will be wasting away in DC.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 05:47:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC. So the one million dollar scholarship will have a major impact on schools in Washington D.C. I thought the right always complained about pouring money into failing schools was a waste anyway!", 
        "intTime": 20090311, 
        "postID": 34, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC.", 
        "reply": " So the one million dollar scholarship will have a major impact on schools in Washington D.C. I thought the right always complained about pouring money into failing schools was a waste anyway!", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 05:59:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by GunnyRet03: quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC. So the one million dollar scholarship will have a major impact on schools in Washington D.C. I thought the right always complained about pouring money into failing schools was a waste anyway! Priorities. And if you're going to dump money into the system at least give students and parents a choice of schools. I guess libs dont like choice when it comes to schools just abortions.", 
        "intTime": 20090311, 
        "postID": 35, 
        "quote": "Originally posted by samh32: quote: Originally posted by GunnyRet03: quote: Originally posted by samh32: A mind is a terrible thing to waste! And they will be wasting away in DC. So the one million dollar scholarship will have a major impact on schools in Washington D.C. I thought the right always complained about pouring money into failing schools was a waste anyway!", 
        "reply": " Priorities. And if you're going to dump money into the system at least give students and parents a choice of schools. I guess libs dont like choice when it comes to schools just abortions.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 06:16:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": ".........educate them over here so they can kill us over there...... oops, should have said... educate them over here so they learn how to kill us over here. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090311, 
        "postID": 36, 
        "quote": "", 
        "reply": ".........educate them over here so they can kill us over there...... oops, should have said... educate them over here so they learn how to kill us over here. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 20:08:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Clinton is an embarrassment to this nation.", 
        "intTime": 20090311, 
        "postID": 37, 
        "quote": "", 
        "reply": "Clinton is an embarrassment to this nation.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-11 20:15:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "intTime": 20090312, 
        "postID": 38, 
        "quote": "", 
        "reply": "Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:08:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends. Bravo", 
        "intTime": 20090312, 
        "postID": 39, 
        "quote": "Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "reply": " Bravo", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:18:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study.", 
        "intTime": 20090312, 
        "postID": 40, 
        "quote": "Palestinians might seek a constructive future, were their young people offered a chance at one.", 
        "reply": " Then they should consider Christianity as it would be more useful for them to study.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:31:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs!", 
        "intTime": 20090312, 
        "postID": 41, 
        "quote": "Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study.", 
        "reply": " So let me get this straight...Change their religion, to what satisfy your beliefs!", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:35:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace...", 
        "intTime": 20090312, 
        "postID": 42, 
        "quote": "Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs!", 
        "reply": " Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace...", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:50:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!!", 
        "intTime": 20090312, 
        "postID": 43, 
        "quote": "Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace...", 
        "reply": " Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!!", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 17:57:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation. She is just obeying Obama's orders. A day with out Obama giving away millions is like a day with out sunshine. So far thats all he is good for.", 
        "intTime": 20090312, 
        "postID": 44, 
        "quote": "Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation.", 
        "reply": " She is just obeying Obama's orders. A day with out Obama giving away millions is like a day with out sunshine. So far thats all he is good for.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:02:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. There are a lot more bad guys than just Hamas in Palestine. Any dime going into Palestine is suspect in how it is used. FYI, There are Palestinians already in school here in the states. On the OSU campus in Ohio they were constantly chalking bad things about this country, the Jews, on and on. The campus did nothing to curb but constantly threatened to pull the rights of the ROTC program.", 
        "intTime": 20090312, 
        "postID": 45, 
        "quote": "Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers.", 
        "reply": " There are a lot more bad guys than just Hamas in Palestine. Any dime going into Palestine is suspect in how it is used. FYI, There are Palestinians already in school here in the states. On the OSU campus in Ohio they were constantly chalking bad things about this country, the Jews, on and on. The campus did nothing to curb but constantly threatened to pull the rights of the ROTC program.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:10:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "ACR26"
    }, 
    {
        "content": "thats dumb ... hey lets pay for terrorist to come here and infest our school system... but hey at lease it will open the door so they can attacks us and use gov grants to open up business so they can fund their jihad against us like the clintons did in the 90s ....", 
        "intTime": 20090312, 
        "postID": 46, 
        "quote": "", 
        "reply": "thats dumb ... hey lets pay for terrorist to come here and infest our school system... but hey at lease it will open the door so they can attacks us and use gov grants to open up business so they can fund their jihad against us like the clintons did in the 90s ....", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:37:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. There are a lot more bad guys than just Hamas in Palestine. Any dime going into Palestine is suspect in how it is used. FYI, There are Palestinians already in school here in the states. On the OSU campus in Ohio they were constantly chalking bad things about this country, the Jews, on and on. The campus did nothing to curb but constantly threatened to pull the rights of the ROTC program. yea i remember them in the 90s... they were working here and sending money back home to fund terrorism....", 
        "intTime": 20090312, 
        "postID": 47, 
        "quote": "Originally posted by ACR26: quote: Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. There are a lot more bad guys than just Hamas in Palestine. Any dime going into Palestine is suspect in how it is used. FYI, There are Palestinians already in school here in the states. On the OSU campus in Ohio they were constantly chalking bad things about this country, the Jews, on and on. The campus did nothing to curb but constantly threatened to pull the rights of the ROTC program.", 
        "reply": " yea i remember them in the 90s... they were working here and sending money back home to fund terrorism....", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:39:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!! yea i guess you felt in the 1st crusade they should of just let the Christians who were going to the holyland to worship to get slaughter by the masses... you tend to forget about the muslim in that... yea i guess the christains dont have a right to worship in their holyland?? naw they are the bad guys always... huh ..", 
        "intTime": 20090312, 
        "postID": 48, 
        "quote": "Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!!", 
        "reply": " yea i guess you felt in the 1st crusade they should of just let the Christians who were going to the holyland to worship to get slaughter by the masses... you tend to forget about the muslim in that... yea i guess the christains dont have a right to worship in their holyland?? naw they are the bad guys always... huh ..", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:43:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends. yea too bad thats not what they want... go and spend a few years chatting with a few ... they want to cut out your heart and cut off your mind....thats heart and minds with the pals...", 
        "intTime": 20090312, 
        "postID": 49, 
        "quote": "Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "reply": " yea too bad thats not what they want... go and spend a few years chatting with a few ... they want to cut out your heart and cut off your mind....thats heart and minds with the pals...", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:45:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation. yes she is... a disgrace also... oh well the holyland loved her and slick willy... the ones i knew in the 90s praised them... hell it was federal grants created by the clintons that made it possible for them to fund their jihad....", 
        "intTime": 20090312, 
        "postID": 50, 
        "quote": "Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation.", 
        "reply": " yes she is... a disgrace also... oh well the holyland loved her and slick willy... the ones i knew in the 90s praised them... hell it was federal grants created by the clintons that made it possible for them to fund their jihad....", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 18:47:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation. yes she is... a disgrace also... oh well the holyland loved her and slick willy... the ones i knew in the 90s praised them... hell it was federal grants created by the clintons that made it possible for them to fund their jihad.... Interesting point....butttttttttttttttt Where are all the republicans that beat up on the Clintons while he was president? In the dust bin of history...WAIT!!!! Newt is still trying to crawl out... Bill and Hillary still rule the school", 
        "intTime": 20090312, 
        "postID": 51, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by EspritDeCorps: Clinton is an embarrassment to this nation. yes she is... a disgrace also... oh well the holyland loved her and slick willy... the ones i knew in the 90s praised them... hell it was federal grants created by the clintons that made it possible for them to fund their jihad....", 
        "reply": " Interesting point....butttttttttttttttt Where are all the republicans that beat up on the Clintons while he was president? In the dust bin of history...WAIT!!!! Newt is still trying to crawl out... Bill and Hillary still rule the school", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 21:34:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right??", 
        "intTime": 20090312, 
        "postID": 52, 
        "quote": "Bill and Hillary still rule the school", 
        "reply": " yup a school that gave terrorist a means to fund terrorism... but hey who cares right??", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 21:37:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right?? ok ok ok...Were the Jews who took on the British in Palestine heroes or terrorists?...Depends who you ask? I'll ask a Jew....you ask a Brit", 
        "intTime": 20090312, 
        "postID": 53, 
        "quote": "Originally posted by outlaws93: quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right??", 
        "reply": " ok ok ok...Were the Jews who took on the British in Palestine heroes or terrorists?...Depends who you ask? I'll ask a Jew....you ask a Brit", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-12 22:14:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by outlaws93: quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right?? ok ok ok...Were the Jews who took on the British in Palestine heroes or terrorists?...Depends who you ask? I'll ask a Jew....you ask a Brit How about the ones that are killing AMERICANS now ???? Or are they just poor, misunderstood, beheading, terroists?", 
        "intTime": 20090313, 
        "postID": 54, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by outlaws93: quote: Bill and Hillary still rule the school yup a school that gave terrorist a means to fund terrorism... but hey who cares right?? ok ok ok...Were the Jews who took on the British in Palestine heroes or terrorists?...Depends who you ask? I'll ask a Jew....you ask a Brit", 
        "reply": " How about the ones that are killing AMERICANS now ???? Or are they just poor, misunderstood, beheading, terroists?", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 07:02:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!! Please, tell us all about the Crusades...", 
        "intTime": 20090313, 
        "postID": 55, 
        "quote": "Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!!", 
        "reply": " Please, tell us all about the Crusades...", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 07:25:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "Philhelm"
    }, 
    {
        "content": "here is something intersting... more hate from the religion of peace.. ===http://www.israelnationalnews.com/News/News.aspx/130414 PA TV Celebrates Most Murderous Terror Attack in Israeli History Adar 17, 5769, 13 March 09 10:11by Gil Ronen(IsraelNN.com) The Palestinian Authority (PA) celebrated the single most murderous attack against Israeli civilians by broadcasting an hour-long special Wednesday on its official television station. Arabs who penetrated into Israel by rubber dinghies from Lebanon carried out the attack, known in Israel as the Coastal Road Terror Attack, on March 11, 1978. They hijacked a tourist bus and killed 38 civilians, 13 of them children. PA TV celebrated the attack on the anniversary of the hijacking with an hour-long special. The program included interviews with terrorists who described the planning and implementation of the murder spree. Palestinian Media Watch reported that the program opened with the narrator glorifying the attack as: “…one of the most important and most prominent special actions, executed by the Palestinian revolution by sea, on the coast between Haifa and Tel Aviv. This action, which was carried out by a group of heroes and led by the heroic fighter Dalal Mughrabi, had a great impact on continuing events of the Arab-Israeli conflict.\" Mughrabi and 11 other terrorists landed by Zodiac boats on a beach near Ma'agan Michael, north of Tel Aviv. They fatally shot American photographer Gail Rubin who was taking nature photographs nearby, reached the Coastal Highway and commandeered a bus that was carrying Egged bus drivers and their families on a day outing. Passengers burned alive The bus continued driving south on the Coastal Road (Highway 2) while the terrorists fired and threw grenades at passing cars, shot passengers and dumped at least one body out of the bus. At one point, they hijacked another bus and forced the passengers from the first bus to board it. An explosion caused either by an exploding fuel tank or a grenade set the bus on fire, killing 38 civilians, 13 of them children. 71 Israelis were wounded.", 
        "intTime": 20090313, 
        "postID": 56, 
        "quote": "", 
        "reply": "here is something intersting... more hate from the religion of peace.. ===http://www.israelnationalnews.com/News/News.aspx/130414 PA TV Celebrates Most Murderous Terror Attack in Israeli History Adar 17, 5769, 13 March 09 10:11by Gil Ronen(IsraelNN.com) The Palestinian Authority (PA) celebrated the single most murderous attack against Israeli civilians by broadcasting an hour-long special Wednesday on its official television station. Arabs who penetrated into Israel by rubber dinghies from Lebanon carried out the attack, known in Israel as the Coastal Road Terror Attack, on March 11, 1978. They hijacked a tourist bus and killed 38 civilians, 13 of them children. PA TV celebrated the attack on the anniversary of the hijacking with an hour-long special. The program included interviews with terrorists who described the planning and implementation of the murder spree. Palestinian Media Watch reported that the program opened with the narrator glorifying the attack as: “…one of the most important and most prominent special actions, executed by the Palestinian revolution by sea, on the coast between Haifa and Tel Aviv. This action, which was carried out by a group of heroes and led by the heroic fighter Dalal Mughrabi, had a great impact on continuing events of the Arab-Israeli conflict.\" Mughrabi and 11 other terrorists landed by Zodiac boats on a beach near Ma'agan Michael, north of Tel Aviv. They fatally shot American photographer Gail Rubin who was taking nature photographs nearby, reached the Coastal Highway and commandeered a bus that was carrying Egged bus drivers and their families on a day outing. Passengers burned alive The bus continued driving south on the Coastal Road (Highway 2) while the terrorists fired and threw grenades at passing cars, shot passengers and dumped at least one body out of the bus. At one point, they hijacked another bus and forced the passengers from the first bus to board it. An explosion caused either by an exploding fuel tank or a grenade set the bus on fire, killing 38 civilians, 13 of them children. 71 Israelis were wounded.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 09:16:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: quote: Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!! Please, tell us all about the Crusades... well he cant because he hasnt got a clue about them himself...", 
        "intTime": 20090313, 
        "postID": 57, 
        "quote": "Originally posted by Philhelm: quote: Originally posted by samh32: quote: Originally posted by threerings: quote: Originally posted by samh32: quote: Originally posted by soscorpio: quote: Palestinians might seek a constructive future, were their young people offered a chance at one. Then they should consider Christianity as it would be more useful for them to study. So let me get this straight...Change their religion, to what satisfy your beliefs! Ya..thats OUT-RAGE-OUES... I cant think of any religion..that would think of that.. not one... at least not a religion of peace... Religion of peace? You ever heard of the Crusades Quick Robin back to the topic!! Please, tell us all about the Crusades...", 
        "reply": " well he cant because he hasnt got a clue about them himself...", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 09:17:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Once again, Arafat died with a personal fortune of between $900,000,000 and $1 billion. From ALL sources, the \"Palestinians\" recieve about $23,000 per capata in foreign aid PER YEAR, while the AVERAGE \"palestinian\" earns less that $2,000 PER YEAR. So we need to send them still more money? Seems to me they already recieve more than enough, if the $ is used as intended, to have a pretty nice little mini-State going on, no poverty, nice hotels on the Med. Sea, good schools, yes, if they were not dedicated to MURDERING their NEIGHBORS becaus they are Jews and Christians and apostates, they'd hav e a pretty nice life. It is 60 years past time we stopped making excuses for them, don't you think, and fixed the problem?", 
        "intTime": 20090313, 
        "postID": 58, 
        "quote": "", 
        "reply": "Once again, Arafat died with a personal fortune of between $900,000,000 and $1 billion. From ALL sources, the \"Palestinians\" recieve about $23,000 per capata in foreign aid PER YEAR, while the AVERAGE \"palestinian\" earns less that $2,000 PER YEAR. So we need to send them still more money? Seems to me they already recieve more than enough, if the $ is used as intended, to have a pretty nice little mini-State going on, no poverty, nice hotels on the Med. Sea, good schools, yes, if they were not dedicated to MURDERING their NEIGHBORS becaus they are Jews and Christians and apostates, they'd hav e a pretty nice life. It is 60 years past time we stopped making excuses for them, don't you think, and fixed the problem?", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 10:06:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "intTime": 20090313, 
        "postID": 59, 
        "quote": "Originally posted by Ruanne: Palestinians might seek a constructive future, were their young people offered a chance at one. Obviously, not all will do so. But if you can convince one family, or however many families will benefit from this program, so much the better. Our competition is HAMAS, and HAMAS uses as many charities in its arsenal as it does suicide bombers. Hearts and minds, my friends.", 
        "reply": "", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 10:06:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "Knele"
    }, 
    {
        "content": "So, Ru..., what exactly would you do to get the hearts and minds of people who hav e been dressed up as future suicide bombers and glorified as much since they were 18 months of life.", 
        "intTime": 20090313, 
        "postID": 60, 
        "quote": "", 
        "reply": "So, Ru..., what exactly would you do to get the hearts and minds of people who hav e been dressed up as future suicide bombers and glorified as much since they were 18 months of life.", 
        "threadID": "409192893_8940025712001", 
        "time": "2009-03-13 10:11:00", 
        "title": "Clinton Announces Million-Dollar Scholarship Program for Palestinian Students", 
        "userID": "peter3_1"
    }
]