[
    {
        "content": "While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "", 
        "reply": "While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:29:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "", 
        "reply": "Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:34:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "reply": " Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:56:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Here's to Secretary Gates.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 4, 
        "quote": "Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "reply": " Here's to Secretary Gates.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 06:39:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing! Every Real American? So what do you propose, waiting until the 2010 and 2012 elections to change the government by the legal democratic process of the electorate, OR, take to the streets in an illegal civil insurrection to overthrow the federal government? Personally, I don't see any other choices. All Real Americans, would follow the course of democratic elections. So, that would make it only one REAL choice. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 5, 
        "quote": "Originally posted by Mom2APAJ: While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "reply": " Every Real American? So what do you propose, waiting until the 2010 and 2012 elections to change the government by the legal democratic process of the electorate, OR, take to the streets in an illegal civil insurrection to overthrow the federal government? Personally, I don't see any other choices. All Real Americans, would follow the course of democratic elections. So, that would make it only one REAL choice. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 06:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "intTime": 20090507, 
        "postID": 6, 
        "quote": "I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country?", 
        "reply": " Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 08:08:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "xerello"
    }, 
    {
        "content": "President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "intTime": 20090507, 
        "postID": 7, 
        "quote": "", 
        "reply": "President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:07:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "intTime": 20090507, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him.", 
        "reply": " I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:13:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "intTime": 20090507, 
        "postID": 9, 
        "quote": "Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "reply": " That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:15:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful. When did I say that is what makes America great? The fact is, though, that we ARE the richest AND most powerful nation today, yesterday and for the foreseable future... The rest of the world wants to cry about that then they ought to go to work and change it...", 
        "intTime": 20090507, 
        "postID": 10, 
        "quote": "Originally posted by foxred03: quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "reply": " When did I say that is what makes America great? The fact is, though, that we ARE the richest AND most powerful nation today, yesterday and for the foreseable future... The rest of the world wants to cry about that then they ought to go to work and change it...", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:33:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090507, 
        "postID": 11, 
        "quote": "Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "reply": " I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "L0A1"
    }, 
    {
        "content": "Mom the Obama Administration is just taking up where the Bush Administration left off with the Administration appointees dyed in the wool DC hacks of the fist order...second order and any other order you want to layout...be pizzed...good get it out... it is right on as to where we are as a nation at this place in time!", 
        "intTime": 20090507, 
        "postID": 12, 
        "quote": "", 
        "reply": "Mom the Obama Administration is just taking up where the Bush Administration left off with the Administration appointees dyed in the wool DC hacks of the fist order...second order and any other order you want to layout...be pizzed...good get it out... it is right on as to where we are as a nation at this place in time!", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:10:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "intTime": 20090507, 
        "postID": 13, 
        "quote": "", 
        "reply": "When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:16:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. I just haven't seen the \"change\" that you do. He seems to be doing what a Secretary of Defense usually does but to me, he seems to be doing a bit better especially in a tough administration.", 
        "intTime": 20090507, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't.", 
        "reply": " I just haven't seen the \"change\" that you do. He seems to be doing what a Secretary of Defense usually does but to me, he seems to be doing a bit better especially in a tough administration.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:19:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? I can't find any reference to the Bible or Jesus in either document. Please point out the passages. kthxbai Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "intTime": 20090507, 
        "postID": 15, 
        "quote": "Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this?", 
        "reply": " I can't find any reference to the Bible or Jesus in either document. Please point out the passages. kthxbai Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:21:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "BonoboJones"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Sincerely, Every real American So, all the American citizens who voted for Barack Obama are not \"Real Americans\"? The majority of America's citizens are not \"Real Americans\"? \"Waiter, could I have some cheese to go with the OP's whine?\"", 
        "intTime": 20090507, 
        "postID": 16, 
        "quote": "Originally posted by Mom2APAJ: Sincerely, Every real American", 
        "reply": " So, all the American citizens who voted for Barack Obama are not \"Real Americans\"? The majority of America's citizens are not \"Real Americans\"? \"Waiter, could I have some cheese to go with the OP's whine?\"", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:29:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "intTime": 20090507, 
        "postID": 17, 
        "quote": "Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "reply": " My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 12:55:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: And yes, it does seem that he becoming more of a politician and less SecDef. That I do not see at all, but it is my perception, nothing more or less. As for your other point I agree with it to a certain extent. But it does seem that the trend in wars over the last 50 years shows that Gate's restructuring ideas are probably overdue. Rumsfield actually recognized the need for a military more geared for smaller wars of insurgency as well.", 
        "intTime": 20090507, 
        "postID": 18, 
        "quote": "And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "reply": " That I do not see at all, but it is my perception, nothing more or less. As for your other point I agree with it to a certain extent. But it does seem that the trend in wars over the last 50 years shows that Gate's restructuring ideas are probably overdue. Rumsfield actually recognized the need for a military more geared for smaller wars of insurgency as well.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 12:59:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: foxred03 sez: \"We aren't great because we are rich and powerful.\" Man, I've read your posts, and would love to hear you summarize why you believe America is great.", 
        "intTime": 20090507, 
        "postID": 19, 
        "quote": "foxred03", 
        "reply": " sez: \"We aren't great because we are rich and powerful.\" Man, I've read your posts, and would love to hear you summarize why you believe America is great.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:03:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "soscorpio"
    }, 
    {
        "content": "\"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "intTime": 20090507, 
        "postID": 20, 
        "quote": "", 
        "reply": "\"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:17:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "intTime": 20090507, 
        "postID": 21, 
        "quote": "Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\"", 
        "reply": " Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:26:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by foxred03: \"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism. Speaks to what? Your patriotism, or your lack of better opportunities because of the recession? I think you were asked your opinion, not quotes and sound bites.", 
        "intTime": 20090507, 
        "postID": 22, 
        "quote": "Originally posted by foxred03: \"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "reply": " Speaks to what? Your patriotism, or your lack of better opportunities because of the recession? I think you were asked your opinion, not quotes and sound bites.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "transport1"
    }, 
    {
        "content": "I believe you are a bit out of line.", 
        "intTime": 20090507, 
        "postID": 23, 
        "quote": "", 
        "reply": "I believe you are a bit out of line.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:51:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: I believe you are a bit out of line. What is your fear of summarizing why you think America is great?", 
        "intTime": 20090507, 
        "postID": 24, 
        "quote": "I believe you are a bit out of line.", 
        "reply": " What is your fear of summarizing why you think America is great?", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 14:59:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this. Indeed which is why I didn't bother to waste my time expounding on my own personal patriotism. The McCarthy's calling it into question would ignore such an effort, as they usually do when something simple, balanced, obvious, and true is presented. At one point in time, a Combat Infantryman's Badge spoke for itself; now it seems that opposing torture and other specific viewpoints equates to a lack of patriotism.", 
        "intTime": 20090507, 
        "postID": 25, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "reply": " Indeed which is why I didn't bother to waste my time expounding on my own personal patriotism. The McCarthy's calling it into question would ignore such an effort, as they usually do when something simple, balanced, obvious, and true is presented. At one point in time, a Combat Infantryman's Badge spoke for itself; now it seems that opposing torture and other specific viewpoints equates to a lack of patriotism.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 20:52:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "Thanks, Mom. I appreciate you posting this and know several fine \"real Americans\" who will love it too. As for 0 lying about our Christian heritage - we had to see that coming, as it falls right in line with him proclaiming his Muslim faith. (Fortunately, utube has not deleted it ... yet.) \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 26, 
        "quote": "", 
        "reply": "Thanks, Mom. I appreciate you posting this and know several fine \"real Americans\" who will love it too. As for 0 lying about our Christian heritage - we had to see that coming, as it falls right in line with him proclaiming his Muslim faith. (Fortunately, utube has not deleted it ... yet.) \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 05:19:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "America is great because the people of America made it great, in the last couple of decades, ploiticians have made America look weak by not taking care of America's best interest. America is still great, the American people are still great, the leadership of the greatest country has been subpar for some time now and it's starting to reflect on the American people.", 
        "intTime": 20090508, 
        "postID": 27, 
        "quote": "", 
        "reply": "America is great because the people of America made it great, in the last couple of decades, ploiticians have made America look weak by not taking care of America's best interest. America is still great, the American people are still great, the leadership of the greatest country has been subpar for some time now and it's starting to reflect on the American people.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 08:38:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "blane"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling... Congrats Irwin, you get the title of the most uninformed, short sighted and lame poster of the current crop of clueless posters. May the force be with you. For the record, please tell us how the foreign policies of the Bush adminstration have served us.", 
        "intTime": 20090508, 
        "postID": 28, 
        "quote": "Originally posted by Irwin_R_Schyster: When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "reply": " Congrats Irwin, you get the title of the most uninformed, short sighted and lame poster of the current crop of clueless posters. May the force be with you. For the record, please tell us how the foreign policies of the Bush adminstration have served us.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:26:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country? Really, when did President Obama apologize for any actions of the United States? I'm sure the \"real American\" who wrote this letter did not mean to say that we are a Christian nation (except for the Vatican, there are no Christian nations) but one built on Christian-Judeo ideals. When did President Obama deny this? Being outraged by what conservative commentators tell you is true, instead of what really happened does not make you a real American, just a fringe element, politically speaking.", 
        "intTime": 20090508, 
        "postID": 29, 
        "quote": "Originally posted by xerello: quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "reply": " Really, when did President Obama apologize for any actions of the United States? I'm sure the \"real American\" who wrote this letter did not mean to say that we are a Christian nation (except for the Vatican, there are no Christian nations) but one built on Christian-Judeo ideals. When did President Obama deny this? Being outraged by what conservative commentators tell you is true, instead of what really happened does not make you a real American, just a fringe element, politically speaking.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:32:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef. Ridiculous. It is precisely his, \"forward vision\" that enables him to make these critical decisions with respect to weapons systems and military manning levels. How much complaining has the military done concerning his proposals? I think they're onboard. It's those politicians that see jobs in their districts going away that have issues.....not the actual warfighters. The politicans are more concerned about their poltical future than the nations security.", 
        "intTime": 20090508, 
        "postID": 30, 
        "quote": "Originally posted by sw614: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "reply": " Ridiculous. It is precisely his, \"forward vision\" that enables him to make these critical decisions with respect to weapons systems and military manning levels. How much complaining has the military done concerning his proposals? I think they're onboard. It's those politicians that see jobs in their districts going away that have issues.....not the actual warfighters. The politicans are more concerned about their poltical future than the nations security.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:33:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "WepsFP"
    }, 
    {
        "content": "While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "intTime": 20090506, 
        "postID": 31, 
        "quote": "", 
        "reply": "While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:29:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "intTime": 20090506, 
        "postID": 32, 
        "quote": "", 
        "reply": "Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:34:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 33, 
        "quote": "Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "reply": " Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:56:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Here's to Secretary Gates.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 34, 
        "quote": "Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "reply": " Here's to Secretary Gates.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 06:39:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing! Every Real American? So what do you propose, waiting until the 2010 and 2012 elections to change the government by the legal democratic process of the electorate, OR, take to the streets in an illegal civil insurrection to overthrow the federal government? Personally, I don't see any other choices. All Real Americans, would follow the course of democratic elections. So, that would make it only one REAL choice. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 35, 
        "quote": "Originally posted by Mom2APAJ: While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "reply": " Every Real American? So what do you propose, waiting until the 2010 and 2012 elections to change the government by the legal democratic process of the electorate, OR, take to the streets in an illegal civil insurrection to overthrow the federal government? Personally, I don't see any other choices. All Real Americans, would follow the course of democratic elections. So, that would make it only one REAL choice. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 06:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "intTime": 20090507, 
        "postID": 36, 
        "quote": "I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country?", 
        "reply": " Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 08:08:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "xerello"
    }, 
    {
        "content": "President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "intTime": 20090507, 
        "postID": 37, 
        "quote": "", 
        "reply": "President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:07:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "intTime": 20090507, 
        "postID": 38, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him.", 
        "reply": " I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:13:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "intTime": 20090507, 
        "postID": 39, 
        "quote": "Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "reply": " That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:15:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful. When did I say that is what makes America great? The fact is, though, that we ARE the richest AND most powerful nation today, yesterday and for the foreseable future... The rest of the world wants to cry about that then they ought to go to work and change it...", 
        "intTime": 20090507, 
        "postID": 40, 
        "quote": "Originally posted by foxred03: quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "reply": " When did I say that is what makes America great? The fact is, though, that we ARE the richest AND most powerful nation today, yesterday and for the foreseable future... The rest of the world wants to cry about that then they ought to go to work and change it...", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:33:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090507, 
        "postID": 41, 
        "quote": "Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "reply": " I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "L0A1"
    }, 
    {
        "content": "Mom the Obama Administration is just taking up where the Bush Administration left off with the Administration appointees dyed in the wool DC hacks of the fist order...second order and any other order you want to layout...be pizzed...good get it out... it is right on as to where we are as a nation at this place in time!", 
        "intTime": 20090507, 
        "postID": 42, 
        "quote": "", 
        "reply": "Mom the Obama Administration is just taking up where the Bush Administration left off with the Administration appointees dyed in the wool DC hacks of the fist order...second order and any other order you want to layout...be pizzed...good get it out... it is right on as to where we are as a nation at this place in time!", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:10:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "intTime": 20090507, 
        "postID": 43, 
        "quote": "", 
        "reply": "When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:16:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. I just haven't seen the \"change\" that you do. He seems to be doing what a Secretary of Defense usually does but to me, he seems to be doing a bit better especially in a tough administration.", 
        "intTime": 20090507, 
        "postID": 44, 
        "quote": "Originally posted by L0A1: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't.", 
        "reply": " I just haven't seen the \"change\" that you do. He seems to be doing what a Secretary of Defense usually does but to me, he seems to be doing a bit better especially in a tough administration.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:19:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? I can't find any reference to the Bible or Jesus in either document. Please point out the passages. kthxbai Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "intTime": 20090507, 
        "postID": 45, 
        "quote": "Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this?", 
        "reply": " I can't find any reference to the Bible or Jesus in either document. Please point out the passages. kthxbai Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:21:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "BonoboJones"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Sincerely, Every real American So, all the American citizens who voted for Barack Obama are not \"Real Americans\"? The majority of America's citizens are not \"Real Americans\"? \"Waiter, could I have some cheese to go with the OP's whine?\"", 
        "intTime": 20090507, 
        "postID": 46, 
        "quote": "Originally posted by Mom2APAJ: Sincerely, Every real American", 
        "reply": " So, all the American citizens who voted for Barack Obama are not \"Real Americans\"? The majority of America's citizens are not \"Real Americans\"? \"Waiter, could I have some cheese to go with the OP's whine?\"", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:29:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "intTime": 20090507, 
        "postID": 47, 
        "quote": "Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "reply": " My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 12:55:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: And yes, it does seem that he becoming more of a politician and less SecDef. That I do not see at all, but it is my perception, nothing more or less. As for your other point I agree with it to a certain extent. But it does seem that the trend in wars over the last 50 years shows that Gate's restructuring ideas are probably overdue. Rumsfield actually recognized the need for a military more geared for smaller wars of insurgency as well.", 
        "intTime": 20090507, 
        "postID": 48, 
        "quote": "And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "reply": " That I do not see at all, but it is my perception, nothing more or less. As for your other point I agree with it to a certain extent. But it does seem that the trend in wars over the last 50 years shows that Gate's restructuring ideas are probably overdue. Rumsfield actually recognized the need for a military more geared for smaller wars of insurgency as well.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 12:59:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: foxred03 sez: \"We aren't great because we are rich and powerful.\" Man, I've read your posts, and would love to hear you summarize why you believe America is great.", 
        "intTime": 20090507, 
        "postID": 49, 
        "quote": "foxred03", 
        "reply": " sez: \"We aren't great because we are rich and powerful.\" Man, I've read your posts, and would love to hear you summarize why you believe America is great.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:03:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "soscorpio"
    }, 
    {
        "content": "\"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "intTime": 20090507, 
        "postID": 50, 
        "quote": "", 
        "reply": "\"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:17:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "intTime": 20090507, 
        "postID": 51, 
        "quote": "Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\"", 
        "reply": " Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:26:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by foxred03: \"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism. Speaks to what? Your patriotism, or your lack of better opportunities because of the recession? I think you were asked your opinion, not quotes and sound bites.", 
        "intTime": 20090507, 
        "postID": 52, 
        "quote": "Originally posted by foxred03: \"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "reply": " Speaks to what? Your patriotism, or your lack of better opportunities because of the recession? I think you were asked your opinion, not quotes and sound bites.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "transport1"
    }, 
    {
        "content": "I believe you are a bit out of line.", 
        "intTime": 20090507, 
        "postID": 53, 
        "quote": "", 
        "reply": "I believe you are a bit out of line.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:51:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: I believe you are a bit out of line. What is your fear of summarizing why you think America is great?", 
        "intTime": 20090507, 
        "postID": 54, 
        "quote": "I believe you are a bit out of line.", 
        "reply": " What is your fear of summarizing why you think America is great?", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 14:59:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this. Indeed which is why I didn't bother to waste my time expounding on my own personal patriotism. The McCarthy's calling it into question would ignore such an effort, as they usually do when something simple, balanced, obvious, and true is presented. At one point in time, a Combat Infantryman's Badge spoke for itself; now it seems that opposing torture and other specific viewpoints equates to a lack of patriotism.", 
        "intTime": 20090507, 
        "postID": 55, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "reply": " Indeed which is why I didn't bother to waste my time expounding on my own personal patriotism. The McCarthy's calling it into question would ignore such an effort, as they usually do when something simple, balanced, obvious, and true is presented. At one point in time, a Combat Infantryman's Badge spoke for itself; now it seems that opposing torture and other specific viewpoints equates to a lack of patriotism.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 20:52:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "Thanks, Mom. I appreciate you posting this and know several fine \"real Americans\" who will love it too. As for 0 lying about our Christian heritage - we had to see that coming, as it falls right in line with him proclaiming his Muslim faith. (Fortunately, utube has not deleted it ... yet.) \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 56, 
        "quote": "", 
        "reply": "Thanks, Mom. I appreciate you posting this and know several fine \"real Americans\" who will love it too. As for 0 lying about our Christian heritage - we had to see that coming, as it falls right in line with him proclaiming his Muslim faith. (Fortunately, utube has not deleted it ... yet.) \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 05:19:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "America is great because the people of America made it great, in the last couple of decades, ploiticians have made America look weak by not taking care of America's best interest. America is still great, the American people are still great, the leadership of the greatest country has been subpar for some time now and it's starting to reflect on the American people.", 
        "intTime": 20090508, 
        "postID": 57, 
        "quote": "", 
        "reply": "America is great because the people of America made it great, in the last couple of decades, ploiticians have made America look weak by not taking care of America's best interest. America is still great, the American people are still great, the leadership of the greatest country has been subpar for some time now and it's starting to reflect on the American people.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 08:38:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "blane"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling... Congrats Irwin, you get the title of the most uninformed, short sighted and lame poster of the current crop of clueless posters. May the force be with you. For the record, please tell us how the foreign policies of the Bush adminstration have served us.", 
        "intTime": 20090508, 
        "postID": 58, 
        "quote": "Originally posted by Irwin_R_Schyster: When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "reply": " Congrats Irwin, you get the title of the most uninformed, short sighted and lame poster of the current crop of clueless posters. May the force be with you. For the record, please tell us how the foreign policies of the Bush adminstration have served us.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:26:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country? Really, when did President Obama apologize for any actions of the United States? I'm sure the \"real American\" who wrote this letter did not mean to say that we are a Christian nation (except for the Vatican, there are no Christian nations) but one built on Christian-Judeo ideals. When did President Obama deny this? Being outraged by what conservative commentators tell you is true, instead of what really happened does not make you a real American, just a fringe element, politically speaking.", 
        "intTime": 20090508, 
        "postID": 59, 
        "quote": "Originally posted by xerello: quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "reply": " Really, when did President Obama apologize for any actions of the United States? I'm sure the \"real American\" who wrote this letter did not mean to say that we are a Christian nation (except for the Vatican, there are no Christian nations) but one built on Christian-Judeo ideals. When did President Obama deny this? Being outraged by what conservative commentators tell you is true, instead of what really happened does not make you a real American, just a fringe element, politically speaking.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:32:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef. Ridiculous. It is precisely his, \"forward vision\" that enables him to make these critical decisions with respect to weapons systems and military manning levels. How much complaining has the military done concerning his proposals? I think they're onboard. It's those politicians that see jobs in their districts going away that have issues.....not the actual warfighters. The politicans are more concerned about their poltical future than the nations security.", 
        "intTime": 20090508, 
        "postID": 60, 
        "quote": "Originally posted by sw614: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "reply": " Ridiculous. It is precisely his, \"forward vision\" that enables him to make these critical decisions with respect to weapons systems and military manning levels. How much complaining has the military done concerning his proposals? I think they're onboard. It's those politicians that see jobs in their districts going away that have issues.....not the actual warfighters. The politicans are more concerned about their poltical future than the nations security.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:33:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "WepsFP"
    }, 
    {
        "content": "While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "intTime": 20090506, 
        "postID": 61, 
        "quote": "", 
        "reply": "While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:29:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "intTime": 20090506, 
        "postID": 62, 
        "quote": "", 
        "reply": "Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:34:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 63, 
        "quote": "Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "reply": " Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-06 15:56:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Here's to Secretary Gates.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 64, 
        "quote": "Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick.", 
        "reply": " Here's to Secretary Gates.......... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 06:39:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing! Every Real American? So what do you propose, waiting until the 2010 and 2012 elections to change the government by the legal democratic process of the electorate, OR, take to the streets in an illegal civil insurrection to overthrow the federal government? Personally, I don't see any other choices. All Real Americans, would follow the course of democratic elections. So, that would make it only one REAL choice. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 65, 
        "quote": "Originally posted by Mom2APAJ: While I didn't write it, I applaud every word! Subject: LETTER TO OUR PRESIDENT Here's a letter I can truly understand and I am grateful that someone could put it into words. This came to me via an e-mail \"forward it on campaign\". Even if you don't forward it to anyone else it will make you feel like you're not crazy anymore, and that other people feel much like you do. April 17, 2009 The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States. You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain, our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you ! You can't find the time to visit the graves of our greatest generation because you dont want to offend the Germans but make time to visit a mosque in Turkey. You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. Whats the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. I took a 5% cut in my pay to save jobs with my employer. You havent said anything about that. Who authorized that? I surely didnt! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million not a bad take. Who authorized that and why havent you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a chance to spend two terms destroying my beautiful country. Sincerely, Every real American Let the Obama-sycophants rant all they want... this Administration is without a doubt the biggest bunch of two-faced liars, criminals and thieves to ever inhabit DC and that takes some doing!", 
        "reply": " Every Real American? So what do you propose, waiting until the 2010 and 2012 elections to change the government by the legal democratic process of the electorate, OR, take to the streets in an illegal civil insurrection to overthrow the federal government? Personally, I don't see any other choices. All Real Americans, would follow the course of democratic elections. So, that would make it only one REAL choice. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 06:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "intTime": 20090507, 
        "postID": 66, 
        "quote": "I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country?", 
        "reply": " Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 08:08:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "xerello"
    }, 
    {
        "content": "President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "intTime": 20090507, 
        "postID": 67, 
        "quote": "", 
        "reply": "President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:07:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "intTime": 20090507, 
        "postID": 68, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him.", 
        "reply": " I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:13:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "intTime": 20090507, 
        "postID": 69, 
        "quote": "Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying..", 
        "reply": " That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:15:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful. When did I say that is what makes America great? The fact is, though, that we ARE the richest AND most powerful nation today, yesterday and for the foreseable future... The rest of the world wants to cry about that then they ought to go to work and change it...", 
        "intTime": 20090507, 
        "postID": 70, 
        "quote": "Originally posted by foxred03: quote: Originally posted by Irwin_R_Schyster: President Obama is soft, and i'm sick of the national cheerleader going abroad and apologizing for things we are not guilty of. Arrogant? We're the richest most powerful nation on earth, get over it. What should we do? Call the rest of the world, \"winners\"?? because that would be lying.. That is why you fail... A long time ago we took down the richest most powerful nation on earth. We were a somewhat poorer, weaker country for well over a hundred years after that. But that did not make America less great. Your attitude is kind of lame. We aren't great because we are rich and powerful.", 
        "reply": " When did I say that is what makes America great? The fact is, though, that we ARE the richest AND most powerful nation today, yesterday and for the foreseable future... The rest of the world wants to cry about that then they ought to go to work and change it...", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:33:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090507, 
        "postID": 71, 
        "quote": "Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "reply": " I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 09:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "L0A1"
    }, 
    {
        "content": "Mom the Obama Administration is just taking up where the Bush Administration left off with the Administration appointees dyed in the wool DC hacks of the fist order...second order and any other order you want to layout...be pizzed...good get it out... it is right on as to where we are as a nation at this place in time!", 
        "intTime": 20090507, 
        "postID": 72, 
        "quote": "", 
        "reply": "Mom the Obama Administration is just taking up where the Bush Administration left off with the Administration appointees dyed in the wool DC hacks of the fist order...second order and any other order you want to layout...be pizzed...good get it out... it is right on as to where we are as a nation at this place in time!", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:10:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "intTime": 20090507, 
        "postID": 73, 
        "quote": "", 
        "reply": "When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:16:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't. I just haven't seen the \"change\" that you do. He seems to be doing what a Secretary of Defense usually does but to me, he seems to be doing a bit better especially in a tough administration.", 
        "intTime": 20090507, 
        "postID": 74, 
        "quote": "Originally posted by L0A1: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. I once followed your line of thinking, but lately he seems to be a yes man, nothing more. I wish I could give him the credit I once did, if he stayed consistant perhaps but he doesn't.", 
        "reply": " I just haven't seen the \"change\" that you do. He seems to be doing what a Secretary of Defense usually does but to me, he seems to be doing a bit better especially in a tough administration.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:19:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? I can't find any reference to the Bible or Jesus in either document. Please point out the passages. kthxbai Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "intTime": 20090507, 
        "postID": 75, 
        "quote": "Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this?", 
        "reply": " I can't find any reference to the Bible or Jesus in either document. Please point out the passages. kthxbai Our loyalties are to the species and the planet. We speak for Earth. Our obligation to survive is owed not just to ourselves but also to that Cosmos, ancient and vast, from which we spring. --Carl Sagan, 1934-1996", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:21:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "BonoboJones"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Sincerely, Every real American So, all the American citizens who voted for Barack Obama are not \"Real Americans\"? The majority of America's citizens are not \"Real Americans\"? \"Waiter, could I have some cheese to go with the OP's whine?\"", 
        "intTime": 20090507, 
        "postID": 76, 
        "quote": "Originally posted by Mom2APAJ: Sincerely, Every real American", 
        "reply": " So, all the American citizens who voted for Barack Obama are not \"Real Americans\"? The majority of America's citizens are not \"Real Americans\"? \"Waiter, could I have some cheese to go with the OP's whine?\"", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 10:29:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "intTime": 20090507, 
        "postID": 77, 
        "quote": "Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing.", 
        "reply": " My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 12:55:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: And yes, it does seem that he becoming more of a politician and less SecDef. That I do not see at all, but it is my perception, nothing more or less. As for your other point I agree with it to a certain extent. But it does seem that the trend in wars over the last 50 years shows that Gate's restructuring ideas are probably overdue. Rumsfield actually recognized the need for a military more geared for smaller wars of insurgency as well.", 
        "intTime": 20090507, 
        "postID": 78, 
        "quote": "And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "reply": " That I do not see at all, but it is my perception, nothing more or less. As for your other point I agree with it to a certain extent. But it does seem that the trend in wars over the last 50 years shows that Gate's restructuring ideas are probably overdue. Rumsfield actually recognized the need for a military more geared for smaller wars of insurgency as well.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 12:59:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: foxred03 sez: \"We aren't great because we are rich and powerful.\" Man, I've read your posts, and would love to hear you summarize why you believe America is great.", 
        "intTime": 20090507, 
        "postID": 79, 
        "quote": "foxred03", 
        "reply": " sez: \"We aren't great because we are rich and powerful.\" Man, I've read your posts, and would love to hear you summarize why you believe America is great.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:03:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "soscorpio"
    }, 
    {
        "content": "\"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "intTime": 20090507, 
        "postID": 80, 
        "quote": "", 
        "reply": "\"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:17:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "intTime": 20090507, 
        "postID": 81, 
        "quote": "Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\"", 
        "reply": " Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:26:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by foxred03: \"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism. Speaks to what? Your patriotism, or your lack of better opportunities because of the recession? I think you were asked your opinion, not quotes and sound bites.", 
        "intTime": 20090507, 
        "postID": 82, 
        "quote": "Originally posted by foxred03: \"Moral Restraint Let us not dissemble: If Americans wanted to rule the world, there would be only one government today, it would be seated in Washington DC, and there would be nothing else but conquered vassals and the ruins of those who resisted. The reason this picture is not presently so, and has not even been attempted, is because true Americans value the freedom of others every bit as much as we value our own. We have refrained from conquering the world because we believe that conquering it would be wrong. There are hordes of anti-Americans who, not having any grasp of moral restraint, believe that we are on a course of world conquest, or they believe that we are too weak to do so. By mouthing either error, they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable. To Americans, it isn't, and that is why there is no American Empire.\" That's just one reason. I'd add more quotes and write out my top ten reasons, but you'd just ignore them. The fact that I enlisted, and then reenlisted in a time of war speaks for itself. The thing is, I'm a patriot, not a nationalist or a fan of jingoism.", 
        "reply": " Speaks to what? Your patriotism, or your lack of better opportunities because of the recession? I think you were asked your opinion, not quotes and sound bites.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:49:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "transport1"
    }, 
    {
        "content": "I believe you are a bit out of line.", 
        "intTime": 20090507, 
        "postID": 83, 
        "quote": "", 
        "reply": "I believe you are a bit out of line.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 13:51:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: I believe you are a bit out of line. What is your fear of summarizing why you think America is great?", 
        "intTime": 20090507, 
        "postID": 84, 
        "quote": "I believe you are a bit out of line.", 
        "reply": " What is your fear of summarizing why you think America is great?", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 14:59:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this. Indeed which is why I didn't bother to waste my time expounding on my own personal patriotism. The McCarthy's calling it into question would ignore such an effort, as they usually do when something simple, balanced, obvious, and true is presented. At one point in time, a Combat Infantryman's Badge spoke for itself; now it seems that opposing torture and other specific viewpoints equates to a lack of patriotism.", 
        "intTime": 20090507, 
        "postID": 85, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by foxred03: \"...they are really confessing that if they had the power, they would set about ruling others. To them, to have power and not use it is literally unthinkable...\" Sounds like more than a few \"patriotic 100% American\" posters to this Forum, doesn't it? It even sounds a bit like the person who wrote the original \"Letter To Our President\" that Mom2APAJ quoted when she initiated this Forum thread, wouldn't you agree? quote: The thing is, I'm a patriot, not a nationalist or a fan of jingoism. I feel the same as you on this.", 
        "reply": " Indeed which is why I didn't bother to waste my time expounding on my own personal patriotism. The McCarthy's calling it into question would ignore such an effort, as they usually do when something simple, balanced, obvious, and true is presented. At one point in time, a Combat Infantryman's Badge spoke for itself; now it seems that opposing torture and other specific viewpoints equates to a lack of patriotism.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-07 20:52:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "foxred03"
    }, 
    {
        "content": "Thanks, Mom. I appreciate you posting this and know several fine \"real Americans\" who will love it too. As for 0 lying about our Christian heritage - we had to see that coming, as it falls right in line with him proclaiming his Muslim faith. (Fortunately, utube has not deleted it ... yet.) \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090508, 
        "postID": 86, 
        "quote": "", 
        "reply": "Thanks, Mom. I appreciate you posting this and know several fine \"real Americans\" who will love it too. As for 0 lying about our Christian heritage - we had to see that coming, as it falls right in line with him proclaiming his Muslim faith. (Fortunately, utube has not deleted it ... yet.) \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 05:19:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "America is great because the people of America made it great, in the last couple of decades, ploiticians have made America look weak by not taking care of America's best interest. America is still great, the American people are still great, the leadership of the greatest country has been subpar for some time now and it's starting to reflect on the American people.", 
        "intTime": 20090508, 
        "postID": 87, 
        "quote": "", 
        "reply": "America is great because the people of America made it great, in the last couple of decades, ploiticians have made America look weak by not taking care of America's best interest. America is still great, the American people are still great, the leadership of the greatest country has been subpar for some time now and it's starting to reflect on the American people.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 08:38:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "blane"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling... Congrats Irwin, you get the title of the most uninformed, short sighted and lame poster of the current crop of clueless posters. May the force be with you. For the record, please tell us how the foreign policies of the Bush adminstration have served us.", 
        "intTime": 20090508, 
        "postID": 88, 
        "quote": "Originally posted by Irwin_R_Schyster: When it comes to foreign affairs President Obama, thanks to his softness, has about as much credibility and integrity as televised wrestling...", 
        "reply": " Congrats Irwin, you get the title of the most uninformed, short sighted and lame poster of the current crop of clueless posters. May the force be with you. For the record, please tell us how the foreign policies of the Bush adminstration have served us.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:26:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country? Really, when did President Obama apologize for any actions of the United States? I'm sure the \"real American\" who wrote this letter did not mean to say that we are a Christian nation (except for the Vatican, there are no Christian nations) but one built on Christian-Judeo ideals. When did President Obama deny this? Being outraged by what conservative commentators tell you is true, instead of what really happened does not make you a real American, just a fringe element, politically speaking.", 
        "intTime": 20090508, 
        "postID": 89, 
        "quote": "Originally posted by xerello: quote: I personally resent that you go around the world apologizing for the United States Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Where is the quote of President Obama apologizing for any actions of the United States? Where is the quote of President Obama telling a Muslim country that the United States not consider itself a Christian country?", 
        "reply": " Really, when did President Obama apologize for any actions of the United States? I'm sure the \"real American\" who wrote this letter did not mean to say that we are a Christian nation (except for the Vatican, there are no Christian nations) but one built on Christian-Judeo ideals. When did President Obama deny this? Being outraged by what conservative commentators tell you is true, instead of what really happened does not make you a real American, just a fringe element, politically speaking.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:32:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef. Ridiculous. It is precisely his, \"forward vision\" that enables him to make these critical decisions with respect to weapons systems and military manning levels. How much complaining has the military done concerning his proposals? I think they're onboard. It's those politicians that see jobs in their districts going away that have issues.....not the actual warfighters. The politicans are more concerned about their poltical future than the nations security.", 
        "intTime": 20090508, 
        "postID": 90, 
        "quote": "Originally posted by sw614: quote: Originally posted by foxred03: quote: Originally posted by L0A1: quote: Originally posted by Boots_: Secretary of Defense Robert Gates would like to Counterpoint ++http://www.welt.de/english-news/article3678931/Robert-Gates-defines-Americas-war-on-terror.html FAREED ZAKARIA, HOST: Secretary Gates, thank you for doing this. ROBERT GATES: My pleasure. ZAKARIA: President Obama - you've heard a lot of Republican criticism that he's going around the world apologizing about America. Do you accept that? GATES: Well I'd like to remind people that when President George W. Bush came into office he talked about a more humble America. And you can go back to Theodore Roosevelt and his line about speaking softly but carrying a big stick. I think that acknowledging that we have made mistakes is not only factually accurate; I think that it is unusual because so few other governments in the world are willing to admit that. Although they make them all of the time, and some of them make catastrophic mistakes. And in speeches myself, I have said that at times we have acted too arrogantly. And I didn't feel that I was being apologetic for America, I just was saying – because the next -- I was just saying that that's the way we are in terms of being willing to recognize our own limitations. And when we make a mistake, to correct it. Because I think the next line that I always use is, no other country in the world is so self-critical and is so willing to change course when we feel that we've strayed from our values or when we feel like we've been too arrogant. So I think -- I have not seen it as an apology tour at all, but rather a change of tone, a more humble America. But everybody knows we still have the big stick. Gates wants his job. He has turned into the politician now.. Bush started him down that rode, Obama tweaked him. I thought Bush made a good choice when he picked Gates. I thought Obama made a good choice by keeping him on. His skill is obvious in many ways but the fact that two different presidents from two different parties with two almost opposite viewpoints considered him the best man for the job should speak for itself. I was wondering how some people would twist these statements by Gates. It's pretty disapointing. My big issue with SecDef Gates has no real forward vision. His \"next war itis\" statement is proof of that. Most equipment and weapons we use today came from lessons learned and next war itis. Failure to envision all possible scenarios and become fixated on one or two could have catastrophic consequences in 10-20 years. And yes, it does seem that he becoming more of a politician and less SecDef.", 
        "reply": " Ridiculous. It is precisely his, \"forward vision\" that enables him to make these critical decisions with respect to weapons systems and military manning levels. How much complaining has the military done concerning his proposals? I think they're onboard. It's those politicians that see jobs in their districts going away that have issues.....not the actual warfighters. The politicans are more concerned about their poltical future than the nations security.", 
        "threadID": "409192893_5360066222001", 
        "time": "2009-05-08 10:33:00", 
        "title": "LETTER TO OUR PRESIDENT", 
        "userID": "WepsFP"
    }
]