[
    {
        "content": "Seeing as how there are those that are now in the majority that want to go back to the previous administration and examine their policies to see if there were any crimes commited, and then to prosecute, should every future administration follow the same policy? Just curious...", 
        "intTime": 20090514, 
        "postID": 1, 
        "quote": "", 
        "reply": "Seeing as how there are those that are now in the majority that want to go back to the previous administration and examine their policies to see if there were any crimes commited, and then to prosecute, should every future administration follow the same policy? Just curious...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-14 21:10:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "If crimes were committed, yes.", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "If crimes were committed, yes.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-15 04:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: If crimes were committed, yes. I think his point is, you don't know if crimes were committed until you INVESTIGATE, so using what you are saying tells me that we should go back and investigate each admin change. Correct? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "Originally posted by SeaWitch1220: If crimes were committed, yes.", 
        "reply": " I think his point is, you don't know if crimes were committed until you INVESTIGATE, so using what you are saying tells me that we should go back and investigate each admin change. Correct? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-15 08:15:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "L0A1"
    }, 
    {
        "content": "That is correct. If the next administration decides that there was criminal activity in the current one, so on and so forth...Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. So, if the next administration finds that laws were violated by the current, then the law must be enforced. This message has been edited. Last edited by: psychoABN, Mon 18 May 2009 06:43 PM", 
        "intTime": 20090517, 
        "postID": 4, 
        "quote": "", 
        "reply": "That is correct. If the next administration decides that there was criminal activity in the current one, so on and so forth...Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. So, if the next administration finds that laws were violated by the current, then the law must be enforced. This message has been edited. Last edited by: psychoABN, Mon 18 May 2009 06:43 PM", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-17 14:22:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Well then, I guess this only works one way...", 
        "intTime": 20090518, 
        "postID": 5, 
        "quote": "", 
        "reply": "Well then, I guess this only works one way...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:43:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "Originally posted by psychoABN: Well then, I guess this only works one way...", 
        "reply": " One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken. The instances that are given took place when those administrations were in office, not after the fact. It's always easy to be the Monday-morning quarterback, to second guess...", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "reply": " The instances that are given took place when those administrations were in office, not after the fact. It's always easy to be the Monday-morning quarterback, to second guess...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:56:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": ".Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances.", 
        "reply": " I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:04:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated? They did...", 
        "intTime": 20090518, 
        "postID": 9, 
        "quote": "Originally posted by karlhungusjr: quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "reply": " They did...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:12:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: They did... k. and?", 
        "intTime": 20090518, 
        "postID": 10, 
        "quote": "They did...", 
        "reply": " k. and?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:15:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "intTime": 20090518, 
        "postID": 11, 
        "quote": "Originally posted by karlhungusjr: quote: They did... k. and?", 
        "reply": " And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:30:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "intTime": 20090518, 
        "postID": 12, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "reply": " I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:06:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "intTime": 20090518, 
        "postID": 13, 
        "quote": "And...they folded under pressure.", 
        "reply": " and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:13:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something. Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree....", 
        "intTime": 20090518, 
        "postID": 14, 
        "quote": "Originally posted by karlhungusjr: quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "reply": " Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree....", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:21:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "intTime": 20090518, 
        "postID": 15, 
        "quote": "Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment.", 
        "reply": " What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:27:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "intTime": 20090518, 
        "postID": 16, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "reply": " Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:34:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "intTime": 20090518, 
        "postID": 17, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "reply": " It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:39:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob. I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. If you don't know how the bond market works, then you won't get it. When the company goes into bankruptcy, which Chrysler has done because the President ordered it, after already giving them a ton of our money(good business sense says to let it go to begin with, the company and the holding company has a contract to insure that the investors will take an agreed to loss. The bond holders were told that they were going to take a bigger loss, and like it, thus breaking the contract. We have yet to see if it will hold up in court, I'll bet if the judge is a Democrat, it's a no guesser.", 
        "intTime": 20090518, 
        "postID": 18, 
        "quote": "Originally posted by karlhungusjr: quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "reply": " I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. If you don't know how the bond market works, then you won't get it. When the company goes into bankruptcy, which Chrysler has done because the President ordered it, after already giving them a ton of our money(good business sense says to let it go to begin with, the company and the holding company has a contract to insure that the investors will take an agreed to loss. The bond holders were told that they were going to take a bigger loss, and like it, thus breaking the contract. We have yet to see if it will hold up in court, I'll bet if the judge is a Democrat, it's a no guesser.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:39:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? let me get this straight..... Your bank was doing just fine but Obama came in and had a personal meeting with the executives and forced them to take TARP money that they didn't need. And they took it only because they were scared of angry mobs that Obama was personally \"holding back\"? really?", 
        "intTime": 20090518, 
        "postID": 19, 
        "quote": "work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not?", 
        "reply": " let me get this straight..... Your bank was doing just fine but Obama came in and had a personal meeting with the executives and forced them to take TARP money that they didn't need. And they took it only because they were scared of angry mobs that Obama was personally \"holding back\"? really?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:40:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "intTime": 20090518, 
        "postID": 20, 
        "quote": "I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company.", 
        "reply": " Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:43:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "intTime": 20090518, 
        "postID": 21, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "reply": " I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "what bank do you work for? I only ask since this must be a very large bank.", 
        "intTime": 20090518, 
        "postID": 22, 
        "quote": "", 
        "reply": "what bank do you work for? I only ask since this must be a very large bank.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:48:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS. Well, as you said, since both parties agreed, no crime was commited, right? And the CEO of GM wasn't ran out by the President, either...The President didn't say that the government would guarantee automobile warranties...okay.", 
        "intTime": 20090518, 
        "postID": 23, 
        "quote": "Originally posted by karlhungusjr: quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "reply": " Well, as you said, since both parties agreed, no crime was commited, right? And the CEO of GM wasn't ran out by the President, either...The President didn't say that the government would guarantee automobile warranties...okay.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:48:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "This thread has gotten way off track. All I was asking is that, when future administrations come into office, if they deem actions of the previous administration to be \"criminal\", then it's okay to prosecute, and yes, of course, that would include the current administration receiving that consideration. That's the way things should be done now, Agreed?", 
        "intTime": 20090518, 
        "postID": 24, 
        "quote": "", 
        "reply": "This thread has gotten way off track. All I was asking is that, when future administrations come into office, if they deem actions of the previous administration to be \"criminal\", then it's okay to prosecute, and yes, of course, that would include the current administration receiving that consideration. That's the way things should be done now, Agreed?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:52:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "intTime": 20090518, 
        "postID": 25, 
        "quote": "Well, as you said, since both parties agreed, no crime was commited, right?", 
        "reply": " WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:53:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: what bank do you work for? I only ask since this must be a very large bank. It is, and there are several of those evil, evil \"Big Banks\".", 
        "intTime": 20090518, 
        "postID": 26, 
        "quote": "Originally posted by karlhungusjr: what bank do you work for? I only ask since this must be a very large bank.", 
        "reply": " It is, and there are several of those evil, evil \"Big Banks\".", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:54:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "yes if there is a crime then they should be prosecuted. No, the deal with the auto makers is in no way shape or form a crime.", 
        "intTime": 20090518, 
        "postID": 27, 
        "quote": "", 
        "reply": "yes if there is a crime then they should be prosecuted. No, the deal with the auto makers is in no way shape or form a crime.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:55:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back. Then explain how this happened: \"Wells Fargo parent company of Charlotte, N.C.-based Wachovia Corp., will pay a quarterly dividend of $312.5 million to the U.S. Treasury on the 25,000 shares of preferred stock it purchased under the Troubled Asset Relief Program. The dividend is payable Friday. To date, San Francisco-based Wells (NYSE: WFC) has received $25 billion under the TARP initiative, which is designed to thaw the credit markets and boost the economy. “Since last October when Wells Fargo received this investment from the U.S. Treasury, Wells Fargo has extended more than $225 billion of credit to U.S. consumers and businesses,” said Howard Atkins, chief financial officer. “In the first quarter alone, we originated $101 billion in home mortgages helping 450,000 customers finance a mortgage — almost double the number of customers who did so with us the previous quarter.” >http://www.bizjournals.com/birmingham/stories/2009/05/11/daily40.html Perhaps your bank failed the stress test?", 
        "intTime": 20090518, 
        "postID": 28, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "reply": " Then explain how this happened: \"Wells Fargo parent company of Charlotte, N.C.-based Wachovia Corp., will pay a quarterly dividend of $312.5 million to the U.S. Treasury on the 25,000 shares of preferred stock it purchased under the Troubled Asset Relief Program. The dividend is payable Friday. To date, San Francisco-based Wells (NYSE: WFC) has received $25 billion under the TARP initiative, which is designed to thaw the credit markets and boost the economy. “Since last October when Wells Fargo received this investment from the U.S. Treasury, Wells Fargo has extended more than $225 billion of credit to U.S. consumers and businesses,” said Howard Atkins, chief financial officer. “In the first quarter alone, we originated $101 billion in home mortgages helping 450,000 customers finance a mortgage — almost double the number of customers who did so with us the previous quarter.” >http://www.bizjournals.com/birmingham/stories/2009/05/11/daily40.html Perhaps your bank failed the stress test?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:56:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and? Why would the President of the United States guarantee vehicle warranties? That's usually the CEO's job. Please read my post above, I gave an example of something \"shady\", who said that there actually was a crime. If the next administration comes in and says that there was criminal activity, let's just say that it involved the Chrysler contracts,then it's okay for them to prosecute, wouldn't you agree?", 
        "intTime": 20090518, 
        "postID": 29, 
        "quote": "Originally posted by karlhungusjr: quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "reply": " Why would the President of the United States guarantee vehicle warranties? That's usually the CEO's job. Please read my post above, I gave an example of something \"shady\", who said that there actually was a crime. If the next administration comes in and says that there was criminal activity, let's just say that it involved the Chrysler contracts,then it's okay for them to prosecute, wouldn't you agree?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:57:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: It is, and there are several of those evil, evil \"Big Banks\". can you say which one? because somehow I have a feeling Obama didn't hold a personal meeting with the exec's of your bank, nor do i believe the exec's personally informed you that Obama was all the was keeping the mobs with pitchforks away.", 
        "intTime": 20090518, 
        "postID": 30, 
        "quote": "It is, and there are several of those evil, evil \"Big Banks\".", 
        "reply": " can you say which one? because somehow I have a feeling Obama didn't hold a personal meeting with the exec's of your bank, nor do i believe the exec's personally informed you that Obama was all the was keeping the mobs with pitchforks away.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:57:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Seeing as how there are those that are now in the majority that want to go back to the previous administration and examine their policies to see if there were any crimes commited, and then to prosecute, should every future administration follow the same policy? Just curious...", 
        "intTime": 20090514, 
        "postID": 31, 
        "quote": "", 
        "reply": "Seeing as how there are those that are now in the majority that want to go back to the previous administration and examine their policies to see if there were any crimes commited, and then to prosecute, should every future administration follow the same policy? Just curious...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-14 21:10:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "If crimes were committed, yes.", 
        "intTime": 20090515, 
        "postID": 32, 
        "quote": "", 
        "reply": "If crimes were committed, yes.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-15 04:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: If crimes were committed, yes. I think his point is, you don't know if crimes were committed until you INVESTIGATE, so using what you are saying tells me that we should go back and investigate each admin change. Correct? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 33, 
        "quote": "Originally posted by SeaWitch1220: If crimes were committed, yes.", 
        "reply": " I think his point is, you don't know if crimes were committed until you INVESTIGATE, so using what you are saying tells me that we should go back and investigate each admin change. Correct? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-15 08:15:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "L0A1"
    }, 
    {
        "content": "That is correct. If the next administration decides that there was criminal activity in the current one, so on and so forth...Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. So, if the next administration finds that laws were violated by the current, then the law must be enforced. This message has been edited. Last edited by: psychoABN, Mon 18 May 2009 06:43 PM", 
        "intTime": 20090517, 
        "postID": 34, 
        "quote": "", 
        "reply": "That is correct. If the next administration decides that there was criminal activity in the current one, so on and so forth...Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. So, if the next administration finds that laws were violated by the current, then the law must be enforced. This message has been edited. Last edited by: psychoABN, Mon 18 May 2009 06:43 PM", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-17 14:22:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Well then, I guess this only works one way...", 
        "intTime": 20090518, 
        "postID": 35, 
        "quote": "", 
        "reply": "Well then, I guess this only works one way...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:43:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "intTime": 20090518, 
        "postID": 36, 
        "quote": "Originally posted by psychoABN: Well then, I guess this only works one way...", 
        "reply": " One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken. The instances that are given took place when those administrations were in office, not after the fact. It's always easy to be the Monday-morning quarterback, to second guess...", 
        "intTime": 20090518, 
        "postID": 37, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "reply": " The instances that are given took place when those administrations were in office, not after the fact. It's always easy to be the Monday-morning quarterback, to second guess...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:56:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "intTime": 20090518, 
        "postID": 38, 
        "quote": ".Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances.", 
        "reply": " I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:04:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated? They did...", 
        "intTime": 20090518, 
        "postID": 39, 
        "quote": "Originally posted by karlhungusjr: quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "reply": " They did...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:12:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: They did... k. and?", 
        "intTime": 20090518, 
        "postID": 40, 
        "quote": "They did...", 
        "reply": " k. and?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:15:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "intTime": 20090518, 
        "postID": 41, 
        "quote": "Originally posted by karlhungusjr: quote: They did... k. and?", 
        "reply": " And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:30:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "intTime": 20090518, 
        "postID": 42, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "reply": " I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:06:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "intTime": 20090518, 
        "postID": 43, 
        "quote": "And...they folded under pressure.", 
        "reply": " and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:13:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something. Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree....", 
        "intTime": 20090518, 
        "postID": 44, 
        "quote": "Originally posted by karlhungusjr: quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "reply": " Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree....", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:21:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "intTime": 20090518, 
        "postID": 45, 
        "quote": "Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment.", 
        "reply": " What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:27:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "intTime": 20090518, 
        "postID": 46, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "reply": " Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:34:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "intTime": 20090518, 
        "postID": 47, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "reply": " It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:39:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob. I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. If you don't know how the bond market works, then you won't get it. When the company goes into bankruptcy, which Chrysler has done because the President ordered it, after already giving them a ton of our money(good business sense says to let it go to begin with, the company and the holding company has a contract to insure that the investors will take an agreed to loss. The bond holders were told that they were going to take a bigger loss, and like it, thus breaking the contract. We have yet to see if it will hold up in court, I'll bet if the judge is a Democrat, it's a no guesser.", 
        "intTime": 20090518, 
        "postID": 48, 
        "quote": "Originally posted by karlhungusjr: quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "reply": " I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. If you don't know how the bond market works, then you won't get it. When the company goes into bankruptcy, which Chrysler has done because the President ordered it, after already giving them a ton of our money(good business sense says to let it go to begin with, the company and the holding company has a contract to insure that the investors will take an agreed to loss. The bond holders were told that they were going to take a bigger loss, and like it, thus breaking the contract. We have yet to see if it will hold up in court, I'll bet if the judge is a Democrat, it's a no guesser.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:39:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? let me get this straight..... Your bank was doing just fine but Obama came in and had a personal meeting with the executives and forced them to take TARP money that they didn't need. And they took it only because they were scared of angry mobs that Obama was personally \"holding back\"? really?", 
        "intTime": 20090518, 
        "postID": 49, 
        "quote": "work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not?", 
        "reply": " let me get this straight..... Your bank was doing just fine but Obama came in and had a personal meeting with the executives and forced them to take TARP money that they didn't need. And they took it only because they were scared of angry mobs that Obama was personally \"holding back\"? really?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:40:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "intTime": 20090518, 
        "postID": 50, 
        "quote": "I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company.", 
        "reply": " Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:43:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "intTime": 20090518, 
        "postID": 51, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "reply": " I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "what bank do you work for? I only ask since this must be a very large bank.", 
        "intTime": 20090518, 
        "postID": 52, 
        "quote": "", 
        "reply": "what bank do you work for? I only ask since this must be a very large bank.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:48:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS. Well, as you said, since both parties agreed, no crime was commited, right? And the CEO of GM wasn't ran out by the President, either...The President didn't say that the government would guarantee automobile warranties...okay.", 
        "intTime": 20090518, 
        "postID": 53, 
        "quote": "Originally posted by karlhungusjr: quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "reply": " Well, as you said, since both parties agreed, no crime was commited, right? And the CEO of GM wasn't ran out by the President, either...The President didn't say that the government would guarantee automobile warranties...okay.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:48:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "This thread has gotten way off track. All I was asking is that, when future administrations come into office, if they deem actions of the previous administration to be \"criminal\", then it's okay to prosecute, and yes, of course, that would include the current administration receiving that consideration. That's the way things should be done now, Agreed?", 
        "intTime": 20090518, 
        "postID": 54, 
        "quote": "", 
        "reply": "This thread has gotten way off track. All I was asking is that, when future administrations come into office, if they deem actions of the previous administration to be \"criminal\", then it's okay to prosecute, and yes, of course, that would include the current administration receiving that consideration. That's the way things should be done now, Agreed?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:52:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "intTime": 20090518, 
        "postID": 55, 
        "quote": "Well, as you said, since both parties agreed, no crime was commited, right?", 
        "reply": " WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:53:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: what bank do you work for? I only ask since this must be a very large bank. It is, and there are several of those evil, evil \"Big Banks\".", 
        "intTime": 20090518, 
        "postID": 56, 
        "quote": "Originally posted by karlhungusjr: what bank do you work for? I only ask since this must be a very large bank.", 
        "reply": " It is, and there are several of those evil, evil \"Big Banks\".", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:54:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "yes if there is a crime then they should be prosecuted. No, the deal with the auto makers is in no way shape or form a crime.", 
        "intTime": 20090518, 
        "postID": 57, 
        "quote": "", 
        "reply": "yes if there is a crime then they should be prosecuted. No, the deal with the auto makers is in no way shape or form a crime.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:55:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back. Then explain how this happened: \"Wells Fargo parent company of Charlotte, N.C.-based Wachovia Corp., will pay a quarterly dividend of $312.5 million to the U.S. Treasury on the 25,000 shares of preferred stock it purchased under the Troubled Asset Relief Program. The dividend is payable Friday. To date, San Francisco-based Wells (NYSE: WFC) has received $25 billion under the TARP initiative, which is designed to thaw the credit markets and boost the economy. “Since last October when Wells Fargo received this investment from the U.S. Treasury, Wells Fargo has extended more than $225 billion of credit to U.S. consumers and businesses,” said Howard Atkins, chief financial officer. “In the first quarter alone, we originated $101 billion in home mortgages helping 450,000 customers finance a mortgage — almost double the number of customers who did so with us the previous quarter.” >http://www.bizjournals.com/birmingham/stories/2009/05/11/daily40.html Perhaps your bank failed the stress test?", 
        "intTime": 20090518, 
        "postID": 58, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "reply": " Then explain how this happened: \"Wells Fargo parent company of Charlotte, N.C.-based Wachovia Corp., will pay a quarterly dividend of $312.5 million to the U.S. Treasury on the 25,000 shares of preferred stock it purchased under the Troubled Asset Relief Program. The dividend is payable Friday. To date, San Francisco-based Wells (NYSE: WFC) has received $25 billion under the TARP initiative, which is designed to thaw the credit markets and boost the economy. “Since last October when Wells Fargo received this investment from the U.S. Treasury, Wells Fargo has extended more than $225 billion of credit to U.S. consumers and businesses,” said Howard Atkins, chief financial officer. “In the first quarter alone, we originated $101 billion in home mortgages helping 450,000 customers finance a mortgage — almost double the number of customers who did so with us the previous quarter.” >http://www.bizjournals.com/birmingham/stories/2009/05/11/daily40.html Perhaps your bank failed the stress test?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:56:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and? Why would the President of the United States guarantee vehicle warranties? That's usually the CEO's job. Please read my post above, I gave an example of something \"shady\", who said that there actually was a crime. If the next administration comes in and says that there was criminal activity, let's just say that it involved the Chrysler contracts,then it's okay for them to prosecute, wouldn't you agree?", 
        "intTime": 20090518, 
        "postID": 59, 
        "quote": "Originally posted by karlhungusjr: quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "reply": " Why would the President of the United States guarantee vehicle warranties? That's usually the CEO's job. Please read my post above, I gave an example of something \"shady\", who said that there actually was a crime. If the next administration comes in and says that there was criminal activity, let's just say that it involved the Chrysler contracts,then it's okay for them to prosecute, wouldn't you agree?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:57:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: It is, and there are several of those evil, evil \"Big Banks\". can you say which one? because somehow I have a feeling Obama didn't hold a personal meeting with the exec's of your bank, nor do i believe the exec's personally informed you that Obama was all the was keeping the mobs with pitchforks away.", 
        "intTime": 20090518, 
        "postID": 60, 
        "quote": "It is, and there are several of those evil, evil \"Big Banks\".", 
        "reply": " can you say which one? because somehow I have a feeling Obama didn't hold a personal meeting with the exec's of your bank, nor do i believe the exec's personally informed you that Obama was all the was keeping the mobs with pitchforks away.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:57:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Seeing as how there are those that are now in the majority that want to go back to the previous administration and examine their policies to see if there were any crimes commited, and then to prosecute, should every future administration follow the same policy? Just curious...", 
        "intTime": 20090514, 
        "postID": 61, 
        "quote": "", 
        "reply": "Seeing as how there are those that are now in the majority that want to go back to the previous administration and examine their policies to see if there were any crimes commited, and then to prosecute, should every future administration follow the same policy? Just curious...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-14 21:10:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "If crimes were committed, yes.", 
        "intTime": 20090515, 
        "postID": 62, 
        "quote": "", 
        "reply": "If crimes were committed, yes.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-15 04:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: If crimes were committed, yes. I think his point is, you don't know if crimes were committed until you INVESTIGATE, so using what you are saying tells me that we should go back and investigate each admin change. Correct? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 63, 
        "quote": "Originally posted by SeaWitch1220: If crimes were committed, yes.", 
        "reply": " I think his point is, you don't know if crimes were committed until you INVESTIGATE, so using what you are saying tells me that we should go back and investigate each admin change. Correct? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-15 08:15:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "L0A1"
    }, 
    {
        "content": "That is correct. If the next administration decides that there was criminal activity in the current one, so on and so forth...Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. So, if the next administration finds that laws were violated by the current, then the law must be enforced. This message has been edited. Last edited by: psychoABN, Mon 18 May 2009 06:43 PM", 
        "intTime": 20090517, 
        "postID": 64, 
        "quote": "", 
        "reply": "That is correct. If the next administration decides that there was criminal activity in the current one, so on and so forth...Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. So, if the next administration finds that laws were violated by the current, then the law must be enforced. This message has been edited. Last edited by: psychoABN, Mon 18 May 2009 06:43 PM", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-17 14:22:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Well then, I guess this only works one way...", 
        "intTime": 20090518, 
        "postID": 65, 
        "quote": "", 
        "reply": "Well then, I guess this only works one way...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:43:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "intTime": 20090518, 
        "postID": 66, 
        "quote": "Originally posted by psychoABN: Well then, I guess this only works one way...", 
        "reply": " One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken. The instances that are given took place when those administrations were in office, not after the fact. It's always easy to be the Monday-morning quarterback, to second guess...", 
        "intTime": 20090518, 
        "postID": 67, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "reply": " The instances that are given took place when those administrations were in office, not after the fact. It's always easy to be the Monday-morning quarterback, to second guess...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:56:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "intTime": 20090518, 
        "postID": 68, 
        "quote": ".Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances.", 
        "reply": " I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:04:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated? They did...", 
        "intTime": 20090518, 
        "postID": 69, 
        "quote": "Originally posted by karlhungusjr: quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "reply": " They did...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:12:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: They did... k. and?", 
        "intTime": 20090518, 
        "postID": 70, 
        "quote": "They did...", 
        "reply": " k. and?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:15:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "intTime": 20090518, 
        "postID": 71, 
        "quote": "Originally posted by karlhungusjr: quote: They did... k. and?", 
        "reply": " And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:30:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "intTime": 20090518, 
        "postID": 72, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "reply": " I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:06:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "intTime": 20090518, 
        "postID": 73, 
        "quote": "And...they folded under pressure.", 
        "reply": " and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:13:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something. Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree....", 
        "intTime": 20090518, 
        "postID": 74, 
        "quote": "Originally posted by karlhungusjr: quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "reply": " Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree....", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:21:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "intTime": 20090518, 
        "postID": 75, 
        "quote": "Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment.", 
        "reply": " What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:27:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "intTime": 20090518, 
        "postID": 76, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "reply": " Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:34:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "intTime": 20090518, 
        "postID": 77, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "reply": " It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:39:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob. I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. If you don't know how the bond market works, then you won't get it. When the company goes into bankruptcy, which Chrysler has done because the President ordered it, after already giving them a ton of our money(good business sense says to let it go to begin with, the company and the holding company has a contract to insure that the investors will take an agreed to loss. The bond holders were told that they were going to take a bigger loss, and like it, thus breaking the contract. We have yet to see if it will hold up in court, I'll bet if the judge is a Democrat, it's a no guesser.", 
        "intTime": 20090518, 
        "postID": 78, 
        "quote": "Originally posted by karlhungusjr: quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "reply": " I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. If you don't know how the bond market works, then you won't get it. When the company goes into bankruptcy, which Chrysler has done because the President ordered it, after already giving them a ton of our money(good business sense says to let it go to begin with, the company and the holding company has a contract to insure that the investors will take an agreed to loss. The bond holders were told that they were going to take a bigger loss, and like it, thus breaking the contract. We have yet to see if it will hold up in court, I'll bet if the judge is a Democrat, it's a no guesser.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:39:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? let me get this straight..... Your bank was doing just fine but Obama came in and had a personal meeting with the executives and forced them to take TARP money that they didn't need. And they took it only because they were scared of angry mobs that Obama was personally \"holding back\"? really?", 
        "intTime": 20090518, 
        "postID": 79, 
        "quote": "work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not?", 
        "reply": " let me get this straight..... Your bank was doing just fine but Obama came in and had a personal meeting with the executives and forced them to take TARP money that they didn't need. And they took it only because they were scared of angry mobs that Obama was personally \"holding back\"? really?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:40:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "intTime": 20090518, 
        "postID": 80, 
        "quote": "I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company.", 
        "reply": " Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:43:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "intTime": 20090518, 
        "postID": 81, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "reply": " I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "what bank do you work for? I only ask since this must be a very large bank.", 
        "intTime": 20090518, 
        "postID": 82, 
        "quote": "", 
        "reply": "what bank do you work for? I only ask since this must be a very large bank.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:48:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS. Well, as you said, since both parties agreed, no crime was commited, right? And the CEO of GM wasn't ran out by the President, either...The President didn't say that the government would guarantee automobile warranties...okay.", 
        "intTime": 20090518, 
        "postID": 83, 
        "quote": "Originally posted by karlhungusjr: quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "reply": " Well, as you said, since both parties agreed, no crime was commited, right? And the CEO of GM wasn't ran out by the President, either...The President didn't say that the government would guarantee automobile warranties...okay.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:48:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "This thread has gotten way off track. All I was asking is that, when future administrations come into office, if they deem actions of the previous administration to be \"criminal\", then it's okay to prosecute, and yes, of course, that would include the current administration receiving that consideration. That's the way things should be done now, Agreed?", 
        "intTime": 20090518, 
        "postID": 84, 
        "quote": "", 
        "reply": "This thread has gotten way off track. All I was asking is that, when future administrations come into office, if they deem actions of the previous administration to be \"criminal\", then it's okay to prosecute, and yes, of course, that would include the current administration receiving that consideration. That's the way things should be done now, Agreed?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:52:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "intTime": 20090518, 
        "postID": 85, 
        "quote": "Well, as you said, since both parties agreed, no crime was commited, right?", 
        "reply": " WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:53:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: what bank do you work for? I only ask since this must be a very large bank. It is, and there are several of those evil, evil \"Big Banks\".", 
        "intTime": 20090518, 
        "postID": 86, 
        "quote": "Originally posted by karlhungusjr: what bank do you work for? I only ask since this must be a very large bank.", 
        "reply": " It is, and there are several of those evil, evil \"Big Banks\".", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:54:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "yes if there is a crime then they should be prosecuted. No, the deal with the auto makers is in no way shape or form a crime.", 
        "intTime": 20090518, 
        "postID": 87, 
        "quote": "", 
        "reply": "yes if there is a crime then they should be prosecuted. No, the deal with the auto makers is in no way shape or form a crime.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:55:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back. Then explain how this happened: \"Wells Fargo parent company of Charlotte, N.C.-based Wachovia Corp., will pay a quarterly dividend of $312.5 million to the U.S. Treasury on the 25,000 shares of preferred stock it purchased under the Troubled Asset Relief Program. The dividend is payable Friday. To date, San Francisco-based Wells (NYSE: WFC) has received $25 billion under the TARP initiative, which is designed to thaw the credit markets and boost the economy. “Since last October when Wells Fargo received this investment from the U.S. Treasury, Wells Fargo has extended more than $225 billion of credit to U.S. consumers and businesses,” said Howard Atkins, chief financial officer. “In the first quarter alone, we originated $101 billion in home mortgages helping 450,000 customers finance a mortgage — almost double the number of customers who did so with us the previous quarter.” >http://www.bizjournals.com/birmingham/stories/2009/05/11/daily40.html Perhaps your bank failed the stress test?", 
        "intTime": 20090518, 
        "postID": 88, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "reply": " Then explain how this happened: \"Wells Fargo parent company of Charlotte, N.C.-based Wachovia Corp., will pay a quarterly dividend of $312.5 million to the U.S. Treasury on the 25,000 shares of preferred stock it purchased under the Troubled Asset Relief Program. The dividend is payable Friday. To date, San Francisco-based Wells (NYSE: WFC) has received $25 billion under the TARP initiative, which is designed to thaw the credit markets and boost the economy. “Since last October when Wells Fargo received this investment from the U.S. Treasury, Wells Fargo has extended more than $225 billion of credit to U.S. consumers and businesses,” said Howard Atkins, chief financial officer. “In the first quarter alone, we originated $101 billion in home mortgages helping 450,000 customers finance a mortgage — almost double the number of customers who did so with us the previous quarter.” >http://www.bizjournals.com/birmingham/stories/2009/05/11/daily40.html Perhaps your bank failed the stress test?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:56:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and? Why would the President of the United States guarantee vehicle warranties? That's usually the CEO's job. Please read my post above, I gave an example of something \"shady\", who said that there actually was a crime. If the next administration comes in and says that there was criminal activity, let's just say that it involved the Chrysler contracts,then it's okay for them to prosecute, wouldn't you agree?", 
        "intTime": 20090518, 
        "postID": 89, 
        "quote": "Originally posted by karlhungusjr: quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "reply": " Why would the President of the United States guarantee vehicle warranties? That's usually the CEO's job. Please read my post above, I gave an example of something \"shady\", who said that there actually was a crime. If the next administration comes in and says that there was criminal activity, let's just say that it involved the Chrysler contracts,then it's okay for them to prosecute, wouldn't you agree?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:57:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: It is, and there are several of those evil, evil \"Big Banks\". can you say which one? because somehow I have a feeling Obama didn't hold a personal meeting with the exec's of your bank, nor do i believe the exec's personally informed you that Obama was all the was keeping the mobs with pitchforks away.", 
        "intTime": 20090518, 
        "postID": 90, 
        "quote": "It is, and there are several of those evil, evil \"Big Banks\".", 
        "reply": " can you say which one? because somehow I have a feeling Obama didn't hold a personal meeting with the exec's of your bank, nor do i believe the exec's personally informed you that Obama was all the was keeping the mobs with pitchforks away.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:57:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Seeing as how there are those that are now in the majority that want to go back to the previous administration and examine their policies to see if there were any crimes commited, and then to prosecute, should every future administration follow the same policy? Just curious...", 
        "intTime": 20090514, 
        "postID": 91, 
        "quote": "", 
        "reply": "Seeing as how there are those that are now in the majority that want to go back to the previous administration and examine their policies to see if there were any crimes commited, and then to prosecute, should every future administration follow the same policy? Just curious...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-14 21:10:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "If crimes were committed, yes.", 
        "intTime": 20090515, 
        "postID": 92, 
        "quote": "", 
        "reply": "If crimes were committed, yes.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-15 04:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: If crimes were committed, yes. I think his point is, you don't know if crimes were committed until you INVESTIGATE, so using what you are saying tells me that we should go back and investigate each admin change. Correct? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 93, 
        "quote": "Originally posted by SeaWitch1220: If crimes were committed, yes.", 
        "reply": " I think his point is, you don't know if crimes were committed until you INVESTIGATE, so using what you are saying tells me that we should go back and investigate each admin change. Correct? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-15 08:15:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "L0A1"
    }, 
    {
        "content": "That is correct. If the next administration decides that there was criminal activity in the current one, so on and so forth...Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. So, if the next administration finds that laws were violated by the current, then the law must be enforced. This message has been edited. Last edited by: psychoABN, Mon 18 May 2009 06:43 PM", 
        "intTime": 20090517, 
        "postID": 94, 
        "quote": "", 
        "reply": "That is correct. If the next administration decides that there was criminal activity in the current one, so on and so forth...Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. So, if the next administration finds that laws were violated by the current, then the law must be enforced. This message has been edited. Last edited by: psychoABN, Mon 18 May 2009 06:43 PM", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-17 14:22:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "Well then, I guess this only works one way...", 
        "intTime": 20090518, 
        "postID": 95, 
        "quote": "", 
        "reply": "Well then, I guess this only works one way...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:43:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "intTime": 20090518, 
        "postID": 96, 
        "quote": "Originally posted by psychoABN: Well then, I guess this only works one way...", 
        "reply": " One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken. The instances that are given took place when those administrations were in office, not after the fact. It's always easy to be the Monday-morning quarterback, to second guess...", 
        "intTime": 20090518, 
        "postID": 97, 
        "quote": "Originally posted by DMarkUhler: quote: Originally posted by psychoABN: Well then, I guess this only works one way... One way? How so? A Cunningham and Jefferson...Clinton and Nixon. Seems the fact that matters the most is if a law has been broken.", 
        "reply": " The instances that are given took place when those administrations were in office, not after the fact. It's always easy to be the Monday-morning quarterback, to second guess...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 18:56:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "intTime": 20090518, 
        "postID": 98, 
        "quote": ".Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances.", 
        "reply": " I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:04:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated? They did...", 
        "intTime": 20090518, 
        "postID": 99, 
        "quote": "Originally posted by karlhungusjr: quote: .Ther reason I'm asking is that I know some lawyers that say the current adminstration is violating several contract laws with regard to Chrysler, and in a few other instances. I also know of several people who think The President is a secret muslim. how ever...when it comes to contract laws being broken, don't you think Chrysler has the lawyers to handle that? don't you think they would be the ones to say something if they felt their contracts were being illegally violated?", 
        "reply": " They did...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:12:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: They did... k. and?", 
        "intTime": 20090518, 
        "postID": 100, 
        "quote": "They did...", 
        "reply": " k. and?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:15:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "intTime": 20090518, 
        "postID": 101, 
        "quote": "Originally posted by karlhungusjr: quote: They did... k. and?", 
        "reply": " And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 19:30:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "intTime": 20090518, 
        "postID": 102, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House.", 
        "reply": " I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:06:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "intTime": 20090518, 
        "postID": 103, 
        "quote": "And...they folded under pressure.", 
        "reply": " and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:13:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something. Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree....", 
        "intTime": 20090518, 
        "postID": 104, 
        "quote": "Originally posted by karlhungusjr: quote: And...they folded under pressure. and thats a crime? quote: The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. what \"hit\" from the white house? The auto makers went to the gov. asking for a bail out. The Gov. didn't go to them and force them to do anything. There is no crime when both parties agree to something.", 
        "reply": " Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree....", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:21:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "intTime": 20090518, 
        "postID": 105, 
        "quote": "Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment.", 
        "reply": " What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:27:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "intTime": 20090518, 
        "postID": 106, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said.", 
        "reply": " Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:34:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "intTime": 20090518, 
        "postID": 107, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press...", 
        "reply": " It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:39:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob. I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. If you don't know how the bond market works, then you won't get it. When the company goes into bankruptcy, which Chrysler has done because the President ordered it, after already giving them a ton of our money(good business sense says to let it go to begin with, the company and the holding company has a contract to insure that the investors will take an agreed to loss. The bond holders were told that they were going to take a bigger loss, and like it, thus breaking the contract. We have yet to see if it will hold up in court, I'll bet if the judge is a Democrat, it's a no guesser.", 
        "intTime": 20090518, 
        "postID": 108, 
        "quote": "Originally posted by karlhungusjr: quote: Let me spell it out for you.... T-h-e l-a-w-y-e-r-s r-e-p-r-e-s-e-n-t-e-d t-h-e b-o-n-d h-o-l-d-e-r-s i-n t-h-e b-a-n-k-r-u-p-t-c-y p-r-o-c-e-e-d-i-n-g-s. They represented bond holders that had invested in the company, with a contract in place to protect the investment. What crime was committed? quote: So, if a john goes to a hooker, and they both agree on price and services, then there is no crime...Same for drug deals, right? I mean, both parties agree on product and price. When the mob goes in to collect protection money, there is no crime...because the business owner agrees to pay so he doesn't get his legs broken. No crime there...both parties agree.... false analogy is false. The examples you used were illegal activities already. lawyers negotiating with the entity who they requested a bail out from is not the same as hookers and the mob.", 
        "reply": " I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. If you don't know how the bond market works, then you won't get it. When the company goes into bankruptcy, which Chrysler has done because the President ordered it, after already giving them a ton of our money(good business sense says to let it go to begin with, the company and the holding company has a contract to insure that the investors will take an agreed to loss. The bond holders were told that they were going to take a bigger loss, and like it, thus breaking the contract. We have yet to see if it will hold up in court, I'll bet if the judge is a Democrat, it's a no guesser.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:39:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? let me get this straight..... Your bank was doing just fine but Obama came in and had a personal meeting with the executives and forced them to take TARP money that they didn't need. And they took it only because they were scared of angry mobs that Obama was personally \"holding back\"? really?", 
        "intTime": 20090518, 
        "postID": 109, 
        "quote": "work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not?", 
        "reply": " let me get this straight..... Your bank was doing just fine but Obama came in and had a personal meeting with the executives and forced them to take TARP money that they didn't need. And they took it only because they were scared of angry mobs that Obama was personally \"holding back\"? really?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:40:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "intTime": 20090518, 
        "postID": 110, 
        "quote": "I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company.", 
        "reply": " Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:43:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "intTime": 20090518, 
        "postID": 111, 
        "quote": "Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place?", 
        "reply": " I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:45:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "what bank do you work for? I only ask since this must be a very large bank.", 
        "intTime": 20090518, 
        "postID": 112, 
        "quote": "", 
        "reply": "what bank do you work for? I only ask since this must be a very large bank.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:48:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS. Well, as you said, since both parties agreed, no crime was commited, right? And the CEO of GM wasn't ran out by the President, either...The President didn't say that the government would guarantee automobile warranties...okay.", 
        "intTime": 20090518, 
        "postID": 113, 
        "quote": "Originally posted by karlhungusjr: quote: I'll try this one more time, the lawyers weren't representing the company requesting a bailout, they were representing bond holders that had invested in the company. Yes. I know that. Now I'll ask one more time...what crime was committed? quote: When the company goes into bankruptcy, which Chrysler has done because the President ordered it The president didn't order Chrysler into bankruptcy. That's 100% BS.", 
        "reply": " Well, as you said, since both parties agreed, no crime was commited, right? And the CEO of GM wasn't ran out by the President, either...The President didn't say that the government would guarantee automobile warranties...okay.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:48:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "This thread has gotten way off track. All I was asking is that, when future administrations come into office, if they deem actions of the previous administration to be \"criminal\", then it's okay to prosecute, and yes, of course, that would include the current administration receiving that consideration. That's the way things should be done now, Agreed?", 
        "intTime": 20090518, 
        "postID": 114, 
        "quote": "", 
        "reply": "This thread has gotten way off track. All I was asking is that, when future administrations come into office, if they deem actions of the previous administration to be \"criminal\", then it's okay to prosecute, and yes, of course, that would include the current administration receiving that consideration. That's the way things should be done now, Agreed?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:52:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "intTime": 20090518, 
        "postID": 115, 
        "quote": "Well, as you said, since both parties agreed, no crime was commited, right?", 
        "reply": " WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:53:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: what bank do you work for? I only ask since this must be a very large bank. It is, and there are several of those evil, evil \"Big Banks\".", 
        "intTime": 20090518, 
        "postID": 116, 
        "quote": "Originally posted by karlhungusjr: what bank do you work for? I only ask since this must be a very large bank.", 
        "reply": " It is, and there are several of those evil, evil \"Big Banks\".", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:54:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "yes if there is a crime then they should be prosecuted. No, the deal with the auto makers is in no way shape or form a crime.", 
        "intTime": 20090518, 
        "postID": 117, 
        "quote": "", 
        "reply": "yes if there is a crime then they should be prosecuted. No, the deal with the auto makers is in no way shape or form a crime.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:55:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back. Then explain how this happened: \"Wells Fargo parent company of Charlotte, N.C.-based Wachovia Corp., will pay a quarterly dividend of $312.5 million to the U.S. Treasury on the 25,000 shares of preferred stock it purchased under the Troubled Asset Relief Program. The dividend is payable Friday. To date, San Francisco-based Wells (NYSE: WFC) has received $25 billion under the TARP initiative, which is designed to thaw the credit markets and boost the economy. “Since last October when Wells Fargo received this investment from the U.S. Treasury, Wells Fargo has extended more than $225 billion of credit to U.S. consumers and businesses,” said Howard Atkins, chief financial officer. “In the first quarter alone, we originated $101 billion in home mortgages helping 450,000 customers finance a mortgage — almost double the number of customers who did so with us the previous quarter.” >http://www.bizjournals.com/birmingham/stories/2009/05/11/daily40.html Perhaps your bank failed the stress test?", 
        "intTime": 20090518, 
        "postID": 118, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by Thud357L: quote: Originally posted by psychoABN: quote: Originally posted by karlhungusjr: quote: They did... k. and? And...they folded under pressure. They didn't want to endure the same fate as AIG executives that received death threats and had protesters show up at their houses. The lawyers represented bond holders, not Chrysler. The bond holders decided to take the hit on the money as opposed to taking the hit from the White House. I think you have jumped to many conclusions Airborne. I think it would be difficult to illustrate what you have said. Difficult to illustrate? I work for a bank, and when our executives went in for a \"conference\" with President Obama, they were told that he was \"the only thing standing between them and the pitchforks..\" We want to pay back the TARP money, hell, we didn't need it to begin with, but Sec. Geitner won't allow us to pay it back. Why not? We have the money. Look at what happened to the AIG executives...I guess it's okay to get death threats and have protesters disrupt family functions based on your career choice, as a result of your name and personal information being leaked to the press... It appears you are a victim of self-serving hyperbole. If your bank didn't need the money then why did it take it in the first place? I'm a victim of nothing. The banks were told that they all had to take the money. The Treasury and the Federal Reserve were afraid that there would be a run on the banks if only those in trouble took the money. All of the larger banks took the money, there was no choice in the matter. When this took place, it was considered a loan, then when the current administration came in, they converted it to prefered stock, and now they plan to convert it to common stock, which is why the money isn't going to be allowed to be paid back.", 
        "reply": " Then explain how this happened: \"Wells Fargo parent company of Charlotte, N.C.-based Wachovia Corp., will pay a quarterly dividend of $312.5 million to the U.S. Treasury on the 25,000 shares of preferred stock it purchased under the Troubled Asset Relief Program. The dividend is payable Friday. To date, San Francisco-based Wells (NYSE: WFC) has received $25 billion under the TARP initiative, which is designed to thaw the credit markets and boost the economy. “Since last October when Wells Fargo received this investment from the U.S. Treasury, Wells Fargo has extended more than $225 billion of credit to U.S. consumers and businesses,” said Howard Atkins, chief financial officer. “In the first quarter alone, we originated $101 billion in home mortgages helping 450,000 customers finance a mortgage — almost double the number of customers who did so with us the previous quarter.” >http://www.bizjournals.com/birmingham/stories/2009/05/11/daily40.html Perhaps your bank failed the stress test?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:56:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and? Why would the President of the United States guarantee vehicle warranties? That's usually the CEO's job. Please read my post above, I gave an example of something \"shady\", who said that there actually was a crime. If the next administration comes in and says that there was criminal activity, let's just say that it involved the Chrysler contracts,then it's okay for them to prosecute, wouldn't you agree?", 
        "intTime": 20090518, 
        "postID": 119, 
        "quote": "Originally posted by karlhungusjr: quote: Well, as you said, since both parties agreed, no crime was commited, right? WHAT CRIME WAS COMMITTED? I've asked you that same question several times now. Either please answer it or just admit that there was no crime. quote: And the CEO of GM wasn't ran out by the President, either... Ran out? No. The CEO of GM could have easily stayed on as CEO. He was under no legal obligation to quit. quote: The President didn't say that the government would guarantee automobile warranties...okay. He said GM's warranties would be honored. Yes. and?", 
        "reply": " Why would the President of the United States guarantee vehicle warranties? That's usually the CEO's job. Please read my post above, I gave an example of something \"shady\", who said that there actually was a crime. If the next administration comes in and says that there was criminal activity, let's just say that it involved the Chrysler contracts,then it's okay for them to prosecute, wouldn't you agree?", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:57:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: It is, and there are several of those evil, evil \"Big Banks\". can you say which one? because somehow I have a feeling Obama didn't hold a personal meeting with the exec's of your bank, nor do i believe the exec's personally informed you that Obama was all the was keeping the mobs with pitchforks away.", 
        "intTime": 20090518, 
        "postID": 120, 
        "quote": "It is, and there are several of those evil, evil \"Big Banks\".", 
        "reply": " can you say which one? because somehow I have a feeling Obama didn't hold a personal meeting with the exec's of your bank, nor do i believe the exec's personally informed you that Obama was all the was keeping the mobs with pitchforks away.", 
        "threadID": "409192893_1550043322001", 
        "time": "2009-05-18 20:57:00", 
        "title": "New Policy for Future Administrations", 
        "userID": "karlhungusjr"
    }
]