[
    {
        "content": "The following comment certainly appears to apply to the majority of posters here that do not think that Obama belongs in the White House. So do you agree or disagree with his statement this morning? Enjoy quote: ... \"There are a whole bunch of folks now who are feigning outrage about these bonuses that a year ago or two years ago or three years ago said, well, we should never meddle in these compensation plans,\" he said. \"These are the best and the brightest. They know what they're doing. That's part of the market,\" he said. \"And now, suddenly, they're outraged.\" >http://news.yahoo.com/s/ap/20090318/ap_on_go_pr_wh/obama_aig< Hmmm. I too can remember specific posters making that same comment on not getting involved because of the same exact reasons listed", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "... \"There are a whole bunch of folks now who are feigning outrage about these bonuses that a year ago or two years ago or three years ago said, well, we should never meddle in these compensation plans,\" he said. \"These are the best and the brightest. They know what they're doing. That's part of the market,\" he said. \"And now, suddenly, they're outraged.\" >http://news.yahoo.com/s/ap/20090318/ap_on_go_pr_wh/obama_aig<", 
        "reply": "The following comment certainly appears to apply to the majority of posters here that do not think that Obama belongs in the White House. So do you agree or disagree with his statement this morning? Enjoy  Hmmm. I too can remember specific posters making that same comment on not getting involved because of the same exact reasons listed", 
        "threadID": "409192893_8460012812001", 
        "time": "2009-03-18 11:06:00", 
        "title": "Reality check: A truism on the AIG issue", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: The following comment certainly appears to apply to the majority of posters here that do not think that Obama belongs in the White House. So do you agree or disagree with his statement this morning? Enjoy quote: ... \"There are a whole bunch of folks now who are feigning outrage about these bonuses that a year ago or two years ago or three years ago said, well, we should never meddle in these compensation plans,\" he said. \"These are the best and the brightest. They know what they're doing. That's part of the market,\" he said. \"And now, suddenly, they're outraged.\" >http://news.yahoo.com/s/ap/20090318/ap_on_go_pr_wh/obama_aig< Hmmm. I too can remember specific posters making that same comment on not getting involved because of the same exact reasons listed The problem Arty Poo...is that it was the meddling that caused the problems.", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "Originally posted by ArtMarsh: The following comment certainly appears to apply to the majority of posters here that do not think that Obama belongs in the White House. So do you agree or disagree with his statement this morning? Enjoy quote: ... \"There are a whole bunch of folks now who are feigning outrage about these bonuses that a year ago or two years ago or three years ago said, well, we should never meddle in these compensation plans,\" he said. \"These are the best and the brightest. They know what they're doing. That's part of the market,\" he said. \"And now, suddenly, they're outraged.\" >http://news.yahoo.com/s/ap/20090318/ap_on_go_pr_wh/obama_aig< Hmmm. I too can remember specific posters making that same comment on not getting involved because of the same exact reasons listed", 
        "reply": " The problem Arty Poo...is that it was the meddling that caused the problems.", 
        "threadID": "409192893_8460012812001", 
        "time": "2009-03-18 11:12:00", 
        "title": "Reality check: A truism on the AIG issue", 
        "userID": "threerings"
    }, 
    {
        "content": "BTW-- Obama made the claim in the same interview that: \"No one around here wrote those contracts..\" Bold face lie: Geithner, Franks, Dodd...", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "", 
        "reply": "BTW-- Obama made the claim in the same interview that: \"No one around here wrote those contracts..\" Bold face lie: Geithner, Franks, Dodd...", 
        "threadID": "409192893_8460012812001", 
        "time": "2009-03-18 11:14:00", 
        "title": "Reality check: A truism on the AIG issue", 
        "userID": "threerings"
    }, 
    {
        "content": "Newsflash - I, at least, am still incensed that the representatives of the people think it is ok to step into the corporate board and \"dictate\" what anyone's salary should or should not be. Especially when you consider the fact that they have set their own salary up to be \"automatically\" upgraded without them having to vote on it. How well would some of these posters respond if thier state representative walked into thier local kroger's and demanded a pay cut for all checkers because of the local recession.", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "Newsflash - I, at least, am still incensed that the representatives of the people think it is ok to step into the corporate board and \"dictate\" what anyone's salary should or should not be. Especially when you consider the fact that they have set their own salary up to be \"automatically\" upgraded without them having to vote on it. How well would some of these posters respond if thier state representative walked into thier local kroger's and demanded a pay cut for all checkers because of the local recession.", 
        "threadID": "409192893_8460012812001", 
        "time": "2009-03-18 11:40:00", 
        "title": "Reality check: A truism on the AIG issue", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: Newsflash - I, at least, am still incensed that the representatives of the people think it is ok to step into the corporate board and \"dictate\" what anyone's salary should or should not be. Especially when you consider the fact that they have set their own salary up to be \"automatically\" upgraded without them having to vote on it. How well would some of these posters respond if thier state representative walked into thier local kroger's and demanded a pay cut for all checkers because of the local recession. I tend to agree with that. While the issue of compensation for executives is a worthy one, the time to have considered it was up front rather than after the fact. For not doing so, the FRB, Bush, Obama, Paulson, Geithner ... and those in Congress that claim the mantle of oversight ... all share a bit of the blame. I'm a whole lot skeptical of Congress' criticism of Wall Street ... particularly since they have perpetuated the biggest Ponzi scheme in history since they began \"borrowing\" from the SS Trust Fund.", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "Originally posted by transport1: Newsflash - I, at least, am still incensed that the representatives of the people think it is ok to step into the corporate board and \"dictate\" what anyone's salary should or should not be. Especially when you consider the fact that they have set their own salary up to be \"automatically\" upgraded without them having to vote on it. How well would some of these posters respond if thier state representative walked into thier local kroger's and demanded a pay cut for all checkers because of the local recession.", 
        "reply": " I tend to agree with that. While the issue of compensation for executives is a worthy one, the time to have considered it was up front rather than after the fact. For not doing so, the FRB, Bush, Obama, Paulson, Geithner ... and those in Congress that claim the mantle of oversight ... all share a bit of the blame. I'm a whole lot skeptical of Congress' criticism of Wall Street ... particularly since they have perpetuated the biggest Ponzi scheme in history since they began \"borrowing\" from the SS Trust Fund.", 
        "threadID": "409192893_8460012812001", 
        "time": "2009-03-18 12:25:00", 
        "title": "Reality check: A truism on the AIG issue", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Can we say dog and pony show?? These people wrote the laws and now they try and tell us they are shocked and amazed at what took place??!!?? Why they were just innocent bystanders, doncha know!!! What a crock of crap!!!!", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "", 
        "reply": "Can we say dog and pony show?? These people wrote the laws and now they try and tell us they are shocked and amazed at what took place??!!?? Why they were just innocent bystanders, doncha know!!! What a crock of crap!!!!", 
        "threadID": "409192893_8460012812001", 
        "time": "2009-03-18 12:31:00", 
        "title": "Reality check: A truism on the AIG issue", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by ArtMarsh: The following comment certainly appears to apply to the majority of posters here that do not think that Obama belongs in the White House. So do you agree or disagree with his statement this morning? Enjoy quote: ... \"There are a whole bunch of folks now who are feigning outrage about these bonuses that a year ago or two years ago or three years ago said, well, we should never meddle in these compensation plans,\" he said. \"These are the best and the brightest. They know what they're doing. That's part of the market,\" he said. \"And now, suddenly, they're outraged.\" >http://news.yahoo.com/s/ap/20090318/ap_on_go_pr_wh/obama_aig< Hmmm. I too can remember specific posters making that same comment on not getting involved because of the same exact reasons listed The problem Arty Poo...is that it was the meddling that caused the problems. Actually it was REFUSING to meddle that caused the problem. What AIG did was issue INSURANCE on the securities BUT the Regulators decided that just because AIG decided to not CALL it insurance they did not have to follow the rules for insurance. If they had followed the rules for insurance AIG would have had the money available to cover most of what the Tax payers had to take over. .", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "Originally posted by threerings: quote: Originally posted by ArtMarsh: The following comment certainly appears to apply to the majority of posters here that do not think that Obama belongs in the White House. So do you agree or disagree with his statement this morning? Enjoy quote: ... \"There are a whole bunch of folks now who are feigning outrage about these bonuses that a year ago or two years ago or three years ago said, well, we should never meddle in these compensation plans,\" he said. \"These are the best and the brightest. They know what they're doing. That's part of the market,\" he said. \"And now, suddenly, they're outraged.\" >http://news.yahoo.com/s/ap/20090318/ap_on_go_pr_wh/obama_aig< Hmmm. I too can remember specific posters making that same comment on not getting involved because of the same exact reasons listed The problem Arty Poo...is that it was the meddling that caused the problems.", 
        "reply": " Actually it was REFUSING to meddle that caused the problem. What AIG did was issue INSURANCE on the securities BUT the Regulators decided that just because AIG decided to not CALL it insurance they did not have to follow the rules for insurance. If they had followed the rules for insurance AIG would have had the money available to cover most of what the Tax payers had to take over. .", 
        "threadID": "409192893_8460012812001", 
        "time": "2009-03-18 13:44:00", 
        "title": "Reality check: A truism on the AIG issue", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by 15933079: Lets see.....The government stole the money from the people........now AGI is stealing some of it back and they're whinning about it. Why should good people care about AGI stealing back part of the stolen stash from the thieves that stole it from us in the first place? Only 9 posts and already you get it. You have my respect sir/ma'm.", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "Originally posted by 15933079: Lets see.....The government stole the money from the people........now AGI is stealing some of it back and they're whinning about it. Why should good people care about AGI stealing back part of the stolen stash from the thieves that stole it from us in the first place?", 
        "reply": " Only 9 posts and already you get it. You have my respect sir/ma'm.", 
        "threadID": "409192893_8460012812001", 
        "time": "2009-03-18 13:58:00", 
        "title": "Reality check: A truism on the AIG issue", 
        "userID": "Duster6"
    }
]