[
    {
        "content": "quote: Top British official Captain Leo Docherty has called Afghanistan \"a textbook case of how to screw up a counterinsurgency.\" A captain in the Scots Guards is hardly a \"Top British official\" - although he did have the courage of his convictions to resign his commission in August 2006 to criticise the strategy in Helmand. The main thrust of his argument is that destroying people's homes and livliehoods (poppy fields) is hardly likely to endear them to coalition forces. As a a result, the Taliban's relatively small core ranks of fanatics have been swollen with the disinherited.", 
        "intTime": 20090301, 
        "postID": 2, 
        "quote": "Top British official Captain Leo Docherty has called Afghanistan \"a textbook case of how to screw up a counterinsurgency.\"", 
        "reply": " A captain in the Scots Guards is hardly a \"Top British official\" - although he did have the courage of his convictions to resign his commission in August 2006 to criticise the strategy in Helmand. The main thrust of his argument is that destroying people's homes and livliehoods (poppy fields) is hardly likely to endear them to coalition forces. As a a result, the Taliban's relatively small core ranks of fanatics have been swollen with the disinherited.", 
        "threadID": "409192893_5730015612001", 
        "time": "2009-03-01 04:23:00", 
        "title": "Obama Making the Wrong Turn in Afghanistan", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "The Captain sounds like an Irish agent...", 
        "intTime": 20090301, 
        "postID": 3, 
        "quote": "", 
        "reply": "The Captain sounds like an Irish agent...", 
        "threadID": "409192893_5730015612001", 
        "time": "2009-03-01 04:30:00", 
        "title": "Obama Making the Wrong Turn in Afghanistan", 
        "userID": "vsibaby"
    }, 
    {
        "content": "WhichitaKid, I think you have a fundamental misunderstanding of how things work in that part of the world. It is a violent place and nothing good can be achieved without security. Sending \"jobs\" over there without the means to protect and provide safety means all those heads would come back to you on a plate.", 
        "intTime": 20090301, 
        "postID": 4, 
        "quote": "", 
        "reply": "WhichitaKid, I think you have a fundamental misunderstanding of how things work in that part of the world. It is a violent place and nothing good can be achieved without security. Sending \"jobs\" over there without the means to protect and provide safety means all those heads would come back to you on a plate.", 
        "threadID": "409192893_5730015612001", 
        "time": "2009-03-01 07:08:00", 
        "title": "Obama Making the Wrong Turn in Afghanistan", 
        "userID": "Thud357L"
    }
]