[
    {
        "content": "I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "", 
        "reply": "I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 16:36:00", 
        "title": "HELP, please", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca I think you have to be friends with someone first..... I just tried gypsy, got their public profile page but then all I was allowed to do is ask them to be my friend... I did the same for you, got your profile page but again all I could do is ask you to be my friend.. I don't see where I could leave you a message... It's that \"new\" fix they got going; we're all a bit stewed over this BUT we have been assured that we will like the new look. We'll see. Guess all you can do is SHOUT real loud and wait till the mod in question answers you. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca", 
        "reply": " I think you have to be friends with someone first..... I just tried gypsy, got their public profile page but then all I was allowed to do is ask them to be my friend... I did the same for you, got your profile page but again all I could do is ask you to be my friend.. I don't see where I could leave you a message... It's that \"new\" fix they got going; we're all a bit stewed over this BUT we have been assured that we will like the new look. We'll see. Guess all you can do is SHOUT real loud and wait till the mod in question answers you. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:04:00", 
        "title": "HELP, please", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Thank you. I tried to change something on my own profile and the system threw me out! AARRRGGGHHH!!!", 
        "intTime": 20090420, 
        "postID": 3, 
        "quote": "", 
        "reply": "Thank you. I tried to change something on my own profile and the system threw me out! AARRRGGGHHH!!!", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:17:00", 
        "title": "HELP, please", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "It's rigged to make it difficult to contact anyone...", 
        "intTime": 20090420, 
        "postID": 4, 
        "quote": "", 
        "reply": "It's rigged to make it difficult to contact anyone...", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:22:00", 
        "title": "HELP, please", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Mom....... only because I might like you I sent a message to Dawg saying you needed help. BUT, just because I've done a small act of kindness don't go getting any notions..... no-sir. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090420, 
        "postID": 5, 
        "quote": "", 
        "reply": "Mom....... only because I might like you I sent a message to Dawg saying you needed help. BUT, just because I've done a small act of kindness don't go getting any notions..... no-sir. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:24:00", 
        "title": "HELP, please", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca Please use the e-mails above our avatars. They work well.", 
        "intTime": 20090420, 
        "postID": 6, 
        "quote": "Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca", 
        "reply": " Please use the e-mails above our avatars. They work well.", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:33:00", 
        "title": "HELP, please", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have.", 
        "intTime": 20090420, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone...", 
        "reply": " Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have.", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:33:00", 
        "title": "HELP, please", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: Mom....... only because I might like you I sent a message to Dawg saying you needed help. BUT, just because I've done a small act of kindness don't go getting any notions..... no-sir. So you think I might be a notional kind of woman???? I'm a might flushed (think best Southern drawl you ever heard ) Thank you! Its kind of like at work when the techies insert a 'patch' in the system, its screwball for a few days/weeks until they fix the patch. \"sigh\". NCIS is calling my name so I'll try again later. Thanks again. Becca", 
        "intTime": 20090420, 
        "postID": 8, 
        "quote": "Originally posted by m551sheridan: Mom....... only because I might like you I sent a message to Dawg saying you needed help. BUT, just because I've done a small act of kindness don't go getting any notions..... no-sir.", 
        "reply": " So you think I might be a notional kind of woman???? I'm a might flushed (think best Southern drawl you ever heard ) Thank you! Its kind of like at work when the techies insert a 'patch' in the system, its screwball for a few days/weeks until they fix the patch. \"sigh\". NCIS is calling my name so I'll try again later. Thanks again. Becca", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:34:00", 
        "title": "HELP, please", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca Please use the e-mails above our avatars. They work well. DER... I already tried that. The pop up said I didn't have \"rights\" to use that option.", 
        "intTime": 20090420, 
        "postID": 9, 
        "quote": "Originally posted by mainedawg: quote: Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca Please use the e-mails above our avatars. They work well.", 
        "reply": " DER... I already tried that. The pop up said I didn't have \"rights\" to use that option.", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:35:00", 
        "title": "HELP, please", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: quote: Originally posted by mainedawg: quote: Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca Please use the e-mails above our avatars. They work well. DER... I already tried that. The pop up said I didn't have \"rights\" to use that option. You use the e-mail address you signed up with or I will contact you", 
        "intTime": 20090420, 
        "postID": 10, 
        "quote": "Originally posted by Mom2APAJ: quote: Originally posted by mainedawg: quote: Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca Please use the e-mails above our avatars. They work well. DER... I already tried that. The pop up said I didn't have \"rights\" to use that option.", 
        "reply": " You use the e-mail address you signed up with or I will contact you", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:39:00", 
        "title": "HELP, please", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water.", 
        "intTime": 20090420, 
        "postID": 11, 
        "quote": "Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have.", 
        "reply": " Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water.", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 17:44:00", 
        "title": "HELP, please", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while.", 
        "intTime": 20090420, 
        "postID": 12, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water.", 
        "reply": " Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while.", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 18:12:00", 
        "title": "HELP, please", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while. Yeh, I know the reason they did it, it wasnt broken. They probably had a bunch of little whiny wannabees that asked for it to change co'z they got their feelings hurt. I didnt like all that military stuff showing in thier profiles. The whole setup looks like crap and is candyassified.", 
        "intTime": 20090420, 
        "postID": 13, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while.", 
        "reply": " Yeh, I know the reason they did it, it wasnt broken. They probably had a bunch of little whiny wannabees that asked for it to change co'z they got their feelings hurt. I didnt like all that military stuff showing in thier profiles. The whole setup looks like crap and is candyassified.", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 20:32:00", 
        "title": "HELP, please", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 10tenths: quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while. Yeh, I know the reason they did it, it wasnt broken. They probably had a bunch of little whiny wannabees that asked for it to change co'z they got their feelings hurt. I didnt like all that military stuff showing in thier profiles. The whole setup looks like crap and is candyassified. Hoorah, Gunny", 
        "intTime": 20090420, 
        "postID": 14, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 10tenths: quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while. Yeh, I know the reason they did it, it wasnt broken. They probably had a bunch of little whiny wannabees that asked for it to change co'z they got their feelings hurt. I didnt like all that military stuff showing in thier profiles. The whole setup looks like crap and is candyassified.", 
        "reply": " Hoorah, Gunny", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 20:37:00", 
        "title": "HELP, please", 
        "userID": "akaironhorse"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by 10tenths: quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while. Yeh, I know the reason they did it, it wasnt broken. They probably had a bunch of little whiny wannabees that asked for it to change co'z they got their feelings hurt. I didnt like all that military stuff showing in thier profiles. The whole setup looks like crap and is candyassified. I agree. But, it is what it is.", 
        "intTime": 20090420, 
        "postID": 15, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by 10tenths: quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while. Yeh, I know the reason they did it, it wasnt broken. They probably had a bunch of little whiny wannabees that asked for it to change co'z they got their feelings hurt. I didnt like all that military stuff showing in thier profiles. The whole setup looks like crap and is candyassified.", 
        "reply": " I agree. But, it is what it is.", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-20 21:05:00", 
        "title": "HELP, please", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: quote: Originally posted by Mom2APAJ: quote: Originally posted by mainedawg: quote: Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca Please use the e-mails above our avatars. They work well. DER... I already tried that. The pop up said I didn't have \"rights\" to use that option. You use the e-mail address you signed up with or I will contact you I clicked on your name, it took me to a different page with the option of contacting you. When I clicked on that option,this is what I got. Error \"You have not been given the permission(s) to access this page. You require the following rights to view this page: 'Can Create/Edit Private Messages'. For a full list of permissions you have on this community, please visit your Personal Zone Permissions page.\" Go Back | Military.com Forums powered by eve community Please Wait. Your request is being processed... [x] Site Military.com Forums Servlet eve2da047 Version 1.2.22 build 9062 Module 1.2.22 Stylesheet \"Front Door\" Wordlet Set \"Default Wordlet Set\" Logout: Military.com Forums Update Groupee Account Understand now?", 
        "intTime": 20090421, 
        "postID": 16, 
        "quote": "Originally posted by mainedawg: quote: Originally posted by Mom2APAJ: quote: Originally posted by mainedawg: quote: Originally posted by Mom2APAJ: I have tried to contact a couple of moderators with a question via email on here but I get a pop-up that says I don't have permission to use that function. WHAT??? No yellow triangle stuff just a couple of questions. Could one of you please contact me? Thank you, Becca Please use the e-mails above our avatars. They work well. DER... I already tried that. The pop up said I didn't have \"rights\" to use that option. You use the e-mail address you signed up with or I will contact you", 
        "reply": " I clicked on your name, it took me to a different page with the option of contacting you. When I clicked on that option,this is what I got. Error \"You have not been given the permission(s) to access this page. You require the following rights to view this page: 'Can Create/Edit Private Messages'. For a full list of permissions you have on this community, please visit your Personal Zone Permissions page.\" Go Back | Military.com Forums powered by eve community Please Wait. Your request is being processed... [x] Site Military.com Forums Servlet eve2da047 Version 1.2.22 build 9062 Module 1.2.22 Stylesheet \"Front Door\" Wordlet Set \"Default Wordlet Set\" Logout: Military.com Forums Update Groupee Account Understand now?", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-21 16:23:00", 
        "title": "HELP, please", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while. I don't have a myspace/facebook - never been, no reason to go so making the comparison could make perfect sense if I'd ever been to either of those sites but since I haven't", 
        "intTime": 20090421, 
        "postID": 17, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by GunnyRet03: quote: Originally posted by mainedawg: quote: Originally posted by GunnyRet03: It's rigged to make it difficult to contact anyone... Ahhhhhh, try looking over my avatar............. Try being a Moderator and want to talk with a Member here. I can see the 1000 friens I would have. Did I say the mods created this 'Goat Rope? The concept is asinine. And one of the few things that everyone here agrees sux pizzer water. Gunny, they are trying to make it similar to what you would fiend on myspace or facebook. On those sites you cannot see somebody's profile until you become a friend of theirs. I believe that they are trying to get away from people calling people out on their profile page before you get to know them a bit. But, I personally like being able to view people's profile. It helps me decide whether or not I even want to get to know them. Obviously, people that had the same job as me or that were stationed in the same place, I would prefer to be cooler with them than somebody with no military experience at all. Karlhungusjr is an example of somebody that I don't get into too many arguments with, only because he has an IUSS badge as his avatar. God knows that he and I don't see eye to eye that much. But, I was a Sonar Tech and did TAD at an IUSS station for a while.", 
        "reply": " I don't have a myspace/facebook - never been, no reason to go so making the comparison could make perfect sense if I'd ever been to either of those sites but since I haven't", 
        "threadID": "409192893_8170003122001", 
        "time": "2009-04-21 16:34:00", 
        "title": "HELP, please", 
        "userID": "Mom2APAJ"
    }
]