[
    {
        "content": "In February 1993, a car bomb was detonated in the underground garage of the North Tower of the World Trade Center in New York City. The terrorist’s plan was for the 1,500 lb bomb to knock the North Tower into the South Tower, bringing both towers down and killing thousands of people. Ramzi Ahmed Yousef was convicted as the mastermind of that attack and sentenced to life in prison without parole. Yousef's uncle is Khalid Shaikh Mohammed, the mastermind of the 9/11 attacks. Eight and a half years later al Qaeda struck again on 9/11/01. It has been a little over seven and a half years since the 9/11 attack. In that time, the Bush Administration has used extraordinary measures to keep American from being attacked again. President Bush and his supporters claim that keeping America safe from another attack since 9/11 has been one of the Bush Administration’s greatest achievements. By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone?", 
        "intTime": 20090518, 
        "postID": 1, 
        "quote": "", 
        "reply": "In February 1993, a car bomb was detonated in the underground garage of the North Tower of the World Trade Center in New York City. The terrorist’s plan was for the 1,500 lb bomb to knock the North Tower into the South Tower, bringing both towers down and killing thousands of people. Ramzi Ahmed Yousef was convicted as the mastermind of that attack and sentenced to life in prison without parole. Yousef's uncle is Khalid Shaikh Mohammed, the mastermind of the 9/11 attacks. Eight and a half years later al Qaeda struck again on 9/11/01. It has been a little over seven and a half years since the 9/11 attack. In that time, the Bush Administration has used extraordinary measures to keep American from being attacked again. President Bush and his supporters claim that keeping America safe from another attack since 9/11 has been one of the Bush Administration’s greatest achievements. By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 07:37:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "Is it possible that this is a politically-loaded question? Say it isn't so. But, I'll bite. First, you have to define torture. EIT is decidedly not torture. I suppose, if we apply by your logic, every POTUS since FDR kept us safe from an attack on American soil UNTIL Clinton. I don't think one person, even the POTUS, deserves so much credit or blame. Every QB buys his linemen dinner after a sackless game for good reason. Now, my question to you...are you opposed to torture and why or why not? \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 2, 
        "quote": "", 
        "reply": "Is it possible that this is a politically-loaded question? Say it isn't so. But, I'll bite. First, you have to define torture. EIT is decidedly not torture. I suppose, if we apply by your logic, every POTUS since FDR kept us safe from an attack on American soil UNTIL Clinton. I don't think one person, even the POTUS, deserves so much credit or blame. Every QB buys his linemen dinner after a sackless game for good reason. Now, my question to you...are you opposed to torture and why or why not? \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 07:45:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don", 
        "intTime": 20090518, 
        "postID": 3, 
        "quote": "Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone?", 
        "reply": " Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 07:48:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I think that terrorism is something that is very difficult to prevent, no matter what measures are taken to combat it. Look at Israel, Europe, Asia, etc. Terrorists will always find some target and attack it if they have the capacity. I blame neither Bush, nor Clinton for 9/11. I don't blame any President for not preventing any given terrorist attack. I blame the terrorists. We can only go so far to protect ourselves. For God's sake we've been fighting crime in America since the country was founded and it still destroys thousands of American lives every year. Though it is subjective and often difficult to define, reasonable measures should always be taken to prevent terrorist attacks. More often than not it means that Federal and local law enforcement, combined with awareness, and national intelligence services need to work together to share information and investigate possible attacks. That alone would have probably prevented 9/11. We are a country of over 300 million people. One terrorist can kill hundreds or thousands depending on numerous and sundry factors.", 
        "intTime": 20090518, 
        "postID": 4, 
        "quote": "", 
        "reply": "I think that terrorism is something that is very difficult to prevent, no matter what measures are taken to combat it. Look at Israel, Europe, Asia, etc. Terrorists will always find some target and attack it if they have the capacity. I blame neither Bush, nor Clinton for 9/11. I don't blame any President for not preventing any given terrorist attack. I blame the terrorists. We can only go so far to protect ourselves. For God's sake we've been fighting crime in America since the country was founded and it still destroys thousands of American lives every year. Though it is subjective and often difficult to define, reasonable measures should always be taken to prevent terrorist attacks. More often than not it means that Federal and local law enforcement, combined with awareness, and national intelligence services need to work together to share information and investigate possible attacks. That alone would have probably prevented 9/11. We are a country of over 300 million people. One terrorist can kill hundreds or thousands depending on numerous and sundry factors.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 07:54:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013", 
        "intTime": 20090518, 
        "postID": 5, 
        "quote": "...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years...", 
        "reply": " Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:01:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: Is it possible that this is a politically-loaded question? Say it isn't so. But, I'll bite. First, you have to define torture. EIT is decidedly not torture. I suppose, if we apply by your logic, every POTUS since FDR kept us safe from an attack on American soil UNTIL Clinton. I don't think one person, even the POTUS, deserves so much credit or blame. Every QB buys his linemen dinner after a sackless game for good reason. Now, my question to you...are you opposed to torture and why or why not? The logic is not mine – it is that of President Bush: \"There is legitimate debate about many of these decisions. But there can be little debate about the results. America has gone more than seven years without another terrorist attack on our soil.\" GW Bush, January 2009. There are plenty of threads about the torture debate – if torture is torture and is torture is legal. This one is about what is necessary to keep America safe. Do you think it is absolutely necessary to torture people to keep America safe?", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "Originally posted by QuanticoBornMarine: Is it possible that this is a politically-loaded question? Say it isn't so. But, I'll bite. First, you have to define torture. EIT is decidedly not torture. I suppose, if we apply by your logic, every POTUS since FDR kept us safe from an attack on American soil UNTIL Clinton. I don't think one person, even the POTUS, deserves so much credit or blame. Every QB buys his linemen dinner after a sackless game for good reason. Now, my question to you...are you opposed to torture and why or why not?", 
        "reply": " The logic is not mine – it is that of President Bush: \"There is legitimate debate about many of these decisions. But there can be little debate about the results. America has gone more than seven years without another terrorist attack on our soil.\" GW Bush, January 2009. There are plenty of threads about the torture debate – if torture is torture and is torture is legal. This one is about what is necessary to keep America safe. Do you think it is absolutely necessary to torture people to keep America safe?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:02:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton?", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don", 
        "reply": " I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:07:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: The logic is not mine – it is that of President Bush: \"There is legitimate debate about many of these decisions. But there can be little debate about the results. America has gone more than seven years without another terrorist attack on our soil.\" GW Bush, January 2009. There are plenty of threads about the torture debate – if torture is torture and is torture is legal. This one is about what is necessary to keep America safe. Do you think it is absolutely necessary to torture people to keep America safe? Fair enough, it may be his logic. I don't necessarily agree with it (see my QB analogy). To answer your question, I do NOT think torture is necessary or even desireable to keep America safe. I think the very real threat of swift, decisive, and violent action in response to an act of terror is all that is necessary. We have a seemingly zero tolerance policy on torture. Not so with collateral damage that occurs as a result of a response to a hostile act. Do I like it? Not particularly, but you didn't ask if I liked it. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": "Originally posted by xerello: The logic is not mine – it is that of President Bush: \"There is legitimate debate about many of these decisions. But there can be little debate about the results. America has gone more than seven years without another terrorist attack on our soil.\" GW Bush, January 2009. There are plenty of threads about the torture debate – if torture is torture and is torture is legal. This one is about what is necessary to keep America safe. Do you think it is absolutely necessary to torture people to keep America safe?", 
        "reply": " Fair enough, it may be his logic. I don't necessarily agree with it (see my QB analogy). To answer your question, I do NOT think torture is necessary or even desireable to keep America safe. I think the very real threat of swift, decisive, and violent action in response to an act of terror is all that is necessary. We have a seemingly zero tolerance policy on torture. Not so with collateral damage that occurs as a result of a response to a hostile act. Do I like it? Not particularly, but you didn't ask if I liked it. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:17:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? I have no problem with Clinton taking credit. I did however work as a Federal LEO during the Clinton years and all I saw were cutbacks in funding and personnel. Ya, he (Clinton) did a heck of a job on giving the U.S. protection. By the way, under Bush, the Feds were finally authorized to build their forces back up. Don", 
        "intTime": 20090518, 
        "postID": 9, 
        "quote": "Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton?", 
        "reply": " I have no problem with Clinton taking credit. I did however work as a Federal LEO during the Clinton years and all I saw were cutbacks in funding and personnel. Ya, he (Clinton) did a heck of a job on giving the U.S. protection. By the way, under Bush, the Feds were finally authorized to build their forces back up. Don", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:21:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090518, 
        "postID": 10, 
        "quote": "Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013", 
        "reply": " Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:34:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. Yet as lame as President Clinton was, there was not another attack on American soil during his term, even though he created \"the environment where we were vulnerable to such an attack.\" President Bush did harden the American target, there is no doubt about that. But did he really prevent another attack, or does it take a long time for al Qaeda to mount an attack?", 
        "intTime": 20090518, 
        "postID": 11, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you.", 
        "reply": " Yet as lame as President Clinton was, there was not another attack on American soil during his term, even though he created \"the environment where we were vulnerable to such an attack.\" President Bush did harden the American target, there is no doubt about that. But did he really prevent another attack, or does it take a long time for al Qaeda to mount an attack?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:43:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "I do not fault President Clinton for the 9-11 terrorist attacks. But I do fault him for the 1995 Oklahoma City terrorist attack. If \"enhanced interrogation techniques\" had been used against Timothy McVeigh during the time he was in custody prior to his executon, the U.S. Government could have possibly rounded up loads of anti-American Right-wingnuts who still threaten the country's existance today. I would even suggest using \"enhanced interrogation techniques\" on Eric Rudolph, the abortion clinic and Atlanta Olympics bomber presently in federal prison, to get intelligence against the terrorists within the anti-abortion movement (such as the Army of God and radical elements of Operation Rescue). If it wasn't a matter of dumb luck, my daughter might have been killed by anti-abortion terrorist John Salvi (she oversplept and missed her appointment that day for a routine annual medical exam at one of the clinics he shot up, killing two clinic employees). Putting these home-grown terrorists away would definitely keep America safer.", 
        "intTime": 20090518, 
        "postID": 12, 
        "quote": "", 
        "reply": "I do not fault President Clinton for the 9-11 terrorist attacks. But I do fault him for the 1995 Oklahoma City terrorist attack. If \"enhanced interrogation techniques\" had been used against Timothy McVeigh during the time he was in custody prior to his executon, the U.S. Government could have possibly rounded up loads of anti-American Right-wingnuts who still threaten the country's existance today. I would even suggest using \"enhanced interrogation techniques\" on Eric Rudolph, the abortion clinic and Atlanta Olympics bomber presently in federal prison, to get intelligence against the terrorists within the anti-abortion movement (such as the Army of God and radical elements of Operation Rescue). If it wasn't a matter of dumb luck, my daughter might have been killed by anti-abortion terrorist John Salvi (she oversplept and missed her appointment that day for a routine annual medical exam at one of the clinics he shot up, killing two clinic employees). Putting these home-grown terrorists away would definitely keep America safer.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:53:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by PinkBlossoms: quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. Yet as lame as President Clinton was, there was not another attack on American soil during his term, even though he created \"the environment where we were vulnerable to such an attack.\" President Bush did harden the American target, there is no doubt about that. But did he really prevent another attack, or does it take a long time for al Qaeda to mount an attack? Well, I for one am confused. I hear people all the time say that Bush gets all the credit for keeping the country safe. And yet, the 9/11 attacks occured nine monthts into the Bush administration's time in office. So the attacks occured on Bush's watch. Now, people can make the argument that it was Clinton's fault that the country had her guard down, which allowed for the 9/11 attacks. My question is, is Bush himself not guilty for 9/11, since he was already in office nine months prior to the attacks? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 13, 
        "quote": "Originally posted by xerello: quote: Originally posted by PinkBlossoms: quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. Yet as lame as President Clinton was, there was not another attack on American soil during his term, even though he created \"the environment where we were vulnerable to such an attack.\" President Bush did harden the American target, there is no doubt about that. But did he really prevent another attack, or does it take a long time for al Qaeda to mount an attack?", 
        "reply": " Well, I for one am confused. I hear people all the time say that Bush gets all the credit for keeping the country safe. And yet, the 9/11 attacks occured nine monthts into the Bush administration's time in office. So the attacks occured on Bush's watch. Now, people can make the argument that it was Clinton's fault that the country had her guard down, which allowed for the 9/11 attacks. My question is, is Bush himself not guilty for 9/11, since he was already in office nine months prior to the attacks? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:59:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Then let me put it this way, so you understand how much damage was done by the man: Think of it like pruning a tree. It's easy and fast to cut a branch off, but growing it back takes a good deal longer, sometimes years. So Clinton cutting the military and CIA HUMINT infrastructure was an easy, quick stroke of the pen. Simply sign the order and the funding stops. Soldiers and (more importantly) mid-grade officers and NCOs leave the service, not to return. Intelligence sorces, funded by CIA dollars and contacted by agents are simply not paid the next year, and no CIA operative is available to gather the intelligence, even if the money WAS available. And the country sleeps, unaware of the true impact of this 'pruning'. A crisis arises. Inexact intelligence sources show an increase in activity, but without the HUMINT sources we used to pay and support, we're stuck with only the shadow play of SIGINT, without on-the-ground verification means. These cannot be recontructed on the fly - making contacts and recruiting informants takes time, effort and above all - patience. Nine months isn't nearly enough time to create such a verification process. Here's the most damning part: Neither is nine months or even nine YEARS enough to rebuild a US Army division. None of those mid-grade officers and NCOs who left ever make senior rank. The slots they held in the 90s were not available for junior officers and NCOs to occupy when their time came. Those that did make mid-grade aren't enough to flesh out new units during a crisis - they're needed in the fighting line. Growth of the military cannot take place during wartime due to the immediate needs of the forces. The basic equipment issue would take a full year or two alone, but the biggest problem is personnel. You see, it takes a decade to create those mid-grade officers and NCOs that Clinton pruned in the 90s. You can grouse about needing a draft all you want, but someone has to train and lead those soldiers, and unless you want E-5s as company 1SGs or 1LT Battalion commanders, you're going to be hard pressed to adequately man the staff structure of these 'new units'. It just can't be done in the modern world without severe costs as these new Battalion and Brigade staffs learn the hard lessons in months when they should have years to perfect them. We've seen it before: Bull Run, Kassarine Pass, Task Force Smith. This was the cost of the 'peace dividend' that Clinton cashed during his time as President. The sad thing is, some of us who left anticipated in 1993-95 what might happen if we went to war again after Clinton's cuts, but the public was too enthralled with the booming economy and 'aw shucks' attitude of the POTUS to worry,...or care. quote: \"God and the soldier we adore, in times of trouble, not before, With the crisis past, and all things righted God is forgotten, the soldier slighted.\" Winston Churchill Sullivan013", 
        "intTime": 20090518, 
        "postID": 14, 
        "quote": "\"God and the soldier we adore, in times of trouble, not before, With the crisis past, and all things righted God is forgotten, the soldier slighted.\" Winston Churchill", 
        "reply": "Then let me put it this way, so you understand how much damage was done by the man: Think of it like pruning a tree. It's easy and fast to cut a branch off, but growing it back takes a good deal longer, sometimes years. So Clinton cutting the military and CIA HUMINT infrastructure was an easy, quick stroke of the pen. Simply sign the order and the funding stops. Soldiers and (more importantly) mid-grade officers and NCOs leave the service, not to return. Intelligence sorces, funded by CIA dollars and contacted by agents are simply not paid the next year, and no CIA operative is available to gather the intelligence, even if the money WAS available. And the country sleeps, unaware of the true impact of this 'pruning'. A crisis arises. Inexact intelligence sources show an increase in activity, but without the HUMINT sources we used to pay and support, we're stuck with only the shadow play of SIGINT, without on-the-ground verification means. These cannot be recontructed on the fly - making contacts and recruiting informants takes time, effort and above all - patience. Nine months isn't nearly enough time to create such a verification process. Here's the most damning part: Neither is nine months or even nine YEARS enough to rebuild a US Army division. None of those mid-grade officers and NCOs who left ever make senior rank. The slots they held in the 90s were not available for junior officers and NCOs to occupy when their time came. Those that did make mid-grade aren't enough to flesh out new units during a crisis - they're needed in the fighting line. Growth of the military cannot take place during wartime due to the immediate needs of the forces. The basic equipment issue would take a full year or two alone, but the biggest problem is personnel. You see, it takes a decade to create those mid-grade officers and NCOs that Clinton pruned in the 90s. You can grouse about needing a draft all you want, but someone has to train and lead those soldiers, and unless you want E-5s as company 1SGs or 1LT Battalion commanders, you're going to be hard pressed to adequately man the staff structure of these 'new units'. It just can't be done in the modern world without severe costs as these new Battalion and Brigade staffs learn the hard lessons in months when they should have years to perfect them. We've seen it before: Bull Run, Kassarine Pass, Task Force Smith. This was the cost of the 'peace dividend' that Clinton cashed during his time as President. The sad thing is, some of us who left anticipated in 1993-95 what might happen if we went to war again after Clinton's cuts, but the public was too enthralled with the booming economy and 'aw shucks' attitude of the POTUS to worry,...or care.  Sullivan013", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:25:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "Oddly enough, if you listen to what OBL said about 9/11, it has more to do with US military presence in Saudi Arabia (Islamic holy ground) than with a particular POTUS' policies. It has more to do with our unofficial (or perhaps official) policy of supporting Israel, right or wrong. If you believe OBL when he says that those are the reasons he hates America (don't forget, he was once indifferent to us), then you have to be willing to point the finger at every president since Carter and maybe even since Truman (when it became fashionable to establish nation-states by convention and treaty). \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 15, 
        "quote": "", 
        "reply": "Oddly enough, if you listen to what OBL said about 9/11, it has more to do with US military presence in Saudi Arabia (Islamic holy ground) than with a particular POTUS' policies. It has more to do with our unofficial (or perhaps official) policy of supporting Israel, right or wrong. If you believe OBL when he says that those are the reasons he hates America (don't forget, he was once indifferent to us), then you have to be willing to point the finger at every president since Carter and maybe even since Truman (when it became fashionable to establish nation-states by convention and treaty). \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:28:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Oderint Dum Metuant. Lucius Accius What you speak of is motivation. That is something that is extrodinarily difficult to control and you would be a fool to think you could do so absolutely. Someone will always find a way to hate us and our society, whether it is over MacDonalds, Maytag or Maybeline. What I speak of is the physical capability of our nation to face adversity, threats, and aggression. Clinton dismantled the one in the absence of improvement in the other. And as for believing OBL, I'd rather quote Goebbels. Do you really think his messages are for us? They are for one particular point: recruitment. Sullivan013", 
        "intTime": 20090518, 
        "postID": 16, 
        "quote": "Oderint Dum Metuant. Lucius Accius", 
        "reply": " What you speak of is motivation. That is something that is extrodinarily difficult to control and you would be a fool to think you could do so absolutely. Someone will always find a way to hate us and our society, whether it is over MacDonalds, Maytag or Maybeline. What I speak of is the physical capability of our nation to face adversity, threats, and aggression. Clinton dismantled the one in the absence of improvement in the other. And as for believing OBL, I'd rather quote Goebbels. Do you really think his messages are for us? They are for one particular point: recruitment. Sullivan013", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:44:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 17, 
        "quote": "Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton?", 
        "reply": " USS Cole, Kenya, Tanazania. all happened under Clinton. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:54:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. Ya forgot one: Slick Willie sold American soil to the Chinese Govt. A couple of West Coast Seaports, if I'm not mistaken.... BUT, in his favor He DID go to great lengths, on prime-time television, to explain to my children why certain physical acts (with descriptions) should not be considered \"sex\"...", 
        "intTime": 20090518, 
        "postID": 18, 
        "quote": "In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon.", 
        "reply": " Ya forgot one: Slick Willie sold American soil to the Chinese Govt. A couple of West Coast Seaports, if I'm not mistaken.... BUT, in his favor He DID go to great lengths, on prime-time television, to explain to my children why certain physical acts (with descriptions) should not be considered \"sex\"...", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:55:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'.", 
        "intTime": 20090518, 
        "postID": 19, 
        "quote": "Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone?", 
        "reply": " Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:01:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton. Domestic attacks by al Qaeda – there have been two, both on the twin towers. If it is foreign attacks that you are referring to, terrorists were very busy during President Bush’s watch, even if you do not count all the Americans they have killed in Iraq and Afghanistan. 2002 June 14, Karachi, Pakistan: bomb exploded outside American consulate in Karachi, Pakistan, killing 12. Linked to al-Qaeda. 2003 May 12, Riyadh, Saudi Arabia: suicide bombers killed 34, including 8 Americans, at housing compounds for Westerners. Al-Qaeda suspected. 2004 May 29–31, Riyadh, Saudi Arabia: terrorists attack the offices of a Saudi oil company in Khobar, Saudi Arabia, take foreign oil workers hostage in a nearby residential compound, leaving 22 people dead including one American. June 11–19, Riyadh, Saudi Arabia: terrorists kidnap and execute Paul Johnson Jr., an American, in Riyadh, Saudi Arabia. 2 other Americans and a BBC cameraman killed by gun attacks. Dec. 6, Jeddah, Saudi Arabia: terrorists storm the U.S. consulate, killing 5 consulate employees. 4 terrorists were killed by Saudi security. 2005 January 30, BAGHDAD, Iraq — U.S. forces on Saturday captured seven suspected insurgents believed to be behind an attack on the U.S. Embassy in Baghdad that killed two Americans and wounded six. Nov. 9, Amman, Jordan: Suicide bombers hit 3 American hotels, Radisson, Grand Hyatt, and Days Inn, in Amman, Jordan, killing 57. Al-Qaeda claimed responsibility. 2006 Feb. 19, 2006 JAKARTA, Indonesia - Hundreds of Muslims protesting caricatures of the Prophet Muhammad stormed the U.S. Embassy on Sunday. Sept. 13, Damascus, Syria: Four gunman attack the American embassy. 2007 Jan. 12, Athens, Greece: the U.S. embassy was fired on by an anti-tank missile causing damage but no injuries. February 17, A JAPANESE extreme left-wing group has claimed responsibility for a small explosion near a US army base outside Tokyo ahead of US Vice President Dick Cheney's visit to Japan.", 
        "intTime": 20090518, 
        "postID": 20, 
        "quote": "Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton.", 
        "reply": " Domestic attacks by al Qaeda – there have been two, both on the twin towers. If it is foreign attacks that you are referring to, terrorists were very busy during President Bush’s watch, even if you do not count all the Americans they have killed in Iraq and Afghanistan. 2002 June 14, Karachi, Pakistan: bomb exploded outside American consulate in Karachi, Pakistan, killing 12. Linked to al-Qaeda. 2003 May 12, Riyadh, Saudi Arabia: suicide bombers killed 34, including 8 Americans, at housing compounds for Westerners. Al-Qaeda suspected. 2004 May 29–31, Riyadh, Saudi Arabia: terrorists attack the offices of a Saudi oil company in Khobar, Saudi Arabia, take foreign oil workers hostage in a nearby residential compound, leaving 22 people dead including one American. June 11–19, Riyadh, Saudi Arabia: terrorists kidnap and execute Paul Johnson Jr., an American, in Riyadh, Saudi Arabia. 2 other Americans and a BBC cameraman killed by gun attacks. Dec. 6, Jeddah, Saudi Arabia: terrorists storm the U.S. consulate, killing 5 consulate employees. 4 terrorists were killed by Saudi security. 2005 January 30, BAGHDAD, Iraq — U.S. forces on Saturday captured seven suspected insurgents believed to be behind an attack on the U.S. Embassy in Baghdad that killed two Americans and wounded six. Nov. 9, Amman, Jordan: Suicide bombers hit 3 American hotels, Radisson, Grand Hyatt, and Days Inn, in Amman, Jordan, killing 57. Al-Qaeda claimed responsibility. 2006 Feb. 19, 2006 JAKARTA, Indonesia - Hundreds of Muslims protesting caricatures of the Prophet Muhammad stormed the U.S. Embassy on Sunday. Sept. 13, Damascus, Syria: Four gunman attack the American embassy. 2007 Jan. 12, Athens, Greece: the U.S. embassy was fired on by an anti-tank missile causing damage but no injuries. February 17, A JAPANESE extreme left-wing group has claimed responsibility for a small explosion near a US army base outside Tokyo ahead of US Vice President Dick Cheney's visit to Japan.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:04:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there.", 
        "intTime": 20090518, 
        "postID": 21, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'.", 
        "reply": " Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:08:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we?", 
        "intTime": 20090518, 
        "postID": 22, 
        "quote": "Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there.", 
        "reply": " I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:24:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton. Domestic attacks by al Qaeda – there have been two, both on the twin towers. If it is foreign attacks that you are referring to, terrorists were very busy during President Bush’s watch, even if you do not count all the Americans they have killed in Iraq and Afghanistan. 2002 June 14, Karachi, Pakistan: bomb exploded outside American consulate in Karachi, Pakistan, killing 12. Linked to al-Qaeda. 2003 May 12, Riyadh, Saudi Arabia: suicide bombers killed 34, including 8 Americans, at housing compounds for Westerners. Al-Qaeda suspected. 2004 May 29–31, Riyadh, Saudi Arabia: terrorists attack the offices of a Saudi oil company in Khobar, Saudi Arabia, take foreign oil workers hostage in a nearby residential compound, leaving 22 people dead including one American. June 11–19, Riyadh, Saudi Arabia: terrorists kidnap and execute Paul Johnson Jr., an American, in Riyadh, Saudi Arabia. 2 other Americans and a BBC cameraman killed by gun attacks. Dec. 6, Jeddah, Saudi Arabia: terrorists storm the U.S. consulate, killing 5 consulate employees. 4 terrorists were killed by Saudi security. 2005 January 30, BAGHDAD, Iraq — U.S. forces on Saturday captured seven suspected insurgents believed to be behind an attack on the U.S. Embassy in Baghdad that killed two Americans and wounded six. Nov. 9, Amman, Jordan: Suicide bombers hit 3 American hotels, Radisson, Grand Hyatt, and Days Inn, in Amman, Jordan, killing 57. Al-Qaeda claimed responsibility. 2006 Feb. 19, 2006 JAKARTA, Indonesia - Hundreds of Muslims protesting caricatures of the Prophet Muhammad stormed the U.S. Embassy on Sunday. Sept. 13, Damascus, Syria: Four gunman attack the American embassy. 2007 Jan. 12, Athens, Greece: the U.S. embassy was fired on by an anti-tank missile causing damage but no injuries. February 17, A JAPANESE extreme left-wing group has claimed responsibility for a small explosion near a US army base outside Tokyo ahead of US Vice President Dick Cheney's visit to Japan. I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 23, 
        "quote": "Originally posted by xerello: quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton. Domestic attacks by al Qaeda – there have been two, both on the twin towers. If it is foreign attacks that you are referring to, terrorists were very busy during President Bush’s watch, even if you do not count all the Americans they have killed in Iraq and Afghanistan. 2002 June 14, Karachi, Pakistan: bomb exploded outside American consulate in Karachi, Pakistan, killing 12. Linked to al-Qaeda. 2003 May 12, Riyadh, Saudi Arabia: suicide bombers killed 34, including 8 Americans, at housing compounds for Westerners. Al-Qaeda suspected. 2004 May 29–31, Riyadh, Saudi Arabia: terrorists attack the offices of a Saudi oil company in Khobar, Saudi Arabia, take foreign oil workers hostage in a nearby residential compound, leaving 22 people dead including one American. June 11–19, Riyadh, Saudi Arabia: terrorists kidnap and execute Paul Johnson Jr., an American, in Riyadh, Saudi Arabia. 2 other Americans and a BBC cameraman killed by gun attacks. Dec. 6, Jeddah, Saudi Arabia: terrorists storm the U.S. consulate, killing 5 consulate employees. 4 terrorists were killed by Saudi security. 2005 January 30, BAGHDAD, Iraq — U.S. forces on Saturday captured seven suspected insurgents believed to be behind an attack on the U.S. Embassy in Baghdad that killed two Americans and wounded six. Nov. 9, Amman, Jordan: Suicide bombers hit 3 American hotels, Radisson, Grand Hyatt, and Days Inn, in Amman, Jordan, killing 57. Al-Qaeda claimed responsibility. 2006 Feb. 19, 2006 JAKARTA, Indonesia - Hundreds of Muslims protesting caricatures of the Prophet Muhammad stormed the U.S. Embassy on Sunday. Sept. 13, Damascus, Syria: Four gunman attack the American embassy. 2007 Jan. 12, Athens, Greece: the U.S. embassy was fired on by an anti-tank missile causing damage but no injuries. February 17, A JAPANESE extreme left-wing group has claimed responsibility for a small explosion near a US army base outside Tokyo ahead of US Vice President Dick Cheney's visit to Japan.", 
        "reply": " I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:29:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years.", 
        "intTime": 20090518, 
        "postID": 24, 
        "quote": "Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles.", 
        "reply": " It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:35:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 25, 
        "quote": "Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years.", 
        "reply": " It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:37:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops You are inccorect: February 26, 1993, look it up.", 
        "intTime": 20090518, 
        "postID": 26, 
        "quote": "Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops", 
        "reply": " You are inccorect: February 26, 1993, look it up.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:41:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we? So you accused President Clinton of treason based on speculation. That is pretty low.", 
        "intTime": 20090518, 
        "postID": 27, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we?", 
        "reply": " So you accused President Clinton of treason based on speculation. That is pretty low.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:42:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops You are inccorect: February 26, 1993, look it up. I can't remember that far back, i was healing from a gun shot wound in Oct 93 Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 28, 
        "quote": "Originally posted by xerello: quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops You are inccorect: February 26, 1993, look it up.", 
        "reply": " I can't remember that far back, i was healing from a gun shot wound in Oct 93 Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:46:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we? So you accused President Clinton of treason based on speculation. That is pretty low. MY God!!!! another mind reading decisionist member, pretty soon they'll be the majority here and we 'others' won't have to post anything what we say or think, you'll do it for them, you'll be wrong all the time but, do you give a crap?", 
        "intTime": 20090518, 
        "postID": 29, 
        "quote": "Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we? So you accused President Clinton of treason based on speculation. That is pretty low.", 
        "reply": " MY God!!!! another mind reading decisionist member, pretty soon they'll be the majority here and we 'others' won't have to post anything what we say or think, you'll do it for them, you'll be wrong all the time but, do you give a crap?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 12:33:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: Oddly enough, if you listen to what OBL said about 9/11, it has more to do with US military presence in Saudi Arabia (Islamic holy ground) than with a particular POTUS' policies. It has more to do with our unofficial (or perhaps official) policy of supporting Israel, right or wrong. If you believe OBL when he says that those are the reasons he hates America (don't forget, he was once indifferent to us), then you have to be willing to point the finger at every president since Carter and maybe even since Truman (when it became fashionable to establish nation-states by convention and treaty). I concur with everything you've said here CPT. I have read this also, where OBL hated us for exactly the \"main\" two reasons you cite. The US military presence in Saudia Arabia, and our adamant support, first and foremost of Israel, while denying equal status to the Palestinians who are also citizens of the state of Israel. Hopefully, there will be a two-state solution under President Obama's watch. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 30, 
        "quote": "Originally posted by QuanticoBornMarine: Oddly enough, if you listen to what OBL said about 9/11, it has more to do with US military presence in Saudi Arabia (Islamic holy ground) than with a particular POTUS' policies. It has more to do with our unofficial (or perhaps official) policy of supporting Israel, right or wrong. If you believe OBL when he says that those are the reasons he hates America (don't forget, he was once indifferent to us), then you have to be willing to point the finger at every president since Carter and maybe even since Truman (when it became fashionable to establish nation-states by convention and treaty).", 
        "reply": " I concur with everything you've said here CPT. I have read this also, where OBL hated us for exactly the \"main\" two reasons you cite. The US military presence in Saudia Arabia, and our adamant support, first and foremost of Israel, while denying equal status to the Palestinians who are also citizens of the state of Israel. Hopefully, there will be a two-state solution under President Obama's watch. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 17:56:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "In February 1993, a car bomb was detonated in the underground garage of the North Tower of the World Trade Center in New York City. The terrorist’s plan was for the 1,500 lb bomb to knock the North Tower into the South Tower, bringing both towers down and killing thousands of people. Ramzi Ahmed Yousef was convicted as the mastermind of that attack and sentenced to life in prison without parole. Yousef's uncle is Khalid Shaikh Mohammed, the mastermind of the 9/11 attacks. Eight and a half years later al Qaeda struck again on 9/11/01. It has been a little over seven and a half years since the 9/11 attack. In that time, the Bush Administration has used extraordinary measures to keep American from being attacked again. President Bush and his supporters claim that keeping America safe from another attack since 9/11 has been one of the Bush Administration’s greatest achievements. By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone?", 
        "intTime": 20090518, 
        "postID": 31, 
        "quote": "", 
        "reply": "In February 1993, a car bomb was detonated in the underground garage of the North Tower of the World Trade Center in New York City. The terrorist’s plan was for the 1,500 lb bomb to knock the North Tower into the South Tower, bringing both towers down and killing thousands of people. Ramzi Ahmed Yousef was convicted as the mastermind of that attack and sentenced to life in prison without parole. Yousef's uncle is Khalid Shaikh Mohammed, the mastermind of the 9/11 attacks. Eight and a half years later al Qaeda struck again on 9/11/01. It has been a little over seven and a half years since the 9/11 attack. In that time, the Bush Administration has used extraordinary measures to keep American from being attacked again. President Bush and his supporters claim that keeping America safe from another attack since 9/11 has been one of the Bush Administration’s greatest achievements. By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 07:37:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "Is it possible that this is a politically-loaded question? Say it isn't so. But, I'll bite. First, you have to define torture. EIT is decidedly not torture. I suppose, if we apply by your logic, every POTUS since FDR kept us safe from an attack on American soil UNTIL Clinton. I don't think one person, even the POTUS, deserves so much credit or blame. Every QB buys his linemen dinner after a sackless game for good reason. Now, my question to you...are you opposed to torture and why or why not? \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 32, 
        "quote": "", 
        "reply": "Is it possible that this is a politically-loaded question? Say it isn't so. But, I'll bite. First, you have to define torture. EIT is decidedly not torture. I suppose, if we apply by your logic, every POTUS since FDR kept us safe from an attack on American soil UNTIL Clinton. I don't think one person, even the POTUS, deserves so much credit or blame. Every QB buys his linemen dinner after a sackless game for good reason. Now, my question to you...are you opposed to torture and why or why not? \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 07:45:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don", 
        "intTime": 20090518, 
        "postID": 33, 
        "quote": "Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone?", 
        "reply": " Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 07:48:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I think that terrorism is something that is very difficult to prevent, no matter what measures are taken to combat it. Look at Israel, Europe, Asia, etc. Terrorists will always find some target and attack it if they have the capacity. I blame neither Bush, nor Clinton for 9/11. I don't blame any President for not preventing any given terrorist attack. I blame the terrorists. We can only go so far to protect ourselves. For God's sake we've been fighting crime in America since the country was founded and it still destroys thousands of American lives every year. Though it is subjective and often difficult to define, reasonable measures should always be taken to prevent terrorist attacks. More often than not it means that Federal and local law enforcement, combined with awareness, and national intelligence services need to work together to share information and investigate possible attacks. That alone would have probably prevented 9/11. We are a country of over 300 million people. One terrorist can kill hundreds or thousands depending on numerous and sundry factors.", 
        "intTime": 20090518, 
        "postID": 34, 
        "quote": "", 
        "reply": "I think that terrorism is something that is very difficult to prevent, no matter what measures are taken to combat it. Look at Israel, Europe, Asia, etc. Terrorists will always find some target and attack it if they have the capacity. I blame neither Bush, nor Clinton for 9/11. I don't blame any President for not preventing any given terrorist attack. I blame the terrorists. We can only go so far to protect ourselves. For God's sake we've been fighting crime in America since the country was founded and it still destroys thousands of American lives every year. Though it is subjective and often difficult to define, reasonable measures should always be taken to prevent terrorist attacks. More often than not it means that Federal and local law enforcement, combined with awareness, and national intelligence services need to work together to share information and investigate possible attacks. That alone would have probably prevented 9/11. We are a country of over 300 million people. One terrorist can kill hundreds or thousands depending on numerous and sundry factors.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 07:54:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013", 
        "intTime": 20090518, 
        "postID": 35, 
        "quote": "...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years...", 
        "reply": " Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:01:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: Is it possible that this is a politically-loaded question? Say it isn't so. But, I'll bite. First, you have to define torture. EIT is decidedly not torture. I suppose, if we apply by your logic, every POTUS since FDR kept us safe from an attack on American soil UNTIL Clinton. I don't think one person, even the POTUS, deserves so much credit or blame. Every QB buys his linemen dinner after a sackless game for good reason. Now, my question to you...are you opposed to torture and why or why not? The logic is not mine – it is that of President Bush: \"There is legitimate debate about many of these decisions. But there can be little debate about the results. America has gone more than seven years without another terrorist attack on our soil.\" GW Bush, January 2009. There are plenty of threads about the torture debate – if torture is torture and is torture is legal. This one is about what is necessary to keep America safe. Do you think it is absolutely necessary to torture people to keep America safe?", 
        "intTime": 20090518, 
        "postID": 36, 
        "quote": "Originally posted by QuanticoBornMarine: Is it possible that this is a politically-loaded question? Say it isn't so. But, I'll bite. First, you have to define torture. EIT is decidedly not torture. I suppose, if we apply by your logic, every POTUS since FDR kept us safe from an attack on American soil UNTIL Clinton. I don't think one person, even the POTUS, deserves so much credit or blame. Every QB buys his linemen dinner after a sackless game for good reason. Now, my question to you...are you opposed to torture and why or why not?", 
        "reply": " The logic is not mine – it is that of President Bush: \"There is legitimate debate about many of these decisions. But there can be little debate about the results. America has gone more than seven years without another terrorist attack on our soil.\" GW Bush, January 2009. There are plenty of threads about the torture debate – if torture is torture and is torture is legal. This one is about what is necessary to keep America safe. Do you think it is absolutely necessary to torture people to keep America safe?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:02:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton?", 
        "intTime": 20090518, 
        "postID": 37, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don", 
        "reply": " I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:07:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: The logic is not mine – it is that of President Bush: \"There is legitimate debate about many of these decisions. But there can be little debate about the results. America has gone more than seven years without another terrorist attack on our soil.\" GW Bush, January 2009. There are plenty of threads about the torture debate – if torture is torture and is torture is legal. This one is about what is necessary to keep America safe. Do you think it is absolutely necessary to torture people to keep America safe? Fair enough, it may be his logic. I don't necessarily agree with it (see my QB analogy). To answer your question, I do NOT think torture is necessary or even desireable to keep America safe. I think the very real threat of swift, decisive, and violent action in response to an act of terror is all that is necessary. We have a seemingly zero tolerance policy on torture. Not so with collateral damage that occurs as a result of a response to a hostile act. Do I like it? Not particularly, but you didn't ask if I liked it. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 38, 
        "quote": "Originally posted by xerello: The logic is not mine – it is that of President Bush: \"There is legitimate debate about many of these decisions. But there can be little debate about the results. America has gone more than seven years without another terrorist attack on our soil.\" GW Bush, January 2009. There are plenty of threads about the torture debate – if torture is torture and is torture is legal. This one is about what is necessary to keep America safe. Do you think it is absolutely necessary to torture people to keep America safe?", 
        "reply": " Fair enough, it may be his logic. I don't necessarily agree with it (see my QB analogy). To answer your question, I do NOT think torture is necessary or even desireable to keep America safe. I think the very real threat of swift, decisive, and violent action in response to an act of terror is all that is necessary. We have a seemingly zero tolerance policy on torture. Not so with collateral damage that occurs as a result of a response to a hostile act. Do I like it? Not particularly, but you didn't ask if I liked it. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:17:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? I have no problem with Clinton taking credit. I did however work as a Federal LEO during the Clinton years and all I saw were cutbacks in funding and personnel. Ya, he (Clinton) did a heck of a job on giving the U.S. protection. By the way, under Bush, the Feds were finally authorized to build their forces back up. Don", 
        "intTime": 20090518, 
        "postID": 39, 
        "quote": "Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton?", 
        "reply": " I have no problem with Clinton taking credit. I did however work as a Federal LEO during the Clinton years and all I saw were cutbacks in funding and personnel. Ya, he (Clinton) did a heck of a job on giving the U.S. protection. By the way, under Bush, the Feds were finally authorized to build their forces back up. Don", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:21:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090518, 
        "postID": 40, 
        "quote": "Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013", 
        "reply": " Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:34:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. Yet as lame as President Clinton was, there was not another attack on American soil during his term, even though he created \"the environment where we were vulnerable to such an attack.\" President Bush did harden the American target, there is no doubt about that. But did he really prevent another attack, or does it take a long time for al Qaeda to mount an attack?", 
        "intTime": 20090518, 
        "postID": 41, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you.", 
        "reply": " Yet as lame as President Clinton was, there was not another attack on American soil during his term, even though he created \"the environment where we were vulnerable to such an attack.\" President Bush did harden the American target, there is no doubt about that. But did he really prevent another attack, or does it take a long time for al Qaeda to mount an attack?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:43:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "I do not fault President Clinton for the 9-11 terrorist attacks. But I do fault him for the 1995 Oklahoma City terrorist attack. If \"enhanced interrogation techniques\" had been used against Timothy McVeigh during the time he was in custody prior to his executon, the U.S. Government could have possibly rounded up loads of anti-American Right-wingnuts who still threaten the country's existance today. I would even suggest using \"enhanced interrogation techniques\" on Eric Rudolph, the abortion clinic and Atlanta Olympics bomber presently in federal prison, to get intelligence against the terrorists within the anti-abortion movement (such as the Army of God and radical elements of Operation Rescue). If it wasn't a matter of dumb luck, my daughter might have been killed by anti-abortion terrorist John Salvi (she oversplept and missed her appointment that day for a routine annual medical exam at one of the clinics he shot up, killing two clinic employees). Putting these home-grown terrorists away would definitely keep America safer.", 
        "intTime": 20090518, 
        "postID": 42, 
        "quote": "", 
        "reply": "I do not fault President Clinton for the 9-11 terrorist attacks. But I do fault him for the 1995 Oklahoma City terrorist attack. If \"enhanced interrogation techniques\" had been used against Timothy McVeigh during the time he was in custody prior to his executon, the U.S. Government could have possibly rounded up loads of anti-American Right-wingnuts who still threaten the country's existance today. I would even suggest using \"enhanced interrogation techniques\" on Eric Rudolph, the abortion clinic and Atlanta Olympics bomber presently in federal prison, to get intelligence against the terrorists within the anti-abortion movement (such as the Army of God and radical elements of Operation Rescue). If it wasn't a matter of dumb luck, my daughter might have been killed by anti-abortion terrorist John Salvi (she oversplept and missed her appointment that day for a routine annual medical exam at one of the clinics he shot up, killing two clinic employees). Putting these home-grown terrorists away would definitely keep America safer.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:53:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by PinkBlossoms: quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. Yet as lame as President Clinton was, there was not another attack on American soil during his term, even though he created \"the environment where we were vulnerable to such an attack.\" President Bush did harden the American target, there is no doubt about that. But did he really prevent another attack, or does it take a long time for al Qaeda to mount an attack? Well, I for one am confused. I hear people all the time say that Bush gets all the credit for keeping the country safe. And yet, the 9/11 attacks occured nine monthts into the Bush administration's time in office. So the attacks occured on Bush's watch. Now, people can make the argument that it was Clinton's fault that the country had her guard down, which allowed for the 9/11 attacks. My question is, is Bush himself not guilty for 9/11, since he was already in office nine months prior to the attacks? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 43, 
        "quote": "Originally posted by xerello: quote: Originally posted by PinkBlossoms: quote: Originally posted by sullivan013: quote: ...didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years... Only in the cartoony world members of the Democratic Party seem to reside. If you wear very dark rosy glasses and look at the world leaning WAY to the left and then squint so the light of truth doesn't illuminate the situtation too much, you just might see it that way. In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. He further reduced the CIA funding of HUMINT (Human Intelligence) infrastructure, leaving us at the mercy of purely SIGINT (Signals Intelligence) sources to anticipate the actions of such threats. Clinton then responded to overt threats such as the Cole bombing and the attack on the East African embassies by inept and impotent 'missile strikes' in the Sudan and Afghanistan that accomplished absolutely nothing but increase the resolve of terrorist organizations that they could strike American targets and suffer no adverse results. The truth is, Clinton was asleep at the helm of the ship of state. If anything, his actions and response to threats INVITED the 9-11 attacks as they were planned, developed and the terrorists trained during his second term - in near complete safety. Did they happen during his watch? No. Did any of his actions prevent them? No. Did his actions (or inaction) create the environment where we were vulnerable to such an attack? Absolutely. Sullivan013 Wow, that was an outstanding summary of events. Thanks for a reality post! Truly, can I save it and quote you sometime down the road when need be? A whole era of dereliction of duty was concisely stated in your one post. Thank you. Yet as lame as President Clinton was, there was not another attack on American soil during his term, even though he created \"the environment where we were vulnerable to such an attack.\" President Bush did harden the American target, there is no doubt about that. But did he really prevent another attack, or does it take a long time for al Qaeda to mount an attack?", 
        "reply": " Well, I for one am confused. I hear people all the time say that Bush gets all the credit for keeping the country safe. And yet, the 9/11 attacks occured nine monthts into the Bush administration's time in office. So the attacks occured on Bush's watch. Now, people can make the argument that it was Clinton's fault that the country had her guard down, which allowed for the 9/11 attacks. My question is, is Bush himself not guilty for 9/11, since he was already in office nine months prior to the attacks? No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 08:59:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Then let me put it this way, so you understand how much damage was done by the man: Think of it like pruning a tree. It's easy and fast to cut a branch off, but growing it back takes a good deal longer, sometimes years. So Clinton cutting the military and CIA HUMINT infrastructure was an easy, quick stroke of the pen. Simply sign the order and the funding stops. Soldiers and (more importantly) mid-grade officers and NCOs leave the service, not to return. Intelligence sorces, funded by CIA dollars and contacted by agents are simply not paid the next year, and no CIA operative is available to gather the intelligence, even if the money WAS available. And the country sleeps, unaware of the true impact of this 'pruning'. A crisis arises. Inexact intelligence sources show an increase in activity, but without the HUMINT sources we used to pay and support, we're stuck with only the shadow play of SIGINT, without on-the-ground verification means. These cannot be recontructed on the fly - making contacts and recruiting informants takes time, effort and above all - patience. Nine months isn't nearly enough time to create such a verification process. Here's the most damning part: Neither is nine months or even nine YEARS enough to rebuild a US Army division. None of those mid-grade officers and NCOs who left ever make senior rank. The slots they held in the 90s were not available for junior officers and NCOs to occupy when their time came. Those that did make mid-grade aren't enough to flesh out new units during a crisis - they're needed in the fighting line. Growth of the military cannot take place during wartime due to the immediate needs of the forces. The basic equipment issue would take a full year or two alone, but the biggest problem is personnel. You see, it takes a decade to create those mid-grade officers and NCOs that Clinton pruned in the 90s. You can grouse about needing a draft all you want, but someone has to train and lead those soldiers, and unless you want E-5s as company 1SGs or 1LT Battalion commanders, you're going to be hard pressed to adequately man the staff structure of these 'new units'. It just can't be done in the modern world without severe costs as these new Battalion and Brigade staffs learn the hard lessons in months when they should have years to perfect them. We've seen it before: Bull Run, Kassarine Pass, Task Force Smith. This was the cost of the 'peace dividend' that Clinton cashed during his time as President. The sad thing is, some of us who left anticipated in 1993-95 what might happen if we went to war again after Clinton's cuts, but the public was too enthralled with the booming economy and 'aw shucks' attitude of the POTUS to worry,...or care. quote: \"God and the soldier we adore, in times of trouble, not before, With the crisis past, and all things righted God is forgotten, the soldier slighted.\" Winston Churchill Sullivan013", 
        "intTime": 20090518, 
        "postID": 44, 
        "quote": "\"God and the soldier we adore, in times of trouble, not before, With the crisis past, and all things righted God is forgotten, the soldier slighted.\" Winston Churchill", 
        "reply": "Then let me put it this way, so you understand how much damage was done by the man: Think of it like pruning a tree. It's easy and fast to cut a branch off, but growing it back takes a good deal longer, sometimes years. So Clinton cutting the military and CIA HUMINT infrastructure was an easy, quick stroke of the pen. Simply sign the order and the funding stops. Soldiers and (more importantly) mid-grade officers and NCOs leave the service, not to return. Intelligence sorces, funded by CIA dollars and contacted by agents are simply not paid the next year, and no CIA operative is available to gather the intelligence, even if the money WAS available. And the country sleeps, unaware of the true impact of this 'pruning'. A crisis arises. Inexact intelligence sources show an increase in activity, but without the HUMINT sources we used to pay and support, we're stuck with only the shadow play of SIGINT, without on-the-ground verification means. These cannot be recontructed on the fly - making contacts and recruiting informants takes time, effort and above all - patience. Nine months isn't nearly enough time to create such a verification process. Here's the most damning part: Neither is nine months or even nine YEARS enough to rebuild a US Army division. None of those mid-grade officers and NCOs who left ever make senior rank. The slots they held in the 90s were not available for junior officers and NCOs to occupy when their time came. Those that did make mid-grade aren't enough to flesh out new units during a crisis - they're needed in the fighting line. Growth of the military cannot take place during wartime due to the immediate needs of the forces. The basic equipment issue would take a full year or two alone, but the biggest problem is personnel. You see, it takes a decade to create those mid-grade officers and NCOs that Clinton pruned in the 90s. You can grouse about needing a draft all you want, but someone has to train and lead those soldiers, and unless you want E-5s as company 1SGs or 1LT Battalion commanders, you're going to be hard pressed to adequately man the staff structure of these 'new units'. It just can't be done in the modern world without severe costs as these new Battalion and Brigade staffs learn the hard lessons in months when they should have years to perfect them. We've seen it before: Bull Run, Kassarine Pass, Task Force Smith. This was the cost of the 'peace dividend' that Clinton cashed during his time as President. The sad thing is, some of us who left anticipated in 1993-95 what might happen if we went to war again after Clinton's cuts, but the public was too enthralled with the booming economy and 'aw shucks' attitude of the POTUS to worry,...or care.  Sullivan013", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:25:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "Oddly enough, if you listen to what OBL said about 9/11, it has more to do with US military presence in Saudi Arabia (Islamic holy ground) than with a particular POTUS' policies. It has more to do with our unofficial (or perhaps official) policy of supporting Israel, right or wrong. If you believe OBL when he says that those are the reasons he hates America (don't forget, he was once indifferent to us), then you have to be willing to point the finger at every president since Carter and maybe even since Truman (when it became fashionable to establish nation-states by convention and treaty). \"Common sense was an uncommon virtue\"", 
        "intTime": 20090518, 
        "postID": 45, 
        "quote": "", 
        "reply": "Oddly enough, if you listen to what OBL said about 9/11, it has more to do with US military presence in Saudi Arabia (Islamic holy ground) than with a particular POTUS' policies. It has more to do with our unofficial (or perhaps official) policy of supporting Israel, right or wrong. If you believe OBL when he says that those are the reasons he hates America (don't forget, he was once indifferent to us), then you have to be willing to point the finger at every president since Carter and maybe even since Truman (when it became fashionable to establish nation-states by convention and treaty). \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:28:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Oderint Dum Metuant. Lucius Accius What you speak of is motivation. That is something that is extrodinarily difficult to control and you would be a fool to think you could do so absolutely. Someone will always find a way to hate us and our society, whether it is over MacDonalds, Maytag or Maybeline. What I speak of is the physical capability of our nation to face adversity, threats, and aggression. Clinton dismantled the one in the absence of improvement in the other. And as for believing OBL, I'd rather quote Goebbels. Do you really think his messages are for us? They are for one particular point: recruitment. Sullivan013", 
        "intTime": 20090518, 
        "postID": 46, 
        "quote": "Oderint Dum Metuant. Lucius Accius", 
        "reply": " What you speak of is motivation. That is something that is extrodinarily difficult to control and you would be a fool to think you could do so absolutely. Someone will always find a way to hate us and our society, whether it is over MacDonalds, Maytag or Maybeline. What I speak of is the physical capability of our nation to face adversity, threats, and aggression. Clinton dismantled the one in the absence of improvement in the other. And as for believing OBL, I'd rather quote Goebbels. Do you really think his messages are for us? They are for one particular point: recruitment. Sullivan013", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:44:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 47, 
        "quote": "Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton?", 
        "reply": " USS Cole, Kenya, Tanazania. all happened under Clinton. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:54:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon. Ya forgot one: Slick Willie sold American soil to the Chinese Govt. A couple of West Coast Seaports, if I'm not mistaken.... BUT, in his favor He DID go to great lengths, on prime-time television, to explain to my children why certain physical acts (with descriptions) should not be considered \"sex\"...", 
        "intTime": 20090518, 
        "postID": 48, 
        "quote": "In the real world, Clinton's response to the threat posed by terrorists was to reduce the very means by which America had to reply. He dismantled the Cold War military by reducing it by half, cut the defense budget so that necessary training was all but impossible, and refused to fund the modernization of the force's communication upgrade at the rate requested by the Pentagon.", 
        "reply": " Ya forgot one: Slick Willie sold American soil to the Chinese Govt. A couple of West Coast Seaports, if I'm not mistaken.... BUT, in his favor He DID go to great lengths, on prime-time television, to explain to my children why certain physical acts (with descriptions) should not be considered \"sex\"...", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 10:55:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'.", 
        "intTime": 20090518, 
        "postID": 49, 
        "quote": "Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone?", 
        "reply": " Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:01:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton. Domestic attacks by al Qaeda – there have been two, both on the twin towers. If it is foreign attacks that you are referring to, terrorists were very busy during President Bush’s watch, even if you do not count all the Americans they have killed in Iraq and Afghanistan. 2002 June 14, Karachi, Pakistan: bomb exploded outside American consulate in Karachi, Pakistan, killing 12. Linked to al-Qaeda. 2003 May 12, Riyadh, Saudi Arabia: suicide bombers killed 34, including 8 Americans, at housing compounds for Westerners. Al-Qaeda suspected. 2004 May 29–31, Riyadh, Saudi Arabia: terrorists attack the offices of a Saudi oil company in Khobar, Saudi Arabia, take foreign oil workers hostage in a nearby residential compound, leaving 22 people dead including one American. June 11–19, Riyadh, Saudi Arabia: terrorists kidnap and execute Paul Johnson Jr., an American, in Riyadh, Saudi Arabia. 2 other Americans and a BBC cameraman killed by gun attacks. Dec. 6, Jeddah, Saudi Arabia: terrorists storm the U.S. consulate, killing 5 consulate employees. 4 terrorists were killed by Saudi security. 2005 January 30, BAGHDAD, Iraq — U.S. forces on Saturday captured seven suspected insurgents believed to be behind an attack on the U.S. Embassy in Baghdad that killed two Americans and wounded six. Nov. 9, Amman, Jordan: Suicide bombers hit 3 American hotels, Radisson, Grand Hyatt, and Days Inn, in Amman, Jordan, killing 57. Al-Qaeda claimed responsibility. 2006 Feb. 19, 2006 JAKARTA, Indonesia - Hundreds of Muslims protesting caricatures of the Prophet Muhammad stormed the U.S. Embassy on Sunday. Sept. 13, Damascus, Syria: Four gunman attack the American embassy. 2007 Jan. 12, Athens, Greece: the U.S. embassy was fired on by an anti-tank missile causing damage but no injuries. February 17, A JAPANESE extreme left-wing group has claimed responsibility for a small explosion near a US army base outside Tokyo ahead of US Vice President Dick Cheney's visit to Japan.", 
        "intTime": 20090518, 
        "postID": 50, 
        "quote": "Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton.", 
        "reply": " Domestic attacks by al Qaeda – there have been two, both on the twin towers. If it is foreign attacks that you are referring to, terrorists were very busy during President Bush’s watch, even if you do not count all the Americans they have killed in Iraq and Afghanistan. 2002 June 14, Karachi, Pakistan: bomb exploded outside American consulate in Karachi, Pakistan, killing 12. Linked to al-Qaeda. 2003 May 12, Riyadh, Saudi Arabia: suicide bombers killed 34, including 8 Americans, at housing compounds for Westerners. Al-Qaeda suspected. 2004 May 29–31, Riyadh, Saudi Arabia: terrorists attack the offices of a Saudi oil company in Khobar, Saudi Arabia, take foreign oil workers hostage in a nearby residential compound, leaving 22 people dead including one American. June 11–19, Riyadh, Saudi Arabia: terrorists kidnap and execute Paul Johnson Jr., an American, in Riyadh, Saudi Arabia. 2 other Americans and a BBC cameraman killed by gun attacks. Dec. 6, Jeddah, Saudi Arabia: terrorists storm the U.S. consulate, killing 5 consulate employees. 4 terrorists were killed by Saudi security. 2005 January 30, BAGHDAD, Iraq — U.S. forces on Saturday captured seven suspected insurgents believed to be behind an attack on the U.S. Embassy in Baghdad that killed two Americans and wounded six. Nov. 9, Amman, Jordan: Suicide bombers hit 3 American hotels, Radisson, Grand Hyatt, and Days Inn, in Amman, Jordan, killing 57. Al-Qaeda claimed responsibility. 2006 Feb. 19, 2006 JAKARTA, Indonesia - Hundreds of Muslims protesting caricatures of the Prophet Muhammad stormed the U.S. Embassy on Sunday. Sept. 13, Damascus, Syria: Four gunman attack the American embassy. 2007 Jan. 12, Athens, Greece: the U.S. embassy was fired on by an anti-tank missile causing damage but no injuries. February 17, A JAPANESE extreme left-wing group has claimed responsibility for a small explosion near a US army base outside Tokyo ahead of US Vice President Dick Cheney's visit to Japan.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:04:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there.", 
        "intTime": 20090518, 
        "postID": 51, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'.", 
        "reply": " Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:08:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we?", 
        "intTime": 20090518, 
        "postID": 52, 
        "quote": "Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there.", 
        "reply": " I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:24:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton. Domestic attacks by al Qaeda – there have been two, both on the twin towers. If it is foreign attacks that you are referring to, terrorists were very busy during President Bush’s watch, even if you do not count all the Americans they have killed in Iraq and Afghanistan. 2002 June 14, Karachi, Pakistan: bomb exploded outside American consulate in Karachi, Pakistan, killing 12. Linked to al-Qaeda. 2003 May 12, Riyadh, Saudi Arabia: suicide bombers killed 34, including 8 Americans, at housing compounds for Westerners. Al-Qaeda suspected. 2004 May 29–31, Riyadh, Saudi Arabia: terrorists attack the offices of a Saudi oil company in Khobar, Saudi Arabia, take foreign oil workers hostage in a nearby residential compound, leaving 22 people dead including one American. June 11–19, Riyadh, Saudi Arabia: terrorists kidnap and execute Paul Johnson Jr., an American, in Riyadh, Saudi Arabia. 2 other Americans and a BBC cameraman killed by gun attacks. Dec. 6, Jeddah, Saudi Arabia: terrorists storm the U.S. consulate, killing 5 consulate employees. 4 terrorists were killed by Saudi security. 2005 January 30, BAGHDAD, Iraq — U.S. forces on Saturday captured seven suspected insurgents believed to be behind an attack on the U.S. Embassy in Baghdad that killed two Americans and wounded six. Nov. 9, Amman, Jordan: Suicide bombers hit 3 American hotels, Radisson, Grand Hyatt, and Days Inn, in Amman, Jordan, killing 57. Al-Qaeda claimed responsibility. 2006 Feb. 19, 2006 JAKARTA, Indonesia - Hundreds of Muslims protesting caricatures of the Prophet Muhammad stormed the U.S. Embassy on Sunday. Sept. 13, Damascus, Syria: Four gunman attack the American embassy. 2007 Jan. 12, Athens, Greece: the U.S. embassy was fired on by an anti-tank missile causing damage but no injuries. February 17, A JAPANESE extreme left-wing group has claimed responsibility for a small explosion near a US army base outside Tokyo ahead of US Vice President Dick Cheney's visit to Japan. I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 53, 
        "quote": "Originally posted by xerello: quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Are you under the impression that the CIA never got physical in any interrogations during the Clinton years? Do you think that info would be posted on some public information section of CIA.com? Don I am not under the impression, but sure that it was not the policy of the Clinton Administration to torture people. I am sure that there was not another attack on America for 8.5 years from the first attack on the twin towers. If President Bush can take credit for a lack of attack, why not President Clinton? USS Cole, Kenya, Tanazania. all happened under Clinton. Domestic attacks by al Qaeda – there have been two, both on the twin towers. If it is foreign attacks that you are referring to, terrorists were very busy during President Bush’s watch, even if you do not count all the Americans they have killed in Iraq and Afghanistan. 2002 June 14, Karachi, Pakistan: bomb exploded outside American consulate in Karachi, Pakistan, killing 12. Linked to al-Qaeda. 2003 May 12, Riyadh, Saudi Arabia: suicide bombers killed 34, including 8 Americans, at housing compounds for Westerners. Al-Qaeda suspected. 2004 May 29–31, Riyadh, Saudi Arabia: terrorists attack the offices of a Saudi oil company in Khobar, Saudi Arabia, take foreign oil workers hostage in a nearby residential compound, leaving 22 people dead including one American. June 11–19, Riyadh, Saudi Arabia: terrorists kidnap and execute Paul Johnson Jr., an American, in Riyadh, Saudi Arabia. 2 other Americans and a BBC cameraman killed by gun attacks. Dec. 6, Jeddah, Saudi Arabia: terrorists storm the U.S. consulate, killing 5 consulate employees. 4 terrorists were killed by Saudi security. 2005 January 30, BAGHDAD, Iraq — U.S. forces on Saturday captured seven suspected insurgents believed to be behind an attack on the U.S. Embassy in Baghdad that killed two Americans and wounded six. Nov. 9, Amman, Jordan: Suicide bombers hit 3 American hotels, Radisson, Grand Hyatt, and Days Inn, in Amman, Jordan, killing 57. Al-Qaeda claimed responsibility. 2006 Feb. 19, 2006 JAKARTA, Indonesia - Hundreds of Muslims protesting caricatures of the Prophet Muhammad stormed the U.S. Embassy on Sunday. Sept. 13, Damascus, Syria: Four gunman attack the American embassy. 2007 Jan. 12, Athens, Greece: the U.S. embassy was fired on by an anti-tank missile causing damage but no injuries. February 17, A JAPANESE extreme left-wing group has claimed responsibility for a small explosion near a US army base outside Tokyo ahead of US Vice President Dick Cheney's visit to Japan.", 
        "reply": " I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:29:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years.", 
        "intTime": 20090518, 
        "postID": 54, 
        "quote": "Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles.", 
        "reply": " It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:35:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 55, 
        "quote": "Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years.", 
        "reply": " It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:37:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops You are inccorect: February 26, 1993, look it up.", 
        "intTime": 20090518, 
        "postID": 56, 
        "quote": "Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops", 
        "reply": " You are inccorect: February 26, 1993, look it up.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:41:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we? So you accused President Clinton of treason based on speculation. That is pretty low.", 
        "intTime": 20090518, 
        "postID": 57, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we?", 
        "reply": " So you accused President Clinton of treason based on speculation. That is pretty low.", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:42:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops You are inccorect: February 26, 1993, look it up. I can't remember that far back, i was healing from a gun shot wound in Oct 93 Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 58, 
        "quote": "Originally posted by xerello: quote: Originally posted by L0A1: quote: Originally posted by xerello: quote: Originally posted by L0A1: I guess part of our strategy to keep the war off the US shores is working? It would seem so looking at these articles. It worked for President Clinton also - no domestic attack by foreign terrorist for eight and a half years. It was in 1996 that we had the trade center bombing, you can give him 4 not 8 years. 5 tops You are inccorect: February 26, 1993, look it up.", 
        "reply": " I can't remember that far back, i was healing from a gun shot wound in Oct 93 Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 11:46:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we? So you accused President Clinton of treason based on speculation. That is pretty low. MY God!!!! another mind reading decisionist member, pretty soon they'll be the majority here and we 'others' won't have to post anything what we say or think, you'll do it for them, you'll be wrong all the time but, do you give a crap?", 
        "intTime": 20090518, 
        "postID": 59, 
        "quote": "Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by xerello: By that same reasoning, didn’t President Clinton keep us safe from another attack on American soil by foreign terrorist for eight and a half years – without torturing anyone? Why would anyone want to attack us when our administration at that time, Clinton, Clinton and Lewinski, where giving away nuclear technoligy and refrained from capturing/killing their leader, Osama? Republicans, 'walk softly but carry a big stick'. Democrats, 'tiptoe through the tulips'. Did you just write that Lewinski was involved in giving nuclear technology to those who follow Osama? Those are some hardcore right wing websites you are visiting there. I guess you missed all the news items from the oval office during that time. Ya never know, Slick willie, while getting a BJ from under the desk, was talking on the phone doing business, with who, I can't remember but it could have been deal making to pacify North Korea by giving them nuclear technoligy. Who knows what went on? We, the people, will never know, will we? So you accused President Clinton of treason based on speculation. That is pretty low.", 
        "reply": " MY God!!!! another mind reading decisionist member, pretty soon they'll be the majority here and we 'others' won't have to post anything what we say or think, you'll do it for them, you'll be wrong all the time but, do you give a crap?", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 12:33:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: Oddly enough, if you listen to what OBL said about 9/11, it has more to do with US military presence in Saudi Arabia (Islamic holy ground) than with a particular POTUS' policies. It has more to do with our unofficial (or perhaps official) policy of supporting Israel, right or wrong. If you believe OBL when he says that those are the reasons he hates America (don't forget, he was once indifferent to us), then you have to be willing to point the finger at every president since Carter and maybe even since Truman (when it became fashionable to establish nation-states by convention and treaty). I concur with everything you've said here CPT. I have read this also, where OBL hated us for exactly the \"main\" two reasons you cite. The US military presence in Saudia Arabia, and our adamant support, first and foremost of Israel, while denying equal status to the Palestinians who are also citizens of the state of Israel. Hopefully, there will be a two-state solution under President Obama's watch. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090518, 
        "postID": 60, 
        "quote": "Originally posted by QuanticoBornMarine: Oddly enough, if you listen to what OBL said about 9/11, it has more to do with US military presence in Saudi Arabia (Islamic holy ground) than with a particular POTUS' policies. It has more to do with our unofficial (or perhaps official) policy of supporting Israel, right or wrong. If you believe OBL when he says that those are the reasons he hates America (don't forget, he was once indifferent to us), then you have to be willing to point the finger at every president since Carter and maybe even since Truman (when it became fashionable to establish nation-states by convention and treaty).", 
        "reply": " I concur with everything you've said here CPT. I have read this also, where OBL hated us for exactly the \"main\" two reasons you cite. The US military presence in Saudia Arabia, and our adamant support, first and foremost of Israel, while denying equal status to the Palestinians who are also citizens of the state of Israel. Hopefully, there will be a two-state solution under President Obama's watch. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_3980045322001", 
        "time": "2009-05-18 17:56:00", 
        "title": "What is Necessary to Keep American Safe?", 
        "userID": "ProgMod"
    }
]