[
    {
        "content": "No, not really but when you see this you might wish there was some. At a public event some guy who thinks he's a wizard gets buck naked. The cops start out by trying to nicely convince him to put his clothes back on but he consistently refuses. This guy has absolutely no reason to ever want to get naked in public. One look at the family jewels will show that he comes from an extremely poor family. Anyway, the cops try until they realize he's an azzhole. Then they put on the blue rubber gloves and things get ugly. When cops ask you nicely to stop breaking the law, maybe you should do that. >http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html", 
        "intTime": 20090426, 
        "postID": 1, 
        "quote": "", 
        "reply": "No, not really but when you see this you might wish there was some. At a public event some guy who thinks he's a wizard gets buck naked. The cops start out by trying to nicely convince him to put his clothes back on but he consistently refuses. This guy has absolutely no reason to ever want to get naked in public. One look at the family jewels will show that he comes from an extremely poor family. Anyway, the cops try until they realize he's an azzhole. Then they put on the blue rubber gloves and things get ugly. When cops ask you nicely to stop breaking the law, maybe you should do that. >http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 01:09:00", 
        "title": "Police Brutality!!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: No, not really but when you see this you might wish there was some. At a public event some guy who thinks he's a wizard gets buck naked. The cops start out by trying to nicely convince him to put his clothes back on but he consistently refuses. This guy has absolutely no reason to ever want to get naked in public. One look at the family jewels will show that he comes from an extremely poor family. Anyway, the cops try until they realize he's an azzhole. Then they put on the blue rubber gloves and things get ugly. When cops ask you nicely to stop breaking the law, maybe you should do that. >http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Don't Tasz me buddy... Please don't Tasz meeee...", 
        "intTime": 20090426, 
        "postID": 2, 
        "quote": "Originally posted by Thud357L: No, not really but when you see this you might wish there was some. At a public event some guy who thinks he's a wizard gets buck naked. The cops start out by trying to nicely convince him to put his clothes back on but he consistently refuses. This guy has absolutely no reason to ever want to get naked in public. One look at the family jewels will show that he comes from an extremely poor family. Anyway, the cops try until they realize he's an azzhole. Then they put on the blue rubber gloves and things get ugly. When cops ask you nicely to stop breaking the law, maybe you should do that. >http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html", 
        "reply": " Don't Tasz me buddy... Please don't Tasz meeee...", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 01:33:00", 
        "title": "Police Brutality!!!", 
        "userID": "Tangler"
    }, 
    {
        "content": "Thud-- I'm shocked at you. You are not following the left's playbook on this one.", 
        "intTime": 20090426, 
        "postID": 3, 
        "quote": "", 
        "reply": "Thud-- I'm shocked at you. You are not following the left's playbook on this one.", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 04:47:00", 
        "title": "Police Brutality!!!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Thud-- I'm shocked at you. You are not following the left's playbook on this one. Haven't seen the playbook. I just call it like it is.", 
        "intTime": 20090426, 
        "postID": 4, 
        "quote": "Originally posted by threerings: Thud-- I'm shocked at you. You are not following the left's playbook on this one.", 
        "reply": " Haven't seen the playbook. I just call it like it is.", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 09:46:00", 
        "title": "Police Brutality!!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "I didn't see the video or read a link. I'm not sure if the man was mentally deranged or just a teenager conducting a prank. An experienced homicide detective explained to me it's not unusual for someone high on PCP or Angel Dust to disrobe and act irrationally before they die. These facts must be considered when investigating claims of brutality against cops, fire fighters, and first responders. Everyone tends to look upon others for blame. Law enforcement recieves the most of it. Most of the accusations are from those with no experience in dealing with the situations described.", 
        "intTime": 20090426, 
        "postID": 5, 
        "quote": "", 
        "reply": "I didn't see the video or read a link. I'm not sure if the man was mentally deranged or just a teenager conducting a prank. An experienced homicide detective explained to me it's not unusual for someone high on PCP or Angel Dust to disrobe and act irrationally before they die. These facts must be considered when investigating claims of brutality against cops, fire fighters, and first responders. Everyone tends to look upon others for blame. Law enforcement recieves the most of it. Most of the accusations are from those with no experience in dealing with the situations described.", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 09:55:00", 
        "title": "Police Brutality!!!", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by scpd3045: I didn't see the video or read a link. I'm not sure if the man was mentally deranged or just a teenager conducting a prank. An experienced homicide detective explained to me it's not unusual for someone high on PCP or Angel Dust to disrobe and act irrationally before they die. These facts must be considered when investigating claims of brutality against cops, fire fighters, and first responders. Everyone tends to look upon others for blame. Law enforcement recieves the most of it. Most of the accusations are from those with no experience in dealing with the situations described. The cops were not being brutal here and the guy doesn't appear to be on a terminal high.", 
        "intTime": 20090426, 
        "postID": 6, 
        "quote": "Originally posted by scpd3045: I didn't see the video or read a link. I'm not sure if the man was mentally deranged or just a teenager conducting a prank. An experienced homicide detective explained to me it's not unusual for someone high on PCP or Angel Dust to disrobe and act irrationally before they die. These facts must be considered when investigating claims of brutality against cops, fire fighters, and first responders. Everyone tends to look upon others for blame. Law enforcement recieves the most of it. Most of the accusations are from those with no experience in dealing with the situations described.", 
        "reply": " The cops were not being brutal here and the guy doesn't appear to be on a terminal high.", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 12:35:00", 
        "title": "Police Brutality!!!", 
        "userID": "Thud357L"
    }, 
    {
        "content": "You guys should do a search for operation repo and take a look at the video where they try to repo a car from a bunch of LARP'ers. Man.", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "", 
        "reply": "You guys should do a search for operation repo and take a look at the video where they try to repo a car from a bunch of LARP'ers. Man.", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 13:09:00", 
        "title": "Police Brutality!!!", 
        "userID": "threerings"
    }, 
    {
        "content": "Police are not involved in repossessions. That's a civil matter where vendors are hired by a bank or finance company. Many of these repo people look like they're suspects themselves. Back to the original post, anybody appearing in public naked as described here poses a significant concern to me. He may just be the type of person who intends on disarming a cop and using his weapon on the officer and others. I don't get hurt for anybody. My police academy training says the taser is \"minimum use of force\". If a tort action follows, I will be safe following my original training. I know I'm not right all the time and these boards should encourage discussions. Thanks for letting me contribute to more than just the weather.", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "", 
        "reply": "Police are not involved in repossessions. That's a civil matter where vendors are hired by a bank or finance company. Many of these repo people look like they're suspects themselves. Back to the original post, anybody appearing in public naked as described here poses a significant concern to me. He may just be the type of person who intends on disarming a cop and using his weapon on the officer and others. I don't get hurt for anybody. My police academy training says the taser is \"minimum use of force\". If a tort action follows, I will be safe following my original training. I know I'm not right all the time and these boards should encourage discussions. Thanks for letting me contribute to more than just the weather.", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 18:54:00", 
        "title": "Police Brutality!!!", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: ne look at the family jewels will show that he comes from an extremely poor family. I planned on opening the link until I seen that line. and now I don't want to know anymore about it.", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "ne look at the family jewels will show that he comes from an extremely poor family.", 
        "reply": " I planned on opening the link until I seen that line. and now I don't want to know anymore about it.", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-26 23:09:00", 
        "title": "Police Brutality!!!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by scpd3045: Police are not involved in repossessions. That's a civil matter where vendors are hired by a bank or finance company. Many of these repo people look like they're suspects themselves. Back to the original post, anybody appearing in public naked as described here poses a significant concern to me. He may just be the type of person who intends on disarming a cop and using his weapon on the officer and others. I don't get hurt for anybody. My police academy training says the taser is \"minimum use of force\". If a tort action follows, I will be safe following my original training. I know I'm not right all the time and these boards should encourage discussions. Thanks for letting me contribute to more than just the weather. Ya I know. You should watch it because its funny.", 
        "intTime": 20090427, 
        "postID": 10, 
        "quote": "Originally posted by scpd3045: Police are not involved in repossessions. That's a civil matter where vendors are hired by a bank or finance company. Many of these repo people look like they're suspects themselves. Back to the original post, anybody appearing in public naked as described here poses a significant concern to me. He may just be the type of person who intends on disarming a cop and using his weapon on the officer and others. I don't get hurt for anybody. My police academy training says the taser is \"minimum use of force\". If a tort action follows, I will be safe following my original training. I know I'm not right all the time and these boards should encourage discussions. Thanks for letting me contribute to more than just the weather.", 
        "reply": " Ya I know. You should watch it because its funny.", 
        "threadID": "409192893_7390087122001", 
        "time": "2009-04-27 04:26:00", 
        "title": "Police Brutality!!!", 
        "userID": "threerings"
    }
]