[
    {
        "content": "I just heard an Obama \"fan\" from his recent town hall meeting say on the radio: \"I dont know what he said, but I left there with a great born again feeling.\" Exactly! You dont know.", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "", 
        "reply": "I just heard an Obama \"fan\" from his recent town hall meeting say on the radio: \"I dont know what he said, but I left there with a great born again feeling.\" Exactly! You dont know.", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 09:53:00", 
        "title": "Born again feeling!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: I just heard an Obama \"fan\" from his recent town hall meeting say on the radio: \"I dont know what he said, but I left there with a great born again feeling.\" Sounds like a \"Jack Flats\" statement. Don", 
        "intTime": 20090320, 
        "postID": 2, 
        "quote": "Originally posted by threerings: I just heard an Obama \"fan\" from his recent town hall meeting say on the radio: \"I dont know what he said, but I left there with a great born again feeling.\"", 
        "reply": " Sounds like a \"Jack Flats\" statement. Don", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 10:10:00", 
        "title": "Born again feeling!", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 10:13:00", 
        "title": "Born again feeling!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "sounds like a lot of \"christians\" to me", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "", 
        "reply": "sounds like a lot of \"christians\" to me", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 10:28:00", 
        "title": "Born again feeling!", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid.", 
        "intTime": 20090320, 
        "postID": 5, 
        "quote": "sounds like a lot of \"christians\" to me", 
        "reply": " No, you're just simple-minded and stuck on stupid.", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 11:23:00", 
        "title": "Born again feeling!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "That born again feeling usually happens between the second & third cup of coffee.", 
        "intTime": 20090320, 
        "postID": 6, 
        "quote": "", 
        "reply": "That born again feeling usually happens between the second & third cup of coffee.", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 11:23:00", 
        "title": "Born again feeling!", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid. I'll give your post a bump, I was debating whether or not to waste time on a response. Notice folks who label themselves \"liberal\", all too often are not very accepting of others?", 
        "intTime": 20090320, 
        "postID": 7, 
        "quote": "Originally posted by soscorpio: quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid.", 
        "reply": " I'll give your post a bump, I was debating whether or not to waste time on a response. Notice folks who label themselves \"liberal\", all too often are not very accepting of others?", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 11:25:00", 
        "title": "Born again feeling!", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid. so are you denying that there are a lot of people who call themselves christians but are ignorant of much of the bible and especially the message of christ? there is a reason I put quotation marks around the word christian", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "Originally posted by soscorpio: quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid.", 
        "reply": " so are you denying that there are a lot of people who call themselves christians but are ignorant of much of the bible and especially the message of christ? there is a reason I put quotation marks around the word christian", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 13:06:00", 
        "title": "Born again feeling!", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by soscorpio: quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid. I'll give your post a bump, I was debating whether or not to waste time on a response. Notice folks who label themselves \"liberal\", all too often are not very accepting of others? Yep, we learned it all from you rightwing types... Of course we're now where as good as you... So keep showing off, we can use the bad examples...", 
        "intTime": 20090320, 
        "postID": 9, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by soscorpio: quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid. I'll give your post a bump, I was debating whether or not to waste time on a response. Notice folks who label themselves \"liberal\", all too often are not very accepting of others?", 
        "reply": " Yep, we learned it all from you rightwing types... Of course we're now where as good as you... So keep showing off, we can use the bad examples...", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 13:35:00", 
        "title": "Born again feeling!", 
        "userID": "Tangler"
    }, 
    {
        "content": "Just more proof of the cult of personality.", 
        "intTime": 20090320, 
        "postID": 10, 
        "quote": "", 
        "reply": "Just more proof of the cult of personality.", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 14:07:00", 
        "title": "Born again feeling!", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: so are you denying that there are a lot of people who call themselves christians but are ignorant of much of the bible and especially the message of christ? I didn't deny anything, I affirmed you. But anywho, some dorkus while walking out of a BO town hall meeting in euphoria no doubt stating \"I dont know what he said, but I left there with a great born again feeling.\" most likely has no affiliation with the Word of God. We put nothing above or on equal with the Trinity.", 
        "intTime": 20090320, 
        "postID": 11, 
        "quote": "so are you denying that there are a lot of people who call themselves christians but are ignorant of much of the bible and especially the message of christ?", 
        "reply": " I didn't deny anything, I affirmed you. But anywho, some dorkus while walking out of a BO town hall meeting in euphoria no doubt stating \"I dont know what he said, but I left there with a great born again feeling.\" most likely has no affiliation with the Word of God. We put nothing above or on equal with the Trinity.", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 14:13:00", 
        "title": "Born again feeling!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Yep, we learned it all from you rightwing types... Of course we're now where as good as you... So keep showing off, we can use the bad examples... Morals cannot withstand the test of time without an ode to a righteous higher power. That is why those in power attempt to liberalize their citizentry, because liberals are so gullible and inconsistent with the applications of their \"insight\". If liberalism is so superior, why then after 100 years of liberalism in America are we at breaking point?", 
        "intTime": 20090320, 
        "postID": 12, 
        "quote": "Yep, we learned it all from you rightwing types... Of course we're now where as good as you... So keep showing off, we can use the bad examples...", 
        "reply": " Morals cannot withstand the test of time without an ode to a righteous higher power. That is why those in power attempt to liberalize their citizentry, because liberals are so gullible and inconsistent with the applications of their \"insight\". If liberalism is so superior, why then after 100 years of liberalism in America are we at breaking point?", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 14:17:00", 
        "title": "Born again feeling!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by liberal90: sounds like a lot of \"christians\" to me Fantastic, just Fantastic!! Made my points in a lot of areas!", 
        "intTime": 20090320, 
        "postID": 13, 
        "quote": "Originally posted by liberal90: sounds like a lot of \"christians\" to me", 
        "reply": " Fantastic, just Fantastic!! Made my points in a lot of areas!", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 15:29:00", 
        "title": "Born again feeling!", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "Did you feel that tingle going up your leg?", 
        "intTime": 20090320, 
        "postID": 14, 
        "quote": "", 
        "reply": "Did you feel that tingle going up your leg?", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-20 15:31:00", 
        "title": "Born again feeling!", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by 67NOV: quote: Originally posted by soscorpio: quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid. I'll give your post a bump, I was debating whether or not to waste time on a response. Notice folks who label themselves \"liberal\", all too often are not very accepting of others? Yep, we learned it all from you rightwing types... Of course we're now where as good as you... So keep showing off, we can use the bad examples... Just came back to this thread. I hope you're not the type who thinks the sun shines out the azz of your party. I lean to the right because it's the lesser of 2 evils. For bad examples look no further then lovely people like Oberman, Pelosi, Reid, etc.!", 
        "intTime": 20090323, 
        "postID": 15, 
        "quote": "Originally posted by Tangler: quote: Originally posted by 67NOV: quote: Originally posted by soscorpio: quote: sounds like a lot of \"christians\" to me No, you're just simple-minded and stuck on stupid. I'll give your post a bump, I was debating whether or not to waste time on a response. Notice folks who label themselves \"liberal\", all too often are not very accepting of others? Yep, we learned it all from you rightwing types... Of course we're now where as good as you... So keep showing off, we can use the bad examples...", 
        "reply": " Just came back to this thread. I hope you're not the type who thinks the sun shines out the azz of your party. I lean to the right because it's the lesser of 2 evils. For bad examples look no further then lovely people like Oberman, Pelosi, Reid, etc.!", 
        "threadID": "409192893_8430024812001", 
        "time": "2009-03-23 07:00:00", 
        "title": "Born again feeling!", 
        "userID": "67NOV"
    }
]