[
    {
        "content": "In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:09:00", 
        "title": "The United States - or your state?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I very much doubt that any state is going to secede anytime soon. However, just to play \"what if?\".. if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example.", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "", 
        "reply": "I very much doubt that any state is going to secede anytime soon. However, just to play \"what if?\".. if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:14:00", 
        "title": "The United States - or your state?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama. Change your depends, take a shower, and the smell will go away.", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama.", 
        "reply": " Change your depends, take a shower, and the smell will go away.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:32:00", 
        "title": "The United States - or your state?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama. This entire thread's premise is melodrama... so don't blame that chit on me, uhler.", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama.", 
        "reply": " This entire thread's premise is melodrama... so don't blame that chit on me, uhler.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:36:00", 
        "title": "The United States - or your state?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Let's see... If I had to chose between Gov. David Patterson or President Barac Obama... Aaaaaarrrrggggghhhh (head exploding....)", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "", 
        "reply": "Let's see... If I had to chose between Gov. David Patterson or President Barac Obama... Aaaaaarrrrggggghhhh (head exploding....)", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:45:00", 
        "title": "The United States - or your state?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Igor Panarin : US Will Break Into Six Parts (Russian Professor) //www.huffingtonpost.com/2008/11/25/igor-panarin-us-will-brea_n_146427.html", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "", 
        "reply": "Igor Panarin : US Will Break Into Six Parts (Russian Professor) //www.huffingtonpost.com/2008/11/25/igor-panarin-us-will-brea_n_146427.html", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:48:00", 
        "title": "The United States - or your state?", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.?", 
        "reply": " Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:07:00", 
        "title": "The United States - or your state?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Rick Perry is big on wind and smoke, living in Texas I know he loves media attention when he can get it. To take him serious on a statement of secession would be a mistake. Things have changed alot since 1860. Back in those days, and this was true predominately in the South more so than in the North, citizens looked upon their individual states as their own sovereign countries. Robert E. Lee was greatly disturbed by a decision he would eventually have to make, since he was initially offered the command of all Federal armies in the Union, and at the same time saw his native Virginia as \"native soil.\" But as a devout and loyal career minded US Army officer who held the rank of Full-Colonel at the time, he did not take nor make his decision lightly, nor in haste. Painfully for him, because he was a Union Man at heart, he chose Virginia, and henceforth the Confederacy over the Union. Even after the war was over, he maintained he made the right decision, and said he would have done it all over again if need be. It wasn't so much that he was dedicated to the principles of the Confederacy, but he was absolutely dedicated to the defense of his home-his native Virginia. As lee said, \"I cannot raise my own sword against her.\" This is an interesting contrast to Sam Houston, who was instrumental in securing Texas independence from Mexico, but who helped bring Texas into the Union in 1845 as a state of the Union. When the seeds of secession were taking place in Texas during 1860-61, Houston, being a Pro-Union man was absolutely opposed to Texas seceeding and becoming a state of the Confederacy. Henceforth, Houston would himself become neutral during the CW, and took neither side. His life was threatened on several occasions by fellow Texans who were Southern sympathizers before and during the war. Things have changed alot in this country since 1860. My fear is not so much a \"South shall rise again scenario,\" but rather a group of states (or segments of states) in North, South, East and West forming some kind of an independent coalition, but would NOT be divided geographically from those areas choosing to stay in the Union, such as a Mason-Dixon line example. Well Flight Director, I didn't mean to rattle on like this, but your \"modern day\" scenario of a former 1860 gets very complicated to say the least. My hope is always that the Union shall maintain itself, even during the worst of political and economic upheaval!... This message has been edited. Last edited by: ProgMod, Thu 16 April 2009 10:27 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "", 
        "reply": "Rick Perry is big on wind and smoke, living in Texas I know he loves media attention when he can get it. To take him serious on a statement of secession would be a mistake. Things have changed alot since 1860. Back in those days, and this was true predominately in the South more so than in the North, citizens looked upon their individual states as their own sovereign countries. Robert E. Lee was greatly disturbed by a decision he would eventually have to make, since he was initially offered the command of all Federal armies in the Union, and at the same time saw his native Virginia as \"native soil.\" But as a devout and loyal career minded US Army officer who held the rank of Full-Colonel at the time, he did not take nor make his decision lightly, nor in haste. Painfully for him, because he was a Union Man at heart, he chose Virginia, and henceforth the Confederacy over the Union. Even after the war was over, he maintained he made the right decision, and said he would have done it all over again if need be. It wasn't so much that he was dedicated to the principles of the Confederacy, but he was absolutely dedicated to the defense of his home-his native Virginia. As lee said, \"I cannot raise my own sword against her.\" This is an interesting contrast to Sam Houston, who was instrumental in securing Texas independence from Mexico, but who helped bring Texas into the Union in 1845 as a state of the Union. When the seeds of secession were taking place in Texas during 1860-61, Houston, being a Pro-Union man was absolutely opposed to Texas seceeding and becoming a state of the Confederacy. Henceforth, Houston would himself become neutral during the CW, and took neither side. His life was threatened on several occasions by fellow Texans who were Southern sympathizers before and during the war. Things have changed alot in this country since 1860. My fear is not so much a \"South shall rise again scenario,\" but rather a group of states (or segments of states) in North, South, East and West forming some kind of an independent coalition, but would NOT be divided geographically from those areas choosing to stay in the Union, such as a Mason-Dixon line example. Well Flight Director, I didn't mean to rattle on like this, but your \"modern day\" scenario of a former 1860 gets very complicated to say the least. My hope is always that the Union shall maintain itself, even during the worst of political and economic upheaval!... This message has been edited. Last edited by: ProgMod, Thu 16 April 2009 10:27 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:09:00", 
        "title": "The United States - or your state?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:14:00", 
        "title": "The United States - or your state?", 
        "userID": "L0A1"
    }, 
    {
        "content": "I hope a professional Texas sports team doesn't win a major event for the next decade. That's the real problem behind the recent bombast; ridiculous Texas ego. Seceding from the most prosperous country on the planet, is not only illogical but impossible. Here's how the \"we are seceding\" conversation would go: Texas: \"(big long-winded speech drawing heavily on Revolution-era rhetoric)...and that is why we have decided to leave.\" The Federal Government: \"No.\"", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "", 
        "reply": "I hope a professional Texas sports team doesn't win a major event for the next decade. That's the real problem behind the recent bombast; ridiculous Texas ego. Seceding from the most prosperous country on the planet, is not only illogical but impossible. Here's how the \"we are seceding\" conversation would go: Texas: \"(big long-winded speech drawing heavily on Revolution-era rhetoric)...and that is why we have decided to leave.\" The Federal Government: \"No.\"", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:47:00", 
        "title": "The United States - or your state?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of control spending and goverment growth. Roger That . . .", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of control spending and goverment growth.", 
        "reply": " Roger That . . .", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:51:00", 
        "title": "The United States - or your state?", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:54:00", 
        "title": "The United States - or your state?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Well said LOA1, Well said. Supporter of the TEA party.", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth.", 
        "reply": " Well said LOA1, Well said. Supporter of the TEA party.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:24:00", 
        "title": "The United States - or your state?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "I live in southern Indiana. We're hoping that Gary secedes.", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "", 
        "reply": "I live in southern Indiana. We're hoping that Gary secedes.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:52:00", 
        "title": "The United States - or your state?", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. Quit being such a drama queen. No state can vote to seceed, it's unconstitutional. The vote wouldn't be legally binding. Now, if your state was one of 2/3 that votes for an Art V Constitutional Convention and chooses not to renew their association with the US as a subservient state (which would be legal), you could then pontificate about your moral choice. Secession: will never happen Constitutional Convention: possibility At least stay within the bounds of realism. You might as well say \"if Klingons and Romulans invaded our solar system and forced everyone to pick sides, who would you join with?\"", 
        "intTime": 20090416, 
        "postID": 15, 
        "quote": "Originally posted by Fightdirector: If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " Quit being such a drama queen. No state can vote to seceed, it's unconstitutional. The vote wouldn't be legally binding. Now, if your state was one of 2/3 that votes for an Art V Constitutional Convention and chooses not to renew their association with the US as a subservient state (which would be legal), you could then pontificate about your moral choice. Secession: will never happen Constitutional Convention: possibility At least stay within the bounds of realism. You might as well say \"if Klingons and Romulans invaded our solar system and forced everyone to pick sides, who would you join with?\"", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:54:00", 
        "title": "The United States - or your state?", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second. As a native Texan, I concur with everything you have said here!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090416, 
        "postID": 16, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "reply": " As a native Texan, I concur with everything you have said here!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 12:06:00", 
        "title": "The United States - or your state?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "intTime": 20090416, 
        "postID": 17, 
        "quote": "", 
        "reply": "with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 12:14:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....By the way, those HEROES who took a stand in 1860 against a Federal Government grown tyrannical are a shining example for all Americans who believe in the Constitution of the United States of America AS IT WAS WRITTEN.... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Descendant of Lt. General James Longstreet (on my dad's mother's side of the family)", 
        "intTime": 20090416, 
        "postID": 18, 
        "quote": "Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "reply": " Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....By the way, those HEROES who took a stand in 1860 against a Federal Government grown tyrannical are a shining example for all Americans who believe in the Constitution of the United States of America AS IT WAS WRITTEN.... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Descendant of Lt. General James Longstreet (on my dad's mother's side of the family)", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 13:39:00", 
        "title": "The United States - or your state?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 19, 
        "quote": "", 
        "reply": "It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 13:50:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. yea i agree not an easy conclusion to come to... i do agree with your statement tho...", 
        "intTime": 20090416, 
        "postID": 20, 
        "quote": "Originally posted by MM2_ss_Lewis: It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow.", 
        "reply": " yea i agree not an easy conclusion to come to... i do agree with your statement tho...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:00:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede. I'm starting to understand your position much better lately. Letting things slip are we Comrade?", 
        "intTime": 20090416, 
        "postID": 21, 
        "quote": "Originally posted by PhoenixDark: As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "reply": " I'm starting to understand your position much better lately. Letting things slip are we Comrade?", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:31:00", 
        "title": "The United States - or your state?", 
        "userID": "floersh"
    }, 
    {
        "content": "Considering the greatest threat to the Constitution of the United States is the politicians in D.C., having by their actions trampled the rights of the people, expanded the power of the government contrary to the limits imposed by the Constitution, and for oppressive and tyrannical behavior towards the states and the people therein...PhoenixDark, let me ask you a question... Since they are the enemy to the Constitution, shouldn't you look into them rather than the states(and their people) at this point? “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 22, 
        "quote": "", 
        "reply": "Considering the greatest threat to the Constitution of the United States is the politicians in D.C., having by their actions trampled the rights of the people, expanded the power of the government contrary to the limits imposed by the Constitution, and for oppressive and tyrannical behavior towards the states and the people therein...PhoenixDark, let me ask you a question... Since they are the enemy to the Constitution, shouldn't you look into them rather than the states(and their people) at this point? “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:48:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. My country is the United States of America, anyone who calls for secession is a traitor. He should just pack up and move into a cave with Osama ben Ladem.", 
        "intTime": 20090416, 
        "postID": 23, 
        "quote": "Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " My country is the United States of America, anyone who calls for secession is a traitor. He should just pack up and move into a cave with Osama ben Ladem.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 15:35:00", 
        "title": "The United States - or your state?", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "intTime": 20090416, 
        "postID": 24, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....", 
        "reply": " The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 15:39:00", 
        "title": "The United States - or your state?", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post. Wow, you got that from his post? I don't see anywhere him saying President Obama is a terrorist supporter or her highness as a commie. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 25, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "reply": " Wow, you got that from his post? I don't see anywhere him saying President Obama is a terrorist supporter or her highness as a commie. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:05:00", 
        "title": "The United States - or your state?", 
        "userID": "L0A1"
    }, 
    {
        "content": "L0A1, don't try to be logical...logic, facts, and thoughts don't work against irrational emotion and preconcieved beliefs mate. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 26, 
        "quote": "", 
        "reply": "L0A1, don't try to be logical...logic, facts, and thoughts don't work against irrational emotion and preconcieved beliefs mate. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:11:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "before ww1 there was no national standing army... each state had a national guard and that was about it... in fact in ww1 there was a lot of rivelies between members of different states... ahh you guys kicked our butts at that one battle in 1862 and were still ****ed... a lot of that stuff...", 
        "intTime": 20090416, 
        "postID": 27, 
        "quote": "", 
        "reply": "before ww1 there was no national standing army... each state had a national guard and that was about it... in fact in ww1 there was a lot of rivelies between members of different states... ahh you guys kicked our butts at that one battle in 1862 and were still ****ed... a lot of that stuff...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:15:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "It really depends on which state you're talking about. As a resident of Illinois I'd need a couple hours to pack before I left the state to it's own ends, If it was california, I'd help some of them pack then wave bye bye to them, and take up a vigil on the Nevada border to ensure they don't come back. The Constitution was very well written by people who wanted to ensure the states maintained certain rights, and now that the federal government is continually searching and enacting laws that circumvent the rights given in the constitution to the states and even talking about rewriting it to make it more current I understand why some states are talking about leaving the union. Times have indeed changed, people have changed, beliefs have changed, but the Constitution has not changed- and it SHOULDN'T. The document is as relevant and current as the day it was written, only the people have changed. We as a people NEED to change back to the people we used to be NOT change the Constitution to accommodate our new ways and beliefs. In the case of Texas: I think they have a legitimate beef and should they decide to secede I will stand with them as America has changed into something I almost don't recognize anymore.", 
        "intTime": 20090416, 
        "postID": 28, 
        "quote": "", 
        "reply": "It really depends on which state you're talking about. As a resident of Illinois I'd need a couple hours to pack before I left the state to it's own ends, If it was california, I'd help some of them pack then wave bye bye to them, and take up a vigil on the Nevada border to ensure they don't come back. The Constitution was very well written by people who wanted to ensure the states maintained certain rights, and now that the federal government is continually searching and enacting laws that circumvent the rights given in the constitution to the states and even talking about rewriting it to make it more current I understand why some states are talking about leaving the union. Times have indeed changed, people have changed, beliefs have changed, but the Constitution has not changed- and it SHOULDN'T. The document is as relevant and current as the day it was written, only the people have changed. We as a people NEED to change back to the people we used to be NOT change the Constitution to accommodate our new ways and beliefs. In the case of Texas: I think they have a legitimate beef and should they decide to secede I will stand with them as America has changed into something I almost don't recognize anymore.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:28:00", 
        "title": "The United States - or your state?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "intTime": 20090416, 
        "postID": 29, 
        "quote": "", 
        "reply": "In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:09:00", 
        "title": "The United States - or your state?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I very much doubt that any state is going to secede anytime soon. However, just to play \"what if?\".. if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example.", 
        "intTime": 20090416, 
        "postID": 30, 
        "quote": "", 
        "reply": "I very much doubt that any state is going to secede anytime soon. However, just to play \"what if?\".. if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:14:00", 
        "title": "The United States - or your state?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama. Change your depends, take a shower, and the smell will go away.", 
        "intTime": 20090416, 
        "postID": 31, 
        "quote": "Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama.", 
        "reply": " Change your depends, take a shower, and the smell will go away.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:32:00", 
        "title": "The United States - or your state?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama. This entire thread's premise is melodrama... so don't blame that chit on me, uhler.", 
        "intTime": 20090416, 
        "postID": 32, 
        "quote": "Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama.", 
        "reply": " This entire thread's premise is melodrama... so don't blame that chit on me, uhler.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:36:00", 
        "title": "The United States - or your state?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Let's see... If I had to chose between Gov. David Patterson or President Barac Obama... Aaaaaarrrrggggghhhh (head exploding....)", 
        "intTime": 20090416, 
        "postID": 33, 
        "quote": "", 
        "reply": "Let's see... If I had to chose between Gov. David Patterson or President Barac Obama... Aaaaaarrrrggggghhhh (head exploding....)", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:45:00", 
        "title": "The United States - or your state?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Igor Panarin : US Will Break Into Six Parts (Russian Professor) //www.huffingtonpost.com/2008/11/25/igor-panarin-us-will-brea_n_146427.html", 
        "intTime": 20090416, 
        "postID": 34, 
        "quote": "", 
        "reply": "Igor Panarin : US Will Break Into Six Parts (Russian Professor) //www.huffingtonpost.com/2008/11/25/igor-panarin-us-will-brea_n_146427.html", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:48:00", 
        "title": "The United States - or your state?", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "intTime": 20090416, 
        "postID": 35, 
        "quote": "Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.?", 
        "reply": " Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:07:00", 
        "title": "The United States - or your state?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Rick Perry is big on wind and smoke, living in Texas I know he loves media attention when he can get it. To take him serious on a statement of secession would be a mistake. Things have changed alot since 1860. Back in those days, and this was true predominately in the South more so than in the North, citizens looked upon their individual states as their own sovereign countries. Robert E. Lee was greatly disturbed by a decision he would eventually have to make, since he was initially offered the command of all Federal armies in the Union, and at the same time saw his native Virginia as \"native soil.\" But as a devout and loyal career minded US Army officer who held the rank of Full-Colonel at the time, he did not take nor make his decision lightly, nor in haste. Painfully for him, because he was a Union Man at heart, he chose Virginia, and henceforth the Confederacy over the Union. Even after the war was over, he maintained he made the right decision, and said he would have done it all over again if need be. It wasn't so much that he was dedicated to the principles of the Confederacy, but he was absolutely dedicated to the defense of his home-his native Virginia. As lee said, \"I cannot raise my own sword against her.\" This is an interesting contrast to Sam Houston, who was instrumental in securing Texas independence from Mexico, but who helped bring Texas into the Union in 1845 as a state of the Union. When the seeds of secession were taking place in Texas during 1860-61, Houston, being a Pro-Union man was absolutely opposed to Texas seceeding and becoming a state of the Confederacy. Henceforth, Houston would himself become neutral during the CW, and took neither side. His life was threatened on several occasions by fellow Texans who were Southern sympathizers before and during the war. Things have changed alot in this country since 1860. My fear is not so much a \"South shall rise again scenario,\" but rather a group of states (or segments of states) in North, South, East and West forming some kind of an independent coalition, but would NOT be divided geographically from those areas choosing to stay in the Union, such as a Mason-Dixon line example. Well Flight Director, I didn't mean to rattle on like this, but your \"modern day\" scenario of a former 1860 gets very complicated to say the least. My hope is always that the Union shall maintain itself, even during the worst of political and economic upheaval!... This message has been edited. Last edited by: ProgMod, Thu 16 April 2009 10:27 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090416, 
        "postID": 36, 
        "quote": "", 
        "reply": "Rick Perry is big on wind and smoke, living in Texas I know he loves media attention when he can get it. To take him serious on a statement of secession would be a mistake. Things have changed alot since 1860. Back in those days, and this was true predominately in the South more so than in the North, citizens looked upon their individual states as their own sovereign countries. Robert E. Lee was greatly disturbed by a decision he would eventually have to make, since he was initially offered the command of all Federal armies in the Union, and at the same time saw his native Virginia as \"native soil.\" But as a devout and loyal career minded US Army officer who held the rank of Full-Colonel at the time, he did not take nor make his decision lightly, nor in haste. Painfully for him, because he was a Union Man at heart, he chose Virginia, and henceforth the Confederacy over the Union. Even after the war was over, he maintained he made the right decision, and said he would have done it all over again if need be. It wasn't so much that he was dedicated to the principles of the Confederacy, but he was absolutely dedicated to the defense of his home-his native Virginia. As lee said, \"I cannot raise my own sword against her.\" This is an interesting contrast to Sam Houston, who was instrumental in securing Texas independence from Mexico, but who helped bring Texas into the Union in 1845 as a state of the Union. When the seeds of secession were taking place in Texas during 1860-61, Houston, being a Pro-Union man was absolutely opposed to Texas seceeding and becoming a state of the Confederacy. Henceforth, Houston would himself become neutral during the CW, and took neither side. His life was threatened on several occasions by fellow Texans who were Southern sympathizers before and during the war. Things have changed alot in this country since 1860. My fear is not so much a \"South shall rise again scenario,\" but rather a group of states (or segments of states) in North, South, East and West forming some kind of an independent coalition, but would NOT be divided geographically from those areas choosing to stay in the Union, such as a Mason-Dixon line example. Well Flight Director, I didn't mean to rattle on like this, but your \"modern day\" scenario of a former 1860 gets very complicated to say the least. My hope is always that the Union shall maintain itself, even during the worst of political and economic upheaval!... This message has been edited. Last edited by: ProgMod, Thu 16 April 2009 10:27 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:09:00", 
        "title": "The United States - or your state?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 37, 
        "quote": "", 
        "reply": "I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:14:00", 
        "title": "The United States - or your state?", 
        "userID": "L0A1"
    }, 
    {
        "content": "I hope a professional Texas sports team doesn't win a major event for the next decade. That's the real problem behind the recent bombast; ridiculous Texas ego. Seceding from the most prosperous country on the planet, is not only illogical but impossible. Here's how the \"we are seceding\" conversation would go: Texas: \"(big long-winded speech drawing heavily on Revolution-era rhetoric)...and that is why we have decided to leave.\" The Federal Government: \"No.\"", 
        "intTime": 20090416, 
        "postID": 38, 
        "quote": "", 
        "reply": "I hope a professional Texas sports team doesn't win a major event for the next decade. That's the real problem behind the recent bombast; ridiculous Texas ego. Seceding from the most prosperous country on the planet, is not only illogical but impossible. Here's how the \"we are seceding\" conversation would go: Texas: \"(big long-winded speech drawing heavily on Revolution-era rhetoric)...and that is why we have decided to leave.\" The Federal Government: \"No.\"", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:47:00", 
        "title": "The United States - or your state?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of control spending and goverment growth. Roger That . . .", 
        "intTime": 20090416, 
        "postID": 39, 
        "quote": "Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of control spending and goverment growth.", 
        "reply": " Roger That . . .", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:51:00", 
        "title": "The United States - or your state?", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "intTime": 20090416, 
        "postID": 40, 
        "quote": "Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:54:00", 
        "title": "The United States - or your state?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Well said LOA1, Well said. Supporter of the TEA party.", 
        "intTime": 20090416, 
        "postID": 41, 
        "quote": "Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth.", 
        "reply": " Well said LOA1, Well said. Supporter of the TEA party.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:24:00", 
        "title": "The United States - or your state?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "I live in southern Indiana. We're hoping that Gary secedes.", 
        "intTime": 20090416, 
        "postID": 42, 
        "quote": "", 
        "reply": "I live in southern Indiana. We're hoping that Gary secedes.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:52:00", 
        "title": "The United States - or your state?", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. Quit being such a drama queen. No state can vote to seceed, it's unconstitutional. The vote wouldn't be legally binding. Now, if your state was one of 2/3 that votes for an Art V Constitutional Convention and chooses not to renew their association with the US as a subservient state (which would be legal), you could then pontificate about your moral choice. Secession: will never happen Constitutional Convention: possibility At least stay within the bounds of realism. You might as well say \"if Klingons and Romulans invaded our solar system and forced everyone to pick sides, who would you join with?\"", 
        "intTime": 20090416, 
        "postID": 43, 
        "quote": "Originally posted by Fightdirector: If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " Quit being such a drama queen. No state can vote to seceed, it's unconstitutional. The vote wouldn't be legally binding. Now, if your state was one of 2/3 that votes for an Art V Constitutional Convention and chooses not to renew their association with the US as a subservient state (which would be legal), you could then pontificate about your moral choice. Secession: will never happen Constitutional Convention: possibility At least stay within the bounds of realism. You might as well say \"if Klingons and Romulans invaded our solar system and forced everyone to pick sides, who would you join with?\"", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:54:00", 
        "title": "The United States - or your state?", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second. As a native Texan, I concur with everything you have said here!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090416, 
        "postID": 44, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "reply": " As a native Texan, I concur with everything you have said here!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 12:06:00", 
        "title": "The United States - or your state?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "intTime": 20090416, 
        "postID": 45, 
        "quote": "", 
        "reply": "with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 12:14:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....By the way, those HEROES who took a stand in 1860 against a Federal Government grown tyrannical are a shining example for all Americans who believe in the Constitution of the United States of America AS IT WAS WRITTEN.... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Descendant of Lt. General James Longstreet (on my dad's mother's side of the family)", 
        "intTime": 20090416, 
        "postID": 46, 
        "quote": "Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "reply": " Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....By the way, those HEROES who took a stand in 1860 against a Federal Government grown tyrannical are a shining example for all Americans who believe in the Constitution of the United States of America AS IT WAS WRITTEN.... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Descendant of Lt. General James Longstreet (on my dad's mother's side of the family)", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 13:39:00", 
        "title": "The United States - or your state?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 47, 
        "quote": "", 
        "reply": "It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 13:50:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. yea i agree not an easy conclusion to come to... i do agree with your statement tho...", 
        "intTime": 20090416, 
        "postID": 48, 
        "quote": "Originally posted by MM2_ss_Lewis: It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow.", 
        "reply": " yea i agree not an easy conclusion to come to... i do agree with your statement tho...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:00:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede. I'm starting to understand your position much better lately. Letting things slip are we Comrade?", 
        "intTime": 20090416, 
        "postID": 49, 
        "quote": "Originally posted by PhoenixDark: As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "reply": " I'm starting to understand your position much better lately. Letting things slip are we Comrade?", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:31:00", 
        "title": "The United States - or your state?", 
        "userID": "floersh"
    }, 
    {
        "content": "Considering the greatest threat to the Constitution of the United States is the politicians in D.C., having by their actions trampled the rights of the people, expanded the power of the government contrary to the limits imposed by the Constitution, and for oppressive and tyrannical behavior towards the states and the people therein...PhoenixDark, let me ask you a question... Since they are the enemy to the Constitution, shouldn't you look into them rather than the states(and their people) at this point? “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 50, 
        "quote": "", 
        "reply": "Considering the greatest threat to the Constitution of the United States is the politicians in D.C., having by their actions trampled the rights of the people, expanded the power of the government contrary to the limits imposed by the Constitution, and for oppressive and tyrannical behavior towards the states and the people therein...PhoenixDark, let me ask you a question... Since they are the enemy to the Constitution, shouldn't you look into them rather than the states(and their people) at this point? “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:48:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. My country is the United States of America, anyone who calls for secession is a traitor. He should just pack up and move into a cave with Osama ben Ladem.", 
        "intTime": 20090416, 
        "postID": 51, 
        "quote": "Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " My country is the United States of America, anyone who calls for secession is a traitor. He should just pack up and move into a cave with Osama ben Ladem.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 15:35:00", 
        "title": "The United States - or your state?", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "intTime": 20090416, 
        "postID": 52, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....", 
        "reply": " The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 15:39:00", 
        "title": "The United States - or your state?", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post. Wow, you got that from his post? I don't see anywhere him saying President Obama is a terrorist supporter or her highness as a commie. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 53, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "reply": " Wow, you got that from his post? I don't see anywhere him saying President Obama is a terrorist supporter or her highness as a commie. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:05:00", 
        "title": "The United States - or your state?", 
        "userID": "L0A1"
    }, 
    {
        "content": "L0A1, don't try to be logical...logic, facts, and thoughts don't work against irrational emotion and preconcieved beliefs mate. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 54, 
        "quote": "", 
        "reply": "L0A1, don't try to be logical...logic, facts, and thoughts don't work against irrational emotion and preconcieved beliefs mate. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:11:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "before ww1 there was no national standing army... each state had a national guard and that was about it... in fact in ww1 there was a lot of rivelies between members of different states... ahh you guys kicked our butts at that one battle in 1862 and were still ****ed... a lot of that stuff...", 
        "intTime": 20090416, 
        "postID": 55, 
        "quote": "", 
        "reply": "before ww1 there was no national standing army... each state had a national guard and that was about it... in fact in ww1 there was a lot of rivelies between members of different states... ahh you guys kicked our butts at that one battle in 1862 and were still ****ed... a lot of that stuff...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:15:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "It really depends on which state you're talking about. As a resident of Illinois I'd need a couple hours to pack before I left the state to it's own ends, If it was california, I'd help some of them pack then wave bye bye to them, and take up a vigil on the Nevada border to ensure they don't come back. The Constitution was very well written by people who wanted to ensure the states maintained certain rights, and now that the federal government is continually searching and enacting laws that circumvent the rights given in the constitution to the states and even talking about rewriting it to make it more current I understand why some states are talking about leaving the union. Times have indeed changed, people have changed, beliefs have changed, but the Constitution has not changed- and it SHOULDN'T. The document is as relevant and current as the day it was written, only the people have changed. We as a people NEED to change back to the people we used to be NOT change the Constitution to accommodate our new ways and beliefs. In the case of Texas: I think they have a legitimate beef and should they decide to secede I will stand with them as America has changed into something I almost don't recognize anymore.", 
        "intTime": 20090416, 
        "postID": 56, 
        "quote": "", 
        "reply": "It really depends on which state you're talking about. As a resident of Illinois I'd need a couple hours to pack before I left the state to it's own ends, If it was california, I'd help some of them pack then wave bye bye to them, and take up a vigil on the Nevada border to ensure they don't come back. The Constitution was very well written by people who wanted to ensure the states maintained certain rights, and now that the federal government is continually searching and enacting laws that circumvent the rights given in the constitution to the states and even talking about rewriting it to make it more current I understand why some states are talking about leaving the union. Times have indeed changed, people have changed, beliefs have changed, but the Constitution has not changed- and it SHOULDN'T. The document is as relevant and current as the day it was written, only the people have changed. We as a people NEED to change back to the people we used to be NOT change the Constitution to accommodate our new ways and beliefs. In the case of Texas: I think they have a legitimate beef and should they decide to secede I will stand with them as America has changed into something I almost don't recognize anymore.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:28:00", 
        "title": "The United States - or your state?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "intTime": 20090416, 
        "postID": 57, 
        "quote": "", 
        "reply": "In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:09:00", 
        "title": "The United States - or your state?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I very much doubt that any state is going to secede anytime soon. However, just to play \"what if?\".. if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example.", 
        "intTime": 20090416, 
        "postID": 58, 
        "quote": "", 
        "reply": "I very much doubt that any state is going to secede anytime soon. However, just to play \"what if?\".. if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:14:00", 
        "title": "The United States - or your state?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama. Change your depends, take a shower, and the smell will go away.", 
        "intTime": 20090416, 
        "postID": 59, 
        "quote": "Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama.", 
        "reply": " Change your depends, take a shower, and the smell will go away.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:32:00", 
        "title": "The United States - or your state?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama. This entire thread's premise is melodrama... so don't blame that chit on me, uhler.", 
        "intTime": 20090416, 
        "postID": 60, 
        "quote": "Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama.", 
        "reply": " This entire thread's premise is melodrama... so don't blame that chit on me, uhler.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:36:00", 
        "title": "The United States - or your state?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Let's see... If I had to chose between Gov. David Patterson or President Barac Obama... Aaaaaarrrrggggghhhh (head exploding....)", 
        "intTime": 20090416, 
        "postID": 61, 
        "quote": "", 
        "reply": "Let's see... If I had to chose between Gov. David Patterson or President Barac Obama... Aaaaaarrrrggggghhhh (head exploding....)", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:45:00", 
        "title": "The United States - or your state?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Igor Panarin : US Will Break Into Six Parts (Russian Professor) //www.huffingtonpost.com/2008/11/25/igor-panarin-us-will-brea_n_146427.html", 
        "intTime": 20090416, 
        "postID": 62, 
        "quote": "", 
        "reply": "Igor Panarin : US Will Break Into Six Parts (Russian Professor) //www.huffingtonpost.com/2008/11/25/igor-panarin-us-will-brea_n_146427.html", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:48:00", 
        "title": "The United States - or your state?", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "intTime": 20090416, 
        "postID": 63, 
        "quote": "Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.?", 
        "reply": " Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:07:00", 
        "title": "The United States - or your state?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Rick Perry is big on wind and smoke, living in Texas I know he loves media attention when he can get it. To take him serious on a statement of secession would be a mistake. Things have changed alot since 1860. Back in those days, and this was true predominately in the South more so than in the North, citizens looked upon their individual states as their own sovereign countries. Robert E. Lee was greatly disturbed by a decision he would eventually have to make, since he was initially offered the command of all Federal armies in the Union, and at the same time saw his native Virginia as \"native soil.\" But as a devout and loyal career minded US Army officer who held the rank of Full-Colonel at the time, he did not take nor make his decision lightly, nor in haste. Painfully for him, because he was a Union Man at heart, he chose Virginia, and henceforth the Confederacy over the Union. Even after the war was over, he maintained he made the right decision, and said he would have done it all over again if need be. It wasn't so much that he was dedicated to the principles of the Confederacy, but he was absolutely dedicated to the defense of his home-his native Virginia. As lee said, \"I cannot raise my own sword against her.\" This is an interesting contrast to Sam Houston, who was instrumental in securing Texas independence from Mexico, but who helped bring Texas into the Union in 1845 as a state of the Union. When the seeds of secession were taking place in Texas during 1860-61, Houston, being a Pro-Union man was absolutely opposed to Texas seceeding and becoming a state of the Confederacy. Henceforth, Houston would himself become neutral during the CW, and took neither side. His life was threatened on several occasions by fellow Texans who were Southern sympathizers before and during the war. Things have changed alot in this country since 1860. My fear is not so much a \"South shall rise again scenario,\" but rather a group of states (or segments of states) in North, South, East and West forming some kind of an independent coalition, but would NOT be divided geographically from those areas choosing to stay in the Union, such as a Mason-Dixon line example. Well Flight Director, I didn't mean to rattle on like this, but your \"modern day\" scenario of a former 1860 gets very complicated to say the least. My hope is always that the Union shall maintain itself, even during the worst of political and economic upheaval!... This message has been edited. Last edited by: ProgMod, Thu 16 April 2009 10:27 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090416, 
        "postID": 64, 
        "quote": "", 
        "reply": "Rick Perry is big on wind and smoke, living in Texas I know he loves media attention when he can get it. To take him serious on a statement of secession would be a mistake. Things have changed alot since 1860. Back in those days, and this was true predominately in the South more so than in the North, citizens looked upon their individual states as their own sovereign countries. Robert E. Lee was greatly disturbed by a decision he would eventually have to make, since he was initially offered the command of all Federal armies in the Union, and at the same time saw his native Virginia as \"native soil.\" But as a devout and loyal career minded US Army officer who held the rank of Full-Colonel at the time, he did not take nor make his decision lightly, nor in haste. Painfully for him, because he was a Union Man at heart, he chose Virginia, and henceforth the Confederacy over the Union. Even after the war was over, he maintained he made the right decision, and said he would have done it all over again if need be. It wasn't so much that he was dedicated to the principles of the Confederacy, but he was absolutely dedicated to the defense of his home-his native Virginia. As lee said, \"I cannot raise my own sword against her.\" This is an interesting contrast to Sam Houston, who was instrumental in securing Texas independence from Mexico, but who helped bring Texas into the Union in 1845 as a state of the Union. When the seeds of secession were taking place in Texas during 1860-61, Houston, being a Pro-Union man was absolutely opposed to Texas seceeding and becoming a state of the Confederacy. Henceforth, Houston would himself become neutral during the CW, and took neither side. His life was threatened on several occasions by fellow Texans who were Southern sympathizers before and during the war. Things have changed alot in this country since 1860. My fear is not so much a \"South shall rise again scenario,\" but rather a group of states (or segments of states) in North, South, East and West forming some kind of an independent coalition, but would NOT be divided geographically from those areas choosing to stay in the Union, such as a Mason-Dixon line example. Well Flight Director, I didn't mean to rattle on like this, but your \"modern day\" scenario of a former 1860 gets very complicated to say the least. My hope is always that the Union shall maintain itself, even during the worst of political and economic upheaval!... This message has been edited. Last edited by: ProgMod, Thu 16 April 2009 10:27 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:09:00", 
        "title": "The United States - or your state?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 65, 
        "quote": "", 
        "reply": "I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:14:00", 
        "title": "The United States - or your state?", 
        "userID": "L0A1"
    }, 
    {
        "content": "I hope a professional Texas sports team doesn't win a major event for the next decade. That's the real problem behind the recent bombast; ridiculous Texas ego. Seceding from the most prosperous country on the planet, is not only illogical but impossible. Here's how the \"we are seceding\" conversation would go: Texas: \"(big long-winded speech drawing heavily on Revolution-era rhetoric)...and that is why we have decided to leave.\" The Federal Government: \"No.\"", 
        "intTime": 20090416, 
        "postID": 66, 
        "quote": "", 
        "reply": "I hope a professional Texas sports team doesn't win a major event for the next decade. That's the real problem behind the recent bombast; ridiculous Texas ego. Seceding from the most prosperous country on the planet, is not only illogical but impossible. Here's how the \"we are seceding\" conversation would go: Texas: \"(big long-winded speech drawing heavily on Revolution-era rhetoric)...and that is why we have decided to leave.\" The Federal Government: \"No.\"", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:47:00", 
        "title": "The United States - or your state?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of control spending and goverment growth. Roger That . . .", 
        "intTime": 20090416, 
        "postID": 67, 
        "quote": "Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of control spending and goverment growth.", 
        "reply": " Roger That . . .", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:51:00", 
        "title": "The United States - or your state?", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "intTime": 20090416, 
        "postID": 68, 
        "quote": "Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:54:00", 
        "title": "The United States - or your state?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Well said LOA1, Well said. Supporter of the TEA party.", 
        "intTime": 20090416, 
        "postID": 69, 
        "quote": "Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth.", 
        "reply": " Well said LOA1, Well said. Supporter of the TEA party.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:24:00", 
        "title": "The United States - or your state?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "I live in southern Indiana. We're hoping that Gary secedes.", 
        "intTime": 20090416, 
        "postID": 70, 
        "quote": "", 
        "reply": "I live in southern Indiana. We're hoping that Gary secedes.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:52:00", 
        "title": "The United States - or your state?", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. Quit being such a drama queen. No state can vote to seceed, it's unconstitutional. The vote wouldn't be legally binding. Now, if your state was one of 2/3 that votes for an Art V Constitutional Convention and chooses not to renew their association with the US as a subservient state (which would be legal), you could then pontificate about your moral choice. Secession: will never happen Constitutional Convention: possibility At least stay within the bounds of realism. You might as well say \"if Klingons and Romulans invaded our solar system and forced everyone to pick sides, who would you join with?\"", 
        "intTime": 20090416, 
        "postID": 71, 
        "quote": "Originally posted by Fightdirector: If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " Quit being such a drama queen. No state can vote to seceed, it's unconstitutional. The vote wouldn't be legally binding. Now, if your state was one of 2/3 that votes for an Art V Constitutional Convention and chooses not to renew their association with the US as a subservient state (which would be legal), you could then pontificate about your moral choice. Secession: will never happen Constitutional Convention: possibility At least stay within the bounds of realism. You might as well say \"if Klingons and Romulans invaded our solar system and forced everyone to pick sides, who would you join with?\"", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:54:00", 
        "title": "The United States - or your state?", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second. As a native Texan, I concur with everything you have said here!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090416, 
        "postID": 72, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "reply": " As a native Texan, I concur with everything you have said here!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 12:06:00", 
        "title": "The United States - or your state?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "intTime": 20090416, 
        "postID": 73, 
        "quote": "", 
        "reply": "with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 12:14:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....By the way, those HEROES who took a stand in 1860 against a Federal Government grown tyrannical are a shining example for all Americans who believe in the Constitution of the United States of America AS IT WAS WRITTEN.... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Descendant of Lt. General James Longstreet (on my dad's mother's side of the family)", 
        "intTime": 20090416, 
        "postID": 74, 
        "quote": "Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "reply": " Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....By the way, those HEROES who took a stand in 1860 against a Federal Government grown tyrannical are a shining example for all Americans who believe in the Constitution of the United States of America AS IT WAS WRITTEN.... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Descendant of Lt. General James Longstreet (on my dad's mother's side of the family)", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 13:39:00", 
        "title": "The United States - or your state?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 75, 
        "quote": "", 
        "reply": "It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 13:50:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. yea i agree not an easy conclusion to come to... i do agree with your statement tho...", 
        "intTime": 20090416, 
        "postID": 76, 
        "quote": "Originally posted by MM2_ss_Lewis: It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow.", 
        "reply": " yea i agree not an easy conclusion to come to... i do agree with your statement tho...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:00:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede. I'm starting to understand your position much better lately. Letting things slip are we Comrade?", 
        "intTime": 20090416, 
        "postID": 77, 
        "quote": "Originally posted by PhoenixDark: As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "reply": " I'm starting to understand your position much better lately. Letting things slip are we Comrade?", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:31:00", 
        "title": "The United States - or your state?", 
        "userID": "floersh"
    }, 
    {
        "content": "Considering the greatest threat to the Constitution of the United States is the politicians in D.C., having by their actions trampled the rights of the people, expanded the power of the government contrary to the limits imposed by the Constitution, and for oppressive and tyrannical behavior towards the states and the people therein...PhoenixDark, let me ask you a question... Since they are the enemy to the Constitution, shouldn't you look into them rather than the states(and their people) at this point? “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 78, 
        "quote": "", 
        "reply": "Considering the greatest threat to the Constitution of the United States is the politicians in D.C., having by their actions trampled the rights of the people, expanded the power of the government contrary to the limits imposed by the Constitution, and for oppressive and tyrannical behavior towards the states and the people therein...PhoenixDark, let me ask you a question... Since they are the enemy to the Constitution, shouldn't you look into them rather than the states(and their people) at this point? “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:48:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. My country is the United States of America, anyone who calls for secession is a traitor. He should just pack up and move into a cave with Osama ben Ladem.", 
        "intTime": 20090416, 
        "postID": 79, 
        "quote": "Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " My country is the United States of America, anyone who calls for secession is a traitor. He should just pack up and move into a cave with Osama ben Ladem.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 15:35:00", 
        "title": "The United States - or your state?", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "intTime": 20090416, 
        "postID": 80, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....", 
        "reply": " The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 15:39:00", 
        "title": "The United States - or your state?", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post. Wow, you got that from his post? I don't see anywhere him saying President Obama is a terrorist supporter or her highness as a commie. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 81, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "reply": " Wow, you got that from his post? I don't see anywhere him saying President Obama is a terrorist supporter or her highness as a commie. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:05:00", 
        "title": "The United States - or your state?", 
        "userID": "L0A1"
    }, 
    {
        "content": "L0A1, don't try to be logical...logic, facts, and thoughts don't work against irrational emotion and preconcieved beliefs mate. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 82, 
        "quote": "", 
        "reply": "L0A1, don't try to be logical...logic, facts, and thoughts don't work against irrational emotion and preconcieved beliefs mate. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:11:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "before ww1 there was no national standing army... each state had a national guard and that was about it... in fact in ww1 there was a lot of rivelies between members of different states... ahh you guys kicked our butts at that one battle in 1862 and were still ****ed... a lot of that stuff...", 
        "intTime": 20090416, 
        "postID": 83, 
        "quote": "", 
        "reply": "before ww1 there was no national standing army... each state had a national guard and that was about it... in fact in ww1 there was a lot of rivelies between members of different states... ahh you guys kicked our butts at that one battle in 1862 and were still ****ed... a lot of that stuff...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:15:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "It really depends on which state you're talking about. As a resident of Illinois I'd need a couple hours to pack before I left the state to it's own ends, If it was california, I'd help some of them pack then wave bye bye to them, and take up a vigil on the Nevada border to ensure they don't come back. The Constitution was very well written by people who wanted to ensure the states maintained certain rights, and now that the federal government is continually searching and enacting laws that circumvent the rights given in the constitution to the states and even talking about rewriting it to make it more current I understand why some states are talking about leaving the union. Times have indeed changed, people have changed, beliefs have changed, but the Constitution has not changed- and it SHOULDN'T. The document is as relevant and current as the day it was written, only the people have changed. We as a people NEED to change back to the people we used to be NOT change the Constitution to accommodate our new ways and beliefs. In the case of Texas: I think they have a legitimate beef and should they decide to secede I will stand with them as America has changed into something I almost don't recognize anymore.", 
        "intTime": 20090416, 
        "postID": 84, 
        "quote": "", 
        "reply": "It really depends on which state you're talking about. As a resident of Illinois I'd need a couple hours to pack before I left the state to it's own ends, If it was california, I'd help some of them pack then wave bye bye to them, and take up a vigil on the Nevada border to ensure they don't come back. The Constitution was very well written by people who wanted to ensure the states maintained certain rights, and now that the federal government is continually searching and enacting laws that circumvent the rights given in the constitution to the states and even talking about rewriting it to make it more current I understand why some states are talking about leaving the union. Times have indeed changed, people have changed, beliefs have changed, but the Constitution has not changed- and it SHOULDN'T. The document is as relevant and current as the day it was written, only the people have changed. We as a people NEED to change back to the people we used to be NOT change the Constitution to accommodate our new ways and beliefs. In the case of Texas: I think they have a legitimate beef and should they decide to secede I will stand with them as America has changed into something I almost don't recognize anymore.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:28:00", 
        "title": "The United States - or your state?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "intTime": 20090416, 
        "postID": 85, 
        "quote": "", 
        "reply": "In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:09:00", 
        "title": "The United States - or your state?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I very much doubt that any state is going to secede anytime soon. However, just to play \"what if?\".. if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example.", 
        "intTime": 20090416, 
        "postID": 86, 
        "quote": "", 
        "reply": "I very much doubt that any state is going to secede anytime soon. However, just to play \"what if?\".. if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:14:00", 
        "title": "The United States - or your state?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama. Change your depends, take a shower, and the smell will go away.", 
        "intTime": 20090416, 
        "postID": 87, 
        "quote": "Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama.", 
        "reply": " Change your depends, take a shower, and the smell will go away.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:32:00", 
        "title": "The United States - or your state?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama. This entire thread's premise is melodrama... so don't blame that chit on me, uhler.", 
        "intTime": 20090416, 
        "postID": 88, 
        "quote": "Originally posted by dmuhler: quote: ..if my state seceded due to ever increasing Fed Gov't tyranny, I'd probably follow Lee's example. I smell melodrama.", 
        "reply": " This entire thread's premise is melodrama... so don't blame that chit on me, uhler.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:36:00", 
        "title": "The United States - or your state?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Let's see... If I had to chose between Gov. David Patterson or President Barac Obama... Aaaaaarrrrggggghhhh (head exploding....)", 
        "intTime": 20090416, 
        "postID": 89, 
        "quote": "", 
        "reply": "Let's see... If I had to chose between Gov. David Patterson or President Barac Obama... Aaaaaarrrrggggghhhh (head exploding....)", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:45:00", 
        "title": "The United States - or your state?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Igor Panarin : US Will Break Into Six Parts (Russian Professor) //www.huffingtonpost.com/2008/11/25/igor-panarin-us-will-brea_n_146427.html", 
        "intTime": 20090416, 
        "postID": 90, 
        "quote": "", 
        "reply": "Igor Panarin : US Will Break Into Six Parts (Russian Professor) //www.huffingtonpost.com/2008/11/25/igor-panarin-us-will-brea_n_146427.html", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 09:48:00", 
        "title": "The United States - or your state?", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "intTime": 20090416, 
        "postID": 91, 
        "quote": "Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.?", 
        "reply": " Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:07:00", 
        "title": "The United States - or your state?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Rick Perry is big on wind and smoke, living in Texas I know he loves media attention when he can get it. To take him serious on a statement of secession would be a mistake. Things have changed alot since 1860. Back in those days, and this was true predominately in the South more so than in the North, citizens looked upon their individual states as their own sovereign countries. Robert E. Lee was greatly disturbed by a decision he would eventually have to make, since he was initially offered the command of all Federal armies in the Union, and at the same time saw his native Virginia as \"native soil.\" But as a devout and loyal career minded US Army officer who held the rank of Full-Colonel at the time, he did not take nor make his decision lightly, nor in haste. Painfully for him, because he was a Union Man at heart, he chose Virginia, and henceforth the Confederacy over the Union. Even after the war was over, he maintained he made the right decision, and said he would have done it all over again if need be. It wasn't so much that he was dedicated to the principles of the Confederacy, but he was absolutely dedicated to the defense of his home-his native Virginia. As lee said, \"I cannot raise my own sword against her.\" This is an interesting contrast to Sam Houston, who was instrumental in securing Texas independence from Mexico, but who helped bring Texas into the Union in 1845 as a state of the Union. When the seeds of secession were taking place in Texas during 1860-61, Houston, being a Pro-Union man was absolutely opposed to Texas seceeding and becoming a state of the Confederacy. Henceforth, Houston would himself become neutral during the CW, and took neither side. His life was threatened on several occasions by fellow Texans who were Southern sympathizers before and during the war. Things have changed alot in this country since 1860. My fear is not so much a \"South shall rise again scenario,\" but rather a group of states (or segments of states) in North, South, East and West forming some kind of an independent coalition, but would NOT be divided geographically from those areas choosing to stay in the Union, such as a Mason-Dixon line example. Well Flight Director, I didn't mean to rattle on like this, but your \"modern day\" scenario of a former 1860 gets very complicated to say the least. My hope is always that the Union shall maintain itself, even during the worst of political and economic upheaval!... This message has been edited. Last edited by: ProgMod, Thu 16 April 2009 10:27 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090416, 
        "postID": 92, 
        "quote": "", 
        "reply": "Rick Perry is big on wind and smoke, living in Texas I know he loves media attention when he can get it. To take him serious on a statement of secession would be a mistake. Things have changed alot since 1860. Back in those days, and this was true predominately in the South more so than in the North, citizens looked upon their individual states as their own sovereign countries. Robert E. Lee was greatly disturbed by a decision he would eventually have to make, since he was initially offered the command of all Federal armies in the Union, and at the same time saw his native Virginia as \"native soil.\" But as a devout and loyal career minded US Army officer who held the rank of Full-Colonel at the time, he did not take nor make his decision lightly, nor in haste. Painfully for him, because he was a Union Man at heart, he chose Virginia, and henceforth the Confederacy over the Union. Even after the war was over, he maintained he made the right decision, and said he would have done it all over again if need be. It wasn't so much that he was dedicated to the principles of the Confederacy, but he was absolutely dedicated to the defense of his home-his native Virginia. As lee said, \"I cannot raise my own sword against her.\" This is an interesting contrast to Sam Houston, who was instrumental in securing Texas independence from Mexico, but who helped bring Texas into the Union in 1845 as a state of the Union. When the seeds of secession were taking place in Texas during 1860-61, Houston, being a Pro-Union man was absolutely opposed to Texas seceeding and becoming a state of the Confederacy. Henceforth, Houston would himself become neutral during the CW, and took neither side. His life was threatened on several occasions by fellow Texans who were Southern sympathizers before and during the war. Things have changed alot in this country since 1860. My fear is not so much a \"South shall rise again scenario,\" but rather a group of states (or segments of states) in North, South, East and West forming some kind of an independent coalition, but would NOT be divided geographically from those areas choosing to stay in the Union, such as a Mason-Dixon line example. Well Flight Director, I didn't mean to rattle on like this, but your \"modern day\" scenario of a former 1860 gets very complicated to say the least. My hope is always that the Union shall maintain itself, even during the worst of political and economic upheaval!... This message has been edited. Last edited by: ProgMod, Thu 16 April 2009 10:27 AM No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:09:00", 
        "title": "The United States - or your state?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 93, 
        "quote": "", 
        "reply": "I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:14:00", 
        "title": "The United States - or your state?", 
        "userID": "L0A1"
    }, 
    {
        "content": "I hope a professional Texas sports team doesn't win a major event for the next decade. That's the real problem behind the recent bombast; ridiculous Texas ego. Seceding from the most prosperous country on the planet, is not only illogical but impossible. Here's how the \"we are seceding\" conversation would go: Texas: \"(big long-winded speech drawing heavily on Revolution-era rhetoric)...and that is why we have decided to leave.\" The Federal Government: \"No.\"", 
        "intTime": 20090416, 
        "postID": 94, 
        "quote": "", 
        "reply": "I hope a professional Texas sports team doesn't win a major event for the next decade. That's the real problem behind the recent bombast; ridiculous Texas ego. Seceding from the most prosperous country on the planet, is not only illogical but impossible. Here's how the \"we are seceding\" conversation would go: Texas: \"(big long-winded speech drawing heavily on Revolution-era rhetoric)...and that is why we have decided to leave.\" The Federal Government: \"No.\"", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:47:00", 
        "title": "The United States - or your state?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of control spending and goverment growth. Roger That . . .", 
        "intTime": 20090416, 
        "postID": 95, 
        "quote": "Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of control spending and goverment growth.", 
        "reply": " Roger That . . .", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:51:00", 
        "title": "The United States - or your state?", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "intTime": 20090416, 
        "postID": 96, 
        "quote": "Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 10:54:00", 
        "title": "The United States - or your state?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth. Well said LOA1, Well said. Supporter of the TEA party.", 
        "intTime": 20090416, 
        "postID": 97, 
        "quote": "Originally posted by L0A1: I don't remember all of this BS during the Bush Admin. Wonder why grassroot movements like Tea Party's and things like that are now taking root. It's NOT because of President Obama, alone. It's because of ALL goverment, both Republican and Democrat. Both Parties are being put on notice. Real change will come if they don't stop this out of controll spending and goverment growth.", 
        "reply": " Well said LOA1, Well said. Supporter of the TEA party.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:24:00", 
        "title": "The United States - or your state?", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "I live in southern Indiana. We're hoping that Gary secedes.", 
        "intTime": 20090416, 
        "postID": 98, 
        "quote": "", 
        "reply": "I live in southern Indiana. We're hoping that Gary secedes.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:52:00", 
        "title": "The United States - or your state?", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. Quit being such a drama queen. No state can vote to seceed, it's unconstitutional. The vote wouldn't be legally binding. Now, if your state was one of 2/3 that votes for an Art V Constitutional Convention and chooses not to renew their association with the US as a subservient state (which would be legal), you could then pontificate about your moral choice. Secession: will never happen Constitutional Convention: possibility At least stay within the bounds of realism. You might as well say \"if Klingons and Romulans invaded our solar system and forced everyone to pick sides, who would you join with?\"", 
        "intTime": 20090416, 
        "postID": 99, 
        "quote": "Originally posted by Fightdirector: If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " Quit being such a drama queen. No state can vote to seceed, it's unconstitutional. The vote wouldn't be legally binding. Now, if your state was one of 2/3 that votes for an Art V Constitutional Convention and chooses not to renew their association with the US as a subservient state (which would be legal), you could then pontificate about your moral choice. Secession: will never happen Constitutional Convention: possibility At least stay within the bounds of realism. You might as well say \"if Klingons and Romulans invaded our solar system and forced everyone to pick sides, who would you join with?\"", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 11:54:00", 
        "title": "The United States - or your state?", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second. As a native Texan, I concur with everything you have said here!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090416, 
        "postID": 100, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SSgtRobertMorris: So, if Texas were to secede, everyone should vacate to the rest of the U.S.? Actually, I believe that the majority of people who live in Texas consider themselves Americans first and Texan second and would take up arms, if necessary, to quash any attempt to put Texas out of the United States. So the chances of any state, even Texas, sucessfully seceding from the United States would fail because, in 2009 unlike 1860, people who love their country greatly outnumber people who consider their state more important than their country. I know I consider myself an American first and a resident of Massachusetts (where I have lived the past 28 years) or of Pennsylvania (where I was born) second.", 
        "reply": " As a native Texan, I concur with everything you have said here!....... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 12:06:00", 
        "title": "The United States - or your state?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "intTime": 20090416, 
        "postID": 101, 
        "quote": "", 
        "reply": "with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 12:14:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....By the way, those HEROES who took a stand in 1860 against a Federal Government grown tyrannical are a shining example for all Americans who believe in the Constitution of the United States of America AS IT WAS WRITTEN.... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Descendant of Lt. General James Longstreet (on my dad's mother's side of the family)", 
        "intTime": 20090416, 
        "postID": 102, 
        "quote": "Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi...", 
        "reply": " Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....By the way, those HEROES who took a stand in 1860 against a Federal Government grown tyrannical are a shining example for all Americans who believe in the Constitution of the United States of America AS IT WAS WRITTEN.... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Descendant of Lt. General James Longstreet (on my dad's mother's side of the family)", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 13:39:00", 
        "title": "The United States - or your state?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 103, 
        "quote": "", 
        "reply": "It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 13:50:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow. yea i agree not an easy conclusion to come to... i do agree with your statement tho...", 
        "intTime": 20090416, 
        "postID": 104, 
        "quote": "Originally posted by MM2_ss_Lewis: It's a hard question...and one that requires much thought. It is something I have looked at time and again and there is no easy answer or \"right\" answer... There are too many variables really. Personally I support the Constitution of the US, not the politicians, not the talking head, or any of those people. Should a Constitutional Convention be held, with a view to dissolving or restructuring the US, I would support sharply curtailing the power of the federal government to within the bounds described by the Constitution. Should such a measure prove unworkable, I would support the states using the convention to redefine the United States into a government or governments that they found more appealing to the people as a whole, even if it ment dissolving the nation and forming new ones composed of smaller numbers of states. Then, where my state went, I would follow.", 
        "reply": " yea i agree not an easy conclusion to come to... i do agree with your statement tho...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:00:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede. I'm starting to understand your position much better lately. Letting things slip are we Comrade?", 
        "intTime": 20090416, 
        "postID": 105, 
        "quote": "Originally posted by PhoenixDark: As for me, I'd hold to the oath I swore to upon enlisting - to defend the Constitution of the United States against all enemies - foreign and domestic - meaning I would have no hesitation to ventilating the skull of any numbnut (and their entire family if need be) who tried to get Texas to secede.", 
        "reply": " I'm starting to understand your position much better lately. Letting things slip are we Comrade?", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:31:00", 
        "title": "The United States - or your state?", 
        "userID": "floersh"
    }, 
    {
        "content": "Considering the greatest threat to the Constitution of the United States is the politicians in D.C., having by their actions trampled the rights of the people, expanded the power of the government contrary to the limits imposed by the Constitution, and for oppressive and tyrannical behavior towards the states and the people therein...PhoenixDark, let me ask you a question... Since they are the enemy to the Constitution, shouldn't you look into them rather than the states(and their people) at this point? “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 106, 
        "quote": "", 
        "reply": "Considering the greatest threat to the Constitution of the United States is the politicians in D.C., having by their actions trampled the rights of the people, expanded the power of the government contrary to the limits imposed by the Constitution, and for oppressive and tyrannical behavior towards the states and the people therein...PhoenixDark, let me ask you a question... Since they are the enemy to the Constitution, shouldn't you look into them rather than the states(and their people) at this point? “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 14:48:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example. My country is the United States of America, anyone who calls for secession is a traitor. He should just pack up and move into a cave with Osama ben Ladem.", 
        "intTime": 20090416, 
        "postID": 107, 
        "quote": "Originally posted by Fightdirector: In 1860, many military officers, NCO's and enlisted men had to choose between their country or their state. Robert E. Lee chose his state, Virginia, over his country, the United States, and brilliantly if ultimately unsucessfully commanded the losing army in the Civil War. George Thomas chose his country, the United States, over his state, Virginia, and became one of the United States Army's greatest generals, earning himself the nickname \"The Rock of Chickamagua\". The present Governor of Texas, Governor Perry, recently hinted at Texas seceding from the United States. If your state legislature voted to secede from the United States, whose example would you follow? Robert E. Lee or George Thomas? I, personally, would follow George Thomas' example.", 
        "reply": " My country is the United States of America, anyone who calls for secession is a traitor. He should just pack up and move into a cave with Osama ben Ladem.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 15:35:00", 
        "title": "The United States - or your state?", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "intTime": 20090416, 
        "postID": 108, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters....", 
        "reply": " The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 15:39:00", 
        "title": "The United States - or your state?", 
        "userID": "Boots_"
    }, 
    {
        "content": "quote: Originally posted by Boots_: quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post. Wow, you got that from his post? I don't see anywhere him saying President Obama is a terrorist supporter or her highness as a commie. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 109, 
        "quote": "Originally posted by Boots_: quote: Originally posted by Proudformermarine: quote: Originally posted by outlaws93: with obama and pelosi in charge that easy my state... get rid of the looser politicians that are destroying our country then we will talk... i have no loyalty to obama and pelosi... Hear, Hear. I reserve my loyalties for REAL Americans, not Communist schills or terrorist supporters.... The President is a terrorist supporter and the Speaker of the House is a communist schill? Thank you for that informative post.", 
        "reply": " Wow, you got that from his post? I don't see anywhere him saying President Obama is a terrorist supporter or her highness as a commie. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:05:00", 
        "title": "The United States - or your state?", 
        "userID": "L0A1"
    }, 
    {
        "content": "L0A1, don't try to be logical...logic, facts, and thoughts don't work against irrational emotion and preconcieved beliefs mate. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090416, 
        "postID": 110, 
        "quote": "", 
        "reply": "L0A1, don't try to be logical...logic, facts, and thoughts don't work against irrational emotion and preconcieved beliefs mate. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:11:00", 
        "title": "The United States - or your state?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "before ww1 there was no national standing army... each state had a national guard and that was about it... in fact in ww1 there was a lot of rivelies between members of different states... ahh you guys kicked our butts at that one battle in 1862 and were still ****ed... a lot of that stuff...", 
        "intTime": 20090416, 
        "postID": 111, 
        "quote": "", 
        "reply": "before ww1 there was no national standing army... each state had a national guard and that was about it... in fact in ww1 there was a lot of rivelies between members of different states... ahh you guys kicked our butts at that one battle in 1862 and were still ****ed... a lot of that stuff...", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:15:00", 
        "title": "The United States - or your state?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "It really depends on which state you're talking about. As a resident of Illinois I'd need a couple hours to pack before I left the state to it's own ends, If it was california, I'd help some of them pack then wave bye bye to them, and take up a vigil on the Nevada border to ensure they don't come back. The Constitution was very well written by people who wanted to ensure the states maintained certain rights, and now that the federal government is continually searching and enacting laws that circumvent the rights given in the constitution to the states and even talking about rewriting it to make it more current I understand why some states are talking about leaving the union. Times have indeed changed, people have changed, beliefs have changed, but the Constitution has not changed- and it SHOULDN'T. The document is as relevant and current as the day it was written, only the people have changed. We as a people NEED to change back to the people we used to be NOT change the Constitution to accommodate our new ways and beliefs. In the case of Texas: I think they have a legitimate beef and should they decide to secede I will stand with them as America has changed into something I almost don't recognize anymore.", 
        "intTime": 20090416, 
        "postID": 112, 
        "quote": "", 
        "reply": "It really depends on which state you're talking about. As a resident of Illinois I'd need a couple hours to pack before I left the state to it's own ends, If it was california, I'd help some of them pack then wave bye bye to them, and take up a vigil on the Nevada border to ensure they don't come back. The Constitution was very well written by people who wanted to ensure the states maintained certain rights, and now that the federal government is continually searching and enacting laws that circumvent the rights given in the constitution to the states and even talking about rewriting it to make it more current I understand why some states are talking about leaving the union. Times have indeed changed, people have changed, beliefs have changed, but the Constitution has not changed- and it SHOULDN'T. The document is as relevant and current as the day it was written, only the people have changed. We as a people NEED to change back to the people we used to be NOT change the Constitution to accommodate our new ways and beliefs. In the case of Texas: I think they have a legitimate beef and should they decide to secede I will stand with them as America has changed into something I almost don't recognize anymore.", 
        "threadID": "409192893_5050019022001", 
        "time": "2009-04-16 16:28:00", 
        "title": "The United States - or your state?", 
        "userID": "MaddogK"
    }
]