[
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by stillkit: I hate to be the bearer of bad news, but smoking isn't so much an issue of addiction for most smokers as it is a habit. I'm a life-long smoker and I can quit or cut down any time I want. So can my wife. So can most smokers I know. So, why do we continue to smoke? Because we want to and nothing like what's outlined in your post will overcome that. So there is no addiction? So what part draws you to smoke? Sure, there's an element of addiction, but it doesn't strike everyone the same way. Not all of us are true addictive personalities. In fact, I doubt most of us are. It's like beer: some people can drink it in large quantities all their lives and never become an alcoholic. They can stop or moderate their drinking whenever they like without any side effects. The same is true for some who use dope. Others, however, can't stop and suffer tremors or delirium's when they do. Those are addicts. The others aren't. The same is true for smokers, in spite of popular opinion.", 
        "intTime": 20090301, 
        "postID": 10, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by stillkit: I hate to be the bearer of bad news, but smoking isn't so much an issue of addiction for most smokers as it is a habit. I'm a life-long smoker and I can quit or cut down any time I want. So can my wife. So can most smokers I know. So, why do we continue to smoke? Because we want to and nothing like what's outlined in your post will overcome that. So there is no addiction? So what part draws you to smoke?", 
        "reply": " Sure, there's an element of addiction, but it doesn't strike everyone the same way. Not all of us are true addictive personalities. In fact, I doubt most of us are. It's like beer: some people can drink it in large quantities all their lives and never become an alcoholic. They can stop or moderate their drinking whenever they like without any side effects. The same is true for some who use dope. Others, however, can't stop and suffer tremors or delirium's when they do. Those are addicts. The others aren't. The same is true for smokers, in spite of popular opinion.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 04:19:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "stillkit"
    }, 
    {
        "content": "I wonder how many \"never gonna quit\" smokers would reconsider if they realized that every cigarette they smoke exposes them to the most poisonous radioactive isotope on earth. \"http://www.lenntech.com/periodic-chart-elements/po-en.htm \"http://www.reuters.com/article/pressRelease/idUS222582+16-Jul-2008+PRN20080716 \"http://www.nytimes.com/2006/12/01/opinion/01proctor.html \"http://www.jointogether.org/news/research/summaries/2008/tobacco-companies-knew-of.html Just curious how that knowledge would influence the habits of smokers who claim they can quit anytime.", 
        "intTime": 20090301, 
        "postID": 11, 
        "quote": "", 
        "reply": "I wonder how many \"never gonna quit\" smokers would reconsider if they realized that every cigarette they smoke exposes them to the most poisonous radioactive isotope on earth. \"http://www.lenntech.com/periodic-chart-elements/po-en.htm \"http://www.reuters.com/article/pressRelease/idUS222582+16-Jul-2008+PRN20080716 \"http://www.nytimes.com/2006/12/01/opinion/01proctor.html \"http://www.jointogether.org/news/research/summaries/2008/tobacco-companies-knew-of.html Just curious how that knowledge would influence the habits of smokers who claim they can quit anytime.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 10:21:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by aggie_swife: quote: Originally posted by stillkit: I hate to be the bearer of bad news, but smoking isn't so much an issue of addiction for most smokers as it is a habit. I'm a life-long smoker and I can quit or cut down any time I want. So can my wife. So can most smokers I know. So, why do we continue to smoke? Because we want to and nothing like what's outlined in your post will overcome that. So there is no addiction? So what part draws you to smoke? Sure, there's an element of addiction, but it doesn't strike everyone the same way. Not all of us are true addictive personalities. In fact, I doubt most of us are. It's like beer: some people can drink it in large quantities all their lives and never become an alcoholic. They can stop or moderate their drinking whenever they like without any side effects. The same is true for some who use dope. Others, however, can't stop and suffer tremors or delirium's when they do. Those are addicts. The others aren't. The same is true for smokers, in spite of popular opinion. Do you have any scientific studies that back that up? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090301, 
        "postID": 12, 
        "quote": "Originally posted by stillkit: quote: Originally posted by aggie_swife: quote: Originally posted by stillkit: I hate to be the bearer of bad news, but smoking isn't so much an issue of addiction for most smokers as it is a habit. I'm a life-long smoker and I can quit or cut down any time I want. So can my wife. So can most smokers I know. So, why do we continue to smoke? Because we want to and nothing like what's outlined in your post will overcome that. So there is no addiction? So what part draws you to smoke? Sure, there's an element of addiction, but it doesn't strike everyone the same way. Not all of us are true addictive personalities. In fact, I doubt most of us are. It's like beer: some people can drink it in large quantities all their lives and never become an alcoholic. They can stop or moderate their drinking whenever they like without any side effects. The same is true for some who use dope. Others, however, can't stop and suffer tremors or delirium's when they do. Those are addicts. The others aren't. The same is true for smokers, in spite of popular opinion.", 
        "reply": " Do you have any scientific studies that back that up? \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 11:37:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: I would be very, very skeptical of ANYTHING made in China that was to be ingested in any maner or form That was my first thought as well. I hope these things turn out to be safe and are eventually sold in the US. Nicotine is one of the most addictive drugs on the planet. Its effects are not nearly as extreme as other drugs but the dependency it creates rates up there with heroin from what I've heard.", 
        "intTime": 20090301, 
        "postID": 13, 
        "quote": "I would be very, very skeptical of ANYTHING made in China that was to be ingested in any maner or form", 
        "reply": " That was my first thought as well. I hope these things turn out to be safe and are eventually sold in the US. Nicotine is one of the most addictive drugs on the planet. Its effects are not nearly as extreme as other drugs but the dependency it creates rates up there with heroin from what I've heard.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 11:56:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: Do you have any scientific studies that back that up? No, I don't. Just a lifetime of observation. And, such studies may not exist at all. Have you ever heard of a study being done about smoking which determined it's not as bad as people think? Me neither. Why not? Is it because cigarettes really are that bad, or is it because nobody can find funding for an honest study because of the hysteria surrounding smoking right now? I don't know, but it's a distinct possibility, given that most of the studies about smoking and second hand smoke began with an assumption and then set out to prove it.", 
        "intTime": 20090301, 
        "postID": 14, 
        "quote": "Originally posted by aggie_swife: Do you have any scientific studies that back that up?", 
        "reply": " No, I don't. Just a lifetime of observation. And, such studies may not exist at all. Have you ever heard of a study being done about smoking which determined it's not as bad as people think? Me neither. Why not? Is it because cigarettes really are that bad, or is it because nobody can find funding for an honest study because of the hysteria surrounding smoking right now? I don't know, but it's a distinct possibility, given that most of the studies about smoking and second hand smoke began with an assumption and then set out to prove it.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 12:01:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: I wonder how many \"never gonna quit\" smokers would reconsider if they realized that every cigarette they smoke exposes them to the most poisonous radioactive isotope on earth. \"http://www.lenntech.com/periodic-chart-elements/po-en.htm \"http://www.reuters.com/article/pressRelease/idUS222582+16-Jul-2008+PRN20080716 \"http://www.nytimes.com/2006/12/01/opinion/01proctor.html \"http://www.jointogether.org/news/research/summaries/2008/tobacco-companies-knew-of.html Just curious how that knowledge would influence the habits of smokers who claim they can quit anytime. We're all exposed to worse than that every time a car passes by on the street, yet nobody is proposing cars be banned around people. For instance, at the local hospital, I can't smoke on their property, but I can stand there and breathe exhaust fumes all day long. Why? Exhaust is at least as dangerous as cigarette smoke, maybe more so, yet nobody is afraid of it enough to protest. The reason I can't smoke, but your car can belch fumes in the same place is because of hysteria concerning cigarettes.", 
        "intTime": 20090301, 
        "postID": 15, 
        "quote": "Originally posted by Whirled_Peas: I wonder how many \"never gonna quit\" smokers would reconsider if they realized that every cigarette they smoke exposes them to the most poisonous radioactive isotope on earth. \"http://www.lenntech.com/periodic-chart-elements/po-en.htm \"http://www.reuters.com/article/pressRelease/idUS222582+16-Jul-2008+PRN20080716 \"http://www.nytimes.com/2006/12/01/opinion/01proctor.html \"http://www.jointogether.org/news/research/summaries/2008/tobacco-companies-knew-of.html Just curious how that knowledge would influence the habits of smokers who claim they can quit anytime.", 
        "reply": " We're all exposed to worse than that every time a car passes by on the street, yet nobody is proposing cars be banned around people. For instance, at the local hospital, I can't smoke on their property, but I can stand there and breathe exhaust fumes all day long. Why? Exhaust is at least as dangerous as cigarette smoke, maybe more so, yet nobody is afraid of it enough to protest. The reason I can't smoke, but your car can belch fumes in the same place is because of hysteria concerning cigarettes.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 12:04:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by aggie_swife: Do you have any scientific studies that back that up? No, I don't. Just a lifetime of observation. And, such studies may not exist at all. Have you ever heard of a study being done about smoking which determined it's not as bad as people think? Me neither. Why not? Is it because cigarettes really are that bad, or is it because nobody can find funding for an honest study because of the hysteria surrounding smoking right now? I don't know, but it's a distinct possibility, given that most of the studies about smoking and second hand smoke began with an assumption and then set out to prove it. How about we agree to donate our lungs to A. College (when our time on Earth is done) so they can be compared. Whatcha think? Here is an example of a comparison: (note: the black one is the smoker's lung) \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090301, 
        "postID": 16, 
        "quote": "Originally posted by stillkit: quote: Originally posted by aggie_swife: Do you have any scientific studies that back that up? No, I don't. Just a lifetime of observation. And, such studies may not exist at all. Have you ever heard of a study being done about smoking which determined it's not as bad as people think? Me neither. Why not? Is it because cigarettes really are that bad, or is it because nobody can find funding for an honest study because of the hysteria surrounding smoking right now? I don't know, but it's a distinct possibility, given that most of the studies about smoking and second hand smoke began with an assumption and then set out to prove it.", 
        "reply": " How about we agree to donate our lungs to A. College (when our time on Earth is done) so they can be compared. Whatcha think? Here is an example of a comparison: (note: the black one is the smoker's lung) \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 13:57:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: I agree. I've been a smoker for over 40 years. Most of my friends have quit, but I feel I'm doing my part in supporting my community with the additional taxes I pay. LOL! Now that Congress has passed and Obama has signed an enhanced SCHIP funded solely by the lungs of smokers, one can fairly say that those that don't smoke or quit ... hate kids! Thanks for the post AW ... I've ordered one of these and we'll see in a couple weeks whether it is all it is cracked up to be.", 
        "intTime": 20090301, 
        "postID": 17, 
        "quote": "I agree. I've been a smoker for over 40 years. Most of my friends have quit, but I feel I'm doing my part in supporting my community with the additional taxes I pay.", 
        "reply": " LOL! Now that Congress has passed and Obama has signed an enhanced SCHIP funded solely by the lungs of smokers, one can fairly say that those that don't smoke or quit ... hate kids! Thanks for the post AW ... I've ordered one of these and we'll see in a couple weeks whether it is all it is cracked up to be.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 14:05:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by stillkit: quote: Originally posted by aggie_swife: Do you have any scientific studies that back that up? No, I don't. Just a lifetime of observation. And, such studies may not exist at all. Have you ever heard of a study being done about smoking which determined it's not as bad as people think? Me neither. Why not? Is it because cigarettes really are that bad, or is it because nobody can find funding for an honest study because of the hysteria surrounding smoking right now? I don't know, but it's a distinct possibility, given that most of the studies about smoking and second hand smoke began with an assumption and then set out to prove it. How about we agree to donate our lungs to A. College (when our time on Earth is done) so they can be compared. Whatcha think? Here is an example of a comparison: (note: the black one is the smoker's lung) So, I should quit smoking so I can die with prettier lungs?", 
        "intTime": 20090301, 
        "postID": 18, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by stillkit: quote: Originally posted by aggie_swife: Do you have any scientific studies that back that up? No, I don't. Just a lifetime of observation. And, such studies may not exist at all. Have you ever heard of a study being done about smoking which determined it's not as bad as people think? Me neither. Why not? Is it because cigarettes really are that bad, or is it because nobody can find funding for an honest study because of the hysteria surrounding smoking right now? I don't know, but it's a distinct possibility, given that most of the studies about smoking and second hand smoke began with an assumption and then set out to prove it. How about we agree to donate our lungs to A. College (when our time on Earth is done) so they can be compared. Whatcha think? Here is an example of a comparison: (note: the black one is the smoker's lung)", 
        "reply": " So, I should quit smoking so I can die with prettier lungs?", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 14:10:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: So, I should quit smoking so I can die with prettier lungs? Damnit StillKit, you beat me to it!", 
        "intTime": 20090301, 
        "postID": 19, 
        "quote": "So, I should quit smoking so I can die with prettier lungs?", 
        "reply": " Damnit StillKit, you beat me to it!", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 14:15:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: If I remember correctly back in the 80s<?> herbal cigarettes (no, not marijuana) were being touted as the answer to the 'smoker's prayer' - I don't smoke and never have but they smelled AWFUL and soon went they way of most fads. I actually tried them. Health food stores sold them. They were made of cabbage leaves and smelled like a raked leaf pile burning. They were so harsh they burned your throat and made you caugh same as breathing the smoke from a leaf pile. And they were expensive.", 
        "intTime": 20090301, 
        "postID": 20, 
        "quote": "Originally posted by Mom2APAJ: If I remember correctly back in the 80s<?> herbal cigarettes (no, not marijuana) were being touted as the answer to the 'smoker's prayer' - I don't smoke and never have but they smelled AWFUL and soon went they way of most fads.", 
        "reply": " I actually tried them. Health food stores sold them. They were made of cabbage leaves and smelled like a raked leaf pile burning. They were so harsh they burned your throat and made you caugh same as breathing the smoke from a leaf pile. And they were expensive.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 14:34:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by stillkit: I hate to be the bearer of bad news, but smoking isn't so much an issue of addiction for most smokers as it is a habit. I'm a life-long smoker and I can quit or cut down any time I want. So can my wife. So can most smokers I know. So, why do we continue to smoke? Because we want to and nothing like what's outlined in your post will overcome that. I to am a smoker and do enjoy it but it is a habit that needs work to break. The addiction is factual as there was a movie based on a true story of a chemist hired by a major tobacco corp to produce an addictive drug they used. I believe it was called the insider or the whistle blower Im not sure. He was reminded that he had signed confidentiality papers when they were letting him go and he complained about his separation package and demanded more. They threatened him and his family and tried to kill him. He was working with an investigative reporter played by Al Pachino. Good flick.", 
        "intTime": 20090301, 
        "postID": 21, 
        "quote": "Originally posted by stillkit: I hate to be the bearer of bad news, but smoking isn't so much an issue of addiction for most smokers as it is a habit. I'm a life-long smoker and I can quit or cut down any time I want. So can my wife. So can most smokers I know. So, why do we continue to smoke? Because we want to and nothing like what's outlined in your post will overcome that.", 
        "reply": " I to am a smoker and do enjoy it but it is a habit that needs work to break. The addiction is factual as there was a movie based on a true story of a chemist hired by a major tobacco corp to produce an addictive drug they used. I believe it was called the insider or the whistle blower Im not sure. He was reminded that he had signed confidentiality papers when they were letting him go and he complained about his separation package and demanded more. They threatened him and his family and tried to kill him. He was working with an investigative reporter played by Al Pachino. Good flick.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 14:52:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "john2x"
    }, 
    {
        "content": "My wife and I got this same product at the mall. This product was made in Isreal. My wife hates it; I love it! If and when we are in a situation that requires us craving for a cigarette, I can take three hits off this fake cigarette and get thru it. My wife? Forget it! She sneaks out and fire up the real thing. JMHO, I could be wrong...", 
        "intTime": 20090301, 
        "postID": 22, 
        "quote": "", 
        "reply": "My wife and I got this same product at the mall. This product was made in Isreal. My wife hates it; I love it! If and when we are in a situation that requires us craving for a cigarette, I can take three hits off this fake cigarette and get thru it. My wife? Forget it! She sneaks out and fire up the real thing. JMHO, I could be wrong...", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 15:03:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by aggie_swife: quote: Originally posted by stillkit: I hate to be the bearer of bad news, but smoking isn't so much an issue of addiction for most smokers as it is a habit. I'm a life-long smoker and I can quit or cut down any time I want. So can my wife. So can most smokers I know. So, why do we continue to smoke? Because we want to and nothing like what's outlined in your post will overcome that. So there is no addiction? So what part draws you to smoke? Sure, there's an element of addiction, but it doesn't strike everyone the same way. Not all of us are true addictive personalities. In fact, I doubt most of us are. It's like beer: some people can drink it in large quantities all their lives and never become an alcoholic. They can stop or moderate their drinking whenever they like without any side effects. The same is true for some who use dope. Others, however, can't stop and suffer tremors or delirium's when they do. Those are addicts. The others aren't. The same is true for smokers, in spite of popular opinion. Its a brain altering addiction. Something like depression if the neurons are in short supply or being re absorbed faster than the body can produce them The firing order of the neurons are disrupted and to few will reach the happy receptors so its not possible to be happy unless the brain says so. Nicotine triggers neurons to hit pleasure receptors and anti smoking drugs mask those receptors from the nicotine. Or something along those lines. But thats the general Idea every thing starts and ends in the brain the conrol center.", 
        "intTime": 20090301, 
        "postID": 23, 
        "quote": "Originally posted by stillkit: quote: Originally posted by aggie_swife: quote: Originally posted by stillkit: I hate to be the bearer of bad news, but smoking isn't so much an issue of addiction for most smokers as it is a habit. I'm a life-long smoker and I can quit or cut down any time I want. So can my wife. So can most smokers I know. So, why do we continue to smoke? Because we want to and nothing like what's outlined in your post will overcome that. So there is no addiction? So what part draws you to smoke? Sure, there's an element of addiction, but it doesn't strike everyone the same way. Not all of us are true addictive personalities. In fact, I doubt most of us are. It's like beer: some people can drink it in large quantities all their lives and never become an alcoholic. They can stop or moderate their drinking whenever they like without any side effects. The same is true for some who use dope. Others, however, can't stop and suffer tremors or delirium's when they do. Those are addicts. The others aren't. The same is true for smokers, in spite of popular opinion.", 
        "reply": " Its a brain altering addiction. Something like depression if the neurons are in short supply or being re absorbed faster than the body can produce them The firing order of the neurons are disrupted and to few will reach the happy receptors so its not possible to be happy unless the brain says so. Nicotine triggers neurons to hit pleasure receptors and anti smoking drugs mask those receptors from the nicotine. Or something along those lines. But thats the general Idea every thing starts and ends in the brain the conrol center.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 15:12:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by aggie_swife: quote: Originally posted by stillkit: quote: Originally posted by aggie_swife: Do you have any scientific studies that back that up? No, I don't. Just a lifetime of observation. And, such studies may not exist at all. Have you ever heard of a study being done about smoking which determined it's not as bad as people think? Me neither. Why not? Is it because cigarettes really are that bad, or is it because nobody can find funding for an honest study because of the hysteria surrounding smoking right now? I don't know, but it's a distinct possibility, given that most of the studies about smoking and second hand smoke began with an assumption and then set out to prove it. How about we agree to donate our lungs to A. College (when our time on Earth is done) so they can be compared. Whatcha think? Here is an example of a comparison: (note: the black one is the smoker's lung) Yea but the bottom line is they both came from DEAD people??? We only have the moment everything before or after becomes a moot point so enjoy the moment its all you have.", 
        "intTime": 20090301, 
        "postID": 24, 
        "quote": "Originally posted by aggie_swife: quote: Originally posted by stillkit: quote: Originally posted by aggie_swife: Do you have any scientific studies that back that up? No, I don't. Just a lifetime of observation. And, such studies may not exist at all. Have you ever heard of a study being done about smoking which determined it's not as bad as people think? Me neither. Why not? Is it because cigarettes really are that bad, or is it because nobody can find funding for an honest study because of the hysteria surrounding smoking right now? I don't know, but it's a distinct possibility, given that most of the studies about smoking and second hand smoke began with an assumption and then set out to prove it. How about we agree to donate our lungs to A. College (when our time on Earth is done) so they can be compared. Whatcha think? Here is an example of a comparison: (note: the black one is the smoker's lung)", 
        "reply": " Yea but the bottom line is they both came from DEAD people??? We only have the moment everything before or after becomes a moot point so enjoy the moment its all you have.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 15:22:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "john2x"
    }, 
    {
        "content": "Be right back, Smoke Break!", 
        "intTime": 20090301, 
        "postID": 25, 
        "quote": "", 
        "reply": "Be right back, Smoke Break!", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 16:01:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "dman1948"
    }, 
    {
        "content": "Don't worry dman we'll send in these guys to help you. (cough) (cough)! \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090301, 
        "postID": 26, 
        "quote": "", 
        "reply": "Don't worry dman we'll send in these guys to help you. (cough) (cough)! \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 16:37:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by john2x: Its a brain altering addiction. Something like depression if the neurons are in short supply or being re absorbed faster than the body can produce them The firing order of the neurons are disrupted and to few will reach the happy receptors so its not possible to be happy unless the brain says so. Nicotine triggers neurons to hit pleasure receptors and anti smoking drugs mask those receptors from the nicotine. Or something along those lines. But thats the general Idea every thing starts and ends in the brain the conrol center. Of course nicotine triggers the pleasure receptors. If they didn't, nobody would smoke. Who wants to indulge in an activity which brings you no pleasure? That would make smoking like work, wouldn't it? But, there must be something in a good steak which triggers those things too because a steak brings me pleasure. Why is it that if I eat steak every day, nobody calls me an addict because of that? Or, if I drink 3 Cokes a day? See? It's still mostly a matter of choice, unless you're willing to admit that we are all addicted to a lot things. But, be careful if you admit that because you might be opening the door to government regulation of YOUR addiction.", 
        "intTime": 20090301, 
        "postID": 27, 
        "quote": "Originally posted by john2x: Its a brain altering addiction. Something like depression if the neurons are in short supply or being re absorbed faster than the body can produce them The firing order of the neurons are disrupted and to few will reach the happy receptors so its not possible to be happy unless the brain says so. Nicotine triggers neurons to hit pleasure receptors and anti smoking drugs mask those receptors from the nicotine. Or something along those lines. But thats the general Idea every thing starts and ends in the brain the conrol center.", 
        "reply": " Of course nicotine triggers the pleasure receptors. If they didn't, nobody would smoke. Who wants to indulge in an activity which brings you no pleasure? That would make smoking like work, wouldn't it? But, there must be something in a good steak which triggers those things too because a steak brings me pleasure. Why is it that if I eat steak every day, nobody calls me an addict because of that? Or, if I drink 3 Cokes a day? See? It's still mostly a matter of choice, unless you're willing to admit that we are all addicted to a lot things. But, be careful if you admit that because you might be opening the door to government regulation of YOUR addiction.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 18:00:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by john2x: Its a brain altering addiction. Something like depression if the neurons are in short supply or being re absorbed faster than the body can produce them The firing order of the neurons are disrupted and to few will reach the happy receptors so its not possible to be happy unless the brain says so. Nicotine triggers neurons to hit pleasure receptors and anti smoking drugs mask those receptors from the nicotine. Or something along those lines. But thats the general Idea every thing starts and ends in the brain the conrol center. Of course nicotine triggers the pleasure receptors. If they didn't, nobody would smoke. Who wants to indulge in an activity which brings you no pleasure? That would make smoking like work, wouldn't it? But, there must be something in a good steak which triggers those things too because a steak brings me pleasure. Why is it that if I eat steak every day, nobody calls me an addict because of that? Or, if I drink 3 Cokes a day? See? It's still mostly a matter of choice, unless you're willing to admit that we are all addicted to a lot things. But, be careful if you admit that because you might be opening the door to government regulation of YOUR addiction. Caffeine is addictive- the body becomes accustomed to it faster than any other substance. If you could not get through a day without your three Cokes, and/or continued to drink Coke despite a doctor's advice, teeth the color of a Hershey bar, etc. then you'd most likely be an addict. If you can quit a substance or activity when it negatively affects your life, then you're not an addict. Now, off to feed my borderline addiction to a truly habit-forming substance; my Girl Scout Cookies have arrived. P.S. Yes, I'm back- had lots of baby knitting and shopping to do. Still at it, but things have calmed down.", 
        "intTime": 20090301, 
        "postID": 28, 
        "quote": "Originally posted by stillkit: quote: Originally posted by john2x: Its a brain altering addiction. Something like depression if the neurons are in short supply or being re absorbed faster than the body can produce them The firing order of the neurons are disrupted and to few will reach the happy receptors so its not possible to be happy unless the brain says so. Nicotine triggers neurons to hit pleasure receptors and anti smoking drugs mask those receptors from the nicotine. Or something along those lines. But thats the general Idea every thing starts and ends in the brain the conrol center. Of course nicotine triggers the pleasure receptors. If they didn't, nobody would smoke. Who wants to indulge in an activity which brings you no pleasure? That would make smoking like work, wouldn't it? But, there must be something in a good steak which triggers those things too because a steak brings me pleasure. Why is it that if I eat steak every day, nobody calls me an addict because of that? Or, if I drink 3 Cokes a day? See? It's still mostly a matter of choice, unless you're willing to admit that we are all addicted to a lot things. But, be careful if you admit that because you might be opening the door to government regulation of YOUR addiction.", 
        "reply": " Caffeine is addictive- the body becomes accustomed to it faster than any other substance. If you could not get through a day without your three Cokes, and/or continued to drink Coke despite a doctor's advice, teeth the color of a Hershey bar, etc. then you'd most likely be an addict. If you can quit a substance or activity when it negatively affects your life, then you're not an addict. Now, off to feed my borderline addiction to a truly habit-forming substance; my Girl Scout Cookies have arrived. P.S. Yes, I'm back- had lots of baby knitting and shopping to do. Still at it, but things have calmed down.", 
        "threadID": "409192893_6920094612001", 
        "time": "2009-03-01 19:44:00", 
        "title": "Answer to a smoker's prayer", 
        "userID": "sweetsuds"
    }
]