[
    {
        "content": "Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach ['''URL=http://www.foxnews.com/story/0,2933,510015,00.html JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:12 AM", 
        "intTime": 20090321, 
        "postID": 1, 
        "quote": "", 
        "reply": "Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach ['''URL=http://www.foxnews.com/story/0,2933,510015,00.html JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:12 AM", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 15:43:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "I can hear Pelosi now, \"The raids must stop!, The raids must stop!!\"", 
        "intTime": 20090321, 
        "postID": 2, 
        "quote": "", 
        "reply": "I can hear Pelosi now, \"The raids must stop!, The raids must stop!!\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 15:59:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "there was a place here in Washington state that was busted a couple years ago for having a club of members who, if they wanted to do an animal it was cool or if they wanted an amimal to do them it was cool...all while everyone watched - how they were busted? Some dude was done by a horse and messed him up good and had to be hospitalised. There are some sick persons out there..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 3, 
        "quote": "", 
        "reply": "there was a place here in Washington state that was busted a couple years ago for having a club of members who, if they wanted to do an animal it was cool or if they wanted an amimal to do them it was cool...all while everyone watched - how they were busted? Some dude was done by a horse and messed him up good and had to be hospitalised. There are some sick persons out there..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 17:00:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Larry Craig....Jimmy Swagger....need we go on? lol...\"TAP TAP TAP\"", 
        "intTime": 20090321, 
        "postID": 4, 
        "quote": "", 
        "reply": "Larry Craig....Jimmy Swagger....need we go on? lol...\"TAP TAP TAP\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 17:10:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "But shouldn't a \"free society\" tolerate everything?? Translate that \"Freak Society\" Wandering and Wondering", 
        "intTime": 20090321, 
        "postID": 5, 
        "quote": "", 
        "reply": "But shouldn't a \"free society\" tolerate everything?? Translate that \"Freak Society\" Wandering and Wondering", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:04:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The folks at PETA are against the use of animals for entertainment, so I suppose they are against \"dating\" as well: \"http://www.peta.org/actioncenter/features-entertainment.asp\"", 
        "intTime": 20090321, 
        "postID": 6, 
        "quote": "", 
        "reply": "The folks at PETA are against the use of animals for entertainment, so I suppose they are against \"dating\" as well: \"http://www.peta.org/actioncenter/features-entertainment.asp\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:04:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:13 AM", 
        "intTime": 20090321, 
        "postID": 7, 
        "quote": "Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a", 
        "reply": " Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:13 AM", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:07:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Will beastiality be the new become the new liberal cause? Why, do you need legal help with that issue?", 
        "intTime": 20090321, 
        "postID": 8, 
        "quote": "Will beastiality be the new become the new liberal cause?", 
        "reply": " Why, do you need legal help with that issue?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:51:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "thorin001"
    }, 
    {
        "content": "\"Will beastiality be the new become the new liberal cause?\" No, at a guess. Considering that liberals are generally big on ethical treatment of animals (PETA being an extreme case), it is hard to imagine bestiality showing up on any credible agenda. Homosexuality is an issue of freedom between two (or more) consenting adults. Animals cannot consent - hence the need for the rope and duct tape in the article. Agreed, though - this is an insulting thread, just like a thread implying conservatives would start pushing laws making women the property of their husbands.", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "", 
        "reply": "\"Will beastiality be the new become the new liberal cause?\" No, at a guess. Considering that liberals are generally big on ethical treatment of animals (PETA being an extreme case), it is hard to imagine bestiality showing up on any credible agenda. Homosexuality is an issue of freedom between two (or more) consenting adults. Animals cannot consent - hence the need for the rope and duct tape in the article. Agreed, though - this is an insulting thread, just like a thread implying conservatives would start pushing laws making women the property of their husbands.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 06:00:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "", 
        "reply": "Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 06:54:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... It is not nice to talk bad about men of the cloth and republican congress critters. uh oh ... Disruptive posting! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090322, 
        "postID": 11, 
        "quote": "Originally posted by dmuhler: quote: With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... It is not nice to talk bad about men of the cloth and republican congress critters.", 
        "reply": " uh oh ... Disruptive posting! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 07:52:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "", 
        "reply": "wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 09:23:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! No it was not a good question, it was a logical fallacy which has been discredited a number of times. And it is not anywhere near to being \"close to the future\" I further fail to see how the current time is any less \"moral\". Perhaps you could point me to a decade or an era when people upheld values and morals to a greater extent than we do today... Where do you get this idiotic idea about \"end times\"? Personally I can think of a number of events throughout the last century alone which were more troubling than homosexual marriage. Didn't anyone read the story of the Austrian man who repeatedly raped his daughter and kept her imprisoned for decades? By your logic, that could be \"the next cause...\" Stupid.", 
        "intTime": 20090322, 
        "postID": 13, 
        "quote": "Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto!", 
        "reply": " No it was not a good question, it was a logical fallacy which has been discredited a number of times. And it is not anywhere near to being \"close to the future\" I further fail to see how the current time is any less \"moral\". Perhaps you could point me to a decade or an era when people upheld values and morals to a greater extent than we do today... Where do you get this idiotic idea about \"end times\"? Personally I can think of a number of events throughout the last century alone which were more troubling than homosexual marriage. Didn't anyone read the story of the Austrian man who repeatedly raped his daughter and kept her imprisoned for decades? By your logic, that could be \"the next cause...\" Stupid.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 09:35:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! Since you seem to want to live in the good old days, why are you out of the kitchen?", 
        "intTime": 20090322, 
        "postID": 14, 
        "quote": "Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto!", 
        "reply": " Since you seem to want to live in the good old days, why are you out of the kitchen?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 11:15:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "thorin001"
    }, 
    {
        "content": "What, Alaska doesn't have any animal cruelty statutes? How bizarre.", 
        "intTime": 20090322, 
        "postID": 15, 
        "quote": "", 
        "reply": "What, Alaska doesn't have any animal cruelty statutes? How bizarre.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 20:18:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by Elesso: wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world... I'm glad I'm not the only one that has come to that conclusion.", 
        "intTime": 20090322, 
        "postID": 16, 
        "quote": "Originally posted by Elesso: wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "reply": " I'm glad I'm not the only one that has come to that conclusion.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 21:56:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "teamrope"
    }, 
    {
        "content": "Sick!", 
        "intTime": 20090322, 
        "postID": 17, 
        "quote": "", 
        "reply": "Sick!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 22:19:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "intTime": 20090323, 
        "postID": 18, 
        "quote": "", 
        "reply": "Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 00:27:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "intTime": 20090323, 
        "postID": 19, 
        "quote": "Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "reply": " What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 02:38:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "intTime": 20090323, 
        "postID": 20, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "reply": " Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 10:12:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by adminnco1: [QUOTE]Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.[/QUOT Because a elephant wouldn't notice it, but a jackass would...", 
        "intTime": 20090323, 
        "postID": 21, 
        "quote": "Originally posted by reducetension: quote: Originally posted by adminnco1: [QUOTE]Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "reply": " Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.[/QUOT Because a elephant wouldn't notice it, but a jackass would...", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:06:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: But shouldn't a \"free society\" tolerate everything?? [IMG]\"http://i614.photobucket.com/albums/tt226/americadoc/strange.jpg\"[/IMG] Translate that \"Freak Society\" Between consenting ADULTs with the capacity to give informed consent there should be MINIMAL interference by the government.", 
        "intTime": 20090323, 
        "postID": 22, 
        "quote": "Originally posted by greywolfghost: But shouldn't a \"free society\" tolerate everything?? [IMG]\"http://i614.photobucket.com/albums/tt226/americadoc/strange.jpg\"[/IMG] Translate that \"Freak Society\"", 
        "reply": " Between consenting ADULTs with the capacity to give informed consent there should be MINIMAL interference by the government.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:34:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE!", 
        "intTime": 20090323, 
        "postID": 23, 
        "quote": "Originally posted by dmuhler: Mods Can we shut this stupid **** down please?", 
        "reply": " OR better yet, you don't like it, DON'T POST HERE!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:59:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals. you may not have mentioned any names, but I hope you are smart enough to realize that your intent was abundantly clear. If you are not smart enough to realize it - oh well. And, i believe it is the state congress that would write up such a law, not the governor. As far as a bible believing nation and moses law regarding beastiality - I would guess that most states just believed us to be beyond this type of behaviour.", 
        "intTime": 20090323, 
        "postID": 24, 
        "quote": "Originally posted by reducetension: quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "reply": " you may not have mentioned any names, but I hope you are smart enough to realize that your intent was abundantly clear. If you are not smart enough to realize it - oh well. And, i believe it is the state congress that would write up such a law, not the governor. As far as a bible believing nation and moses law regarding beastiality - I would guess that most states just believed us to be beyond this type of behaviour.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:07:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "intTime": 20090323, 
        "postID": 25, 
        "quote": "Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE!", 
        "reply": " Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:09:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This was on the local news last night. It is sick and disgusting, IMO and we don't have any laws here for it. In case some of you aren't aware, some real sicko's are hiding out in the bush and some of them are guilty of this and much worse. I have had the unfortunate experience of knowing someone who is guilty of this sadistic action and is proud of it. I am all for this becoming outlawed. It's about damn time.", 
        "intTime": 20090323, 
        "postID": 26, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior.", 
        "reply": " This was on the local news last night. It is sick and disgusting, IMO and we don't have any laws here for it. In case some of you aren't aware, some real sicko's are hiding out in the bush and some of them are guilty of this and much worse. I have had the unfortunate experience of knowing someone who is guilty of this sadistic action and is proud of it. I am all for this becoming outlawed. It's about damn time.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:17:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens Hey, Don't knock 'til ya tries it !!", 
        "intTime": 20090323, 
        "postID": 27, 
        "quote": "Originally posted by transport1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "reply": " Hey, Don't knock 'til ya tries it !!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:34:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "navy8086"
    }, 
    {
        "content": "Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach ['''URL=http://www.foxnews.com/story/0,2933,510015,00.html JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:12 AM", 
        "intTime": 20090321, 
        "postID": 28, 
        "quote": "", 
        "reply": "Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach ['''URL=http://www.foxnews.com/story/0,2933,510015,00.html JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:12 AM", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 15:43:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "I can hear Pelosi now, \"The raids must stop!, The raids must stop!!\"", 
        "intTime": 20090321, 
        "postID": 29, 
        "quote": "", 
        "reply": "I can hear Pelosi now, \"The raids must stop!, The raids must stop!!\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 15:59:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "there was a place here in Washington state that was busted a couple years ago for having a club of members who, if they wanted to do an animal it was cool or if they wanted an amimal to do them it was cool...all while everyone watched - how they were busted? Some dude was done by a horse and messed him up good and had to be hospitalised. There are some sick persons out there..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 30, 
        "quote": "", 
        "reply": "there was a place here in Washington state that was busted a couple years ago for having a club of members who, if they wanted to do an animal it was cool or if they wanted an amimal to do them it was cool...all while everyone watched - how they were busted? Some dude was done by a horse and messed him up good and had to be hospitalised. There are some sick persons out there..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 17:00:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Larry Craig....Jimmy Swagger....need we go on? lol...\"TAP TAP TAP\"", 
        "intTime": 20090321, 
        "postID": 31, 
        "quote": "", 
        "reply": "Larry Craig....Jimmy Swagger....need we go on? lol...\"TAP TAP TAP\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 17:10:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "But shouldn't a \"free society\" tolerate everything?? Translate that \"Freak Society\" Wandering and Wondering", 
        "intTime": 20090321, 
        "postID": 32, 
        "quote": "", 
        "reply": "But shouldn't a \"free society\" tolerate everything?? Translate that \"Freak Society\" Wandering and Wondering", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:04:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The folks at PETA are against the use of animals for entertainment, so I suppose they are against \"dating\" as well: \"http://www.peta.org/actioncenter/features-entertainment.asp\"", 
        "intTime": 20090321, 
        "postID": 33, 
        "quote": "", 
        "reply": "The folks at PETA are against the use of animals for entertainment, so I suppose they are against \"dating\" as well: \"http://www.peta.org/actioncenter/features-entertainment.asp\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:04:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:13 AM", 
        "intTime": 20090321, 
        "postID": 34, 
        "quote": "Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a", 
        "reply": " Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:13 AM", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:07:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Will beastiality be the new become the new liberal cause? Why, do you need legal help with that issue?", 
        "intTime": 20090321, 
        "postID": 35, 
        "quote": "Will beastiality be the new become the new liberal cause?", 
        "reply": " Why, do you need legal help with that issue?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:51:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "thorin001"
    }, 
    {
        "content": "\"Will beastiality be the new become the new liberal cause?\" No, at a guess. Considering that liberals are generally big on ethical treatment of animals (PETA being an extreme case), it is hard to imagine bestiality showing up on any credible agenda. Homosexuality is an issue of freedom between two (or more) consenting adults. Animals cannot consent - hence the need for the rope and duct tape in the article. Agreed, though - this is an insulting thread, just like a thread implying conservatives would start pushing laws making women the property of their husbands.", 
        "intTime": 20090322, 
        "postID": 36, 
        "quote": "", 
        "reply": "\"Will beastiality be the new become the new liberal cause?\" No, at a guess. Considering that liberals are generally big on ethical treatment of animals (PETA being an extreme case), it is hard to imagine bestiality showing up on any credible agenda. Homosexuality is an issue of freedom between two (or more) consenting adults. Animals cannot consent - hence the need for the rope and duct tape in the article. Agreed, though - this is an insulting thread, just like a thread implying conservatives would start pushing laws making women the property of their husbands.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 06:00:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090322, 
        "postID": 37, 
        "quote": "", 
        "reply": "Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 06:54:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... It is not nice to talk bad about men of the cloth and republican congress critters. uh oh ... Disruptive posting! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090322, 
        "postID": 38, 
        "quote": "Originally posted by dmuhler: quote: With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... It is not nice to talk bad about men of the cloth and republican congress critters.", 
        "reply": " uh oh ... Disruptive posting! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 07:52:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "intTime": 20090322, 
        "postID": 39, 
        "quote": "", 
        "reply": "wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 09:23:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! No it was not a good question, it was a logical fallacy which has been discredited a number of times. And it is not anywhere near to being \"close to the future\" I further fail to see how the current time is any less \"moral\". Perhaps you could point me to a decade or an era when people upheld values and morals to a greater extent than we do today... Where do you get this idiotic idea about \"end times\"? Personally I can think of a number of events throughout the last century alone which were more troubling than homosexual marriage. Didn't anyone read the story of the Austrian man who repeatedly raped his daughter and kept her imprisoned for decades? By your logic, that could be \"the next cause...\" Stupid.", 
        "intTime": 20090322, 
        "postID": 40, 
        "quote": "Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto!", 
        "reply": " No it was not a good question, it was a logical fallacy which has been discredited a number of times. And it is not anywhere near to being \"close to the future\" I further fail to see how the current time is any less \"moral\". Perhaps you could point me to a decade or an era when people upheld values and morals to a greater extent than we do today... Where do you get this idiotic idea about \"end times\"? Personally I can think of a number of events throughout the last century alone which were more troubling than homosexual marriage. Didn't anyone read the story of the Austrian man who repeatedly raped his daughter and kept her imprisoned for decades? By your logic, that could be \"the next cause...\" Stupid.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 09:35:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! Since you seem to want to live in the good old days, why are you out of the kitchen?", 
        "intTime": 20090322, 
        "postID": 41, 
        "quote": "Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto!", 
        "reply": " Since you seem to want to live in the good old days, why are you out of the kitchen?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 11:15:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "thorin001"
    }, 
    {
        "content": "What, Alaska doesn't have any animal cruelty statutes? How bizarre.", 
        "intTime": 20090322, 
        "postID": 42, 
        "quote": "", 
        "reply": "What, Alaska doesn't have any animal cruelty statutes? How bizarre.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 20:18:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by Elesso: wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world... I'm glad I'm not the only one that has come to that conclusion.", 
        "intTime": 20090322, 
        "postID": 43, 
        "quote": "Originally posted by Elesso: wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "reply": " I'm glad I'm not the only one that has come to that conclusion.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 21:56:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "teamrope"
    }, 
    {
        "content": "Sick!", 
        "intTime": 20090322, 
        "postID": 44, 
        "quote": "", 
        "reply": "Sick!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 22:19:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "intTime": 20090323, 
        "postID": 45, 
        "quote": "", 
        "reply": "Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 00:27:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "intTime": 20090323, 
        "postID": 46, 
        "quote": "Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "reply": " What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 02:38:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "intTime": 20090323, 
        "postID": 47, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "reply": " Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 10:12:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by adminnco1: [QUOTE]Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.[/QUOT Because a elephant wouldn't notice it, but a jackass would...", 
        "intTime": 20090323, 
        "postID": 48, 
        "quote": "Originally posted by reducetension: quote: Originally posted by adminnco1: [QUOTE]Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "reply": " Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.[/QUOT Because a elephant wouldn't notice it, but a jackass would...", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:06:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: But shouldn't a \"free society\" tolerate everything?? [IMG]\"http://i614.photobucket.com/albums/tt226/americadoc/strange.jpg\"[/IMG] Translate that \"Freak Society\" Between consenting ADULTs with the capacity to give informed consent there should be MINIMAL interference by the government.", 
        "intTime": 20090323, 
        "postID": 49, 
        "quote": "Originally posted by greywolfghost: But shouldn't a \"free society\" tolerate everything?? [IMG]\"http://i614.photobucket.com/albums/tt226/americadoc/strange.jpg\"[/IMG] Translate that \"Freak Society\"", 
        "reply": " Between consenting ADULTs with the capacity to give informed consent there should be MINIMAL interference by the government.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:34:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE!", 
        "intTime": 20090323, 
        "postID": 50, 
        "quote": "Originally posted by dmuhler: Mods Can we shut this stupid **** down please?", 
        "reply": " OR better yet, you don't like it, DON'T POST HERE!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:59:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals. you may not have mentioned any names, but I hope you are smart enough to realize that your intent was abundantly clear. If you are not smart enough to realize it - oh well. And, i believe it is the state congress that would write up such a law, not the governor. As far as a bible believing nation and moses law regarding beastiality - I would guess that most states just believed us to be beyond this type of behaviour.", 
        "intTime": 20090323, 
        "postID": 51, 
        "quote": "Originally posted by reducetension: quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "reply": " you may not have mentioned any names, but I hope you are smart enough to realize that your intent was abundantly clear. If you are not smart enough to realize it - oh well. And, i believe it is the state congress that would write up such a law, not the governor. As far as a bible believing nation and moses law regarding beastiality - I would guess that most states just believed us to be beyond this type of behaviour.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:07:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "intTime": 20090323, 
        "postID": 52, 
        "quote": "Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE!", 
        "reply": " Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:09:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This was on the local news last night. It is sick and disgusting, IMO and we don't have any laws here for it. In case some of you aren't aware, some real sicko's are hiding out in the bush and some of them are guilty of this and much worse. I have had the unfortunate experience of knowing someone who is guilty of this sadistic action and is proud of it. I am all for this becoming outlawed. It's about damn time.", 
        "intTime": 20090323, 
        "postID": 53, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior.", 
        "reply": " This was on the local news last night. It is sick and disgusting, IMO and we don't have any laws here for it. In case some of you aren't aware, some real sicko's are hiding out in the bush and some of them are guilty of this and much worse. I have had the unfortunate experience of knowing someone who is guilty of this sadistic action and is proud of it. I am all for this becoming outlawed. It's about damn time.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:17:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens Hey, Don't knock 'til ya tries it !!", 
        "intTime": 20090323, 
        "postID": 54, 
        "quote": "Originally posted by transport1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "reply": " Hey, Don't knock 'til ya tries it !!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:34:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "navy8086"
    }, 
    {
        "content": "Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach ['''URL=http://www.foxnews.com/story/0,2933,510015,00.html JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:12 AM", 
        "intTime": 20090321, 
        "postID": 55, 
        "quote": "", 
        "reply": "Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach ['''URL=http://www.foxnews.com/story/0,2933,510015,00.html JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:12 AM", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 15:43:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "jessmo24"
    }, 
    {
        "content": "I can hear Pelosi now, \"The raids must stop!, The raids must stop!!\"", 
        "intTime": 20090321, 
        "postID": 56, 
        "quote": "", 
        "reply": "I can hear Pelosi now, \"The raids must stop!, The raids must stop!!\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 15:59:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "there was a place here in Washington state that was busted a couple years ago for having a club of members who, if they wanted to do an animal it was cool or if they wanted an amimal to do them it was cool...all while everyone watched - how they were busted? Some dude was done by a horse and messed him up good and had to be hospitalised. There are some sick persons out there..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 57, 
        "quote": "", 
        "reply": "there was a place here in Washington state that was busted a couple years ago for having a club of members who, if they wanted to do an animal it was cool or if they wanted an amimal to do them it was cool...all while everyone watched - how they were busted? Some dude was done by a horse and messed him up good and had to be hospitalised. There are some sick persons out there..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 17:00:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Larry Craig....Jimmy Swagger....need we go on? lol...\"TAP TAP TAP\"", 
        "intTime": 20090321, 
        "postID": 58, 
        "quote": "", 
        "reply": "Larry Craig....Jimmy Swagger....need we go on? lol...\"TAP TAP TAP\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 17:10:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "But shouldn't a \"free society\" tolerate everything?? Translate that \"Freak Society\" Wandering and Wondering", 
        "intTime": 20090321, 
        "postID": 59, 
        "quote": "", 
        "reply": "But shouldn't a \"free society\" tolerate everything?? Translate that \"Freak Society\" Wandering and Wondering", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:04:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The folks at PETA are against the use of animals for entertainment, so I suppose they are against \"dating\" as well: \"http://www.peta.org/actioncenter/features-entertainment.asp\"", 
        "intTime": 20090321, 
        "postID": 60, 
        "quote": "", 
        "reply": "The folks at PETA are against the use of animals for entertainment, so I suppose they are against \"dating\" as well: \"http://www.peta.org/actioncenter/features-entertainment.asp\"", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:04:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:13 AM", 
        "intTime": 20090321, 
        "postID": 61, 
        "quote": "Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a", 
        "reply": " Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This message has been edited. Last edited by: mainedawg, Sun 22 March 2009 07:13 AM", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:07:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Will beastiality be the new become the new liberal cause? Why, do you need legal help with that issue?", 
        "intTime": 20090321, 
        "postID": 62, 
        "quote": "Will beastiality be the new become the new liberal cause?", 
        "reply": " Why, do you need legal help with that issue?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-21 18:51:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "thorin001"
    }, 
    {
        "content": "\"Will beastiality be the new become the new liberal cause?\" No, at a guess. Considering that liberals are generally big on ethical treatment of animals (PETA being an extreme case), it is hard to imagine bestiality showing up on any credible agenda. Homosexuality is an issue of freedom between two (or more) consenting adults. Animals cannot consent - hence the need for the rope and duct tape in the article. Agreed, though - this is an insulting thread, just like a thread implying conservatives would start pushing laws making women the property of their husbands.", 
        "intTime": 20090322, 
        "postID": 63, 
        "quote": "", 
        "reply": "\"Will beastiality be the new become the new liberal cause?\" No, at a guess. Considering that liberals are generally big on ethical treatment of animals (PETA being an extreme case), it is hard to imagine bestiality showing up on any credible agenda. Homosexuality is an issue of freedom between two (or more) consenting adults. Animals cannot consent - hence the need for the rope and duct tape in the article. Agreed, though - this is an insulting thread, just like a thread implying conservatives would start pushing laws making women the property of their husbands.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 06:00:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090322, 
        "postID": 64, 
        "quote": "", 
        "reply": "Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 06:54:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... It is not nice to talk bad about men of the cloth and republican congress critters. uh oh ... Disruptive posting! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090322, 
        "postID": 65, 
        "quote": "Originally posted by dmuhler: quote: With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... It is not nice to talk bad about men of the cloth and republican congress critters.", 
        "reply": " uh oh ... Disruptive posting! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 07:52:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "intTime": 20090322, 
        "postID": 66, 
        "quote": "", 
        "reply": "wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 09:23:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! No it was not a good question, it was a logical fallacy which has been discredited a number of times. And it is not anywhere near to being \"close to the future\" I further fail to see how the current time is any less \"moral\". Perhaps you could point me to a decade or an era when people upheld values and morals to a greater extent than we do today... Where do you get this idiotic idea about \"end times\"? Personally I can think of a number of events throughout the last century alone which were more troubling than homosexual marriage. Didn't anyone read the story of the Austrian man who repeatedly raped his daughter and kept her imprisoned for decades? By your logic, that could be \"the next cause...\" Stupid.", 
        "intTime": 20090322, 
        "postID": 67, 
        "quote": "Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto!", 
        "reply": " No it was not a good question, it was a logical fallacy which has been discredited a number of times. And it is not anywhere near to being \"close to the future\" I further fail to see how the current time is any less \"moral\". Perhaps you could point me to a decade or an era when people upheld values and morals to a greater extent than we do today... Where do you get this idiotic idea about \"end times\"? Personally I can think of a number of events throughout the last century alone which were more troubling than homosexual marriage. Didn't anyone read the story of the Austrian man who repeatedly raped his daughter and kept her imprisoned for decades? By your logic, that could be \"the next cause...\" Stupid.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 09:35:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto! Since you seem to want to live in the good old days, why are you out of the kitchen?", 
        "intTime": 20090322, 
        "postID": 68, 
        "quote": "Originally posted by PinkBlossoms: Good question and probably not so far off in the future. We're living in very troublesome times where morals and values have taken a back seat to \"anything goes\" freak shows. With the pedophiles following in the footsteps of the homosexuals/NAMBLA --- and the ACLU coming to their aid, nothing surprises me. One abomination after the other ... This is simply another sign that we're living in the end times. Get your lives and hearts in order. Pronto!", 
        "reply": " Since you seem to want to live in the good old days, why are you out of the kitchen?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 11:15:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "thorin001"
    }, 
    {
        "content": "What, Alaska doesn't have any animal cruelty statutes? How bizarre.", 
        "intTime": 20090322, 
        "postID": 69, 
        "quote": "", 
        "reply": "What, Alaska doesn't have any animal cruelty statutes? How bizarre.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 20:18:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by Elesso: wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world... I'm glad I'm not the only one that has come to that conclusion.", 
        "intTime": 20090322, 
        "postID": 70, 
        "quote": "Originally posted by Elesso: wow... that man showed more signs of being a sociopath, and a disassociative disorder... there, is a serial Killer in the making. he is a hunter... he finds a victim and relishes it.. his victime could be a boy a girl, an animal, or even grown or mature humans... it is not the victim he craves, but the release... and anything will do. this man meeds some SERIOUS time in a mental ward.. all seriousness of this act and his priors show a VERY disturbing pattern, and if the Police release him on Bail, watch out world...", 
        "reply": " I'm glad I'm not the only one that has come to that conclusion.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 21:56:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "teamrope"
    }, 
    {
        "content": "Sick!", 
        "intTime": 20090322, 
        "postID": 71, 
        "quote": "", 
        "reply": "Sick!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-22 22:19:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "intTime": 20090323, 
        "postID": 72, 
        "quote": "", 
        "reply": "Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 00:27:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "intTime": 20090323, 
        "postID": 73, 
        "quote": "Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow?", 
        "reply": " What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 02:38:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "intTime": 20090323, 
        "postID": 74, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "reply": " Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 10:12:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by adminnco1: [QUOTE]Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.[/QUOT Because a elephant wouldn't notice it, but a jackass would...", 
        "intTime": 20090323, 
        "postID": 75, 
        "quote": "Originally posted by reducetension: quote: Originally posted by adminnco1: [QUOTE]Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor.", 
        "reply": " Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.[/QUOT Because a elephant wouldn't notice it, but a jackass would...", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:06:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: But shouldn't a \"free society\" tolerate everything?? [IMG]\"http://i614.photobucket.com/albums/tt226/americadoc/strange.jpg\"[/IMG] Translate that \"Freak Society\" Between consenting ADULTs with the capacity to give informed consent there should be MINIMAL interference by the government.", 
        "intTime": 20090323, 
        "postID": 76, 
        "quote": "Originally posted by greywolfghost: But shouldn't a \"free society\" tolerate everything?? [IMG]\"http://i614.photobucket.com/albums/tt226/americadoc/strange.jpg\"[/IMG] Translate that \"Freak Society\"", 
        "reply": " Between consenting ADULTs with the capacity to give informed consent there should be MINIMAL interference by the government.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:34:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE!", 
        "intTime": 20090323, 
        "postID": 77, 
        "quote": "Originally posted by dmuhler: Mods Can we shut this stupid **** down please?", 
        "reply": " OR better yet, you don't like it, DON'T POST HERE!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 11:59:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals. you may not have mentioned any names, but I hope you are smart enough to realize that your intent was abundantly clear. If you are not smart enough to realize it - oh well. And, i believe it is the state congress that would write up such a law, not the governor. As far as a bible believing nation and moses law regarding beastiality - I would guess that most states just believed us to be beyond this type of behaviour.", 
        "intTime": 20090323, 
        "postID": 78, 
        "quote": "Originally posted by reducetension: quote: Originally posted by adminnco1: quote: Originally posted by reducetension: Bestiality isn't anything new. Even the Old Testament law maker Moses has to get his flock to back off from the grazing herd. It is odd, however, that there are no laws against it in many states, even Alaska. What's that governor doing up there, anyhow? What exactly does the lack of a statute have to do with the governor? Was Angus King equally liable when a similar situation involving 'puppy love' developed in Maine? Is Charlie Crist liable because folks in the panhandle took the term 'goat roper' to a logical extreme? It would be really refreshing to have one discussion that does not turn into a referendum on the merits of a particular governor. Did I mentioned names? I'm sure no one governing that state since it was purchased gave much thought to 'animal rape' until now. I was wondering what has happen in state law since then. Who cares what gov. it is? Our own state had no such law until someone got killed sockin' it to a horse a year or so ago. But the law came right on its heels. So, whoever has done what to criminalize such an act in AK? It is interesting to me that a nation that claims a bible as a foundation still has many states that have not taken into consideration the laws of Moses concerning intercourse with animals.", 
        "reply": " you may not have mentioned any names, but I hope you are smart enough to realize that your intent was abundantly clear. If you are not smart enough to realize it - oh well. And, i believe it is the state congress that would write up such a law, not the governor. As far as a bible believing nation and moses law regarding beastiality - I would guess that most states just believed us to be beyond this type of behaviour.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:07:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "intTime": 20090323, 
        "postID": 79, 
        "quote": "Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE!", 
        "reply": " Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:09:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior. This was on the local news last night. It is sick and disgusting, IMO and we don't have any laws here for it. In case some of you aren't aware, some real sicko's are hiding out in the bush and some of them are guilty of this and much worse. I have had the unfortunate experience of knowing someone who is guilty of this sadistic action and is proud of it. I am all for this becoming outlawed. It's about damn time.", 
        "intTime": 20090323, 
        "postID": 80, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by jessmo24: Im just curious? I wonder how long it will be before someone comes out and makes the point that if the animal is in heat that thats means the creature is giving consent? Im sure some nutt job lawyer will come out for the cause, and soon well have people coming out of the ...ehh closet ehh... shed...ehh barn, saying they sleep with animals. warnign the link below and the article will tuen your stomach JUNEAU, Alaska — It's a subject that can cause nervous snickering, a little uneasiness and even a few bad jokes. But many in the southeast Alaska community of Klawock, population 800, weren't laughing last April after a 26-year-old registered sex offender was accused of molesting a local family's pet dog. The man was spotted by a local woman coaxing the Labrador retriever into the woods near a ball field. There he allegedly tied it to a tree, taped its muzzle shut with duct tape and had sex with it, witnesses told police at the time. The man had been twice convicted of raping a young boy and more recently had served probation for assault after lunging at a child. While the incident with the dog was reported to the police, Klawock Mayor Don Marvin said nothing happened for two days while fearful parents escorted their children home from school. \"When this incident happened, we had a community that was scared,\" Marvin said. Because Alaska has no law against such an attack, Ketchikan District Attorney James Scott eventually charged the man with two counts of criminal mischief, which was later changed to a Just to be fair, the same news story discussed similar problems (goat rape) in the FL panhandle. As in Alaska, as well as other states, there are no laws prohibiting such behavior.", 
        "reply": " This was on the local news last night. It is sick and disgusting, IMO and we don't have any laws here for it. In case some of you aren't aware, some real sicko's are hiding out in the bush and some of them are guilty of this and much worse. I have had the unfortunate experience of knowing someone who is guilty of this sadistic action and is proud of it. I am all for this becoming outlawed. It's about damn time.", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:17:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by transport1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens Hey, Don't knock 'til ya tries it !!", 
        "intTime": 20090323, 
        "postID": 81, 
        "quote": "Originally posted by transport1: quote: Originally posted by navy8086: quote: Originally posted by dmuhler: Mods Can we shut this stupid **** down please? OR better yet, you don't like it, DON'T POST HERE! Either that, or don't read it. Hear tell that navy enjoys his velcro muttons mittens", 
        "reply": " Hey, Don't knock 'til ya tries it !!", 
        "threadID": "409192893_6510035812001", 
        "time": "2009-03-23 12:34:00", 
        "title": "Will beastiality be the new become the new liberal cause?", 
        "userID": "navy8086"
    }
]