[
    {
        "content": "I would also like to speculate that the average citizen was used as a lab rat. I'm a \"down winder\", thats someone that lives down wind from the Nevada Test Site. There is a higher incidence of cancer among us.", 
        "intTime": 20090301, 
        "postID": 17, 
        "quote": "", 
        "reply": "I would also like to speculate that the average citizen was used as a lab rat. I'm a \"down winder\", thats someone that lives down wind from the Nevada Test Site. There is a higher incidence of cancer among us.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-01 08:12:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by outlaws93: you do know the intent purpose was to drop an atomic bomb on a city before inf were to move into said city.... good thing we had these tests they were needed we were able to find out the extent of radiation and it saved millions of lives... and kit this is how we were able to find out the hazards of radiation and the bomb... If you think it's such a great idea to use human guinea pigs, why don't you volunteer for the next test? Hell, they could use you right now to test new HIV drugs! well you know kit my dad was right there in the 50s.... he seen not only the ones over japan.. but also a few out in the desert.... in fact there he was having some protrate problems that i though was assorted with his exposures to the bombs....his whole attitude was pretty much the same as mine above.,...hell my dad was apart of the first people to go into Nagasaki like a week after the bomb was dropped... back when they though they could drop these bombs and walk right on in right after....", 
        "intTime": 20090301, 
        "postID": 18, 
        "quote": "Originally posted by stillkit: quote: Originally posted by outlaws93: you do know the intent purpose was to drop an atomic bomb on a city before inf were to move into said city.... good thing we had these tests they were needed we were able to find out the extent of radiation and it saved millions of lives... and kit this is how we were able to find out the hazards of radiation and the bomb... If you think it's such a great idea to use human guinea pigs, why don't you volunteer for the next test? Hell, they could use you right now to test new HIV drugs!", 
        "reply": " well you know kit my dad was right there in the 50s.... he seen not only the ones over japan.. but also a few out in the desert.... in fact there he was having some protrate problems that i though was assorted with his exposures to the bombs....his whole attitude was pretty much the same as mine above.,...hell my dad was apart of the first people to go into Nagasaki like a week after the bomb was dropped... back when they though they could drop these bombs and walk right on in right after....", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-01 08:32:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I do understand the resentment, bitterness and anger over things that happened nearly 60 years ago and are still causing harm to those involved. There should be restitution and extended care for those who were part of these tests - willingly or not. IMHO. HOWEVER ... the undercurrent of the discussion here seems to be that this sort of thing is still going on - as with stillkit's reference to being a volunteer for new HIV drugs, or words to that effect. Comparing approaches that are over a half-century old to today's methods of study are inaccurate, unfair and just plain nonsense. Since the late '50s/early '60s, the US - including the military - has been a signatory party to international laws regarding the use of human subjects in medical and other experiments. It's a highly regulated area that now places protocols for experiments under a huge microscope before, during and after studies are conducted. That said, NO medication, device or vaccine is 100% safe or 100% effective. But without those willing to be part of such studies, we would not have insulin, vaccines for polio, diphtheria, hepatitis, anthrax, drugs for treating hypertension, high cholesterol, angina, arthritis, and so on. You get my point, I'm sure.", 
        "intTime": 20090301, 
        "postID": 19, 
        "quote": "", 
        "reply": "I do understand the resentment, bitterness and anger over things that happened nearly 60 years ago and are still causing harm to those involved. There should be restitution and extended care for those who were part of these tests - willingly or not. IMHO. HOWEVER ... the undercurrent of the discussion here seems to be that this sort of thing is still going on - as with stillkit's reference to being a volunteer for new HIV drugs, or words to that effect. Comparing approaches that are over a half-century old to today's methods of study are inaccurate, unfair and just plain nonsense. Since the late '50s/early '60s, the US - including the military - has been a signatory party to international laws regarding the use of human subjects in medical and other experiments. It's a highly regulated area that now places protocols for experiments under a huge microscope before, during and after studies are conducted. That said, NO medication, device or vaccine is 100% safe or 100% effective. But without those willing to be part of such studies, we would not have insulin, vaccines for polio, diphtheria, hepatitis, anthrax, drugs for treating hypertension, high cholesterol, angina, arthritis, and so on. You get my point, I'm sure.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-01 11:29:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: I do understand the resentment, bitterness and anger over things that happened nearly 60 years ago and are still causing harm to those involved. There should be restitution and extended care for those who were part of these tests - willingly or not. IMHO. HOWEVER ... the undercurrent of the discussion here seems to be that this sort of thing is still going on - as with stillkit's reference to being a volunteer for new HIV drugs, or words to that effect. Comparing approaches that are over a half-century old to today's methods of study are inaccurate, unfair and just plain nonsense. Since the late '50s/early '60s, the US - including the military - has been a signatory party to international laws regarding the use of human subjects in medical and other experiments. It's a highly regulated area that now places protocols for experiments under a huge microscope before, during and after studies are conducted. That said, NO medication, device or vaccine is 100% safe or 100% effective. But without those willing to be part of such studies, we would not have insulin, vaccines for polio, diphtheria, hepatitis, anthrax, drugs for treating hypertension, high cholesterol, angina, arthritis, and so on. You get my point, I'm sure. Thats true and the key word being volunteers. I dont think there would ever be a shortage of volunteers In areas of medical research or pilot programs. In fact there would be and is a surplus of screened volunteers in pilot programs. People who have everything to gain and nothing to lose once all hope is gone. In other areas there are always prisoners who would be willing participants for early releases Rather than extended sentences. As ive said I I myself being young and foolish would have Volunteered if given a choice, I knew some in my squadron that extended thier service time to be a part of this historical event. Its not so much bitterness as it is disappointment and lost confidence in my governments penciled necked geeks who considered us expendable and has till this day not acknowledged or provided proper care for the remaining few or the families of the affected. It has made me a skeptic that disects every thing thats put forth by government. When I see old declassified top secret documents like the northwoods document greated in the sixties where they mention acceptable american civilian casualties it makes my blood boil and have serious doubts about 9/11.", 
        "intTime": 20090301, 
        "postID": 20, 
        "quote": "Originally posted by Cider33_Alpha: I do understand the resentment, bitterness and anger over things that happened nearly 60 years ago and are still causing harm to those involved. There should be restitution and extended care for those who were part of these tests - willingly or not. IMHO. HOWEVER ... the undercurrent of the discussion here seems to be that this sort of thing is still going on - as with stillkit's reference to being a volunteer for new HIV drugs, or words to that effect. Comparing approaches that are over a half-century old to today's methods of study are inaccurate, unfair and just plain nonsense. Since the late '50s/early '60s, the US - including the military - has been a signatory party to international laws regarding the use of human subjects in medical and other experiments. It's a highly regulated area that now places protocols for experiments under a huge microscope before, during and after studies are conducted. That said, NO medication, device or vaccine is 100% safe or 100% effective. But without those willing to be part of such studies, we would not have insulin, vaccines for polio, diphtheria, hepatitis, anthrax, drugs for treating hypertension, high cholesterol, angina, arthritis, and so on. You get my point, I'm sure.", 
        "reply": " Thats true and the key word being volunteers. I dont think there would ever be a shortage of volunteers In areas of medical research or pilot programs. In fact there would be and is a surplus of screened volunteers in pilot programs. People who have everything to gain and nothing to lose once all hope is gone. In other areas there are always prisoners who would be willing participants for early releases Rather than extended sentences. As ive said I I myself being young and foolish would have Volunteered if given a choice, I knew some in my squadron that extended thier service time to be a part of this historical event. Its not so much bitterness as it is disappointment and lost confidence in my governments penciled necked geeks who considered us expendable and has till this day not acknowledged or provided proper care for the remaining few or the families of the affected. It has made me a skeptic that disects every thing thats put forth by government. When I see old declassified top secret documents like the northwoods document greated in the sixties where they mention acceptable american civilian casualties it makes my blood boil and have serious doubts about 9/11.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-01 12:39:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by DaveBarker: quote: Originally posted by stillkit: I have a personal friend who was involved in 7 atomic tests. At one shot, he and the rest of his battalion were in fox holes a mere quarter mile from ground zero. Don't tell me their \"leaders\" didn't know the hazards of THAT. Good point stillkit. I have represented hundreds of those used in the tests. With some terrible miserable physical conditions including hearing loss, nervous disorders and cancers! The VA is quick to disassociate the resulting conditions when possible. Usually when we go before a Veterans Law judge we can get someone to listen to reality. Often as not before the day they are allowed to see the judge their plight is ignored. After what was observed in the drop of the two A-bombs ending WWII, it is beyond my logic why young 17 to 20 year olds were exposed the experiments. Surprisingly, my friend, whom I just saw Thursday, hasn't had any major health issues that I know of. He's now in his late 70's and is still just truckin' along. I wonder why it affected some and not others? No simple answer as I have no idea how close your friend was to the blast, or how he was protected. Test subject protection varied from one test to another. One of my current clients was an eghteen year old sailor. He was told to lie flat on his stomach on the deck at the fo'c'sle of the ship and cover his head with his arms. They were close enough to the blast it affected their hearing for a period of time. His appeal was for hearing loss, scars from the burns he suffered. After the test they were washed down as was the ship with the damage control hoses on the main deck. Using a little thinking, what good did washing down with the water taken out to the same ocean exposed to the blast? It was procedure from the book, so they did it. Some were more affected than others for possible physical reasons, as well as exposure varied. In other words, after all the cases I have worked, I do not know the answer to your question. Wish I did. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090301, 
        "postID": 21, 
        "quote": "Originally posted by stillkit: quote: Originally posted by DaveBarker: quote: Originally posted by stillkit: I have a personal friend who was involved in 7 atomic tests. At one shot, he and the rest of his battalion were in fox holes a mere quarter mile from ground zero. Don't tell me their \"leaders\" didn't know the hazards of THAT. Good point stillkit. I have represented hundreds of those used in the tests. With some terrible miserable physical conditions including hearing loss, nervous disorders and cancers! The VA is quick to disassociate the resulting conditions when possible. Usually when we go before a Veterans Law judge we can get someone to listen to reality. Often as not before the day they are allowed to see the judge their plight is ignored. After what was observed in the drop of the two A-bombs ending WWII, it is beyond my logic why young 17 to 20 year olds were exposed the experiments. Surprisingly, my friend, whom I just saw Thursday, hasn't had any major health issues that I know of. He's now in his late 70's and is still just truckin' along. I wonder why it affected some and not others?", 
        "reply": " No simple answer as I have no idea how close your friend was to the blast, or how he was protected. Test subject protection varied from one test to another. One of my current clients was an eghteen year old sailor. He was told to lie flat on his stomach on the deck at the fo'c'sle of the ship and cover his head with his arms. They were close enough to the blast it affected their hearing for a period of time. His appeal was for hearing loss, scars from the burns he suffered. After the test they were washed down as was the ship with the damage control hoses on the main deck. Using a little thinking, what good did washing down with the water taken out to the same ocean exposed to the blast? It was procedure from the book, so they did it. Some were more affected than others for possible physical reasons, as well as exposure varied. In other words, after all the cases I have worked, I do not know the answer to your question. Wish I did. I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-01 13:39:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "quote: Originally posted by DaveBarker: quote: Originally posted by stillkit: quote: Originally posted by DaveBarker: quote: Originally posted by stillkit: I have a personal friend who was involved in 7 atomic tests. At one shot, he and the rest of his battalion were in fox holes a mere quarter mile from ground zero. Don't tell me their \"leaders\" didn't know the hazards of THAT. Good point stillkit. I have represented hundreds of those used in the tests. With some terrible miserable physical conditions including hearing loss, nervous disorders and cancers! The VA is quick to disassociate the resulting conditions when possible. Usually when we go before a Veterans Law judge we can get someone to listen to reality. Often as not before the day they are allowed to see the judge their plight is ignored. After what was observed in the drop of the two A-bombs ending WWII, it is beyond my logic why young 17 to 20 year olds were exposed the experiments. Surprisingly, my friend, whom I just saw Thursday, hasn't had any major health issues that I know of. He's now in his late 70's and is still just truckin' along. I wonder why it affected some and not others? No simple answer as I have no idea how close your friend was to the blast, or how he was protected. Test subject protection varied from one test to another. One of my current clients was an eghteen year old sailor. He was told to lie flat on his stomach on the deck at the fo'c'sle of the ship and cover his head with his arms. They were close enough to the blast it affected their hearing for a period of time. His appeal was for hearing loss, scars from the burns he suffered. After the test they were washed down as was the ship with the damage control hoses on the main deck. Using a little thinking, what good did washing down with the water taken out to the same ocean exposed to the blast? It was procedure from the book, so they did it. Some were more affected than others for possible physical reasons, as well as exposure varied. In other words, after all the cases I have worked, I do not know the answer to your question. Wish I did. Could be the same reason why some people heavy smokers thier whole lives and never suffer more than a cough or shortness of breath. While others just Breath some second hand smoke and develop Lung cancer. The answer probably lies in cell regeneration and repair.", 
        "intTime": 20090301, 
        "postID": 22, 
        "quote": "Originally posted by DaveBarker: quote: Originally posted by stillkit: quote: Originally posted by DaveBarker: quote: Originally posted by stillkit: I have a personal friend who was involved in 7 atomic tests. At one shot, he and the rest of his battalion were in fox holes a mere quarter mile from ground zero. Don't tell me their \"leaders\" didn't know the hazards of THAT. Good point stillkit. I have represented hundreds of those used in the tests. With some terrible miserable physical conditions including hearing loss, nervous disorders and cancers! The VA is quick to disassociate the resulting conditions when possible. Usually when we go before a Veterans Law judge we can get someone to listen to reality. Often as not before the day they are allowed to see the judge their plight is ignored. After what was observed in the drop of the two A-bombs ending WWII, it is beyond my logic why young 17 to 20 year olds were exposed the experiments. Surprisingly, my friend, whom I just saw Thursday, hasn't had any major health issues that I know of. He's now in his late 70's and is still just truckin' along. I wonder why it affected some and not others? No simple answer as I have no idea how close your friend was to the blast, or how he was protected. Test subject protection varied from one test to another. One of my current clients was an eghteen year old sailor. He was told to lie flat on his stomach on the deck at the fo'c'sle of the ship and cover his head with his arms. They were close enough to the blast it affected their hearing for a period of time. His appeal was for hearing loss, scars from the burns he suffered. After the test they were washed down as was the ship with the damage control hoses on the main deck. Using a little thinking, what good did washing down with the water taken out to the same ocean exposed to the blast? It was procedure from the book, so they did it. Some were more affected than others for possible physical reasons, as well as exposure varied. In other words, after all the cases I have worked, I do not know the answer to your question. Wish I did.", 
        "reply": " Could be the same reason why some people heavy smokers thier whole lives and never suffer more than a cough or shortness of breath. While others just Breath some second hand smoke and develop Lung cancer. The answer probably lies in cell regeneration and repair.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-01 14:25:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: ... In other areas there are always prisoners who would be willing participants for early releases Rather than extended sentences. ... That's no longer an option. Under the international agreements, \"vulnerable populations\" (prisoners, mentally ill or disabled, the elderly, minors, the very poor, and illiterates to name a few) are either off-limits entirely (prisoners, mentally challenged) or subject to extremely rigorous standards in order to be included in clinical trials. That's one of the reasons why the effects of drugs, vaccines and such are not as well-known among the elderly or children as among adults. There is a very real DISincentive to doing studies among the very young and very old.", 
        "intTime": 20090302, 
        "postID": 23, 
        "quote": "Originally posted by john2x: ... In other areas there are always prisoners who would be willing participants for early releases Rather than extended sentences. ...", 
        "reply": " That's no longer an option. Under the international agreements, \"vulnerable populations\" (prisoners, mentally ill or disabled, the elderly, minors, the very poor, and illiterates to name a few) are either off-limits entirely (prisoners, mentally challenged) or subject to extremely rigorous standards in order to be included in clinical trials. That's one of the reasons why the effects of drugs, vaccines and such are not as well-known among the elderly or children as among adults. There is a very real DISincentive to doing studies among the very young and very old.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-02 01:02:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: john2x said: Could be the same reason why some people heavy smokers thier whole lives and never suffer more than a cough or shortness of breath. While others just Breath some second hand smoke and develop Lung cancer. The answer probably lies in cell regeneration and repair. Good answer! I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "intTime": 20090302, 
        "postID": 24, 
        "quote": "john2x said: Could be the same reason why some people heavy smokers thier whole lives and never suffer more than a cough or shortness of breath. While others just Breath some second hand smoke and develop Lung cancer. The answer probably lies in cell regeneration and repair.", 
        "reply": " Good answer! I will cast no stones. Proud member of the RD-DV! Military.com is the original home of the Derelict Veterans Group, RD-DV, established December 31, 2008", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-02 03:21:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "DaveBarker"
    }, 
    {
        "content": "Then there was the Tuskegge Experiment: The Tuskegee Syphilis Experiment ***http://www.tuskegee.edu/Global/Story.asp?s=1207586*** by Borgna Brunner For forty years between 1932 and 1972, the U.S. Public Health Service (PHS) conducted an experiment on 399 black men in the late stages of syphilis. These men, for the most part illiterate sharecroppers from one of the poorest counties in Alabama, were never told what disease they were suffering from or of its seriousness. Informed that they were being treated for “bad blood,” their doctors had no intention of curing them of syphilis at all. The data for the experiment was to be collected from autopsies of the men, and they were thus deliberately left to degenerate under the ravages of tertiary syphilis—which can include tumors, heart disease, paralysis, blindness, insanity, and death. “As I see it,” one of the doctors involved explained, “we have no further interest in these patients until they die.”", 
        "intTime": 20090302, 
        "postID": 25, 
        "quote": "", 
        "reply": "Then there was the Tuskegge Experiment: The Tuskegee Syphilis Experiment ***http://www.tuskegee.edu/Global/Story.asp?s=1207586*** by Borgna Brunner For forty years between 1932 and 1972, the U.S. Public Health Service (PHS) conducted an experiment on 399 black men in the late stages of syphilis. These men, for the most part illiterate sharecroppers from one of the poorest counties in Alabama, were never told what disease they were suffering from or of its seriousness. Informed that they were being treated for “bad blood,” their doctors had no intention of curing them of syphilis at all. The data for the experiment was to be collected from autopsies of the men, and they were thus deliberately left to degenerate under the ravages of tertiary syphilis—which can include tumors, heart disease, paralysis, blindness, insanity, and death. “As I see it,” one of the doctors involved explained, “we have no further interest in these patients until they die.”", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-02 06:10:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Then there were the Human Radiation Experiments at the University of Rochester ***http://www.cipi.com/settlement.shtml*** by Melissa B. Robinson Associated Press Writer November 19, 1996 Washington (AP) - The government has agreed to pay $4.8 million for conducting Cold War-era radiation experiments on unwitting victims, the Energy Department said today. The money will go to one woman who took part in the experiments and the families of 11 other people who have died. Energy Secretary Hazel O'Leary announced the settlement in New York. \"This settlement goes to the very heart of the moral accountability the government owes it citizens,\" O'Leary said in prepared remarks. \"We are grateful to the families for the tough lessons they have taught us about trust, responsibility and accountability between the government and the people.\" The agreement represents the final settlement in 12 of 18 human radiation experiment cases involving the injection of plutonium and uranium, said the official, who spoke on condition of anonymity. Nine of the 12 took place at the University of Rochester in upstate New York. The U.S. government sponsored thousands of human radiation experiments between 1944 and 1974 that included injecting 18 hospital patients in New York, Illinois, California and Tennessee with plutonium. The tests sprang from efforts to develop atomic weapons. \"The purpose of the research worker safety was laudable,\" Ruth Faden, head of an advisory panel on human radiation experiments appointed by President Clinton, said previously. \"Unfortunately, the way they went about it was wrong.\" The committee found that it was not uncommon for doctors to use patients as test subjects without their knowledge in the 1940s. Doctors believe the deaths of the 11 deceased experiment victims were not related to the experiments.", 
        "intTime": 20090302, 
        "postID": 26, 
        "quote": "", 
        "reply": "Then there were the Human Radiation Experiments at the University of Rochester ***http://www.cipi.com/settlement.shtml*** by Melissa B. Robinson Associated Press Writer November 19, 1996 Washington (AP) - The government has agreed to pay $4.8 million for conducting Cold War-era radiation experiments on unwitting victims, the Energy Department said today. The money will go to one woman who took part in the experiments and the families of 11 other people who have died. Energy Secretary Hazel O'Leary announced the settlement in New York. \"This settlement goes to the very heart of the moral accountability the government owes it citizens,\" O'Leary said in prepared remarks. \"We are grateful to the families for the tough lessons they have taught us about trust, responsibility and accountability between the government and the people.\" The agreement represents the final settlement in 12 of 18 human radiation experiment cases involving the injection of plutonium and uranium, said the official, who spoke on condition of anonymity. Nine of the 12 took place at the University of Rochester in upstate New York. The U.S. government sponsored thousands of human radiation experiments between 1944 and 1974 that included injecting 18 hospital patients in New York, Illinois, California and Tennessee with plutonium. The tests sprang from efforts to develop atomic weapons. \"The purpose of the research worker safety was laudable,\" Ruth Faden, head of an advisory panel on human radiation experiments appointed by President Clinton, said previously. \"Unfortunately, the way they went about it was wrong.\" The committee found that it was not uncommon for doctors to use patients as test subjects without their knowledge in the 1940s. Doctors believe the deaths of the 11 deceased experiment victims were not related to the experiments.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-02 06:21:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Considering the Tuskegge experiment and the Human Radiation Experiment, do you still think universal health care under total control of the government is desirable?????", 
        "intTime": 20090302, 
        "postID": 27, 
        "quote": "", 
        "reply": "Considering the Tuskegge experiment and the Human Radiation Experiment, do you still think universal health care under total control of the government is desirable?????", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-02 06:31:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Considering the Tuskegge experiment and the Human Radiation Experiment, do you still think universal health care under total control of the government is desirable????? Good point Bill. Thats exactly how I felt when 25 years after the tests i participated in, I got a letter from the Air foce saying the radiation exposure I was subjected to was well within the safe levels. Then went on to encourage me to check in to a VA hospital for a complete Check up.", 
        "intTime": 20090302, 
        "postID": 28, 
        "quote": "Originally posted by bill_kananen: Considering the Tuskegge experiment and the Human Radiation Experiment, do you still think universal health care under total control of the government is desirable?????", 
        "reply": " Good point Bill. Thats exactly how I felt when 25 years after the tests i participated in, I got a letter from the Air foce saying the radiation exposure I was subjected to was well within the safe levels. Then went on to encourage me to check in to a VA hospital for a complete Check up.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-02 09:59:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "john2x"
    }, 
    {
        "content": "The two \"studies\" you cited, john2x, as well as \"Operation Whitecoat\" at Ft. Detrick, are virtual poster children for how the government did everything wrong - morally, legally, ethically. They are routinely taught in MANDATORY training courses for those entering the research fields. Outside of the CIA and other \"black ops,\" it would be exceedingly rare to find such blatantly BAD studies - no self-respecting researcher in any field would want to come within miles of such a study. It would be professional suicide, even aside from the moral, legal and ethical problems. Would I sign up for a study, if I met the criteria and I saw the value in it, either for myself or for others? Sure. But that is an INDIVIDUAL decision today - even in the military, it's not something that someone can order another to do or be part of.", 
        "intTime": 20090302, 
        "postID": 29, 
        "quote": "", 
        "reply": "The two \"studies\" you cited, john2x, as well as \"Operation Whitecoat\" at Ft. Detrick, are virtual poster children for how the government did everything wrong - morally, legally, ethically. They are routinely taught in MANDATORY training courses for those entering the research fields. Outside of the CIA and other \"black ops,\" it would be exceedingly rare to find such blatantly BAD studies - no self-respecting researcher in any field would want to come within miles of such a study. It would be professional suicide, even aside from the moral, legal and ethical problems. Would I sign up for a study, if I met the criteria and I saw the value in it, either for myself or for others? Sure. But that is an INDIVIDUAL decision today - even in the military, it's not something that someone can order another to do or be part of.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-02 11:58:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: The two \"studies\" you cited, john2x, as well as \"Operation Whitecoat\" at Ft. Detrick, are virtual poster children for how the government did everything wrong - morally, legally, ethically. They are routinely taught in MANDATORY training courses for those entering the research fields. Outside of the CIA and other \"black ops,\" it would be exceedingly rare to find such blatantly BAD studies - no self-respecting researcher in any field would want to come within miles of such a study. It would be professional suicide, even aside from the moral, legal and ethical problems. Would I sign up for a study, if I met the criteria and I saw the value in it, either for myself or for others? Sure. But that is an INDIVIDUAL decision today - even in the military, it's not something that someone can order another to do or be part of. Yes it was way out of line and yet till this day they wont acknowlege their responsibility to these vets or thier families that have suffered greatly. I remember when the fighter A/C that flew through the cloud after the fireball rose and dissipated packed with instruments for extended times, Had landed and taxied into designated Hot areas. The Planes were so contaminated That the pilots were lifted out of the A/C with fork lifts to avoid touching the out side surfaces. Yet they sent in troops with no more than rainsuits and plastic Face shields toscrub these plans down. That was followed by 3 seperate decontamination tent showers each one monitored by Medics with Geiger counters measuring radiation before you entered each tent and as you left. Later released secret documents showed they were testing soaps. When I was a member of the AVA I wrote many letters to my state congressmen among which were Chuch Schumer who failed to respond, and Hilliary Clinton who did respond but never touched on the subject matter and said how much she has done for veterans. They wont touch it with a ten foot pole even though there is a reccommendation for a AV service medal sitting on congresses desk for over 50 years. I had the opportunity to discuss this with General Pace while he was CJCS at an affair I attended. I showed him a letter from a vet that mailed me asking me where he could replace a lost certificate that was issued by the task force commander when we left. I sent him a copy of mine with his name on it. This guy had less than six months left to live at best and here he was thinking about that old Redwing certificate issued over 50 years ago. I told the general how much even a presidential letter of commendation would mean to these few remaining in recognition of thier sevice. He was as honest as he could be in his position and basically said it would open a pandoras box in so many words. He sent me his personal letter of commendation and gratitude for my service which hangs on my den wall.", 
        "intTime": 20090302, 
        "postID": 30, 
        "quote": "Originally posted by Cider33_Alpha: The two \"studies\" you cited, john2x, as well as \"Operation Whitecoat\" at Ft. Detrick, are virtual poster children for how the government did everything wrong - morally, legally, ethically. They are routinely taught in MANDATORY training courses for those entering the research fields. Outside of the CIA and other \"black ops,\" it would be exceedingly rare to find such blatantly BAD studies - no self-respecting researcher in any field would want to come within miles of such a study. It would be professional suicide, even aside from the moral, legal and ethical problems. Would I sign up for a study, if I met the criteria and I saw the value in it, either for myself or for others? Sure. But that is an INDIVIDUAL decision today - even in the military, it's not something that someone can order another to do or be part of.", 
        "reply": " Yes it was way out of line and yet till this day they wont acknowlege their responsibility to these vets or thier families that have suffered greatly. I remember when the fighter A/C that flew through the cloud after the fireball rose and dissipated packed with instruments for extended times, Had landed and taxied into designated Hot areas. The Planes were so contaminated That the pilots were lifted out of the A/C with fork lifts to avoid touching the out side surfaces. Yet they sent in troops with no more than rainsuits and plastic Face shields toscrub these plans down. That was followed by 3 seperate decontamination tent showers each one monitored by Medics with Geiger counters measuring radiation before you entered each tent and as you left. Later released secret documents showed they were testing soaps. When I was a member of the AVA I wrote many letters to my state congressmen among which were Chuch Schumer who failed to respond, and Hilliary Clinton who did respond but never touched on the subject matter and said how much she has done for veterans. They wont touch it with a ten foot pole even though there is a reccommendation for a AV service medal sitting on congresses desk for over 50 years. I had the opportunity to discuss this with General Pace while he was CJCS at an affair I attended. I showed him a letter from a vet that mailed me asking me where he could replace a lost certificate that was issued by the task force commander when we left. I sent him a copy of mine with his name on it. This guy had less than six months left to live at best and here he was thinking about that old Redwing certificate issued over 50 years ago. I told the general how much even a presidential letter of commendation would mean to these few remaining in recognition of thier sevice. He was as honest as he could be in his position and basically said it would open a pandoras box in so many words. He sent me his personal letter of commendation and gratitude for my service which hangs on my den wall.", 
        "threadID": "409192893_6990054612001", 
        "time": "2009-03-02 19:50:00", 
        "title": "Atomic Vets used as lab. Specimens", 
        "userID": "john2x"
    }
]