[
    {
        "content": "If the President sticks to this, then my hat is off to him. I just heard that he seriously considered the advice of military commanders, especially those in country, that told him that it would have a detrimental effect on the conduct of the war. Even if it's only to try to quash the whole interrogation memo issue, it's still the right decision.", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "", 
        "reply": "If the President sticks to this, then my hat is off to him. I just heard that he seriously considered the advice of military commanders, especially those in country, that told him that it would have a detrimental effect on the conduct of the war. Even if it's only to try to quash the whole interrogation memo issue, it's still the right decision.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-13 17:40:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "psychoABN"
    }, 
    {
        "content": "While i agree that keeping the photos from the public and the press due to the outrage it could cause around the world. As far as listening to Military Commanders I dont know if that is really the reason he is doing it but he has finally made a smart move.", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "", 
        "reply": "While i agree that keeping the photos from the public and the press due to the outrage it could cause around the world. As far as listening to Military Commanders I dont know if that is really the reason he is doing it but he has finally made a smart move.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-13 18:28:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Usamp27"
    }, 
    {
        "content": "President Obama does not get to decide to not release the photos. There is a Court order that the photos must be released, under the Freedom of Information Act. The court case has gone on for more than four years. Every angle the Bush Administration tried, including that the release of the photos would cause outrage in the Muslim world, has been shot down by the courts. Maybe President Obama has better lawyers than President Bush and can come up with better legal arguments to not release the photos. However, ultimately it is up to the Courts to decide if the photos get released. By at least trying, CinC Obama shows his concern for the troops in the field by trying to appeal the Court’s decision.", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "", 
        "reply": "President Obama does not get to decide to not release the photos. There is a Court order that the photos must be released, under the Freedom of Information Act. The court case has gone on for more than four years. Every angle the Bush Administration tried, including that the release of the photos would cause outrage in the Muslim world, has been shot down by the courts. Maybe President Obama has better lawyers than President Bush and can come up with better legal arguments to not release the photos. However, ultimately it is up to the Courts to decide if the photos get released. By at least trying, CinC Obama shows his concern for the troops in the field by trying to appeal the Court’s decision.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-13 23:04:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "xerello"
    }, 
    {
        "content": "I am amazed that the outrage isn't in that the pictures exist at all, but that they are to be released.", 
        "intTime": 20090514, 
        "postID": 4, 
        "quote": "", 
        "reply": "I am amazed that the outrage isn't in that the pictures exist at all, but that they are to be released.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 05:15:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Who cares about the muslin world being outrage? Were they outrage when 9/11 happened? Were they outrage when americans get beheaded? And as far as President Obama, I believe he is trying to make sound judgment on every situation presented to him. If it were a republican president, he or she would get all the credit. While so many people hung up on who is running the country, this country is silently being taking over by the enemy. As a country we better stop being nice about the way prisoners of war is interrogated. American soldiers and civilians get captured, tortured, and die a horrific death. Where is the outcry for that?", 
        "intTime": 20090514, 
        "postID": 5, 
        "quote": "", 
        "reply": "Who cares about the muslin world being outrage? Were they outrage when 9/11 happened? Were they outrage when americans get beheaded? And as far as President Obama, I believe he is trying to make sound judgment on every situation presented to him. If it were a republican president, he or she would get all the credit. While so many people hung up on who is running the country, this country is silently being taking over by the enemy. As a country we better stop being nice about the way prisoners of war is interrogated. American soldiers and civilians get captured, tortured, and die a horrific death. Where is the outcry for that?", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:04:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "fwilli52"
    }, 
    {
        "content": "quote: Originally posted by fwilli52: While so many people hung up on who is running the country, this country is silently being taking over by the enemy. Really? What \"enemy\" is \"taking over\" our country? quote: As a country we better stop being nice about the way prisoners of war is interrogated. As a country, we are better than \"they\" are and we don't torture. THAT is just one of the millions of things that make US the better country.", 
        "intTime": 20090514, 
        "postID": 6, 
        "quote": "Originally posted by fwilli52: While so many people hung up on who is running the country, this country is silently being taking over by the enemy.", 
        "reply": " Really? What \"enemy\" is \"taking over\" our country? quote: As a country we better stop being nice about the way prisoners of war is interrogated. As a country, we are better than \"they\" are and we don't torture. THAT is just one of the millions of things that make US the better country.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:12:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "My opinion....if a Congressman wants to see the photos, let him or her into a secure room, no cameras allowed, no copying the photos, look all you want and then protest whatever they feel they have to. What benefit would it be to release them to the public??? President Obama, I didn't vote for you but I like your decision on this one. Don", 
        "intTime": 20090514, 
        "postID": 7, 
        "quote": "", 
        "reply": "My opinion....if a Congressman wants to see the photos, let him or her into a secure room, no cameras allowed, no copying the photos, look all you want and then protest whatever they feel they have to. What benefit would it be to release them to the public??? President Obama, I didn't vote for you but I like your decision on this one. Don", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:19:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "intTime": 20090514, 
        "postID": 8, 
        "quote": "", 
        "reply": "EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:21:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by fwilli52: While so many people hung up on who is running the country, this country is silently being taking over by the enemy. Really? What \"enemy\" is \"taking over\" our country? quote: As a country we better stop being nice about the way prisoners of war is interrogated. As a country, we are better than \"they\" are and we don't torture. THAT is just one of the millions of things that make US the better country. The people who own all the gas stations, and just about all the neighborhood stores. I'm more than sure all that money is sent overseas to support terrorist.", 
        "intTime": 20090514, 
        "postID": 9, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by fwilli52: While so many people hung up on who is running the country, this country is silently being taking over by the enemy. Really? What \"enemy\" is \"taking over\" our country? quote: As a country we better stop being nice about the way prisoners of war is interrogated. As a country, we are better than \"they\" are and we don't torture. THAT is just one of the millions of things that make US the better country.", 
        "reply": " The people who own all the gas stations, and just about all the neighborhood stores. I'm more than sure all that money is sent overseas to support terrorist.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:29:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "fwilli52"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. Well, most world courts, including our own, disagree with your definition of torture. The President of the United States has declared that waterboarding IS torture. John McCain, who himself was tortured, has declared that waterboarding is torture. What we did was illegal. We are not only signors of the Geneva Conventions, but also the Conventions on Torture. That makes our actions as a nation illegal, period.", 
        "intTime": 20090514, 
        "postID": 10, 
        "quote": "Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "reply": " Well, most world courts, including our own, disagree with your definition of torture. The President of the United States has declared that waterboarding IS torture. John McCain, who himself was tortured, has declared that waterboarding is torture. What we did was illegal. We are not only signors of the Geneva Conventions, but also the Conventions on Torture. That makes our actions as a nation illegal, period.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:32:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I applaud President Obama's decision not to show more interrogation photos but the ACLU is pushing to have them released. The ACLU knows that by doing so it will caused more terror attacks on our troops in Iraq and Afghanistan. However, they simply don't care. IMHO the ACLU is just as bad for this country as the Taliban and Al-Qaeda. They should be held accountable if just one American dies due to these photo's being released.", 
        "intTime": 20090514, 
        "postID": 11, 
        "quote": "", 
        "reply": "I applaud President Obama's decision not to show more interrogation photos but the ACLU is pushing to have them released. The ACLU knows that by doing so it will caused more terror attacks on our troops in Iraq and Afghanistan. However, they simply don't care. IMHO the ACLU is just as bad for this country as the Taliban and Al-Qaeda. They should be held accountable if just one American dies due to these photo's being released.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:38:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "intTime": 20090514, 
        "postID": 12, 
        "quote": "Originally posted by psychoABN: When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "reply": "", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 07:32:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "President Obama is a clever politician and the fact of the matter is, those pictures are gonna come out soon or later, and when they finally do, he wants to be on the right side of public opinion about them, so I see this as a purely political move from a very political guy.", 
        "intTime": 20090514, 
        "postID": 13, 
        "quote": "", 
        "reply": "President Obama is a clever politician and the fact of the matter is, those pictures are gonna come out soon or later, and when they finally do, he wants to be on the right side of public opinion about them, so I see this as a purely political move from a very political guy.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 07:57:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: I am amazed that the outrage isn't in that the pictures exist at all, but that they are to be released. The soldiers involved in the photos were already punished, these are not NEW photo, just ones that were not originally released. The outrage already occured with the first set released. I comend him on not releasing these photos for the simple reason, there is only bad that can come from it and to risk the lives of our troops still over there is my only concern. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 14, 
        "quote": "Originally posted by SeaWitch1220: I am amazed that the outrage isn't in that the pictures exist at all, but that they are to be released.", 
        "reply": " The soldiers involved in the photos were already punished, these are not NEW photo, just ones that were not originally released. The outrage already occured with the first set released. I comend him on not releasing these photos for the simple reason, there is only bad that can come from it and to risk the lives of our troops still over there is my only concern. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:09:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "It is the existence of the photos that has placed American military members in harms way. It is the policies of the Bush Administration that allowed the actions that are in the photos that are the problem. If the embarrassing policies never existed then the embarrassing photos would never have existed. Those who argue against releasing the photos, then support “enhanced interrogation” contradict themselves.", 
        "intTime": 20090514, 
        "postID": 15, 
        "quote": "", 
        "reply": "It is the existence of the photos that has placed American military members in harms way. It is the policies of the Bush Administration that allowed the actions that are in the photos that are the problem. If the embarrassing policies never existed then the embarrassing photos would never have existed. Those who argue against releasing the photos, then support “enhanced interrogation” contradict themselves.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:21:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: It is the existence of the photos that has placed American military members in harms way. It is the policies of the Bush Administration that allowed the actions that are in the photos that are the problem. If the embarrassing policies never existed then the embarrassing photos would never have existed. Those who argue against releasing the photos, then support “enhanced interrogation” contradict themselves. Wel I am against the release of photos and enhanced interogations, where does that put me? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 16, 
        "quote": "Originally posted by xerello: It is the existence of the photos that has placed American military members in harms way. It is the policies of the Bush Administration that allowed the actions that are in the photos that are the problem. If the embarrassing policies never existed then the embarrassing photos would never have existed. Those who argue against releasing the photos, then support “enhanced interrogation” contradict themselves.", 
        "reply": " Wel I am against the release of photos and enhanced interogations, where does that put me? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:27:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided..", 
        "intTime": 20090514, 
        "postID": 17, 
        "quote": "", 
        "reply": "LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided..", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:34:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Wel I am against the release of photos and enhanced interogations, where does that put me? It makes you a dirty filthy lib! you lib!!!", 
        "intTime": 20090514, 
        "postID": 18, 
        "quote": "Wel I am against the release of photos and enhanced interogations, where does that put me?", 
        "reply": " It makes you a dirty filthy lib! you lib!!!", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:40:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided.. I am not sure MOST liberals want our troops killed, but there are a few that do. I think anyone that is opposing Obama's descision is doing so because they want more hatred reflected towards Bush to distract other things so the public is not paying attention. Or like Dave said in another thread, he maybe waiting until the 2010 election and then allow them to be released which would of course sabotage a lot of Republicans chances of being elected. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 19, 
        "quote": "Originally posted by Irwin_R_Schyster: LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided..", 
        "reply": " I am not sure MOST liberals want our troops killed, but there are a few that do. I think anyone that is opposing Obama's descision is doing so because they want more hatred reflected towards Bush to distract other things so the public is not paying attention. Or like Dave said in another thread, he maybe waiting until the 2010 election and then allow them to be released which would of course sabotage a lot of Republicans chances of being elected. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:41:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "Our troops are in harm's way because we (Bush) put them there and because we (Obama) refuse to get them out of it, so as for all this talk about these pictures putting them in harm's way, I don't buy it. They're already there! In harm's way that is. I can see why military commanders would not want the pictures to see the light of day though, of course, it shows the American (good guy) military brutalizing and otherwise sexually humiliating people and makes us look bad so damage control and censorship are in order, but they say it's because it will \"harm\" the troops, ya OK... Maybe their reputations will be hurt, but that's about it. They can fight back, right? I mean if some Haj wants to go crazy over the pics, let him, maybe we'll get a better chance of wacking him out before he gets to. Maybe not, ether way it's war, and we're in it, so let's fight it, or get the **** out!!", 
        "intTime": 20090514, 
        "postID": 20, 
        "quote": "", 
        "reply": "Our troops are in harm's way because we (Bush) put them there and because we (Obama) refuse to get them out of it, so as for all this talk about these pictures putting them in harm's way, I don't buy it. They're already there! In harm's way that is. I can see why military commanders would not want the pictures to see the light of day though, of course, it shows the American (good guy) military brutalizing and otherwise sexually humiliating people and makes us look bad so damage control and censorship are in order, but they say it's because it will \"harm\" the troops, ya OK... Maybe their reputations will be hurt, but that's about it. They can fight back, right? I mean if some Haj wants to go crazy over the pics, let him, maybe we'll get a better chance of wacking him out before he gets to. Maybe not, ether way it's war, and we're in it, so let's fight it, or get the **** out!!", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 09:51:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Our troops are in harm's way because we (Bush) put them there and because we (Obama) refuse to get them out of it, so as for all this talk about these pictures putting them in harm's way, I don't buy it. They're already there! In harm's way that is. I can see why military commanders would not want the pictures to see the light of day though, of course, it shows the American (good guy) military brutalizing and otherwise sexually humiliating people and makes us look bad so damage control and censorship are in order, but they say it's because it will \"harm\" the troops, ya OK... Maybe their reputations will be hurt, but that's about it. They can fight back, right? I mean if some Haj wants to go crazy over the pics, let him, maybe we'll get a better chance of wacking him out before he gets to. Maybe not, ether way it's war, and we're in it, so let's fight it, or get the **** out!! You are partly correct, they are in harms way now, but it is a known fact, by detainees that admitted they JOINED the fight because of the last group of photos that went out. Don't buy it, that's your right, but to deny it is ignorance. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 21, 
        "quote": "Originally posted by Killswitch_Engage: Our troops are in harm's way because we (Bush) put them there and because we (Obama) refuse to get them out of it, so as for all this talk about these pictures putting them in harm's way, I don't buy it. They're already there! In harm's way that is. I can see why military commanders would not want the pictures to see the light of day though, of course, it shows the American (good guy) military brutalizing and otherwise sexually humiliating people and makes us look bad so damage control and censorship are in order, but they say it's because it will \"harm\" the troops, ya OK... Maybe their reputations will be hurt, but that's about it. They can fight back, right? I mean if some Haj wants to go crazy over the pics, let him, maybe we'll get a better chance of wacking him out before he gets to. Maybe not, ether way it's war, and we're in it, so let's fight it, or get the **** out!!", 
        "reply": " You are partly correct, they are in harms way now, but it is a known fact, by detainees that admitted they JOINED the fight because of the last group of photos that went out. Don't buy it, that's your right, but to deny it is ignorance. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 09:54:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions of excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more...", 
        "intTime": 20090514, 
        "postID": 22, 
        "quote": "", 
        "reply": "Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions of excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more...", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 09:57:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\".", 
        "intTime": 20090514, 
        "postID": 23, 
        "quote": "Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "reply": " And a beating isn't torture, it is a \"tune up\".", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 09:57:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided.. So, I should come over and rip out your fingernails \"just in case\"? It is what Jack Bauer would do.", 
        "intTime": 20090514, 
        "postID": 24, 
        "quote": "Originally posted by Irwin_R_Schyster: LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided..", 
        "reply": " So, I should come over and rip out your fingernails \"just in case\"? It is what Jack Bauer would do.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 10:00:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more... I understand your point but in a lot of DOCUMENTED cases, it was the catalyst that caused them to join. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 25, 
        "quote": "Originally posted by Killswitch_Engage: Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more...", 
        "reply": " I understand your point but in a lot of DOCUMENTED cases, it was the catalyst that caused them to join. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 10:01:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Killswitch_Engage: Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more... I understand your point but in a lot of DOCUMENTED cases, it was the catalyst that caused them to join. Sounds to me like more targets for our boys...", 
        "intTime": 20090514, 
        "postID": 26, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Killswitch_Engage: Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more... I understand your point but in a lot of DOCUMENTED cases, it was the catalyst that caused them to join.", 
        "reply": " Sounds to me like more targets for our boys...", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 10:05:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. Well, most world courts, including our own, disagree with your definition of torture. The President of the United States has declared that waterboarding IS torture. John McCain, who himself was tortured, has declared that waterboarding is torture. What we did was illegal. We are not only signors of the Geneva Conventions, but also the Conventions on Torture. That makes our actions as a nation illegal, period. Honestly, I really don't care if the \"world\" courts agree with me or not. They don't have the best interests of the US, our country, at heart. So, what you're saying is that you're willing to sacrifice the lives of US citizens in order to satisfy \"world\" opinion. I believe that there's proof that these IETs worked, and I believe that it's contained in the memos that former Vice President Cheney asked to be released, and the proof that it is contained in the memos is the fact that the Obama administration has refused to release them. I put the safety of our citizens first, to hell with the rest of the \"world\".", 
        "intTime": 20090514, 
        "postID": 27, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. Well, most world courts, including our own, disagree with your definition of torture. The President of the United States has declared that waterboarding IS torture. John McCain, who himself was tortured, has declared that waterboarding is torture. What we did was illegal. We are not only signors of the Geneva Conventions, but also the Conventions on Torture. That makes our actions as a nation illegal, period.", 
        "reply": " Honestly, I really don't care if the \"world\" courts agree with me or not. They don't have the best interests of the US, our country, at heart. So, what you're saying is that you're willing to sacrifice the lives of US citizens in order to satisfy \"world\" opinion. I believe that there's proof that these IETs worked, and I believe that it's contained in the memos that former Vice President Cheney asked to be released, and the proof that it is contained in the memos is the fact that the Obama administration has refused to release them. I put the safety of our citizens first, to hell with the rest of the \"world\".", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 11:05:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\". To follow your logic, beheading isn't a savage way to kill someone, it's just a haircut gone bad...If I thought that one American life would be saved, I think it would be worth beating the f'ing hell out of a high level enemy combatant that was captured on the battlefield, if it was a permited SOP, of course...which it isn't...Are you saying that detainees were beaten? I believe that, as stated in the released \"torture\" memos, that an open hand slap, with detailed instructions on the execution, was the extent of the \"beating\".", 
        "intTime": 20090514, 
        "postID": 28, 
        "quote": "Originally posted by thorin001: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\".", 
        "reply": " To follow your logic, beheading isn't a savage way to kill someone, it's just a haircut gone bad...If I thought that one American life would be saved, I think it would be worth beating the f'ing hell out of a high level enemy combatant that was captured on the battlefield, if it was a permited SOP, of course...which it isn't...Are you saying that detainees were beaten? I believe that, as stated in the released \"torture\" memos, that an open hand slap, with detailed instructions on the execution, was the extent of the \"beating\".", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 11:13:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by thorin001: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\". To follow your logic, beheading isn't a savage way to kill someone, it's just a haircut gone bad... Sorry, that is not my logic, it is yours. My logic says that interrupted drowning is just as much torture as choking a guy out as is administering a tune up.", 
        "intTime": 20090514, 
        "postID": 29, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by thorin001: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\". To follow your logic, beheading isn't a savage way to kill someone, it's just a haircut gone bad...", 
        "reply": " Sorry, that is not my logic, it is yours. My logic says that interrupted drowning is just as much torture as choking a guy out as is administering a tune up.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 11:19:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "thorin001"
    }, 
    {
        "content": "If the President sticks to this, then my hat is off to him. I just heard that he seriously considered the advice of military commanders, especially those in country, that told him that it would have a detrimental effect on the conduct of the war. Even if it's only to try to quash the whole interrogation memo issue, it's still the right decision.", 
        "intTime": 20090513, 
        "postID": 30, 
        "quote": "", 
        "reply": "If the President sticks to this, then my hat is off to him. I just heard that he seriously considered the advice of military commanders, especially those in country, that told him that it would have a detrimental effect on the conduct of the war. Even if it's only to try to quash the whole interrogation memo issue, it's still the right decision.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-13 17:40:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "psychoABN"
    }, 
    {
        "content": "While i agree that keeping the photos from the public and the press due to the outrage it could cause around the world. As far as listening to Military Commanders I dont know if that is really the reason he is doing it but he has finally made a smart move.", 
        "intTime": 20090513, 
        "postID": 31, 
        "quote": "", 
        "reply": "While i agree that keeping the photos from the public and the press due to the outrage it could cause around the world. As far as listening to Military Commanders I dont know if that is really the reason he is doing it but he has finally made a smart move.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-13 18:28:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Usamp27"
    }, 
    {
        "content": "President Obama does not get to decide to not release the photos. There is a Court order that the photos must be released, under the Freedom of Information Act. The court case has gone on for more than four years. Every angle the Bush Administration tried, including that the release of the photos would cause outrage in the Muslim world, has been shot down by the courts. Maybe President Obama has better lawyers than President Bush and can come up with better legal arguments to not release the photos. However, ultimately it is up to the Courts to decide if the photos get released. By at least trying, CinC Obama shows his concern for the troops in the field by trying to appeal the Court’s decision.", 
        "intTime": 20090513, 
        "postID": 32, 
        "quote": "", 
        "reply": "President Obama does not get to decide to not release the photos. There is a Court order that the photos must be released, under the Freedom of Information Act. The court case has gone on for more than four years. Every angle the Bush Administration tried, including that the release of the photos would cause outrage in the Muslim world, has been shot down by the courts. Maybe President Obama has better lawyers than President Bush and can come up with better legal arguments to not release the photos. However, ultimately it is up to the Courts to decide if the photos get released. By at least trying, CinC Obama shows his concern for the troops in the field by trying to appeal the Court’s decision.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-13 23:04:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "xerello"
    }, 
    {
        "content": "I am amazed that the outrage isn't in that the pictures exist at all, but that they are to be released.", 
        "intTime": 20090514, 
        "postID": 33, 
        "quote": "", 
        "reply": "I am amazed that the outrage isn't in that the pictures exist at all, but that they are to be released.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 05:15:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Who cares about the muslin world being outrage? Were they outrage when 9/11 happened? Were they outrage when americans get beheaded? And as far as President Obama, I believe he is trying to make sound judgment on every situation presented to him. If it were a republican president, he or she would get all the credit. While so many people hung up on who is running the country, this country is silently being taking over by the enemy. As a country we better stop being nice about the way prisoners of war is interrogated. American soldiers and civilians get captured, tortured, and die a horrific death. Where is the outcry for that?", 
        "intTime": 20090514, 
        "postID": 34, 
        "quote": "", 
        "reply": "Who cares about the muslin world being outrage? Were they outrage when 9/11 happened? Were they outrage when americans get beheaded? And as far as President Obama, I believe he is trying to make sound judgment on every situation presented to him. If it were a republican president, he or she would get all the credit. While so many people hung up on who is running the country, this country is silently being taking over by the enemy. As a country we better stop being nice about the way prisoners of war is interrogated. American soldiers and civilians get captured, tortured, and die a horrific death. Where is the outcry for that?", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:04:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "fwilli52"
    }, 
    {
        "content": "quote: Originally posted by fwilli52: While so many people hung up on who is running the country, this country is silently being taking over by the enemy. Really? What \"enemy\" is \"taking over\" our country? quote: As a country we better stop being nice about the way prisoners of war is interrogated. As a country, we are better than \"they\" are and we don't torture. THAT is just one of the millions of things that make US the better country.", 
        "intTime": 20090514, 
        "postID": 35, 
        "quote": "Originally posted by fwilli52: While so many people hung up on who is running the country, this country is silently being taking over by the enemy.", 
        "reply": " Really? What \"enemy\" is \"taking over\" our country? quote: As a country we better stop being nice about the way prisoners of war is interrogated. As a country, we are better than \"they\" are and we don't torture. THAT is just one of the millions of things that make US the better country.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:12:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "My opinion....if a Congressman wants to see the photos, let him or her into a secure room, no cameras allowed, no copying the photos, look all you want and then protest whatever they feel they have to. What benefit would it be to release them to the public??? President Obama, I didn't vote for you but I like your decision on this one. Don", 
        "intTime": 20090514, 
        "postID": 36, 
        "quote": "", 
        "reply": "My opinion....if a Congressman wants to see the photos, let him or her into a secure room, no cameras allowed, no copying the photos, look all you want and then protest whatever they feel they have to. What benefit would it be to release them to the public??? President Obama, I didn't vote for you but I like your decision on this one. Don", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:19:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "intTime": 20090514, 
        "postID": 37, 
        "quote": "", 
        "reply": "EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:21:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by fwilli52: While so many people hung up on who is running the country, this country is silently being taking over by the enemy. Really? What \"enemy\" is \"taking over\" our country? quote: As a country we better stop being nice about the way prisoners of war is interrogated. As a country, we are better than \"they\" are and we don't torture. THAT is just one of the millions of things that make US the better country. The people who own all the gas stations, and just about all the neighborhood stores. I'm more than sure all that money is sent overseas to support terrorist.", 
        "intTime": 20090514, 
        "postID": 38, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by fwilli52: While so many people hung up on who is running the country, this country is silently being taking over by the enemy. Really? What \"enemy\" is \"taking over\" our country? quote: As a country we better stop being nice about the way prisoners of war is interrogated. As a country, we are better than \"they\" are and we don't torture. THAT is just one of the millions of things that make US the better country.", 
        "reply": " The people who own all the gas stations, and just about all the neighborhood stores. I'm more than sure all that money is sent overseas to support terrorist.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:29:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "fwilli52"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. Well, most world courts, including our own, disagree with your definition of torture. The President of the United States has declared that waterboarding IS torture. John McCain, who himself was tortured, has declared that waterboarding is torture. What we did was illegal. We are not only signors of the Geneva Conventions, but also the Conventions on Torture. That makes our actions as a nation illegal, period.", 
        "intTime": 20090514, 
        "postID": 39, 
        "quote": "Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "reply": " Well, most world courts, including our own, disagree with your definition of torture. The President of the United States has declared that waterboarding IS torture. John McCain, who himself was tortured, has declared that waterboarding is torture. What we did was illegal. We are not only signors of the Geneva Conventions, but also the Conventions on Torture. That makes our actions as a nation illegal, period.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:32:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "I applaud President Obama's decision not to show more interrogation photos but the ACLU is pushing to have them released. The ACLU knows that by doing so it will caused more terror attacks on our troops in Iraq and Afghanistan. However, they simply don't care. IMHO the ACLU is just as bad for this country as the Taliban and Al-Qaeda. They should be held accountable if just one American dies due to these photo's being released.", 
        "intTime": 20090514, 
        "postID": 40, 
        "quote": "", 
        "reply": "I applaud President Obama's decision not to show more interrogation photos but the ACLU is pushing to have them released. The ACLU knows that by doing so it will caused more terror attacks on our troops in Iraq and Afghanistan. However, they simply don't care. IMHO the ACLU is just as bad for this country as the Taliban and Al-Qaeda. They should be held accountable if just one American dies due to these photo's being released.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 06:38:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "intTime": 20090514, 
        "postID": 41, 
        "quote": "Originally posted by psychoABN: When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "reply": "", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 07:32:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "President Obama is a clever politician and the fact of the matter is, those pictures are gonna come out soon or later, and when they finally do, he wants to be on the right side of public opinion about them, so I see this as a purely political move from a very political guy.", 
        "intTime": 20090514, 
        "postID": 42, 
        "quote": "", 
        "reply": "President Obama is a clever politician and the fact of the matter is, those pictures are gonna come out soon or later, and when they finally do, he wants to be on the right side of public opinion about them, so I see this as a purely political move from a very political guy.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 07:57:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: I am amazed that the outrage isn't in that the pictures exist at all, but that they are to be released. The soldiers involved in the photos were already punished, these are not NEW photo, just ones that were not originally released. The outrage already occured with the first set released. I comend him on not releasing these photos for the simple reason, there is only bad that can come from it and to risk the lives of our troops still over there is my only concern. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 43, 
        "quote": "Originally posted by SeaWitch1220: I am amazed that the outrage isn't in that the pictures exist at all, but that they are to be released.", 
        "reply": " The soldiers involved in the photos were already punished, these are not NEW photo, just ones that were not originally released. The outrage already occured with the first set released. I comend him on not releasing these photos for the simple reason, there is only bad that can come from it and to risk the lives of our troops still over there is my only concern. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:09:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "It is the existence of the photos that has placed American military members in harms way. It is the policies of the Bush Administration that allowed the actions that are in the photos that are the problem. If the embarrassing policies never existed then the embarrassing photos would never have existed. Those who argue against releasing the photos, then support “enhanced interrogation” contradict themselves.", 
        "intTime": 20090514, 
        "postID": 44, 
        "quote": "", 
        "reply": "It is the existence of the photos that has placed American military members in harms way. It is the policies of the Bush Administration that allowed the actions that are in the photos that are the problem. If the embarrassing policies never existed then the embarrassing photos would never have existed. Those who argue against releasing the photos, then support “enhanced interrogation” contradict themselves.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:21:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: It is the existence of the photos that has placed American military members in harms way. It is the policies of the Bush Administration that allowed the actions that are in the photos that are the problem. If the embarrassing policies never existed then the embarrassing photos would never have existed. Those who argue against releasing the photos, then support “enhanced interrogation” contradict themselves. Wel I am against the release of photos and enhanced interogations, where does that put me? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 45, 
        "quote": "Originally posted by xerello: It is the existence of the photos that has placed American military members in harms way. It is the policies of the Bush Administration that allowed the actions that are in the photos that are the problem. If the embarrassing policies never existed then the embarrassing photos would never have existed. Those who argue against releasing the photos, then support “enhanced interrogation” contradict themselves.", 
        "reply": " Wel I am against the release of photos and enhanced interogations, where does that put me? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:27:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided..", 
        "intTime": 20090514, 
        "postID": 46, 
        "quote": "", 
        "reply": "LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided..", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:34:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Wel I am against the release of photos and enhanced interogations, where does that put me? It makes you a dirty filthy lib! you lib!!!", 
        "intTime": 20090514, 
        "postID": 47, 
        "quote": "Wel I am against the release of photos and enhanced interogations, where does that put me?", 
        "reply": " It makes you a dirty filthy lib! you lib!!!", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:40:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided.. I am not sure MOST liberals want our troops killed, but there are a few that do. I think anyone that is opposing Obama's descision is doing so because they want more hatred reflected towards Bush to distract other things so the public is not paying attention. Or like Dave said in another thread, he maybe waiting until the 2010 election and then allow them to be released which would of course sabotage a lot of Republicans chances of being elected. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 48, 
        "quote": "Originally posted by Irwin_R_Schyster: LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided..", 
        "reply": " I am not sure MOST liberals want our troops killed, but there are a few that do. I think anyone that is opposing Obama's descision is doing so because they want more hatred reflected towards Bush to distract other things so the public is not paying attention. Or like Dave said in another thread, he maybe waiting until the 2010 election and then allow them to be released which would of course sabotage a lot of Republicans chances of being elected. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 08:41:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "Our troops are in harm's way because we (Bush) put them there and because we (Obama) refuse to get them out of it, so as for all this talk about these pictures putting them in harm's way, I don't buy it. They're already there! In harm's way that is. I can see why military commanders would not want the pictures to see the light of day though, of course, it shows the American (good guy) military brutalizing and otherwise sexually humiliating people and makes us look bad so damage control and censorship are in order, but they say it's because it will \"harm\" the troops, ya OK... Maybe their reputations will be hurt, but that's about it. They can fight back, right? I mean if some Haj wants to go crazy over the pics, let him, maybe we'll get a better chance of wacking him out before he gets to. Maybe not, ether way it's war, and we're in it, so let's fight it, or get the **** out!!", 
        "intTime": 20090514, 
        "postID": 49, 
        "quote": "", 
        "reply": "Our troops are in harm's way because we (Bush) put them there and because we (Obama) refuse to get them out of it, so as for all this talk about these pictures putting them in harm's way, I don't buy it. They're already there! In harm's way that is. I can see why military commanders would not want the pictures to see the light of day though, of course, it shows the American (good guy) military brutalizing and otherwise sexually humiliating people and makes us look bad so damage control and censorship are in order, but they say it's because it will \"harm\" the troops, ya OK... Maybe their reputations will be hurt, but that's about it. They can fight back, right? I mean if some Haj wants to go crazy over the pics, let him, maybe we'll get a better chance of wacking him out before he gets to. Maybe not, ether way it's war, and we're in it, so let's fight it, or get the **** out!!", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 09:51:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Our troops are in harm's way because we (Bush) put them there and because we (Obama) refuse to get them out of it, so as for all this talk about these pictures putting them in harm's way, I don't buy it. They're already there! In harm's way that is. I can see why military commanders would not want the pictures to see the light of day though, of course, it shows the American (good guy) military brutalizing and otherwise sexually humiliating people and makes us look bad so damage control and censorship are in order, but they say it's because it will \"harm\" the troops, ya OK... Maybe their reputations will be hurt, but that's about it. They can fight back, right? I mean if some Haj wants to go crazy over the pics, let him, maybe we'll get a better chance of wacking him out before he gets to. Maybe not, ether way it's war, and we're in it, so let's fight it, or get the **** out!! You are partly correct, they are in harms way now, but it is a known fact, by detainees that admitted they JOINED the fight because of the last group of photos that went out. Don't buy it, that's your right, but to deny it is ignorance. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 50, 
        "quote": "Originally posted by Killswitch_Engage: Our troops are in harm's way because we (Bush) put them there and because we (Obama) refuse to get them out of it, so as for all this talk about these pictures putting them in harm's way, I don't buy it. They're already there! In harm's way that is. I can see why military commanders would not want the pictures to see the light of day though, of course, it shows the American (good guy) military brutalizing and otherwise sexually humiliating people and makes us look bad so damage control and censorship are in order, but they say it's because it will \"harm\" the troops, ya OK... Maybe their reputations will be hurt, but that's about it. They can fight back, right? I mean if some Haj wants to go crazy over the pics, let him, maybe we'll get a better chance of wacking him out before he gets to. Maybe not, ether way it's war, and we're in it, so let's fight it, or get the **** out!!", 
        "reply": " You are partly correct, they are in harms way now, but it is a known fact, by detainees that admitted they JOINED the fight because of the last group of photos that went out. Don't buy it, that's your right, but to deny it is ignorance. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 09:54:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions of excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more...", 
        "intTime": 20090514, 
        "postID": 51, 
        "quote": "", 
        "reply": "Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions of excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more...", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 09:57:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\".", 
        "intTime": 20090514, 
        "postID": 52, 
        "quote": "Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period.", 
        "reply": " And a beating isn't torture, it is a \"tune up\".", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 09:57:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided.. So, I should come over and rip out your fingernails \"just in case\"? It is what Jack Bauer would do.", 
        "intTime": 20090514, 
        "postID": 53, 
        "quote": "Originally posted by Irwin_R_Schyster: LOA1: I am against the release of the photos, but subscribe to the Jack Bauer interrogation doctrine Seriously, why doesn't the White House just classify the photos as Top-Secret?? I'm glad President Obama did what President Bush would have done....liberals must be disappointed that more attacks on our troops, and more hatred toward America was avoided..", 
        "reply": " So, I should come over and rip out your fingernails \"just in case\"? It is what Jack Bauer would do.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 10:00:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more... I understand your point but in a lot of DOCUMENTED cases, it was the catalyst that caused them to join. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 54, 
        "quote": "Originally posted by Killswitch_Engage: Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more...", 
        "reply": " I understand your point but in a lot of DOCUMENTED cases, it was the catalyst that caused them to join. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 10:01:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Killswitch_Engage: Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more... I understand your point but in a lot of DOCUMENTED cases, it was the catalyst that caused them to join. Sounds to me like more targets for our boys...", 
        "intTime": 20090514, 
        "postID": 55, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Killswitch_Engage: Look, more contractors and civilians paid the price for the first round of pictures than soldiers ever did, so if you wanna make the case that it puts civilians in more danger, then I buy that, but our troops, no. I don't buy it. There are a millions excuses Haj can use to go snipe a soldier or join a local militia, he hardly needs one more... I understand your point but in a lot of DOCUMENTED cases, it was the catalyst that caused them to join.", 
        "reply": " Sounds to me like more targets for our boys...", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 10:05:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. Well, most world courts, including our own, disagree with your definition of torture. The President of the United States has declared that waterboarding IS torture. John McCain, who himself was tortured, has declared that waterboarding is torture. What we did was illegal. We are not only signors of the Geneva Conventions, but also the Conventions on Torture. That makes our actions as a nation illegal, period. Honestly, I really don't care if the \"world\" courts agree with me or not. They don't have the best interests of the US, our country, at heart. So, what you're saying is that you're willing to sacrifice the lives of US citizens in order to satisfy \"world\" opinion. I believe that there's proof that these IETs worked, and I believe that it's contained in the memos that former Vice President Cheney asked to be released, and the proof that it is contained in the memos is the fact that the Obama administration has refused to release them. I put the safety of our citizens first, to hell with the rest of the \"world\".", 
        "intTime": 20090514, 
        "postID": 56, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. Well, most world courts, including our own, disagree with your definition of torture. The President of the United States has declared that waterboarding IS torture. John McCain, who himself was tortured, has declared that waterboarding is torture. What we did was illegal. We are not only signors of the Geneva Conventions, but also the Conventions on Torture. That makes our actions as a nation illegal, period.", 
        "reply": " Honestly, I really don't care if the \"world\" courts agree with me or not. They don't have the best interests of the US, our country, at heart. So, what you're saying is that you're willing to sacrifice the lives of US citizens in order to satisfy \"world\" opinion. I believe that there's proof that these IETs worked, and I believe that it's contained in the memos that former Vice President Cheney asked to be released, and the proof that it is contained in the memos is the fact that the Obama administration has refused to release them. I put the safety of our citizens first, to hell with the rest of the \"world\".", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 11:05:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\". To follow your logic, beheading isn't a savage way to kill someone, it's just a haircut gone bad...If I thought that one American life would be saved, I think it would be worth beating the f'ing hell out of a high level enemy combatant that was captured on the battlefield, if it was a permited SOP, of course...which it isn't...Are you saying that detainees were beaten? I believe that, as stated in the released \"torture\" memos, that an open hand slap, with detailed instructions on the execution, was the extent of the \"beating\".", 
        "intTime": 20090514, 
        "postID": 57, 
        "quote": "Originally posted by thorin001: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\".", 
        "reply": " To follow your logic, beheading isn't a savage way to kill someone, it's just a haircut gone bad...If I thought that one American life would be saved, I think it would be worth beating the f'ing hell out of a high level enemy combatant that was captured on the battlefield, if it was a permited SOP, of course...which it isn't...Are you saying that detainees were beaten? I believe that, as stated in the released \"torture\" memos, that an open hand slap, with detailed instructions on the execution, was the extent of the \"beating\".", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 11:13:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "psychoABN"
    }, 
    {
        "content": "quote: Originally posted by psychoABN: quote: Originally posted by thorin001: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\". To follow your logic, beheading isn't a savage way to kill someone, it's just a haircut gone bad... Sorry, that is not my logic, it is yours. My logic says that interrupted drowning is just as much torture as choking a guy out as is administering a tune up.", 
        "intTime": 20090514, 
        "postID": 58, 
        "quote": "Originally posted by psychoABN: quote: Originally posted by thorin001: quote: Originally posted by psychoABN: EITs aren't troture. Waterboarding isn't torture, and I'm tired of hearing the left say that we hung Japanese for waterboarding in WWII. What the Japanese were prosecuted for is called Water Cure, and it involved forcing POWs to drink water to the point where it was toxic, and caused death, which by definition, is torture. When American lives are at risk, personally, I go back to W.W.J.B.D. (What Would Jack Bauer Do). We did not \"torture\" detainees, period. And a beating isn't torture, it is a \"tune up\". To follow your logic, beheading isn't a savage way to kill someone, it's just a haircut gone bad...", 
        "reply": " Sorry, that is not my logic, it is yours. My logic says that interrupted drowning is just as much torture as choking a guy out as is administering a tune up.", 
        "threadID": "409192893_2280042322001", 
        "time": "2009-05-14 11:19:00", 
        "title": "President Obama decides not to release interrogation photos", 
        "userID": "thorin001"
    }
]