[
    {
        "content": "\"http://www.boston.com/news/nation/articles/2009/03/29/abortions_vasectomies_on_increase_in_economic_crisis/?page=full\" quote: The pregnant woman showed up at the medical center in flip-flops and tears after walking there to save bus fare. Her boyfriend had lost his job, she told her doctor in Oakland, Calif., and now - fearing harder times for her family - she wanted to abort what would have been her fourth child. \"This was a desired pregnancy - she'd been getting prenatal care - but they reevaluated expenses and decided not to continue,\" said Dr. Pratima Gupta. \"When I was doing the options counseling, she interrupted me halfway through, crying, and said, 'Dr. Gupta, I just walked here for an hour. I'm sure of my decision.' \" Other doctors are hearing similarly wrenching tales. For many Americans, the recession is affecting their most intimate decisions about sex and family planning. Doctors and clinics are reporting that many women are choosing abortions and men are having vasectomies because they cannot afford a child. Planned Parenthood of Illinois clinics performed an all-time high number of abortions in January, many of them motivated by the women's economic worries, said Steve Trombley, chief executive officer, who declined to give exact numbers. Abortions at Planned Parenthood's St. Louis-area clinics were up nearly 7 percent in the second half of 2008 from a year earlier - ending a stretch in which the numbers were dwindling. Planned Parenthood said it has no up-to-date national abortion figures, nor do other private or government agencies. Stephanie Poggi of the National Network of Abortion Funds, which helps women in need pay for abortions, said, however, that calls to the network's national helpline have nearly quadrupled from a year ago. \"A lot of women who never thought they'd need help are turning to us,\" Poggi said. \"They're telling us: 'I've already put off paying my rent, my electric bill. I'm cutting back on my food.' They've run through all the options.\"... Dr. J. Stephen Jones, a urologist at the Cleveland Clinic, said he has seen a surge of men seeking vasectomies, with his monthly caseload rising from about 45 to more than 70 since November. He said most of the men were married, had children, decided they couldn't afford more, and opted to get a vasectomy while they still had job-related health insurance. \"Several articulated very forcefully that the economy was the motive,\" Jones said. \"I have a long discussion with them and ask if there's any chance they still might want kids. They say they know it's time.\" Women - which may be more important to you - feeding and clothing the children you already have - or carrying your fetus to term? Men - would your employment/financial condition affect your decision on whether to get a vasectomy or not?", 
        "intTime": 20090329, 
        "postID": 1, 
        "quote": "The pregnant woman showed up at the medical center in flip-flops and tears after walking there to save bus fare. Her boyfriend had lost his job, she told her doctor in Oakland, Calif., and now - fearing harder times for her family - she wanted to abort what would have been her fourth child. \"This was a desired pregnancy - she'd been getting prenatal care - but they reevaluated expenses and decided not to continue,\" said Dr. Pratima Gupta. \"When I was doing the options counseling, she interrupted me halfway through, crying, and said, 'Dr. Gupta, I just walked here for an hour. I'm sure of my decision.' \" Other doctors are hearing similarly wrenching tales. For many Americans, the recession is affecting their most intimate decisions about sex and family planning. Doctors and clinics are reporting that many women are choosing abortions and men are having vasectomies because they cannot afford a child. Planned Parenthood of Illinois clinics performed an all-time high number of abortions in January, many of them motivated by the women's economic worries, said Steve Trombley, chief executive officer, who declined to give exact numbers. Abortions at Planned Parenthood's St. Louis-area clinics were up nearly 7 percent in the second half of 2008 from a year earlier - ending a stretch in which the numbers were dwindling. Planned Parenthood said it has no up-to-date national abortion figures, nor do other private or government agencies. Stephanie Poggi of the National Network of Abortion Funds, which helps women in need pay for abortions, said, however, that calls to the network's national helpline have nearly quadrupled from a year ago. \"A lot of women who never thought they'd need help are turning to us,\" Poggi said. \"They're telling us: 'I've already put off paying my rent, my electric bill. I'm cutting back on my food.' They've run through all the options.\"... Dr. J. Stephen Jones, a urologist at the Cleveland Clinic, said he has seen a surge of men seeking vasectomies, with his monthly caseload rising from about 45 to more than 70 since November. He said most of the men were married, had children, decided they couldn't afford more, and opted to get a vasectomy while they still had job-related health insurance. \"Several articulated very forcefully that the economy was the motive,\" Jones said. \"I have a long discussion with them and ask if there's any chance they still might want kids. They say they know it's time.\"", 
        "reply": "\"http://www.boston.com/news/nation/articles/2009/03/29/abortions_vasectomies_on_increase_in_economic_crisis/?page=full\"  Women - which may be more important to you - feeding and clothing the children you already have - or carrying your fetus to term? Men - would your employment/financial condition affect your decision on whether to get a vasectomy or not?", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 06:07:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "This is just the results of Polosi's Chinese condom contract, they're defective.", 
        "intTime": 20090329, 
        "postID": 2, 
        "quote": "", 
        "reply": "This is just the results of Polosi's Chinese condom contract, they're defective.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 08:08:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: This is just the results of Polosi's Chinese condom contract, they're defective. \"This was a desired pregnancy - she'd been getting prenatal care - but they reevaluated expenses and decided not to continue,\" said Dr. Pratima Gupta. \"When I was doing the options counseling, she interrupted me halfway through, crying, and said, 'Dr. Gupta, I just walked here for an hour. I'm sure of my decision.' \" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090329, 
        "postID": 3, 
        "quote": "Originally posted by SignalSgtWilliams: This is just the results of Polosi's Chinese condom contract, they're defective.", 
        "reply": " \"This was a desired pregnancy - she'd been getting prenatal care - but they reevaluated expenses and decided not to continue,\" said Dr. Pratima Gupta. \"When I was doing the options counseling, she interrupted me halfway through, crying, and said, 'Dr. Gupta, I just walked here for an hour. I'm sure of my decision.' \" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 08:23:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Her boyfriend had lost his job,... \"This was a desired pregnancy - she'd been getting prenatal care - but they reevaluated expenses and decided not to continue,\" said Dr. Pratima Gupta. \"When I was doing the options counseling, she interrupted me halfway through, crying, and said, 'Dr. Gupta, I just walked here for an hour. I'm sure of my decision.' \" As long as we can 'BLAME' something else and eliminate our responsibility ... Why doesn't she 'kill' one of the other children or give them away. Why was it a 'desired pregnancy'? to make her boyfriend stay around.", 
        "intTime": 20090329, 
        "postID": 4, 
        "quote": "Her boyfriend had lost his job,... \"This was a desired pregnancy - she'd been getting prenatal care - but they reevaluated expenses and decided not to continue,\" said Dr. Pratima Gupta. \"When I was doing the options counseling, she interrupted me halfway through, crying, and said, 'Dr. Gupta, I just walked here for an hour. I'm sure of my decision.' \"", 
        "reply": " As long as we can 'BLAME' something else and eliminate our responsibility ... Why doesn't she 'kill' one of the other children or give them away. Why was it a 'desired pregnancy'? to make her boyfriend stay around.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 12:23:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "What the hell is she doing having children with her \"boyfriend\" in the first place???", 
        "intTime": 20090329, 
        "postID": 5, 
        "quote": "", 
        "reply": "What the hell is she doing having children with her \"boyfriend\" in the first place???", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 12:32:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: What the hell is she doing having children with her \"boyfriend\" in the first place??? Yaeh, I know and when one refers to the child as a (B-word, since using as a perfectly proper word got stared out) they get bent out of shape. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090329, 
        "postID": 6, 
        "quote": "Originally posted by IHAWKER: What the hell is she doing having children with her \"boyfriend\" in the first place???", 
        "reply": " Yaeh, I know and when one refers to the child as a (B-word, since using as a perfectly proper word got stared out) they get bent out of shape. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 12:51:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy.", 
        "intTime": 20090329, 
        "postID": 7, 
        "quote": "", 
        "reply": "Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 16:45:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. It takes two........... men can't walk through a door, it has to be opened first. If women wore a chasity belt, etc etc etc.", 
        "intTime": 20090329, 
        "postID": 8, 
        "quote": "Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy.", 
        "reply": " It takes two........... men can't walk through a door, it has to be opened first. If women wore a chasity belt, etc etc etc.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 16:59:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. The father has every right. However, both parties need to be responsible. If couple has their family and the man decides to get a vasectomy, so be it. Not really a viable option if he is single and hopes to have kids one day.", 
        "intTime": 20090329, 
        "postID": 9, 
        "quote": "Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy.", 
        "reply": " The father has every right. However, both parties need to be responsible. If couple has their family and the man decides to get a vasectomy, so be it. Not really a viable option if he is single and hopes to have kids one day.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 17:14:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. It takes two........... men can't walk through a door, it has to be opened first. If women wore a chasity belt, etc etc etc. Unless someone has put a gun to the man's head he doesn't have to walk through that door, open or not.", 
        "intTime": 20090329, 
        "postID": 10, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. It takes two........... men can't walk through a door, it has to be opened first. If women wore a chasity belt, etc etc etc.", 
        "reply": " Unless someone has put a gun to the man's head he doesn't have to walk through that door, open or not.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 17:18:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Boospar"
    }, 
    {
        "content": "Like I have always said. Women kill people. Not guns. Until we can say the hellll with love or whats love got to do with it? We will always have this problem. IMO no one in this country should be allowed to have kids unless they meet certain criteria. Be educated, economically able to support them, and responsible enough to raise them. Most women feel that if they don't have a child then they are not really a woman at all. How sick is that?", 
        "intTime": 20090329, 
        "postID": 11, 
        "quote": "", 
        "reply": "Like I have always said. Women kill people. Not guns. Until we can say the hellll with love or whats love got to do with it? We will always have this problem. IMO no one in this country should be allowed to have kids unless they meet certain criteria. Be educated, economically able to support them, and responsible enough to raise them. Most women feel that if they don't have a child then they are not really a woman at all. How sick is that?", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 17:33:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Most women feel that if they don't have a child then they are not really a woman at all. How sick is that? As a woman, I think that's the damn dumbest thing I've ever heard! Some of these chicks who think they HAVE to have kids....WHY? Honestly, if you don't have a child, are you less of a person? Hell no! Anyways...she has the right to do with her body/child as she wishes, BUT, I myself think she's being selfish and unreasonable. If you can plan a child, then you can carry through with its birth! If you and your boyfriend (don't get me started on THAT) can plan to have 4 kids (or THAT either!), then you damn sure shoulda thought of how you'd raise 'em if things got tight. My husband and I have 5 between us, yes on purpose, and even when things are tight the kids were always provided for first. How? Well he and I went without material things, he got a 2nd job and so did I, he pawned expensive music equipment. Whatever it took, because what was the other option? Sell a couple of 'em? Do what so many in Nebraska did and give them up? NO. It's called consequences of actions. She got some action and didn't wanna deal with the consequences anymore when it got the littlest bit challenging. Raising kids oughta be a rude awakening for someone who doesn't rise to challenges, but instead bails on 'em! That's my 2 cents. Flame away if ya want.", 
        "intTime": 20090329, 
        "postID": 12, 
        "quote": "Most women feel that if they don't have a child then they are not really a woman at all. How sick is that?", 
        "reply": " As a woman, I think that's the damn dumbest thing I've ever heard! Some of these chicks who think they HAVE to have kids....WHY? Honestly, if you don't have a child, are you less of a person? Hell no! Anyways...she has the right to do with her body/child as she wishes, BUT, I myself think she's being selfish and unreasonable. If you can plan a child, then you can carry through with its birth! If you and your boyfriend (don't get me started on THAT) can plan to have 4 kids (or THAT either!), then you damn sure shoulda thought of how you'd raise 'em if things got tight. My husband and I have 5 between us, yes on purpose, and even when things are tight the kids were always provided for first. How? Well he and I went without material things, he got a 2nd job and so did I, he pawned expensive music equipment. Whatever it took, because what was the other option? Sell a couple of 'em? Do what so many in Nebraska did and give them up? NO. It's called consequences of actions. She got some action and didn't wanna deal with the consequences anymore when it got the littlest bit challenging. Raising kids oughta be a rude awakening for someone who doesn't rise to challenges, but instead bails on 'em! That's my 2 cents. Flame away if ya want.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 18:01:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "mfamily2004"
    }, 
    {
        "content": "quote: Originally posted by mfamily2004: quote: Most women feel that if they don't have a child then they are not really a woman at all. How sick is that? As a woman, I think that's the damn dumbest thing I've ever heard! Some of these chicks who think they HAVE to have kids....WHY? Honestly, if you don't have a child, are you less of a person? Hell no! Anyways...she has the right to do with her body/child as she wishes, BUT, I myself think she's being selfish and unreasonable. If you can plan a child, then you can carry through with its birth! If you and your boyfriend (don't get me started on THAT) can plan to have 4 kids (or THAT either!), then you damn sure shoulda thought of how you'd raise 'em if things got tight. My husband and I have 5 between us, yes on purpose, and even when things are tight the kids were always provided for first. How? Well he and I went without material things, he got a 2nd job and so did I, he pawned expensive music equipment. Whatever it took, because what was the other option? Sell a couple of 'em? Do what so many in Nebraska did and give them up? NO. It's called consequences of actions. She got some action and didn't wanna deal with the consequences anymore when it got the littlest bit challenging. Raising kids oughta be a rude awakening for someone who doesn't rise to challenges, but instead bails on 'em! That's my 2 cents. Flame away if ya want. You have the right to say this. Men don't have the same vote as you do. This is definitely more of a woman's issue. All I hear is men jawing about this, and if a woman speaks us, men chatter away with their macho bull until the women give up and leave the conversation. That's not right. Women should have three votes to one of a man's in the abortion issue. There would be no abortion issue if men did their part. Women are expected to be the ones who provide the birth control, carry the babies, and make the life decisions for the baby....", 
        "intTime": 20090329, 
        "postID": 13, 
        "quote": "Originally posted by mfamily2004: quote: Most women feel that if they don't have a child then they are not really a woman at all. How sick is that? As a woman, I think that's the damn dumbest thing I've ever heard! Some of these chicks who think they HAVE to have kids....WHY? Honestly, if you don't have a child, are you less of a person? Hell no! Anyways...she has the right to do with her body/child as she wishes, BUT, I myself think she's being selfish and unreasonable. If you can plan a child, then you can carry through with its birth! If you and your boyfriend (don't get me started on THAT) can plan to have 4 kids (or THAT either!), then you damn sure shoulda thought of how you'd raise 'em if things got tight. My husband and I have 5 between us, yes on purpose, and even when things are tight the kids were always provided for first. How? Well he and I went without material things, he got a 2nd job and so did I, he pawned expensive music equipment. Whatever it took, because what was the other option? Sell a couple of 'em? Do what so many in Nebraska did and give them up? NO. It's called consequences of actions. She got some action and didn't wanna deal with the consequences anymore when it got the littlest bit challenging. Raising kids oughta be a rude awakening for someone who doesn't rise to challenges, but instead bails on 'em! That's my 2 cents. Flame away if ya want.", 
        "reply": " You have the right to say this. Men don't have the same vote as you do. This is definitely more of a woman's issue. All I hear is men jawing about this, and if a woman speaks us, men chatter away with their macho bull until the women give up and leave the conversation. That's not right. Women should have three votes to one of a man's in the abortion issue. There would be no abortion issue if men did their part. Women are expected to be the ones who provide the birth control, carry the babies, and make the life decisions for the baby....", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 18:22:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by Boospar: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. It takes two........... men can't walk through a door, it has to be opened first. If women wore a chasity belt, etc etc etc. Unless someone has put a gun to the man's head he doesn't have to walk through that door, open or not. nor does the door have to swing open willingly.", 
        "intTime": 20090329, 
        "postID": 14, 
        "quote": "Originally posted by Boospar: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. It takes two........... men can't walk through a door, it has to be opened first. If women wore a chasity belt, etc etc etc. Unless someone has put a gun to the man's head he doesn't have to walk through that door, open or not.", 
        "reply": " nor does the door have to swing open willingly.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 18:55:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: As a woman, I think that's the damn dumbest thing I've ever heard! Some of these chicks who think they HAVE to have kids....WHY? Honestly, if you don't have a child, are you less of a person? Hell no! Anyways...she has the right to do with her body/child as she wishes, BUT, I myself think she's being selfish and unreasonable. If you can plan a child, then you can carry through with its birth! If you and your boyfriend (don't get me started on THAT) can plan to have 4 kids (or THAT either!), then you damn sure shoulda thought of how you'd raise 'em if things got tight. My husband and I have 5 between us, yes on purpose, and even when things are tight the kids were always provided for first. How? Well he and I went without material things, he got a 2nd job and so did I, he pawned expensive music equipment. Whatever it took, because what was the other option? Sell a couple of 'em? Do what so many in Nebraska did and give them up? NO. It's called consequences of actions. She got some action and didn't wanna deal with the consequences anymore when it got the littlest bit challenging. Raising kids oughta be a rude awakening for someone who doesn't rise to challenges, but instead bails on 'em! That's my 2 cents. Flame away if ya want. ... and I applaud you for being responsible and willing to accept any and all consequences for your actions! quote: Why doesn't she 'kill' one of the other children or give them away. Why was it a 'desired pregnancy'? to make her boyfriend stay around. My remarks were a bit crass but I question anyone as being a responsible caring parent that opts 'family reduction' when times appear to be tough. What are her plans if things really get tough? Her boyfriend also seems to be a 'gem'; why isn't he with her? Years ago, I would call such a story 'Bogus'. Unfortunately, today, I've found it all too frequent - take the easiest route and blame your irresponsibility on someone/something else.", 
        "intTime": 20090329, 
        "postID": 15, 
        "quote": "As a woman, I think that's the damn dumbest thing I've ever heard! Some of these chicks who think they HAVE to have kids....WHY? Honestly, if you don't have a child, are you less of a person? Hell no! Anyways...she has the right to do with her body/child as she wishes, BUT, I myself think she's being selfish and unreasonable. If you can plan a child, then you can carry through with its birth! If you and your boyfriend (don't get me started on THAT) can plan to have 4 kids (or THAT either!), then you damn sure shoulda thought of how you'd raise 'em if things got tight. My husband and I have 5 between us, yes on purpose, and even when things are tight the kids were always provided for first. How? Well he and I went without material things, he got a 2nd job and so did I, he pawned expensive music equipment. Whatever it took, because what was the other option? Sell a couple of 'em? Do what so many in Nebraska did and give them up? NO. It's called consequences of actions. She got some action and didn't wanna deal with the consequences anymore when it got the littlest bit challenging. Raising kids oughta be a rude awakening for someone who doesn't rise to challenges, but instead bails on 'em! That's my 2 cents. Flame away if ya want.", 
        "reply": " ... and I applaud you for being responsible and willing to accept any and all consequences for your actions! quote: Why doesn't she 'kill' one of the other children or give them away. Why was it a 'desired pregnancy'? to make her boyfriend stay around. My remarks were a bit crass but I question anyone as being a responsible caring parent that opts 'family reduction' when times appear to be tough. What are her plans if things really get tough? Her boyfriend also seems to be a 'gem'; why isn't he with her? Years ago, I would call such a story 'Bogus'. Unfortunately, today, I've found it all too frequent - take the easiest route and blame your irresponsibility on someone/something else.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-29 21:22:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "Octomom where are you when I need you?", 
        "intTime": 20090330, 
        "postID": 16, 
        "quote": "", 
        "reply": "Octomom where are you when I need you?", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 03:55:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Duster6"
    }, 
    {
        "content": "Something like 47% of Americans are living paycheck to paycheck. When those paychecks are lost and jobs are scarce, people have to make really tough decisions. I am very sad for this couple, but they have three other children they have to provide for. I wish they had found another option, especially since they wanted this child.", 
        "intTime": 20090330, 
        "postID": 17, 
        "quote": "", 
        "reply": "Something like 47% of Americans are living paycheck to paycheck. When those paychecks are lost and jobs are scarce, people have to make really tough decisions. I am very sad for this couple, but they have three other children they have to provide for. I wish they had found another option, especially since they wanted this child.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 05:20:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Something like 47% of Americans are living paycheck to paycheck. When those paychecks are lost and jobs are scarce, people have to make really tough decisions. I am very sad for this couple, but they have three other children they have to provide for. I wish they had found another option, especially since they wanted this child. Perhaps they could have placed one of their others up for adoption.", 
        "intTime": 20090330, 
        "postID": 18, 
        "quote": "Originally posted by SeaWitch1220: Something like 47% of Americans are living paycheck to paycheck. When those paychecks are lost and jobs are scarce, people have to make really tough decisions. I am very sad for this couple, but they have three other children they have to provide for. I wish they had found another option, especially since they wanted this child.", 
        "reply": " Perhaps they could have placed one of their others up for adoption.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 05:28:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Boospar: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. It takes two........... men can't walk through a door, it has to be opened first. If women wore a chasity belt, etc etc etc. Unless someone has put a gun to the man's head he doesn't have to walk through that door, open or not. nor does the door have to swing open willingly. So long as we all understand it's a 2-way street in this matter.", 
        "intTime": 20090330, 
        "postID": 19, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Boospar: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. It takes two........... men can't walk through a door, it has to be opened first. If women wore a chasity belt, etc etc etc. Unless someone has put a gun to the man's head he doesn't have to walk through that door, open or not. nor does the door have to swing open willingly.", 
        "reply": " So long as we all understand it's a 2-way street in this matter.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 05:28:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Originally posted by Boospar: Perhaps they could have placed one of their others up for adoption. How Sophie's Choice of you. (To a much less extreme extent) It was not a choice I would have made, but I am not in these women's shoes so I cannot say what is the best decision for them...and it IS their choice.", 
        "intTime": 20090330, 
        "postID": 20, 
        "quote": "Originally posted by Boospar: Perhaps they could have placed one of their others up for adoption.", 
        "reply": " How Sophie's Choice of you. (To a much less extreme extent) It was not a choice I would have made, but I am not in these women's shoes so I cannot say what is the best decision for them...and it IS their choice.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 05:52:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Women - which may be more important to you - feeding and clothing the children you already have - or carrying your fetus to term? Men - would your employment/financial condition affect your decision on whether to get a vasectomy or not? The child is hers, born or not. It is a living human being in her womb. As to feeding a child, we have programs for that. We also have long waiting lists for babies. Is death really the preferred alternative to adoption? Economic hard times come and go. Generally in the U.S. starvation due to economic hardship doesn't exist. By the logic of this article, Barack Obama Jr. would have been aborted. Alcoholic absent father, mother with no means of support. Why on earth did she not abort our President? If only Planned Parenthood were there, think of how much better our world would be, right?", 
        "intTime": 20090330, 
        "postID": 21, 
        "quote": "Women - which may be more important to you - feeding and clothing the children you already have - or carrying your fetus to term? Men - would your employment/financial condition affect your decision on whether to get a vasectomy or not?", 
        "reply": " The child is hers, born or not. It is a living human being in her womb. As to feeding a child, we have programs for that. We also have long waiting lists for babies. Is death really the preferred alternative to adoption? Economic hard times come and go. Generally in the U.S. starvation due to economic hardship doesn't exist. By the logic of this article, Barack Obama Jr. would have been aborted. Alcoholic absent father, mother with no means of support. Why on earth did she not abort our President? If only Planned Parenthood were there, think of how much better our world would be, right?", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 06:27:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Boospar"
    }, 
    {
        "content": "my parents had 5 kids..helped with grandchildren, etc. they both said the last of us was a surprise..but in the long haul the expenses from 4 to 5 didn't change that much..of course as we got older if we wanted extras, we earned money to buy..never expected everything to be handed to us..we went from 2 to 3 children & the expense didn't change much either..just my 2 cents & not even worth that much anymore!", 
        "intTime": 20090330, 
        "postID": 22, 
        "quote": "", 
        "reply": "my parents had 5 kids..helped with grandchildren, etc. they both said the last of us was a surprise..but in the long haul the expenses from 4 to 5 didn't change that much..of course as we got older if we wanted extras, we earned money to buy..never expected everything to be handed to us..we went from 2 to 3 children & the expense didn't change much either..just my 2 cents & not even worth that much anymore!", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 08:54:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "bmh"
    }, 
    {
        "content": "quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. Dear billbright, the last portion of your name is a misnomer, IMHO. (note: rapes or incest have nothing to do with my postings below.) Any woman, and I repeat ANY woman, that does not wish to carry a pregnancy to term, is nothing more than an \"egg donor\", in the same as any man that is unwilling to raise and/or support a child that they helped create is a \"sperm donor\" (Do notice the emphasis on 'helped'. In almost all of the abortion cases, it was adult consensual sex.) Both of the persons, who engaged in an adult, consensual, sexual relation that produces a child, have a say about the child's future; and if either one of them wishes to have the child carried to term, it shall be so!! ( My personal opinion is that the child shall be born regardless of their wishes, unless deemed to be a medical safety issue by a team of at least 5 doctors who are experienced in obstetrics.) To argue that last statement is futile! No argument, I repeat, NO argument, has merit against it. No brag...just fact. see -<http://www.imdb.com/Quotes?0061259> These are my opinions. Yours may differ.", 
        "intTime": 20090330, 
        "postID": 23, 
        "quote": "Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy.", 
        "reply": " Dear billbright, the last portion of your name is a misnomer, IMHO. (note: rapes or incest have nothing to do with my postings below.) Any woman, and I repeat ANY woman, that does not wish to carry a pregnancy to term, is nothing more than an \"egg donor\", in the same as any man that is unwilling to raise and/or support a child that they helped create is a \"sperm donor\" (Do notice the emphasis on 'helped'. In almost all of the abortion cases, it was adult consensual sex.) Both of the persons, who engaged in an adult, consensual, sexual relation that produces a child, have a say about the child's future; and if either one of them wishes to have the child carried to term, it shall be so!! ( My personal opinion is that the child shall be born regardless of their wishes, unless deemed to be a medical safety issue by a team of at least 5 doctors who are experienced in obstetrics.) To argue that last statement is futile! No argument, I repeat, NO argument, has merit against it. No brag...just fact. see -<http://www.imdb.com/Quotes?0061259> These are my opinions. Yours may differ.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 10:56:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "4403771"
    }, 
    {
        "content": "quote: Originally posted by 4403771: quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. Dear billbright, the last portion of your name is a misnomer, IMHO. (note: rapes or incest have nothing to do with my postings below.) [COLOR:BLUE]What a load of self-rightious B.S. Any woman, and I repeat ANY woman, that does not wish to carry a pregnancy to term, is nothing more than an \"egg donor\", in the same as any man that is unwilling to raise and/or support a child that they helped create is a \"sperm donor\" (Do notice the emphasis on 'helped'. In almost all of the abortion cases, it was adult consensual sex.) Both of the persons, who engaged in an adult, consensual, sexual relation that produces a child, have a say about the child's future; and if either one of them wishes to have the child carried to term, it shall be so!! First, the man only \"helps\"/ \"donates\" his spearm... The woman on the other hand gives not only of her eggs but the use of her body for the 7-10 months the fetus(es) are with her. This includes the changes in her body due to the effects of the pregnancy,this can also cause verious problems with her body both during and after the including blood clots, cancer, bleeding. The father /sperm /\"donation\" causes him none of these things. ( My personal opinion is that the child shall be born regardless of their wishes, unless deemed to be a medical safety issue by a team of at least 5 doctors who are experienced in obstetrics.)Gee, why don't you volunteer to carry the fetus if she can't carry it... oh right, your a man. To argue that last statement is futile! No argument, I repeat, NO argument, has merit against it.[/color] Yep, since you're a man, there's no reason that \"you\" find as a good reson for a woman to abort...you would happly force her to carry to term, forcing her to only do the healthy life style, that you feel will create a healthy baby, without reguard of her life, because you feel your vision is the only way for her to live. No brag...just fact. see -<http://www.imdb.com/Quotes?0061259>", 
        "intTime": 20090330, 
        "postID": 24, 
        "quote": "Originally posted by 4403771: quote: Originally posted by billbright: Five very judgmental MEN. Notice how all the commentary was about the woman, and none of it regarded vasectomy. You called her killer, suggesting she should kill her kids. You demean her in her hour of trial. Men have absolutely NO RIGHT to comment about abortion. If men wore a rubber or got a vasectomy every time it made sense to do it, abortion would be no problem. It's a woman's problem, made so by MEN. Self-righteousness doesn't flatter Holy Willy. Dear billbright, the last portion of your name is a misnomer, IMHO. (note: rapes or incest have nothing to do with my postings below.) [COLOR:BLUE]What a load of self-rightious B.S. Any woman, and I repeat ANY woman, that does not wish to carry a pregnancy to term, is nothing more than an \"egg donor\", in the same as any man that is unwilling to raise and/or support a child that they helped create is a \"sperm donor\" (Do notice the emphasis on 'helped'. In almost all of the abortion cases, it was adult consensual sex.) Both of the persons, who engaged in an adult, consensual, sexual relation that produces a child, have a say about the child's future; and if either one of them wishes to have the child carried to term, it shall be so!! First, the man only \"helps\"/ \"donates\" his spearm... The woman on the other hand gives not only of her eggs but the use of her body for the 7-10 months the fetus(es) are with her. This includes the changes in her body due to the effects of the pregnancy,this can also cause verious problems with her body both during and after the including blood clots, cancer, bleeding. The father /sperm /\"donation\" causes him none of these things. ( My personal opinion is that the child shall be born regardless of their wishes, unless deemed to be a medical safety issue by a team of at least 5 doctors who are experienced in obstetrics.)Gee, why don't you volunteer to carry the fetus if she can't carry it... oh right, your a man. To argue that last statement is futile! No argument, I repeat, NO argument, has merit against it.[/color] Yep, since you're a man, there's no reason that \"you\" find as a good reson for a woman to abort...you would happly force her to carry to term, forcing her to only do the healthy life style, that you feel will create a healthy baby, without reguard of her life, because you feel your vision is the only way for her to live. No brag...just fact. see -<http://www.imdb.com/Quotes?0061259>", 
        "reply": "", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 11:55:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: So long as we all understand it's a 2-way street in this matter. That's right. They should probably abort the father's willy. That would make it even... a two way street.", 
        "intTime": 20090330, 
        "postID": 25, 
        "quote": "So long as we all understand it's a 2-way street in this matter.", 
        "reply": " That's right. They should probably abort the father's willy. That would make it even... a two way street.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 14:41:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "billbright"
    }, 
    {
        "content": "quote: Originally posted by billbright: quote: So long as we all understand it's a 2-way street in this matter. That's right. They should probably abort the father's willy. That would make it even... a two way street. and remove the woman's uterus at the same time, that's the two way street.", 
        "intTime": 20090330, 
        "postID": 26, 
        "quote": "Originally posted by billbright: quote: So long as we all understand it's a 2-way street in this matter. That's right. They should probably abort the father's willy. That would make it even... a two way street.", 
        "reply": " and remove the woman's uterus at the same time, that's the two way street.", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 14:46:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "So I'm gathering that the right-wing posters here don't agree that men should take a tad bit more responsibility in their sexual behavior?", 
        "intTime": 20090330, 
        "postID": 27, 
        "quote": "", 
        "reply": "So I'm gathering that the right-wing posters here don't agree that men should take a tad bit more responsibility in their sexual behavior?", 
        "threadID": "409192893_5700052912001", 
        "time": "2009-03-30 14:55:00", 
        "title": "Abortions & Vasectomies on the increase due to economy", 
        "userID": "billbright"
    }
]