[
    {
        "content": "Crusty old CNN coot, Jack Cafferty, recently admitted to having a crush on the new First Lady. I have to agree with him, Michelle Obama IS utterly fascinating... quote: Mrs. Obama has blown away the stale air in a White House musty from eight years of the Bushes. It's like the sun came out and a fresh spring breeze began wafting through the open windows. It's the people's house, and Michelle Obama totally gets it. So much so that she has taken to inviting people in from the streets to see her home. Nice touch -- one completely lacking in her recent predecessors. Watch her when she visits a local school and you see the warmth and affection she instantly triggers in people. Kids are pretty much totally honest with very good BS-detectors. If they sense you're a phony, forget it. But around the first lady, they want to hug her and laugh with her and tell her stories. While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. quote: New to the Washington neighborhood, Michelle Obama has taken it upon herself to go around and introduce herself to the people in the various agencies of government. When's the last time a first lady did that? I don't ever remember it before. And during her visits she listens rather than lectures. And people respond to her. She was raised on the south side of Chicago by blue-collar parents. She went to Princeton University, and Harvard Law School. But in many ways she's still a kid from the south side of Chicago, and that's what makes her special. She knows exactly who she is. \"http://www.cnn.com/2009/POLITICS/03/03/cafferty.first.lady/\" She is shaping up to be one of the best (and best looking) First Ladies we have had to date IMHO.", 
        "intTime": 20090306, 
        "postID": 1, 
        "quote": "Mrs. Obama has blown away the stale air in a White House musty from eight years of the Bushes. It's like the sun came out and a fresh spring breeze began wafting through the open windows. It's the people's house, and Michelle Obama totally gets it. So much so that she has taken to inviting people in from the streets to see her home. Nice touch -- one completely lacking in her recent predecessors. Watch her when she visits a local school and you see the warmth and affection she instantly triggers in people. Kids are pretty much totally honest with very good BS-detectors. If they sense you're a phony, forget it. But around the first lady, they want to hug her and laugh with her and tell her stories.", 
        "reply": "Crusty old CNN coot, Jack Cafferty, recently admitted to having a crush on the new First Lady. I have to agree with him, Michelle Obama IS utterly fascinating...  While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. quote: New to the Washington neighborhood, Michelle Obama has taken it upon herself to go around and introduce herself to the people in the various agencies of government. When's the last time a first lady did that? I don't ever remember it before. And during her visits she listens rather than lectures. And people respond to her. She was raised on the south side of Chicago by blue-collar parents. She went to Princeton University, and Harvard Law School. But in many ways she's still a kid from the south side of Chicago, and that's what makes her special. She knows exactly who she is. \"http://www.cnn.com/2009/POLITICS/03/03/cafferty.first.lady/\" She is shaping up to be one of the best (and best looking) First Ladies we have had to date IMHO.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:39:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "intTime": 20090306, 
        "postID": 2, 
        "quote": "While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband.", 
        "reply": " How many \"moveon miles\" do you get for posting that around the web?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:44:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I really like Michelle. She has a lot of class and... I just get the feeling of sincerity when I compare her words, tone and inflection to that of her body language, posturing and expressions. I read people pretty well usually, and while I am no fan of her husband, I do have to agree that she is a class act. Charming is the word I would use. And yes, she's quite attractive and alluring. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 3, 
        "quote": "", 
        "reply": "I really like Michelle. She has a lot of class and... I just get the feeling of sincerity when I compare her words, tone and inflection to that of her body language, posturing and expressions. I read people pretty well usually, and while I am no fan of her husband, I do have to agree that she is a class act. Charming is the word I would use. And yes, she's quite attractive and alluring. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:46:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web? \"Moveon miles...\" OK, I don't care who you are, that is f-ing funny! Thanks for the morning giggle, bro! I'll put it to good use and make someone else smile today. I seriously almost spit out my coffee. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 4, 
        "quote": "Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": " \"Moveon miles...\" OK, I don't care who you are, that is f-ing funny! Thanks for the morning giggle, bro! I'll put it to good use and make someone else smile today. I seriously almost spit out my coffee. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:49:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "intTime": 20090306, 
        "postID": 5, 
        "quote": "Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": "", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:51:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Thanks for the morning giggle, bro! Glad I could help. I got mine too this morning on the BO birth certificate thread. DHD posted some ridiculous copy, my abs hurt. It's Friday! WooHoo!!!", 
        "intTime": 20090306, 
        "postID": 6, 
        "quote": "Thanks for the morning giggle, bro!", 
        "reply": " Glad I could help. I got mine too this morning on the BO birth certificate thread. DHD posted some ridiculous copy, my abs hurt. It's Friday! WooHoo!!!", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:54:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point?", 
        "intTime": 20090306, 
        "postID": 7, 
        "quote": "SeaWitch1220", 
        "reply": " What? It was a legitimate question. Besides what's the point?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:55:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web? Moveon.org is the reference. He was using levity to espouse that liberals -- you -- are encouraged to run from site to site praising Barack Obama like frequent flier miles. It was just a little poke in the ribs. No need to be upset - it is WAY, WAY, WAY too beautiful of a day! Speaking of that, how the hell are you, SW? Been a while since we chatted. Did WP tell you that she converted me to universal health care? I have betrayed my conservative party But it just too magnificent of a day to worry about that! God, it is just absolutely beautiful outside, like the first morning of spring. No one can experience a morning like this and not be convinced of a loving God up there, somewhere, giving a hefty thumbs up at His artwork. Have a GREAT day, SW! <hugs> It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 8, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": " Moveon.org is the reference. He was using levity to espouse that liberals -- you -- are encouraged to run from site to site praising Barack Obama like frequent flier miles. It was just a little poke in the ribs. No need to be upset - it is WAY, WAY, WAY too beautiful of a day! Speaking of that, how the hell are you, SW? Been a while since we chatted. Did WP tell you that she converted me to universal health care? I have betrayed my conservative party But it just too magnificent of a day to worry about that! God, it is just absolutely beautiful outside, like the first morning of spring. No one can experience a morning like this and not be convinced of a loving God up there, somewhere, giving a hefty thumbs up at His artwork. Have a GREAT day, SW! <hugs> It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:59:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point? Hardly a \"legitimate question\". Personally I've never been to moveon or DU. Been to the Daily Kos a time or two to read an article and frequent the Huffington Post regularly. If you can't see the \"point\", why did you post?", 
        "intTime": 20090306, 
        "postID": 9, 
        "quote": "Originally posted by soscorpio: quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point?", 
        "reply": " Hardly a \"legitimate question\". Personally I've never been to moveon or DU. Been to the Daily Kos a time or two to read an article and frequent the Huffington Post regularly. If you can't see the \"point\", why did you post?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 06:00:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "A face only a lesbian could love.", 
        "intTime": 20090306, 
        "postID": 10, 
        "quote": "", 
        "reply": "A face only a lesbian could love.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 06:04:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "HEY! Seawitch and I actually agree on something!!!! Michelle is a MILF", 
        "intTime": 20090306, 
        "postID": 11, 
        "quote": "", 
        "reply": "HEY! Seawitch and I actually agree on something!!!! Michelle is a MILF", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:10:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "Originally posted by GunnyRet03: A face only a lesbian could love.", 
        "reply": " Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:38:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it. I'll take boortz and tammy bruce over rush anyday", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "reply": " When you pull your head out of a certain persons azz I might take you up on it. I'll take boortz and tammy bruce over rush anyday", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:47:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 14, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "reply": " Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:47:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) Maybe you and PD can stand around a pic of her and have your way. Friday indeed....", 
        "intTime": 20090306, 
        "postID": 15, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!)", 
        "reply": " Maybe you and PD can stand around a pic of her and have your way. Friday indeed....", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:54:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: I'll take boortz and tammy bruce over rush anyday Yep, I don't think rush is even a conservative. It makes sense to attack him, in a snide way, they are endorsing him.", 
        "intTime": 20090306, 
        "postID": 16, 
        "quote": "I'll take boortz and tammy bruce over rush anyday", 
        "reply": " Yep, I don't think rush is even a conservative. It makes sense to attack him, in a snide way, they are endorsing him.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:58:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Just another orchestrated diversion from the issues of the economy, nation debt, out of control spending, and ineffective government.", 
        "intTime": 20090306, 
        "postID": 17, 
        "quote": "", 
        "reply": "Just another orchestrated diversion from the issues of the economy, nation debt, out of control spending, and ineffective government.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:03:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "intTime": 20090306, 
        "postID": 18, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!)", 
        "reply": " I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:26:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that.", 
        "intTime": 20090306, 
        "postID": 19, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "reply": " At least it's not Pudweiser, I will give you that.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:27:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that. Budweiser? That's for college kids.", 
        "intTime": 20090306, 
        "postID": 20, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that.", 
        "reply": " Budweiser? That's for college kids.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:30:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Reminds me of a bad Haloween party I went too...Stoly shooters and beer chasers...with roasted pumkin seeds as snacks", 
        "intTime": 20090306, 
        "postID": 21, 
        "quote": "", 
        "reply": "Reminds me of a bad Haloween party I went too...Stoly shooters and beer chasers...with roasted pumkin seeds as snacks", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:32:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Budweiser? That's for college kids. Not a typo 'P' thats for people who really dont like beer.", 
        "intTime": 20090306, 
        "postID": 22, 
        "quote": "Budweiser? That's for college kids.", 
        "reply": " Not a typo 'P' thats for people who really dont like beer.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:33:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "intTime": 20090306, 
        "postID": 23, 
        "quote": "", 
        "reply": "Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:39:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together. All I have to say is he better not leave his beer unattended, it may get rimmed.", 
        "intTime": 20090306, 
        "postID": 24, 
        "quote": "Originally posted by navy8086: Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "reply": " All I have to say is he better not leave his beer unattended, it may get rimmed.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:46:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Don't be silly. PD would NEVER cheat on his favorite sheep! Sheesh. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 25, 
        "quote": "", 
        "reply": "Don't be silly. PD would NEVER cheat on his favorite sheep! Sheesh. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:51:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "intTime": 20090306, 
        "postID": 26, 
        "quote": "", 
        "reply": "I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:11:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "DocTrowerFMF"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it. LOL! Fat chance! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090306, 
        "postID": 27, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it.", 
        "reply": " LOL! Fat chance! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:15:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "intTime": 20090306, 
        "postID": 28, 
        "quote": "", 
        "reply": "I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:18:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!) She could give Jay Leno chin envy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090306, 
        "postID": 29, 
        "quote": "Originally posted by 1WW: I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "reply": " She could give Jay Leno chin envy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:57:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by DocTrowerFMF: I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either. Put a bag over the face and the rest is useable ...", 
        "intTime": 20090306, 
        "postID": 30, 
        "quote": "Originally posted by DocTrowerFMF: I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "reply": " Put a bag over the face and the rest is useable ...", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 10:01:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }, 
    {
        "content": "Crusty old CNN coot, Jack Cafferty, recently admitted to having a crush on the new First Lady. I have to agree with him, Michelle Obama IS utterly fascinating... quote: Mrs. Obama has blown away the stale air in a White House musty from eight years of the Bushes. It's like the sun came out and a fresh spring breeze began wafting through the open windows. It's the people's house, and Michelle Obama totally gets it. So much so that she has taken to inviting people in from the streets to see her home. Nice touch -- one completely lacking in her recent predecessors. Watch her when she visits a local school and you see the warmth and affection she instantly triggers in people. Kids are pretty much totally honest with very good BS-detectors. If they sense you're a phony, forget it. But around the first lady, they want to hug her and laugh with her and tell her stories. While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. quote: New to the Washington neighborhood, Michelle Obama has taken it upon herself to go around and introduce herself to the people in the various agencies of government. When's the last time a first lady did that? I don't ever remember it before. And during her visits she listens rather than lectures. And people respond to her. She was raised on the south side of Chicago by blue-collar parents. She went to Princeton University, and Harvard Law School. But in many ways she's still a kid from the south side of Chicago, and that's what makes her special. She knows exactly who she is. \"http://www.cnn.com/2009/POLITICS/03/03/cafferty.first.lady/\" She is shaping up to be one of the best (and best looking) First Ladies we have had to date IMHO.", 
        "intTime": 20090306, 
        "postID": 31, 
        "quote": "Mrs. Obama has blown away the stale air in a White House musty from eight years of the Bushes. It's like the sun came out and a fresh spring breeze began wafting through the open windows. It's the people's house, and Michelle Obama totally gets it. So much so that she has taken to inviting people in from the streets to see her home. Nice touch -- one completely lacking in her recent predecessors. Watch her when she visits a local school and you see the warmth and affection she instantly triggers in people. Kids are pretty much totally honest with very good BS-detectors. If they sense you're a phony, forget it. But around the first lady, they want to hug her and laugh with her and tell her stories.", 
        "reply": "Crusty old CNN coot, Jack Cafferty, recently admitted to having a crush on the new First Lady. I have to agree with him, Michelle Obama IS utterly fascinating...  While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. quote: New to the Washington neighborhood, Michelle Obama has taken it upon herself to go around and introduce herself to the people in the various agencies of government. When's the last time a first lady did that? I don't ever remember it before. And during her visits she listens rather than lectures. And people respond to her. She was raised on the south side of Chicago by blue-collar parents. She went to Princeton University, and Harvard Law School. But in many ways she's still a kid from the south side of Chicago, and that's what makes her special. She knows exactly who she is. \"http://www.cnn.com/2009/POLITICS/03/03/cafferty.first.lady/\" She is shaping up to be one of the best (and best looking) First Ladies we have had to date IMHO.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:39:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "intTime": 20090306, 
        "postID": 32, 
        "quote": "While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband.", 
        "reply": " How many \"moveon miles\" do you get for posting that around the web?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:44:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I really like Michelle. She has a lot of class and... I just get the feeling of sincerity when I compare her words, tone and inflection to that of her body language, posturing and expressions. I read people pretty well usually, and while I am no fan of her husband, I do have to agree that she is a class act. Charming is the word I would use. And yes, she's quite attractive and alluring. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 33, 
        "quote": "", 
        "reply": "I really like Michelle. She has a lot of class and... I just get the feeling of sincerity when I compare her words, tone and inflection to that of her body language, posturing and expressions. I read people pretty well usually, and while I am no fan of her husband, I do have to agree that she is a class act. Charming is the word I would use. And yes, she's quite attractive and alluring. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:46:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web? \"Moveon miles...\" OK, I don't care who you are, that is f-ing funny! Thanks for the morning giggle, bro! I'll put it to good use and make someone else smile today. I seriously almost spit out my coffee. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 34, 
        "quote": "Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": " \"Moveon miles...\" OK, I don't care who you are, that is f-ing funny! Thanks for the morning giggle, bro! I'll put it to good use and make someone else smile today. I seriously almost spit out my coffee. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:49:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "intTime": 20090306, 
        "postID": 35, 
        "quote": "Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": "", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:51:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Thanks for the morning giggle, bro! Glad I could help. I got mine too this morning on the BO birth certificate thread. DHD posted some ridiculous copy, my abs hurt. It's Friday! WooHoo!!!", 
        "intTime": 20090306, 
        "postID": 36, 
        "quote": "Thanks for the morning giggle, bro!", 
        "reply": " Glad I could help. I got mine too this morning on the BO birth certificate thread. DHD posted some ridiculous copy, my abs hurt. It's Friday! WooHoo!!!", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:54:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point?", 
        "intTime": 20090306, 
        "postID": 37, 
        "quote": "SeaWitch1220", 
        "reply": " What? It was a legitimate question. Besides what's the point?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:55:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web? Moveon.org is the reference. He was using levity to espouse that liberals -- you -- are encouraged to run from site to site praising Barack Obama like frequent flier miles. It was just a little poke in the ribs. No need to be upset - it is WAY, WAY, WAY too beautiful of a day! Speaking of that, how the hell are you, SW? Been a while since we chatted. Did WP tell you that she converted me to universal health care? I have betrayed my conservative party But it just too magnificent of a day to worry about that! God, it is just absolutely beautiful outside, like the first morning of spring. No one can experience a morning like this and not be convinced of a loving God up there, somewhere, giving a hefty thumbs up at His artwork. Have a GREAT day, SW! <hugs> It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 38, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": " Moveon.org is the reference. He was using levity to espouse that liberals -- you -- are encouraged to run from site to site praising Barack Obama like frequent flier miles. It was just a little poke in the ribs. No need to be upset - it is WAY, WAY, WAY too beautiful of a day! Speaking of that, how the hell are you, SW? Been a while since we chatted. Did WP tell you that she converted me to universal health care? I have betrayed my conservative party But it just too magnificent of a day to worry about that! God, it is just absolutely beautiful outside, like the first morning of spring. No one can experience a morning like this and not be convinced of a loving God up there, somewhere, giving a hefty thumbs up at His artwork. Have a GREAT day, SW! <hugs> It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:59:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point? Hardly a \"legitimate question\". Personally I've never been to moveon or DU. Been to the Daily Kos a time or two to read an article and frequent the Huffington Post regularly. If you can't see the \"point\", why did you post?", 
        "intTime": 20090306, 
        "postID": 39, 
        "quote": "Originally posted by soscorpio: quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point?", 
        "reply": " Hardly a \"legitimate question\". Personally I've never been to moveon or DU. Been to the Daily Kos a time or two to read an article and frequent the Huffington Post regularly. If you can't see the \"point\", why did you post?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 06:00:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "A face only a lesbian could love.", 
        "intTime": 20090306, 
        "postID": 40, 
        "quote": "", 
        "reply": "A face only a lesbian could love.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 06:04:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "HEY! Seawitch and I actually agree on something!!!! Michelle is a MILF", 
        "intTime": 20090306, 
        "postID": 41, 
        "quote": "", 
        "reply": "HEY! Seawitch and I actually agree on something!!!! Michelle is a MILF", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:10:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "intTime": 20090306, 
        "postID": 42, 
        "quote": "Originally posted by GunnyRet03: A face only a lesbian could love.", 
        "reply": " Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:38:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it. I'll take boortz and tammy bruce over rush anyday", 
        "intTime": 20090306, 
        "postID": 43, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "reply": " When you pull your head out of a certain persons azz I might take you up on it. I'll take boortz and tammy bruce over rush anyday", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:47:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 44, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "reply": " Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:47:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) Maybe you and PD can stand around a pic of her and have your way. Friday indeed....", 
        "intTime": 20090306, 
        "postID": 45, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!)", 
        "reply": " Maybe you and PD can stand around a pic of her and have your way. Friday indeed....", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:54:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: I'll take boortz and tammy bruce over rush anyday Yep, I don't think rush is even a conservative. It makes sense to attack him, in a snide way, they are endorsing him.", 
        "intTime": 20090306, 
        "postID": 46, 
        "quote": "I'll take boortz and tammy bruce over rush anyday", 
        "reply": " Yep, I don't think rush is even a conservative. It makes sense to attack him, in a snide way, they are endorsing him.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:58:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Just another orchestrated diversion from the issues of the economy, nation debt, out of control spending, and ineffective government.", 
        "intTime": 20090306, 
        "postID": 47, 
        "quote": "", 
        "reply": "Just another orchestrated diversion from the issues of the economy, nation debt, out of control spending, and ineffective government.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:03:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "intTime": 20090306, 
        "postID": 48, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!)", 
        "reply": " I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:26:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that.", 
        "intTime": 20090306, 
        "postID": 49, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "reply": " At least it's not Pudweiser, I will give you that.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:27:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that. Budweiser? That's for college kids.", 
        "intTime": 20090306, 
        "postID": 50, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that.", 
        "reply": " Budweiser? That's for college kids.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:30:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Reminds me of a bad Haloween party I went too...Stoly shooters and beer chasers...with roasted pumkin seeds as snacks", 
        "intTime": 20090306, 
        "postID": 51, 
        "quote": "", 
        "reply": "Reminds me of a bad Haloween party I went too...Stoly shooters and beer chasers...with roasted pumkin seeds as snacks", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:32:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Budweiser? That's for college kids. Not a typo 'P' thats for people who really dont like beer.", 
        "intTime": 20090306, 
        "postID": 52, 
        "quote": "Budweiser? That's for college kids.", 
        "reply": " Not a typo 'P' thats for people who really dont like beer.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:33:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "intTime": 20090306, 
        "postID": 53, 
        "quote": "", 
        "reply": "Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:39:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together. All I have to say is he better not leave his beer unattended, it may get rimmed.", 
        "intTime": 20090306, 
        "postID": 54, 
        "quote": "Originally posted by navy8086: Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "reply": " All I have to say is he better not leave his beer unattended, it may get rimmed.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:46:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Don't be silly. PD would NEVER cheat on his favorite sheep! Sheesh. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 55, 
        "quote": "", 
        "reply": "Don't be silly. PD would NEVER cheat on his favorite sheep! Sheesh. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:51:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "intTime": 20090306, 
        "postID": 56, 
        "quote": "", 
        "reply": "I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:11:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "DocTrowerFMF"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it. LOL! Fat chance! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090306, 
        "postID": 57, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it.", 
        "reply": " LOL! Fat chance! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:15:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "intTime": 20090306, 
        "postID": 58, 
        "quote": "", 
        "reply": "I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:18:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!) She could give Jay Leno chin envy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090306, 
        "postID": 59, 
        "quote": "Originally posted by 1WW: I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "reply": " She could give Jay Leno chin envy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:57:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by DocTrowerFMF: I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either. Put a bag over the face and the rest is useable ...", 
        "intTime": 20090306, 
        "postID": 60, 
        "quote": "Originally posted by DocTrowerFMF: I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "reply": " Put a bag over the face and the rest is useable ...", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 10:01:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }, 
    {
        "content": "Crusty old CNN coot, Jack Cafferty, recently admitted to having a crush on the new First Lady. I have to agree with him, Michelle Obama IS utterly fascinating... quote: Mrs. Obama has blown away the stale air in a White House musty from eight years of the Bushes. It's like the sun came out and a fresh spring breeze began wafting through the open windows. It's the people's house, and Michelle Obama totally gets it. So much so that she has taken to inviting people in from the streets to see her home. Nice touch -- one completely lacking in her recent predecessors. Watch her when she visits a local school and you see the warmth and affection she instantly triggers in people. Kids are pretty much totally honest with very good BS-detectors. If they sense you're a phony, forget it. But around the first lady, they want to hug her and laugh with her and tell her stories. While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. quote: New to the Washington neighborhood, Michelle Obama has taken it upon herself to go around and introduce herself to the people in the various agencies of government. When's the last time a first lady did that? I don't ever remember it before. And during her visits she listens rather than lectures. And people respond to her. She was raised on the south side of Chicago by blue-collar parents. She went to Princeton University, and Harvard Law School. But in many ways she's still a kid from the south side of Chicago, and that's what makes her special. She knows exactly who she is. \"http://www.cnn.com/2009/POLITICS/03/03/cafferty.first.lady/\" She is shaping up to be one of the best (and best looking) First Ladies we have had to date IMHO.", 
        "intTime": 20090306, 
        "postID": 61, 
        "quote": "Mrs. Obama has blown away the stale air in a White House musty from eight years of the Bushes. It's like the sun came out and a fresh spring breeze began wafting through the open windows. It's the people's house, and Michelle Obama totally gets it. So much so that she has taken to inviting people in from the streets to see her home. Nice touch -- one completely lacking in her recent predecessors. Watch her when she visits a local school and you see the warmth and affection she instantly triggers in people. Kids are pretty much totally honest with very good BS-detectors. If they sense you're a phony, forget it. But around the first lady, they want to hug her and laugh with her and tell her stories.", 
        "reply": "Crusty old CNN coot, Jack Cafferty, recently admitted to having a crush on the new First Lady. I have to agree with him, Michelle Obama IS utterly fascinating...  While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. quote: New to the Washington neighborhood, Michelle Obama has taken it upon herself to go around and introduce herself to the people in the various agencies of government. When's the last time a first lady did that? I don't ever remember it before. And during her visits she listens rather than lectures. And people respond to her. She was raised on the south side of Chicago by blue-collar parents. She went to Princeton University, and Harvard Law School. But in many ways she's still a kid from the south side of Chicago, and that's what makes her special. She knows exactly who she is. \"http://www.cnn.com/2009/POLITICS/03/03/cafferty.first.lady/\" She is shaping up to be one of the best (and best looking) First Ladies we have had to date IMHO.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:39:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "intTime": 20090306, 
        "postID": 62, 
        "quote": "While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband.", 
        "reply": " How many \"moveon miles\" do you get for posting that around the web?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:44:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "I really like Michelle. She has a lot of class and... I just get the feeling of sincerity when I compare her words, tone and inflection to that of her body language, posturing and expressions. I read people pretty well usually, and while I am no fan of her husband, I do have to agree that she is a class act. Charming is the word I would use. And yes, she's quite attractive and alluring. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 63, 
        "quote": "", 
        "reply": "I really like Michelle. She has a lot of class and... I just get the feeling of sincerity when I compare her words, tone and inflection to that of her body language, posturing and expressions. I read people pretty well usually, and while I am no fan of her husband, I do have to agree that she is a class act. Charming is the word I would use. And yes, she's quite attractive and alluring. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:46:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web? \"Moveon miles...\" OK, I don't care who you are, that is f-ing funny! Thanks for the morning giggle, bro! I'll put it to good use and make someone else smile today. I seriously almost spit out my coffee. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 64, 
        "quote": "Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": " \"Moveon miles...\" OK, I don't care who you are, that is f-ing funny! Thanks for the morning giggle, bro! I'll put it to good use and make someone else smile today. I seriously almost spit out my coffee. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:49:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "intTime": 20090306, 
        "postID": 65, 
        "quote": "Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": "", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:51:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Thanks for the morning giggle, bro! Glad I could help. I got mine too this morning on the BO birth certificate thread. DHD posted some ridiculous copy, my abs hurt. It's Friday! WooHoo!!!", 
        "intTime": 20090306, 
        "postID": 66, 
        "quote": "Thanks for the morning giggle, bro!", 
        "reply": " Glad I could help. I got mine too this morning on the BO birth certificate thread. DHD posted some ridiculous copy, my abs hurt. It's Friday! WooHoo!!!", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:54:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point?", 
        "intTime": 20090306, 
        "postID": 67, 
        "quote": "SeaWitch1220", 
        "reply": " What? It was a legitimate question. Besides what's the point?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:55:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web? Moveon.org is the reference. He was using levity to espouse that liberals -- you -- are encouraged to run from site to site praising Barack Obama like frequent flier miles. It was just a little poke in the ribs. No need to be upset - it is WAY, WAY, WAY too beautiful of a day! Speaking of that, how the hell are you, SW? Been a while since we chatted. Did WP tell you that she converted me to universal health care? I have betrayed my conservative party But it just too magnificent of a day to worry about that! God, it is just absolutely beautiful outside, like the first morning of spring. No one can experience a morning like this and not be convinced of a loving God up there, somewhere, giving a hefty thumbs up at His artwork. Have a GREAT day, SW! <hugs> It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 68, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by soscorpio: quote: While she seems friendly and down to earth, she is also very smart and politically savvy just like her husband. How many \"moveon miles\" do you get for posting that around the web?", 
        "reply": " Moveon.org is the reference. He was using levity to espouse that liberals -- you -- are encouraged to run from site to site praising Barack Obama like frequent flier miles. It was just a little poke in the ribs. No need to be upset - it is WAY, WAY, WAY too beautiful of a day! Speaking of that, how the hell are you, SW? Been a while since we chatted. Did WP tell you that she converted me to universal health care? I have betrayed my conservative party But it just too magnificent of a day to worry about that! God, it is just absolutely beautiful outside, like the first morning of spring. No one can experience a morning like this and not be convinced of a loving God up there, somewhere, giving a hefty thumbs up at His artwork. Have a GREAT day, SW! <hugs> It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 05:59:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point? Hardly a \"legitimate question\". Personally I've never been to moveon or DU. Been to the Daily Kos a time or two to read an article and frequent the Huffington Post regularly. If you can't see the \"point\", why did you post?", 
        "intTime": 20090306, 
        "postID": 69, 
        "quote": "Originally posted by soscorpio: quote: SeaWitch1220 What? It was a legitimate question. Besides what's the point?", 
        "reply": " Hardly a \"legitimate question\". Personally I've never been to moveon or DU. Been to the Daily Kos a time or two to read an article and frequent the Huffington Post regularly. If you can't see the \"point\", why did you post?", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 06:00:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "A face only a lesbian could love.", 
        "intTime": 20090306, 
        "postID": 70, 
        "quote": "", 
        "reply": "A face only a lesbian could love.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 06:04:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "HEY! Seawitch and I actually agree on something!!!! Michelle is a MILF", 
        "intTime": 20090306, 
        "postID": 71, 
        "quote": "", 
        "reply": "HEY! Seawitch and I actually agree on something!!!! Michelle is a MILF", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:10:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "intTime": 20090306, 
        "postID": 72, 
        "quote": "Originally posted by GunnyRet03: A face only a lesbian could love.", 
        "reply": " Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:38:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it. I'll take boortz and tammy bruce over rush anyday", 
        "intTime": 20090306, 
        "postID": 73, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "reply": " When you pull your head out of a certain persons azz I might take you up on it. I'll take boortz and tammy bruce over rush anyday", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:47:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 74, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks", 
        "reply": " Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:47:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) Maybe you and PD can stand around a pic of her and have your way. Friday indeed....", 
        "intTime": 20090306, 
        "postID": 75, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!)", 
        "reply": " Maybe you and PD can stand around a pic of her and have your way. Friday indeed....", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:54:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: I'll take boortz and tammy bruce over rush anyday Yep, I don't think rush is even a conservative. It makes sense to attack him, in a snide way, they are endorsing him.", 
        "intTime": 20090306, 
        "postID": 76, 
        "quote": "I'll take boortz and tammy bruce over rush anyday", 
        "reply": " Yep, I don't think rush is even a conservative. It makes sense to attack him, in a snide way, they are endorsing him.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 07:58:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Just another orchestrated diversion from the issues of the economy, nation debt, out of control spending, and ineffective government.", 
        "intTime": 20090306, 
        "postID": 77, 
        "quote": "", 
        "reply": "Just another orchestrated diversion from the issues of the economy, nation debt, out of control spending, and ineffective government.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:03:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "intTime": 20090306, 
        "postID": 78, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!)", 
        "reply": " I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:26:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that.", 
        "intTime": 20090306, 
        "postID": 79, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone", 
        "reply": " At least it's not Pudweiser, I will give you that.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:27:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that. Budweiser? That's for college kids.", 
        "intTime": 20090306, 
        "postID": 80, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by FollowMeInfantry: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks Hey. HEY! I'm in Texas now. Where's MY f-ing longnecks, ya cheap b@st@rd? (It's FRIDAY!) I have a couple six packs of Dos Equis in the fridge nice and cold, just come on down to San Antone At least it's not Pudweiser, I will give you that.", 
        "reply": " Budweiser? That's for college kids.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:30:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Reminds me of a bad Haloween party I went too...Stoly shooters and beer chasers...with roasted pumkin seeds as snacks", 
        "intTime": 20090306, 
        "postID": 81, 
        "quote": "", 
        "reply": "Reminds me of a bad Haloween party I went too...Stoly shooters and beer chasers...with roasted pumkin seeds as snacks", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:32:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Budweiser? That's for college kids. Not a typo 'P' thats for people who really dont like beer.", 
        "intTime": 20090306, 
        "postID": 82, 
        "quote": "Budweiser? That's for college kids.", 
        "reply": " Not a typo 'P' thats for people who really dont like beer.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:33:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "intTime": 20090306, 
        "postID": 83, 
        "quote": "", 
        "reply": "Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:39:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together. All I have to say is he better not leave his beer unattended, it may get rimmed.", 
        "intTime": 20090306, 
        "postID": 84, 
        "quote": "Originally posted by navy8086: Nice how this thread has become a \"date line\". Gunny, I hope you and PD are very happy together.", 
        "reply": " All I have to say is he better not leave his beer unattended, it may get rimmed.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:46:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Don't be silly. PD would NEVER cheat on his favorite sheep! Sheesh. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090306, 
        "postID": 85, 
        "quote": "", 
        "reply": "Don't be silly. PD would NEVER cheat on his favorite sheep! Sheesh. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 08:51:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "intTime": 20090306, 
        "postID": 86, 
        "quote": "", 
        "reply": "I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:11:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "DocTrowerFMF"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it. LOL! Fat chance! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090306, 
        "postID": 87, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by PhoenixDark: quote: Originally posted by GunnyRet03: A face only a lesbian could love. Now Gunny, we didn't need to see the womenfolk's reaction to your approach Work on that sentence some more Just kiddin' - tell ya what, if ya ever get up off your knees there at the Altar of Rush and make it down to Texas, I'll buy ya a couple cold Longnecks When you pull your head out of a certain persons azz I might take you up on it.", 
        "reply": " LOL! Fat chance! \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:15:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "intTime": 20090306, 
        "postID": 88, 
        "quote": "", 
        "reply": "I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:18:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!) She could give Jay Leno chin envy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090306, 
        "postID": 89, 
        "quote": "Originally posted by 1WW: I admire the First Lady very much. She's intelligent, classy, and just a great partner for the president. When they're together, I have a sense that they're very much in love with each other. She's on the cover of the current issue of \"Vogue\" (my favorite magazine!)", 
        "reply": " She could give Jay Leno chin envy. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 09:57:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by DocTrowerFMF: I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either. Put a bag over the face and the rest is useable ...", 
        "intTime": 20090306, 
        "postID": 90, 
        "quote": "Originally posted by DocTrowerFMF: I don't know, I don't get the fascination with the Obama woman.. Yes, she is in great shape and appears to have a nice body, although I do not believe any of us have seen her nekid. That being said, to me, she looks like a chipmunk with it's cheeks crammed full of chipmunk food. Call me (very) Shallow Hal, but her jaw structure is hideous. I must learn how to post a picture on here so that I can show people what a beautiful woman looks like. (My GF) I may be a bit biased regarding her looks, but it's no lie. With Mrs. Obama, it's not a \"color\" thing or a \"party\" thing. It's a \"face\" thing. But, like they say, \"Everyone has an opinion...\" Also, there is no accounting for taste on these threads either.", 
        "reply": " Put a bag over the face and the rest is useable ...", 
        "threadID": "409192893_2230080712001", 
        "time": "2009-03-06 10:01:00", 
        "title": "I'm Smitten Too!!!!", 
        "userID": "navy8086"
    }
]