[
    {
        "content": "Biden and Unions Bosses biitching about CEO's while they sit at a resort sipping martinis and plotting unions takeover of America at taxpayers expense....What a surprise Biden Says Stimulus Is Aimed at Boosting Union Jobs Friday, March 06, 2009 By Susan Jones, Senior Editor 'http://www.cnsnews.com/public/content/article.aspx?RsrcID=44621' (CNSNews.com) - Vice President Joe Biden, expressing his solidarity with organized labor, told the AFL-CIO Executive Committee on Thursday that \"rebuilding our broken economy gives us the opportunity to get it right and reward workers.\" Union workers. “We're going to make sure that in every policy, every decision, we don't lose sight of the folks that brought us to the dance,” he said -- a reference to organized labor’s support of the Obama-Biden ticket. “And toward that end, we have to make sure that the jobs we're creating come with fair wages and decent benefits.” Biden told the union executives at the five-star Fontainebleau Hotel in Miami that \"economic injustice and inequity are bad for everyone. It's just not right and everybody knows it -- it's just not right when the average CEO makes $10,000 more every day...than what the average worker makes every year.” he said. The vice president noted that the administration is determined to see that taxpayer dollars \"go to something other than union-busting activities.” He mentioned the stimulus package, which will funnel taxpayer dollars to union jobs: \"The focus of this administration the first month has been to rebuild American roads, bridges, waterways -- jobs for the building trades union. Investing and getting more people access to broadband -- communication workers. Creating clean energy economy -- jobs that require electrical workers to modernize the grid, steel workers to go out and build the wind turbines, laborers to install the solar panels. Making our communities safer, jobs that require getting cops on the beat and keeping firefighters in firehouses. That's what we're trying to do.\" He also mentioned investment in schools (teachers unions). <edit> According to Biden, the nation's policy -- as expressed in the National Labor Relations Act -- is to \"encourage collective bargaining, encourage unions.\" He said it's not enough for corporations and government to \"tolerate\" workers forming unions -- \"after using every trick in the book\" to block them. Biden reassured labor leaders that he and President Barack Obama agree, \"You can't have a strong middle class without a strong labor movement.\" And Biden repeated that he and Obama will judge the success or failure of their administration on whether the middle class standard of living has increased during their first term. Biden described teachers, police officers, firefighters, hospital workers and factory workers are the \"nation's heart and soul.\" And while bankers and financiers are \"necessary,\" \"they are not the spine of the system,\" he said. Biden says the middle class has been \"slipping\" in recent years because the “social contract” is out of balance. When productivity goes up, the people responsible for that productivity are supposed to benefit. That’s the “deal,” he said: “We don't want chief executives and wealthy people not to get wealthy. That's okay by us. Every one of us hope our kids end up there some day.” But Biden said the deal involves workers getting a piece of the higher profits generated by their labor: “While a company’s management may come up with a good idea, workers “help make it happen…we do things faster and better and cheaper for you so the profit margin increases -- the deal was we get a piece of that. We get a piece of it -- a fair piece. That's the bargain.” Biden added that workers who helped boost productivity in recent years have seen the value of their incomes drop. \"For too long the middle class has been dealt out. I'm here to tell you in this administration it is dealt in. It is the first card on the table.\" <edit> In a plug for the Employee Free Choice Act, Biden said the unions aren't asking for anything they don't deserve: \"We just want to level this playing field again.\" The Employee Free Choice Act, also known as the card-check bill, would require the government to certify a union after 51 percent of workers have openly signed a card saying they want to unionize. The measure would effectively eliminate secret ballot union elections, critics warn. \"I have a simple, basic belief, one that we're going to work hard to put into action: If a union is what you want, a union you're entitled to have,\" Biden said. Biden told the AFL-CIO there is no such thing as an \"inherently good job.\" \"They become good jobs when workers have an opportunity to insist that they get paid a fair wage, they get treated fairly, and they will benefit from the productivity that results from that industry. The union movement made them good jobs.\" Although it’s going to be a “rough year,” Biden says he’s optimistic: “I think we've got a ladder long enough, and I think when we climb out of this hole, if we do this right, it's going to be -- we climb onto a platform that's clearer, sturdier, better, more competitive for America, and put us in a position where we're able to do in the 21st century what we did in the 20th century. Our job in the meantime is to get as many people on that ladder as we can.” Biden said there’s a good chance of returning to the days of gainful employment and “the bargain” that lifts workers: “We got a shot like we haven't had for the last 30 years,” he said. Cameras were not allowed to cover Biden's speech, but his office released a transcript of his remarks.", 
        "intTime": 20090309, 
        "postID": 1, 
        "quote": "", 
        "reply": "Biden and Unions Bosses biitching about CEO's while they sit at a resort sipping martinis and plotting unions takeover of America at taxpayers expense....What a surprise Biden Says Stimulus Is Aimed at Boosting Union Jobs Friday, March 06, 2009 By Susan Jones, Senior Editor 'http://www.cnsnews.com/public/content/article.aspx?RsrcID=44621' (CNSNews.com) - Vice President Joe Biden, expressing his solidarity with organized labor, told the AFL-CIO Executive Committee on Thursday that \"rebuilding our broken economy gives us the opportunity to get it right and reward workers.\" Union workers. “We're going to make sure that in every policy, every decision, we don't lose sight of the folks that brought us to the dance,” he said -- a reference to organized labor’s support of the Obama-Biden ticket. “And toward that end, we have to make sure that the jobs we're creating come with fair wages and decent benefits.” Biden told the union executives at the five-star Fontainebleau Hotel in Miami that \"economic injustice and inequity are bad for everyone. It's just not right and everybody knows it -- it's just not right when the average CEO makes $10,000 more every day...than what the average worker makes every year.” he said. The vice president noted that the administration is determined to see that taxpayer dollars \"go to something other than union-busting activities.” He mentioned the stimulus package, which will funnel taxpayer dollars to union jobs: \"The focus of this administration the first month has been to rebuild American roads, bridges, waterways -- jobs for the building trades union. Investing and getting more people access to broadband -- communication workers. Creating clean energy economy -- jobs that require electrical workers to modernize the grid, steel workers to go out and build the wind turbines, laborers to install the solar panels. Making our communities safer, jobs that require getting cops on the beat and keeping firefighters in firehouses. That's what we're trying to do.\" He also mentioned investment in schools (teachers unions). <edit> According to Biden, the nation's policy -- as expressed in the National Labor Relations Act -- is to \"encourage collective bargaining, encourage unions.\" He said it's not enough for corporations and government to \"tolerate\" workers forming unions -- \"after using every trick in the book\" to block them. Biden reassured labor leaders that he and President Barack Obama agree, \"You can't have a strong middle class without a strong labor movement.\" And Biden repeated that he and Obama will judge the success or failure of their administration on whether the middle class standard of living has increased during their first term. Biden described teachers, police officers, firefighters, hospital workers and factory workers are the \"nation's heart and soul.\" And while bankers and financiers are \"necessary,\" \"they are not the spine of the system,\" he said. Biden says the middle class has been \"slipping\" in recent years because the “social contract” is out of balance. When productivity goes up, the people responsible for that productivity are supposed to benefit. That’s the “deal,” he said: “We don't want chief executives and wealthy people not to get wealthy. That's okay by us. Every one of us hope our kids end up there some day.” But Biden said the deal involves workers getting a piece of the higher profits generated by their labor: “While a company’s management may come up with a good idea, workers “help make it happen…we do things faster and better and cheaper for you so the profit margin increases -- the deal was we get a piece of that. We get a piece of it -- a fair piece. That's the bargain.” Biden added that workers who helped boost productivity in recent years have seen the value of their incomes drop. \"For too long the middle class has been dealt out. I'm here to tell you in this administration it is dealt in. It is the first card on the table.\" <edit> In a plug for the Employee Free Choice Act, Biden said the unions aren't asking for anything they don't deserve: \"We just want to level this playing field again.\" The Employee Free Choice Act, also known as the card-check bill, would require the government to certify a union after 51 percent of workers have openly signed a card saying they want to unionize. The measure would effectively eliminate secret ballot union elections, critics warn. \"I have a simple, basic belief, one that we're going to work hard to put into action: If a union is what you want, a union you're entitled to have,\" Biden said. Biden told the AFL-CIO there is no such thing as an \"inherently good job.\" \"They become good jobs when workers have an opportunity to insist that they get paid a fair wage, they get treated fairly, and they will benefit from the productivity that results from that industry. The union movement made them good jobs.\" Although it’s going to be a “rough year,” Biden says he’s optimistic: “I think we've got a ladder long enough, and I think when we climb out of this hole, if we do this right, it's going to be -- we climb onto a platform that's clearer, sturdier, better, more competitive for America, and put us in a position where we're able to do in the 21st century what we did in the 20th century. Our job in the meantime is to get as many people on that ladder as we can.” Biden said there’s a good chance of returning to the days of gainful employment and “the bargain” that lifts workers: “We got a shot like we haven't had for the last 30 years,” he said. Cameras were not allowed to cover Biden's speech, but his office released a transcript of his remarks.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:24:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already.", 
        "intTime": 20090309, 
        "postID": 2, 
        "quote": "Says Stimulus Is Aimed at Boosting Union Jobs", 
        "reply": " So what? I am pretty sure we have enough minimum wage jobs already.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:33:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage.", 
        "intTime": 20090309, 
        "postID": 3, 
        "quote": "Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already.", 
        "reply": " Yeh, everyone that is not union is min wage.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:35:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created.", 
        "intTime": 20090309, 
        "postID": 4, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage.", 
        "reply": " Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:45:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created. This is about Obama using taxpayer money to prop up unions.", 
        "intTime": 20090309, 
        "postID": 5, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created.", 
        "reply": " This is about Obama using taxpayer money to prop up unions.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:52:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Ya know...I have a what if... What if every worker in the United States was a Union Worker being paid Union Wages with Union Rights and Benefits. What would happen? Would there be any jobs left at all?", 
        "intTime": 20090309, 
        "postID": 6, 
        "quote": "", 
        "reply": "Ya know...I have a what if... What if every worker in the United States was a Union Worker being paid Union Wages with Union Rights and Benefits. What would happen? Would there be any jobs left at all?", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:53:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Biden told the union executives at the five-star Fontainebleau Hotel in Miami that \"economic injustice and inequity are bad for everyone. It's just not right and everybody knows it -- it's just not right when the average CEO makes $10,000 more every day...than what the average worker makes every year.” he said. When all else fails, class warfare. Union execs using blue-collar dues to fund 5-star boondoggles where they can b**ch about overpaid CEOs. Every time a demmo and some union leaders get together I'm reminded of \"Animal Farm\", with the pigs that say \"all animals are equal, but some animals are more equal than others\". quote: Biden told the AFL-CIO there is no such thing as an \"inherently good job.\" \"They become good jobs when workers have an opportunity to insist that they get paid a fair wage, they get treated fairly, and they will benefit from the productivity that results from that industry. The union movement made them good jobs.\" Oh, absolutely, as the taxpayer winding up on the hook to pay union-demanded bennies that forced companies into bankruptcy proves. Obama/Biden are going to do everything they can to force unions into the few areas of the country that are still free to be business-friendly. The hottest economy in the world isn't ours, for a reason...we pander to unions and weaken our own industries under the banner of \"worker rights\" and \"sticking it to fat-cat CEOs\", while countries like China where the government actually DOES support industries that employ their citizens are experiencing a mere 9% or so growth while the rest of the world is in a recession.", 
        "intTime": 20090309, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: Biden told the union executives at the five-star Fontainebleau Hotel in Miami that \"economic injustice and inequity are bad for everyone. It's just not right and everybody knows it -- it's just not right when the average CEO makes $10,000 more every day...than what the average worker makes every year.” he said.", 
        "reply": " When all else fails, class warfare. Union execs using blue-collar dues to fund 5-star boondoggles where they can b**ch about overpaid CEOs. Every time a demmo and some union leaders get together I'm reminded of \"Animal Farm\", with the pigs that say \"all animals are equal, but some animals are more equal than others\". quote: Biden told the AFL-CIO there is no such thing as an \"inherently good job.\" \"They become good jobs when workers have an opportunity to insist that they get paid a fair wage, they get treated fairly, and they will benefit from the productivity that results from that industry. The union movement made them good jobs.\" Oh, absolutely, as the taxpayer winding up on the hook to pay union-demanded bennies that forced companies into bankruptcy proves. Obama/Biden are going to do everything they can to force unions into the few areas of the country that are still free to be business-friendly. The hottest economy in the world isn't ours, for a reason...we pander to unions and weaken our own industries under the banner of \"worker rights\" and \"sticking it to fat-cat CEOs\", while countries like China where the government actually DOES support industries that employ their citizens are experiencing a mere 9% or so growth while the rest of the world is in a recession.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:01:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "jwr6"
    }, 
    {
        "content": "Union were necessary when: Most Americans held a middle school education. Transportation was limited. Poor health working conditions prevailed. Long hours were standard. 12 hours a day or more and 6 day work week with no benefits. This day and age people can pack up and move to another city and another state if necessary. There are labor laws in place and OSHA monitors safety conditions. They may not establish amount of pay out, but there is a minimum standard of pay and overtime has been established. Any corporation will try to keep the good workers and make incentives to keep them. They know they may get stuck with a slacker if they let the good people go. Many Americans work for non-union corporation and have found it rewarding. This day and age if you don't make it in the world, either you haven't put in the effort and educated yourself in a specific field or your working for a minimum wage that fit your qualifications.", 
        "intTime": 20090309, 
        "postID": 8, 
        "quote": "", 
        "reply": "Union were necessary when: Most Americans held a middle school education. Transportation was limited. Poor health working conditions prevailed. Long hours were standard. 12 hours a day or more and 6 day work week with no benefits. This day and age people can pack up and move to another city and another state if necessary. There are labor laws in place and OSHA monitors safety conditions. They may not establish amount of pay out, but there is a minimum standard of pay and overtime has been established. Any corporation will try to keep the good workers and make incentives to keep them. They know they may get stuck with a slacker if they let the good people go. Many Americans work for non-union corporation and have found it rewarding. This day and age if you don't make it in the world, either you haven't put in the effort and educated yourself in a specific field or your working for a minimum wage that fit your qualifications.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:25:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "airwing1"
    }, 
    {
        "content": "Unions = Organized Crime Union Dons no loger give a tinkers damn about the rank and file. It's all about 2 things and 2 things only - MONEY AND POWER. I think the whole lot of them should be tried under racketeering charges and sent up for a VERY LONG time. Furthermore I wont shed a single tear if unions were abolished entirely.", 
        "intTime": 20090309, 
        "postID": 9, 
        "quote": "", 
        "reply": "Unions = Organized Crime Union Dons no loger give a tinkers damn about the rank and file. It's all about 2 things and 2 things only - MONEY AND POWER. I think the whole lot of them should be tried under racketeering charges and sent up for a VERY LONG time. Furthermore I wont shed a single tear if unions were abolished entirely.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:30:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "navy8086"
    }, 
    {
        "content": "Maybe the unions will not be allowed in the voting booths to monitor how union members vote anymore... Sen. Jim DeMint (R-SC) and a group of congressional Republicans have introduced the Secret Ballot Protection Act to protect the right of workers to a secret ballot in choosing whether or not to unionize. This move is meant to preempt the egregiously misnamed Employee Free Choice Act (EFCA), which is designed to remove workers' right to a secret ballot. Democrats are pushing EFCA as a thank you for the millions of dollars unions gave to Obama and various high-profile liberal campaigns in 2008. It seeks to publicize the union voting process so that union stewards and supporters can intimidate workers who choose to reject what they have to offer. Reports of such intimidation are already surfacing in Oregon, and many Republicans are worried about the impact of wider union influence in the American economy. As DeMint noted, \"Why would we take the business model that has virtually destroyed the American auto industry and try to force it onto the entire American economy?\"", 
        "intTime": 20090309, 
        "postID": 10, 
        "quote": "", 
        "reply": "Maybe the unions will not be allowed in the voting booths to monitor how union members vote anymore... Sen. Jim DeMint (R-SC) and a group of congressional Republicans have introduced the Secret Ballot Protection Act to protect the right of workers to a secret ballot in choosing whether or not to unionize. This move is meant to preempt the egregiously misnamed Employee Free Choice Act (EFCA), which is designed to remove workers' right to a secret ballot. Democrats are pushing EFCA as a thank you for the millions of dollars unions gave to Obama and various high-profile liberal campaigns in 2008. It seeks to publicize the union voting process so that union stewards and supporters can intimidate workers who choose to reject what they have to offer. Reports of such intimidation are already surfacing in Oregon, and many Republicans are worried about the impact of wider union influence in the American economy. As DeMint noted, \"Why would we take the business model that has virtually destroyed the American auto industry and try to force it onto the entire American economy?\"", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:39:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Maybe the unions will not be allowed in the voting booths to monitor how union members vote anymore... Sen. Jim DeMint (R-SC) and a group of congressional Republicans have introduced the Secret Ballot Protection Act to protect the right of workers to a secret ballot in choosing whether or not to unionize. This move is meant to preempt the egregiously misnamed Employee Free Choice Act (EFCA), which is designed to remove workers' right to a secret ballot. Democrats are pushing EFCA as a thank you for the millions of dollars unions gave to Obama and various high-profile liberal campaigns in 2008. It seeks to publicize the union voting process so that union stewards and supporters can intimidate workers who choose to reject what they have to offer. Reports of such intimidation are already surfacing in Oregon, and many Republicans are worried about the impact of wider union influence in the American economy. As DeMint noted, \"Why would we take the business model that has virtually destroyed the American auto industry and try to force it onto the entire American economy?\" My Boy!", 
        "intTime": 20090309, 
        "postID": 11, 
        "quote": "Originally posted by Mom2APAJ: Maybe the unions will not be allowed in the voting booths to monitor how union members vote anymore... Sen. Jim DeMint (R-SC) and a group of congressional Republicans have introduced the Secret Ballot Protection Act to protect the right of workers to a secret ballot in choosing whether or not to unionize. This move is meant to preempt the egregiously misnamed Employee Free Choice Act (EFCA), which is designed to remove workers' right to a secret ballot. Democrats are pushing EFCA as a thank you for the millions of dollars unions gave to Obama and various high-profile liberal campaigns in 2008. It seeks to publicize the union voting process so that union stewards and supporters can intimidate workers who choose to reject what they have to offer. Reports of such intimidation are already surfacing in Oregon, and many Republicans are worried about the impact of wider union influence in the American economy. As DeMint noted, \"Why would we take the business model that has virtually destroyed the American auto industry and try to force it onto the entire American economy?\"", 
        "reply": " My Boy!", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:45:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans.", 
        "intTime": 20090309, 
        "postID": 12, 
        "quote": "", 
        "reply": "This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 08:19:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created. Spin, deflect, avoid", 
        "intTime": 20090309, 
        "postID": 13, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created.", 
        "reply": " Spin, deflect, avoid", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 09:38:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives.", 
        "intTime": 20090309, 
        "postID": 14, 
        "quote": "Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans.", 
        "reply": " Sounds like VP meeting with oil executives.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 09:41:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Biden described teachers, police officers, firefighters, hospital workers and factory workers are the \"nation's heart and soul.\" And while bankers and financiers are \"necessary,\" \"they are not the spine of the system,\" he said. BULL SHYTE!!!! I've personally seen where the unions were a DIRECT THREAT to patient care. A couple of years ago something like 20 nursing homes went on stirke, some of the workers were guilty of (all designed to make the replacement workers lives hell): - Removing wrist bands from patient, made IDing a patient harder.(Med errors WERE made) - Crazy gluing locks shut - smearing CRAP all over shower stall - One nurse gave diabetic patient candy before she walked off on strike. - Enticing confused patiets from the picket line to go outside THere were other incidences, but you get the picture I BLAME the union thugs that create this kind of work enviorment, especailly during contract negoiations. As a SAD note, no one was prosecuted or lost thier jobs for the above criminal acts. IN MY NOT SO HUMBLE OPINION, UNIONS HAVE NO PLACE AND SHOULD BE BANNED FROM THE HEALTH CARE INDUSTRY", 
        "intTime": 20090309, 
        "postID": 15, 
        "quote": "Biden described teachers, police officers, firefighters, hospital workers and factory workers are the \"nation's heart and soul.\" And while bankers and financiers are \"necessary,\" \"they are not the spine of the system,\" he said.", 
        "reply": " BULL SHYTE!!!! I've personally seen where the unions were a DIRECT THREAT to patient care. A couple of years ago something like 20 nursing homes went on stirke, some of the workers were guilty of (all designed to make the replacement workers lives hell): - Removing wrist bands from patient, made IDing a patient harder.(Med errors WERE made) - Crazy gluing locks shut - smearing CRAP all over shower stall - One nurse gave diabetic patient candy before she walked off on strike. - Enticing confused patiets from the picket line to go outside THere were other incidences, but you get the picture I BLAME the union thugs that create this kind of work enviorment, especailly during contract negoiations. As a SAD note, no one was prosecuted or lost thier jobs for the above criminal acts. IN MY NOT SO HUMBLE OPINION, UNIONS HAVE NO PLACE AND SHOULD BE BANNED FROM THE HEALTH CARE INDUSTRY", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 09:52:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option.", 
        "intTime": 20090309, 
        "postID": 16, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives.", 
        "reply": " Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 10:31:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option. WTF are you talking about? Do I need a secret decoder ring?", 
        "intTime": 20090309, 
        "postID": 17, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option.", 
        "reply": " WTF are you talking about? Do I need a secret decoder ring?", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 11:20:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option. WTF are you talking about? Do I need a secret decoder ring? Tell ya what junior, to be brutally honest, you need a hell of a lot more that a decoder ring.", 
        "intTime": 20090309, 
        "postID": 18, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option. WTF are you talking about? Do I need a secret decoder ring?", 
        "reply": " Tell ya what junior, to be brutally honest, you need a hell of a lot more that a decoder ring.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 11:25:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "adminnco1"
    }, 
    {
        "content": "It appears that the often quoted Buffet by the left is warning against Card Check.", 
        "intTime": 20090309, 
        "postID": 19, 
        "quote": "", 
        "reply": "It appears that the often quoted Buffet by the left is warning against Card Check.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 11:31:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "All unions are not created equal. The building trades is a good example of this. There is a good balance in the building trades that could not exist without unions. Some of you may know that construction is not a steady industry. A company will get a project that lasts a year and may get a handful of projects here and there for the following year. It would not be cost effective to keep the same labor force in that second year as that big project that took place the year prior. In this case, the employer lays off the workers that it doesn't need. Then those workers go to their Union hall to sign the out of work list. Usually, within a week, they are put on another project with another employer. Problem solved. Also, since the union does all of the training and certification, the companies do not need to pay to train (most training funds are funding from employee wages, not their benefits package). And, when employers bid jobs, labor is extremely easy to calculate because the wages are standardized per region and in line with the agreement that the union has made with all of the union contractors in that particular region. On the flipside of that, let's say that a relatively small company that typically does 20 man projects finally gets a really BIG project like a stadium or something similar that requires roughly 300 trained and certified tradesmen (Laborers, Ironworkers, Pipefitters, Carpenters, Operators, etc). Obviously, that company does not have that many employees already and finding that many tradesmen that are certified and trained through the classifieds will probably yield much smaller numbers than what is required for the job. This is a simple fix in union projects: All the employer has to do is call the union halls for each trade and request the number of tradesmen they need. Problem solved. As for the pay, what most Construction Craft Tradesmen make is not as much as you may think. Plus, many of them are skilled workers and do extremely dangerous work. For instance, take an Ironworker who has to do 8000 hous of OJT as well as 1000 hours of classroom training before he gets Journeyman status. The majority of his days are spent many feet above ground, walking on beams that are 4\" to 8\" wide. That is 8+ hours a day, 5 days a week, every week. Many times, the only way for him to get from one level to the other is to climb the iron to the next level. If he is not trained in the proper techniques of welding and connecting steel, blueprint reading, and structural integrity measure, that building could collapse years in the future. Plus, ironworkers do not wear a harness when they are walking the iron because it is actually increases the danger of the job. Would you say that $24 an hour is paying this guy too much? If so, then you are nuts! Or, let's look at a Construction Craft Laborer. This guy must do 4000 hours of OJT and 500 hours of classroom training to get Journeyman status. This is probably some of the most grueling and dangerous work you will find in construction. Not only do these guys to all the environmental remediation (asbestos removal, HAZMAT removal, Radioactive waste removal, etc), they also do all of the demolition projects (explosive demo, controlled demo, refractory demo, etc). That means that a Laborer will spend much of his days behind a pnuematic hammer/mut, climbing structures at great height, working with highly dangerous materials, cutting steal structure at great height (aka, high burning), working inside steel manufacturing furnaces and ovens in temps up to 150 degrees, etc. Many of these guys bodies are completely broken when they finally retire at 55-60. Is $20 an hour too much for this guy? If so, then you are nuts. The simple fact is, unless you have a college degree or you have a skill, you shouldn't be making $50,000 a year. But, if you have a skill (such as a tradesman) or a degree, you have earned that $50,000 a year. You have paid your dues, so to speak. Now, the UAW, Teamsters, Grocery workers, etc. Yeah, those are problems. They are paying people massive amounts of money to do something that a chimp could do. But, for people who have no idea what they are talking about to lump in every union in America together and think that they operate the same way is just ignorant. Also, keep in mind that the Building Tradesmen do not get holiday pay, sick pay, etc. If they don't work, they don't get paid.", 
        "intTime": 20090309, 
        "postID": 20, 
        "quote": "", 
        "reply": "All unions are not created equal. The building trades is a good example of this. There is a good balance in the building trades that could not exist without unions. Some of you may know that construction is not a steady industry. A company will get a project that lasts a year and may get a handful of projects here and there for the following year. It would not be cost effective to keep the same labor force in that second year as that big project that took place the year prior. In this case, the employer lays off the workers that it doesn't need. Then those workers go to their Union hall to sign the out of work list. Usually, within a week, they are put on another project with another employer. Problem solved. Also, since the union does all of the training and certification, the companies do not need to pay to train (most training funds are funding from employee wages, not their benefits package). And, when employers bid jobs, labor is extremely easy to calculate because the wages are standardized per region and in line with the agreement that the union has made with all of the union contractors in that particular region. On the flipside of that, let's say that a relatively small company that typically does 20 man projects finally gets a really BIG project like a stadium or something similar that requires roughly 300 trained and certified tradesmen (Laborers, Ironworkers, Pipefitters, Carpenters, Operators, etc). Obviously, that company does not have that many employees already and finding that many tradesmen that are certified and trained through the classifieds will probably yield much smaller numbers than what is required for the job. This is a simple fix in union projects: All the employer has to do is call the union halls for each trade and request the number of tradesmen they need. Problem solved. As for the pay, what most Construction Craft Tradesmen make is not as much as you may think. Plus, many of them are skilled workers and do extremely dangerous work. For instance, take an Ironworker who has to do 8000 hous of OJT as well as 1000 hours of classroom training before he gets Journeyman status. The majority of his days are spent many feet above ground, walking on beams that are 4\" to 8\" wide. That is 8+ hours a day, 5 days a week, every week. Many times, the only way for him to get from one level to the other is to climb the iron to the next level. If he is not trained in the proper techniques of welding and connecting steel, blueprint reading, and structural integrity measure, that building could collapse years in the future. Plus, ironworkers do not wear a harness when they are walking the iron because it is actually increases the danger of the job. Would you say that $24 an hour is paying this guy too much? If so, then you are nuts! Or, let's look at a Construction Craft Laborer. This guy must do 4000 hours of OJT and 500 hours of classroom training to get Journeyman status. This is probably some of the most grueling and dangerous work you will find in construction. Not only do these guys to all the environmental remediation (asbestos removal, HAZMAT removal, Radioactive waste removal, etc), they also do all of the demolition projects (explosive demo, controlled demo, refractory demo, etc). That means that a Laborer will spend much of his days behind a pnuematic hammer/mut, climbing structures at great height, working with highly dangerous materials, cutting steal structure at great height (aka, high burning), working inside steel manufacturing furnaces and ovens in temps up to 150 degrees, etc. Many of these guys bodies are completely broken when they finally retire at 55-60. Is $20 an hour too much for this guy? If so, then you are nuts. The simple fact is, unless you have a college degree or you have a skill, you shouldn't be making $50,000 a year. But, if you have a skill (such as a tradesman) or a degree, you have earned that $50,000 a year. You have paid your dues, so to speak. Now, the UAW, Teamsters, Grocery workers, etc. Yeah, those are problems. They are paying people massive amounts of money to do something that a chimp could do. But, for people who have no idea what they are talking about to lump in every union in America together and think that they operate the same way is just ignorant. Also, keep in mind that the Building Tradesmen do not get holiday pay, sick pay, etc. If they don't work, they don't get paid.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 13:09:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: All unions are not created equal. The building trades is a good example of this. There is a good balance in the building trades that could not exist without unions. Some of you may know that construction is not a steady industry. A company will get a project that lasts a year and may get a handful of projects here and there for the following year. It would not be cost effective to keep the same labor force in that second year as that big project that took place the year prior. In this case, the employer lays off the workers that it doesn't need. Then those workers go to their Union hall to sign the out of work list. Usually, within a week, they are put on another project with another employer. Problem solved. Also, since the union does all of the training and certification, the companies do not need to pay to train (most training funds are funding from employee wages, not their benefits package). And, when employers bid jobs, labor is extremely easy to calculate because the wages are standardized per region and in line with the agreement that the union has made with all of the union contractors in that particular region. On the flipside of that, let's say that a relatively small company that typically does 20 man projects finally gets a really BIG project like a stadium or something similar that requires roughly 300 trained and certified tradesmen (Laborers, Ironworkers, Pipefitters, Carpenters, Operators, etc). Obviously, that company does not have that many employees already and finding that many tradesmen that are certified and trained through the classifieds will probably yield much smaller numbers than what is required for the job. This is a simple fix in union projects: All the employer has to do is call the union halls for each trade and request the number of tradesmen they need. Problem solved. As for the pay, what most Construction Craft Tradesmen make is not as much as you may think. Plus, many of them are skilled workers and do extremely dangerous work. For instance, take an Ironworker who has to do 8000 hous of OJT as well as 1000 hours of classroom training before he gets Journeyman status. The majority of his days are spent many feet above ground, walking on beams that are 4\" to 8\" wide. That is 8+ hours a day, 5 days a week, every week. Many times, the only way for him to get from one level to the other is to climb the iron to the next level. Would you say that $24 an hour is paying this guy too much? If so, then you are nuts! Or, let's look at a Construction Craft Laborer. This guy must do 4000 hours of OJT and 500 hours of classroom training to get Journeyman status. This is probably some of the most grueling and dangerous work you will find in construction. Not only do these guys to all the environmental remediation (asbestos removal, HAZMAT removal, Radioactive waste removal, etc), they also do all of the demolition projects (explosive demo, controlled demo, etc). That means that a Laborer will spend much of his days behind a pnuematic hammer/mut, climbing structures at great height, working with highly dangerous materials, cutting steal structure at great height (aka, high burning), working inside steel manufacturing furnaces and ovens in temps up to 150 degrees, etc. Many of these guys bodies are completely broken when they finally retire at 55-60. Is $20 an hour too much for this guy? If so, then you are nuts. The simple fact is, unless you have a college degree or you have a skill, you shouldn't be making $50,000 a year. But, if you have a skill (such as a tradesman) or a degree, you have earned that $50,000 a year. Now, the UAW, Teamsters, Grocery workers, etc. Yeah, those are problems. They are paying people massive amounts of money to do something that a chimp could do. But, for people who have no idea what they are talking about to lump in every union in America together and think that they operate the same way is just ignorant. Well laid out. I do have issue though that the general thought process (as shown by Joe the plumber) that if you are not union then you are not skilled. I have worked many years in construction and have worked right along union people doing the same jobs. I know there are many skilled workers out there who are union and non-union. What I did see as a non-union worker working next to the union worker was non-unions were harassed and put in danger by the union workers. I saw deliberate slow downs to hamper the non-union companies (they probably still have not found their steel ). The productivity was not even close comparing the two. Non-unions ran circles around the unions on every job that I was on because we had to. There were other jobs waiting on us which drove us. I did not see a difference in quality. Both can be poor or good , but when a good empowered inspector was on the site quality was high. However, a private companies very reputation is on the line and our owners were up our rears making sure the customer got what they paid for. Other than the deliberate endangerment and harassment I do not care. If the customer wants to pay for it then it is on them. I do not like the mandate that X amount of government work must be union labor and I think this is the most unfair to the tax payer. I do appreciate the sheer volume of training Union members receive but know first hand that OJT is where the real experience is gained. However, there was one job where a private contractor brought in “illegals?” by the bus load and the whole job site went to crap very quickly.", 
        "intTime": 20090309, 
        "postID": 21, 
        "quote": "All unions are not created equal. The building trades is a good example of this. There is a good balance in the building trades that could not exist without unions. Some of you may know that construction is not a steady industry. A company will get a project that lasts a year and may get a handful of projects here and there for the following year. It would not be cost effective to keep the same labor force in that second year as that big project that took place the year prior. In this case, the employer lays off the workers that it doesn't need. Then those workers go to their Union hall to sign the out of work list. Usually, within a week, they are put on another project with another employer. Problem solved. Also, since the union does all of the training and certification, the companies do not need to pay to train (most training funds are funding from employee wages, not their benefits package). And, when employers bid jobs, labor is extremely easy to calculate because the wages are standardized per region and in line with the agreement that the union has made with all of the union contractors in that particular region. On the flipside of that, let's say that a relatively small company that typically does 20 man projects finally gets a really BIG project like a stadium or something similar that requires roughly 300 trained and certified tradesmen (Laborers, Ironworkers, Pipefitters, Carpenters, Operators, etc). Obviously, that company does not have that many employees already and finding that many tradesmen that are certified and trained through the classifieds will probably yield much smaller numbers than what is required for the job. This is a simple fix in union projects: All the employer has to do is call the union halls for each trade and request the number of tradesmen they need. Problem solved. As for the pay, what most Construction Craft Tradesmen make is not as much as you may think. Plus, many of them are skilled workers and do extremely dangerous work. For instance, take an Ironworker who has to do 8000 hous of OJT as well as 1000 hours of classroom training before he gets Journeyman status. The majority of his days are spent many feet above ground, walking on beams that are 4\" to 8\" wide. That is 8+ hours a day, 5 days a week, every week. Many times, the only way for him to get from one level to the other is to climb the iron to the next level. Would you say that $24 an hour is paying this guy too much? If so, then you are nuts! Or, let's look at a Construction Craft Laborer. This guy must do 4000 hours of OJT and 500 hours of classroom training to get Journeyman status. This is probably some of the most grueling and dangerous work you will find in construction. Not only do these guys to all the environmental remediation (asbestos removal, HAZMAT removal, Radioactive waste removal, etc), they also do all of the demolition projects (explosive demo, controlled demo, etc). That means that a Laborer will spend much of his days behind a pnuematic hammer/mut, climbing structures at great height, working with highly dangerous materials, cutting steal structure at great height (aka, high burning), working inside steel manufacturing furnaces and ovens in temps up to 150 degrees, etc. Many of these guys bodies are completely broken when they finally retire at 55-60. Is $20 an hour too much for this guy? If so, then you are nuts. The simple fact is, unless you have a college degree or you have a skill, you shouldn't be making $50,000 a year. But, if you have a skill (such as a tradesman) or a degree, you have earned that $50,000 a year. Now, the UAW, Teamsters, Grocery workers, etc. Yeah, those are problems. They are paying people massive amounts of money to do something that a chimp could do. But, for people who have no idea what they are talking about to lump in every union in America together and think that they operate the same way is just ignorant.", 
        "reply": " Well laid out. I do have issue though that the general thought process (as shown by Joe the plumber) that if you are not union then you are not skilled. I have worked many years in construction and have worked right along union people doing the same jobs. I know there are many skilled workers out there who are union and non-union. What I did see as a non-union worker working next to the union worker was non-unions were harassed and put in danger by the union workers. I saw deliberate slow downs to hamper the non-union companies (they probably still have not found their steel ). The productivity was not even close comparing the two. Non-unions ran circles around the unions on every job that I was on because we had to. There were other jobs waiting on us which drove us. I did not see a difference in quality. Both can be poor or good , but when a good empowered inspector was on the site quality was high. However, a private companies very reputation is on the line and our owners were up our rears making sure the customer got what they paid for. Other than the deliberate endangerment and harassment I do not care. If the customer wants to pay for it then it is on them. I do not like the mandate that X amount of government work must be union labor and I think this is the most unfair to the tax payer. I do appreciate the sheer volume of training Union members receive but know first hand that OJT is where the real experience is gained. However, there was one job where a private contractor brought in “illegals?” by the bus load and the whole job site went to crap very quickly.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 13:36:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "ACR26"
    }, 
    {
        "content": "Trust me, I have seen that before. When I was active in the Ironworkers I worked for one company. You basically have two kinds of workers in the Building Trades; company men and union men. Our workers, though in the same union, were company men. We didn't like to hop from company to company. And, we wanted to move up past scale pay. Everybody that worked at our company was of the same mindset. So, we worked out butts off and that set a standard. If you came out of the hall and could not keep up, you got your two checks and we brought in the next guy. It really depends on the company and the local. When we would work out of town and were required to bring in guys from that local, those local guys would often try to slow down the job (especially if it were a time and materials job). The company wouldn't take it. They would just lay off whoever couldn't hack it. We eventually went through 80% of the Ironworkers in that town before they got the hint. We got that job done under budget and before deadline. If the balance is kept between the Union and the Contractor, then everything is great for both parties. Once one side makes waves and starts shifting that balance, then that is when it turns into a turd.", 
        "intTime": 20090309, 
        "postID": 22, 
        "quote": "", 
        "reply": "Trust me, I have seen that before. When I was active in the Ironworkers I worked for one company. You basically have two kinds of workers in the Building Trades; company men and union men. Our workers, though in the same union, were company men. We didn't like to hop from company to company. And, we wanted to move up past scale pay. Everybody that worked at our company was of the same mindset. So, we worked out butts off and that set a standard. If you came out of the hall and could not keep up, you got your two checks and we brought in the next guy. It really depends on the company and the local. When we would work out of town and were required to bring in guys from that local, those local guys would often try to slow down the job (especially if it were a time and materials job). The company wouldn't take it. They would just lay off whoever couldn't hack it. We eventually went through 80% of the Ironworkers in that town before they got the hint. We got that job done under budget and before deadline. If the balance is kept between the Union and the Contractor, then everything is great for both parties. Once one side makes waves and starts shifting that balance, then that is when it turns into a turd.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 14:46:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "10Tenths"
    }, 
    {
        "content": "did you expect something else from the good millionaire senator, you know, the one that needs to be muzzled for all his 'errors in decorum'", 
        "intTime": 20090309, 
        "postID": 23, 
        "quote": "", 
        "reply": "did you expect something else from the good millionaire senator, you know, the one that needs to be muzzled for all his 'errors in decorum'", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 14:48:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I was a member of a union for 17 years and was happy to be a member.I think I know why Biden met w/ the AFL/CIO at a posh hotel in Fla. It is good for the economy of that area where the meeting was held and Obama, in his attempt to make business feel guilty about having meetings and retreats, thus damaging economies is appalling. The workers at the hotel are probably mmembers of a union signatory under AFL jurisdiction as well as those who remodeled the hotel. It seems like Obama's (obama means volcano) positions are not helpful to this nation. Time will tell but it does not seem like it will be a long time.", 
        "intTime": 20090309, 
        "postID": 24, 
        "quote": "", 
        "reply": "I was a member of a union for 17 years and was happy to be a member.I think I know why Biden met w/ the AFL/CIO at a posh hotel in Fla. It is good for the economy of that area where the meeting was held and Obama, in his attempt to make business feel guilty about having meetings and retreats, thus damaging economies is appalling. The workers at the hotel are probably mmembers of a union signatory under AFL jurisdiction as well as those who remodeled the hotel. It seems like Obama's (obama means volcano) positions are not helpful to this nation. Time will tell but it does not seem like it will be a long time.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 17:05:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "5727609"
    }, 
    {
        "content": "Actually it's kinda nice that one of these maroons finally comes right out and says what we all knew anyway!!~!!!", 
        "intTime": 20090309, 
        "postID": 25, 
        "quote": "", 
        "reply": "Actually it's kinda nice that one of these maroons finally comes right out and says what we all knew anyway!!~!!!", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 18:26:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "tawodi"
    }, 
    {
        "content": "There are great unions, and then there are the ones that give the great unions a bad name. To think that only Union workers get the greatest salaries is wrong. There are both Union and non Union companies that offer competitive wages, bonuses and what have you. I support those good Unions that haven't forgot where they come from and who they are there for and represent. The Workers. Folks can get raises without a union. If the people at say a non union company, are due for a contract revision, they go about other ways about bargaining for a contract. People do actually take this step. The workers at the company get together, pitch in and hire a lawyer. They see it as cheaper in the long run. If they all contribute toward a lawyer/s it would be a one time fee, until the said contract is up in say four or five years. Therefore, there is no union dues to pay every week. To break it down, say there is 60 workers at a plant. They each contribute $15 a week to union dues. So each month they all contribute $3600 for dues. So for the year it adds up to $43,200. Times that by say, four years until the contract is up and that equals $172,800 in dues. Those people would not spend anywhere near that for a lawyer/s to negotiate a contract every four years. If they hire a lawyer at say $250 an hour for two weeks it would cost $20,000. For a month it would cost $40,000. It would cost $666 for each worker ($12 a week for only one year) once every four years. So that would net a savings of $132,800 (if $40,000 was needed for the lawyer).", 
        "intTime": 20090311, 
        "postID": 26, 
        "quote": "", 
        "reply": "There are great unions, and then there are the ones that give the great unions a bad name. To think that only Union workers get the greatest salaries is wrong. There are both Union and non Union companies that offer competitive wages, bonuses and what have you. I support those good Unions that haven't forgot where they come from and who they are there for and represent. The Workers. Folks can get raises without a union. If the people at say a non union company, are due for a contract revision, they go about other ways about bargaining for a contract. People do actually take this step. The workers at the company get together, pitch in and hire a lawyer. They see it as cheaper in the long run. If they all contribute toward a lawyer/s it would be a one time fee, until the said contract is up in say four or five years. Therefore, there is no union dues to pay every week. To break it down, say there is 60 workers at a plant. They each contribute $15 a week to union dues. So each month they all contribute $3600 for dues. So for the year it adds up to $43,200. Times that by say, four years until the contract is up and that equals $172,800 in dues. Those people would not spend anywhere near that for a lawyer/s to negotiate a contract every four years. If they hire a lawyer at say $250 an hour for two weeks it would cost $20,000. For a month it would cost $40,000. It would cost $666 for each worker ($12 a week for only one year) once every four years. So that would net a savings of $132,800 (if $40,000 was needed for the lawyer).", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "Well the US could buy SCAB russian warships,tanks and planes...AFL-CIO", 
        "intTime": 20090311, 
        "postID": 27, 
        "quote": "", 
        "reply": "Well the US could buy SCAB russian warships,tanks and planes...AFL-CIO", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 15:34:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "scottrj50"
    }, 
    {
        "content": "SCAB huh? Right there it is all ugly and puss filled", 
        "intTime": 20090311, 
        "postID": 28, 
        "quote": "", 
        "reply": "SCAB huh? Right there it is all ugly and puss filled", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 15:41:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Biden Says Stimulus Is Aimed at Boosting Union Jobs Yeh - in China and the Middle East... That's where all if CitiCorp's bailout money has been going, while they refuse to loan money to companies here in America. Citicorp = ChinaCorp Wandering and Wondering", 
        "intTime": 20090311, 
        "postID": 29, 
        "quote": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "reply": " Yeh - in China and the Middle East... That's where all if CitiCorp's bailout money has been going, while they refuse to loan money to companies here in America. Citicorp = ChinaCorp Wandering and Wondering", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 16:00:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Another case for unions in the United Mine Workers. To this day there are fewer accidents and deaths in union mines. I am sure everyone remembers the recent mining deaths in West Virginia, all in nonunion mines. Also considering the danger of the job, and the skill it does take to work a coal mine I think they are easily worth 20 to 30 an hour.", 
        "intTime": 20090311, 
        "postID": 30, 
        "quote": "", 
        "reply": "Another case for unions in the United Mine Workers. To this day there are fewer accidents and deaths in union mines. I am sure everyone remembers the recent mining deaths in West Virginia, all in nonunion mines. Also considering the danger of the job, and the skill it does take to work a coal mine I think they are easily worth 20 to 30 an hour.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 17:27:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Biden and Unions Bosses biitching about CEO's while they sit at a resort sipping martinis and plotting unions takeover of America at taxpayers expense....What a surprise Biden Says Stimulus Is Aimed at Boosting Union Jobs Friday, March 06, 2009 By Susan Jones, Senior Editor 'http://www.cnsnews.com/public/content/article.aspx?RsrcID=44621' (CNSNews.com) - Vice President Joe Biden, expressing his solidarity with organized labor, told the AFL-CIO Executive Committee on Thursday that \"rebuilding our broken economy gives us the opportunity to get it right and reward workers.\" Union workers. “We're going to make sure that in every policy, every decision, we don't lose sight of the folks that brought us to the dance,” he said -- a reference to organized labor’s support of the Obama-Biden ticket. “And toward that end, we have to make sure that the jobs we're creating come with fair wages and decent benefits.” Biden told the union executives at the five-star Fontainebleau Hotel in Miami that \"economic injustice and inequity are bad for everyone. It's just not right and everybody knows it -- it's just not right when the average CEO makes $10,000 more every day...than what the average worker makes every year.” he said. The vice president noted that the administration is determined to see that taxpayer dollars \"go to something other than union-busting activities.” He mentioned the stimulus package, which will funnel taxpayer dollars to union jobs: \"The focus of this administration the first month has been to rebuild American roads, bridges, waterways -- jobs for the building trades union. Investing and getting more people access to broadband -- communication workers. Creating clean energy economy -- jobs that require electrical workers to modernize the grid, steel workers to go out and build the wind turbines, laborers to install the solar panels. Making our communities safer, jobs that require getting cops on the beat and keeping firefighters in firehouses. That's what we're trying to do.\" He also mentioned investment in schools (teachers unions). <edit> According to Biden, the nation's policy -- as expressed in the National Labor Relations Act -- is to \"encourage collective bargaining, encourage unions.\" He said it's not enough for corporations and government to \"tolerate\" workers forming unions -- \"after using every trick in the book\" to block them. Biden reassured labor leaders that he and President Barack Obama agree, \"You can't have a strong middle class without a strong labor movement.\" And Biden repeated that he and Obama will judge the success or failure of their administration on whether the middle class standard of living has increased during their first term. Biden described teachers, police officers, firefighters, hospital workers and factory workers are the \"nation's heart and soul.\" And while bankers and financiers are \"necessary,\" \"they are not the spine of the system,\" he said. Biden says the middle class has been \"slipping\" in recent years because the “social contract” is out of balance. When productivity goes up, the people responsible for that productivity are supposed to benefit. That’s the “deal,” he said: “We don't want chief executives and wealthy people not to get wealthy. That's okay by us. Every one of us hope our kids end up there some day.” But Biden said the deal involves workers getting a piece of the higher profits generated by their labor: “While a company’s management may come up with a good idea, workers “help make it happen…we do things faster and better and cheaper for you so the profit margin increases -- the deal was we get a piece of that. We get a piece of it -- a fair piece. That's the bargain.” Biden added that workers who helped boost productivity in recent years have seen the value of their incomes drop. \"For too long the middle class has been dealt out. I'm here to tell you in this administration it is dealt in. It is the first card on the table.\" <edit> In a plug for the Employee Free Choice Act, Biden said the unions aren't asking for anything they don't deserve: \"We just want to level this playing field again.\" The Employee Free Choice Act, also known as the card-check bill, would require the government to certify a union after 51 percent of workers have openly signed a card saying they want to unionize. The measure would effectively eliminate secret ballot union elections, critics warn. \"I have a simple, basic belief, one that we're going to work hard to put into action: If a union is what you want, a union you're entitled to have,\" Biden said. Biden told the AFL-CIO there is no such thing as an \"inherently good job.\" \"They become good jobs when workers have an opportunity to insist that they get paid a fair wage, they get treated fairly, and they will benefit from the productivity that results from that industry. The union movement made them good jobs.\" Although it’s going to be a “rough year,” Biden says he’s optimistic: “I think we've got a ladder long enough, and I think when we climb out of this hole, if we do this right, it's going to be -- we climb onto a platform that's clearer, sturdier, better, more competitive for America, and put us in a position where we're able to do in the 21st century what we did in the 20th century. Our job in the meantime is to get as many people on that ladder as we can.” Biden said there’s a good chance of returning to the days of gainful employment and “the bargain” that lifts workers: “We got a shot like we haven't had for the last 30 years,” he said. Cameras were not allowed to cover Biden's speech, but his office released a transcript of his remarks.", 
        "intTime": 20090309, 
        "postID": 31, 
        "quote": "", 
        "reply": "Biden and Unions Bosses biitching about CEO's while they sit at a resort sipping martinis and plotting unions takeover of America at taxpayers expense....What a surprise Biden Says Stimulus Is Aimed at Boosting Union Jobs Friday, March 06, 2009 By Susan Jones, Senior Editor 'http://www.cnsnews.com/public/content/article.aspx?RsrcID=44621' (CNSNews.com) - Vice President Joe Biden, expressing his solidarity with organized labor, told the AFL-CIO Executive Committee on Thursday that \"rebuilding our broken economy gives us the opportunity to get it right and reward workers.\" Union workers. “We're going to make sure that in every policy, every decision, we don't lose sight of the folks that brought us to the dance,” he said -- a reference to organized labor’s support of the Obama-Biden ticket. “And toward that end, we have to make sure that the jobs we're creating come with fair wages and decent benefits.” Biden told the union executives at the five-star Fontainebleau Hotel in Miami that \"economic injustice and inequity are bad for everyone. It's just not right and everybody knows it -- it's just not right when the average CEO makes $10,000 more every day...than what the average worker makes every year.” he said. The vice president noted that the administration is determined to see that taxpayer dollars \"go to something other than union-busting activities.” He mentioned the stimulus package, which will funnel taxpayer dollars to union jobs: \"The focus of this administration the first month has been to rebuild American roads, bridges, waterways -- jobs for the building trades union. Investing and getting more people access to broadband -- communication workers. Creating clean energy economy -- jobs that require electrical workers to modernize the grid, steel workers to go out and build the wind turbines, laborers to install the solar panels. Making our communities safer, jobs that require getting cops on the beat and keeping firefighters in firehouses. That's what we're trying to do.\" He also mentioned investment in schools (teachers unions). <edit> According to Biden, the nation's policy -- as expressed in the National Labor Relations Act -- is to \"encourage collective bargaining, encourage unions.\" He said it's not enough for corporations and government to \"tolerate\" workers forming unions -- \"after using every trick in the book\" to block them. Biden reassured labor leaders that he and President Barack Obama agree, \"You can't have a strong middle class without a strong labor movement.\" And Biden repeated that he and Obama will judge the success or failure of their administration on whether the middle class standard of living has increased during their first term. Biden described teachers, police officers, firefighters, hospital workers and factory workers are the \"nation's heart and soul.\" And while bankers and financiers are \"necessary,\" \"they are not the spine of the system,\" he said. Biden says the middle class has been \"slipping\" in recent years because the “social contract” is out of balance. When productivity goes up, the people responsible for that productivity are supposed to benefit. That’s the “deal,” he said: “We don't want chief executives and wealthy people not to get wealthy. That's okay by us. Every one of us hope our kids end up there some day.” But Biden said the deal involves workers getting a piece of the higher profits generated by their labor: “While a company’s management may come up with a good idea, workers “help make it happen…we do things faster and better and cheaper for you so the profit margin increases -- the deal was we get a piece of that. We get a piece of it -- a fair piece. That's the bargain.” Biden added that workers who helped boost productivity in recent years have seen the value of their incomes drop. \"For too long the middle class has been dealt out. I'm here to tell you in this administration it is dealt in. It is the first card on the table.\" <edit> In a plug for the Employee Free Choice Act, Biden said the unions aren't asking for anything they don't deserve: \"We just want to level this playing field again.\" The Employee Free Choice Act, also known as the card-check bill, would require the government to certify a union after 51 percent of workers have openly signed a card saying they want to unionize. The measure would effectively eliminate secret ballot union elections, critics warn. \"I have a simple, basic belief, one that we're going to work hard to put into action: If a union is what you want, a union you're entitled to have,\" Biden said. Biden told the AFL-CIO there is no such thing as an \"inherently good job.\" \"They become good jobs when workers have an opportunity to insist that they get paid a fair wage, they get treated fairly, and they will benefit from the productivity that results from that industry. The union movement made them good jobs.\" Although it’s going to be a “rough year,” Biden says he’s optimistic: “I think we've got a ladder long enough, and I think when we climb out of this hole, if we do this right, it's going to be -- we climb onto a platform that's clearer, sturdier, better, more competitive for America, and put us in a position where we're able to do in the 21st century what we did in the 20th century. Our job in the meantime is to get as many people on that ladder as we can.” Biden said there’s a good chance of returning to the days of gainful employment and “the bargain” that lifts workers: “We got a shot like we haven't had for the last 30 years,” he said. Cameras were not allowed to cover Biden's speech, but his office released a transcript of his remarks.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:24:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already.", 
        "intTime": 20090309, 
        "postID": 32, 
        "quote": "Says Stimulus Is Aimed at Boosting Union Jobs", 
        "reply": " So what? I am pretty sure we have enough minimum wage jobs already.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:33:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage.", 
        "intTime": 20090309, 
        "postID": 33, 
        "quote": "Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already.", 
        "reply": " Yeh, everyone that is not union is min wage.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:35:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created.", 
        "intTime": 20090309, 
        "postID": 34, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage.", 
        "reply": " Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:45:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created. This is about Obama using taxpayer money to prop up unions.", 
        "intTime": 20090309, 
        "postID": 35, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created.", 
        "reply": " This is about Obama using taxpayer money to prop up unions.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:52:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Ya know...I have a what if... What if every worker in the United States was a Union Worker being paid Union Wages with Union Rights and Benefits. What would happen? Would there be any jobs left at all?", 
        "intTime": 20090309, 
        "postID": 36, 
        "quote": "", 
        "reply": "Ya know...I have a what if... What if every worker in the United States was a Union Worker being paid Union Wages with Union Rights and Benefits. What would happen? Would there be any jobs left at all?", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 06:53:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Biden told the union executives at the five-star Fontainebleau Hotel in Miami that \"economic injustice and inequity are bad for everyone. It's just not right and everybody knows it -- it's just not right when the average CEO makes $10,000 more every day...than what the average worker makes every year.” he said. When all else fails, class warfare. Union execs using blue-collar dues to fund 5-star boondoggles where they can b**ch about overpaid CEOs. Every time a demmo and some union leaders get together I'm reminded of \"Animal Farm\", with the pigs that say \"all animals are equal, but some animals are more equal than others\". quote: Biden told the AFL-CIO there is no such thing as an \"inherently good job.\" \"They become good jobs when workers have an opportunity to insist that they get paid a fair wage, they get treated fairly, and they will benefit from the productivity that results from that industry. The union movement made them good jobs.\" Oh, absolutely, as the taxpayer winding up on the hook to pay union-demanded bennies that forced companies into bankruptcy proves. Obama/Biden are going to do everything they can to force unions into the few areas of the country that are still free to be business-friendly. The hottest economy in the world isn't ours, for a reason...we pander to unions and weaken our own industries under the banner of \"worker rights\" and \"sticking it to fat-cat CEOs\", while countries like China where the government actually DOES support industries that employ their citizens are experiencing a mere 9% or so growth while the rest of the world is in a recession.", 
        "intTime": 20090309, 
        "postID": 37, 
        "quote": "Originally posted by GunnyRet03: Biden told the union executives at the five-star Fontainebleau Hotel in Miami that \"economic injustice and inequity are bad for everyone. It's just not right and everybody knows it -- it's just not right when the average CEO makes $10,000 more every day...than what the average worker makes every year.” he said.", 
        "reply": " When all else fails, class warfare. Union execs using blue-collar dues to fund 5-star boondoggles where they can b**ch about overpaid CEOs. Every time a demmo and some union leaders get together I'm reminded of \"Animal Farm\", with the pigs that say \"all animals are equal, but some animals are more equal than others\". quote: Biden told the AFL-CIO there is no such thing as an \"inherently good job.\" \"They become good jobs when workers have an opportunity to insist that they get paid a fair wage, they get treated fairly, and they will benefit from the productivity that results from that industry. The union movement made them good jobs.\" Oh, absolutely, as the taxpayer winding up on the hook to pay union-demanded bennies that forced companies into bankruptcy proves. Obama/Biden are going to do everything they can to force unions into the few areas of the country that are still free to be business-friendly. The hottest economy in the world isn't ours, for a reason...we pander to unions and weaken our own industries under the banner of \"worker rights\" and \"sticking it to fat-cat CEOs\", while countries like China where the government actually DOES support industries that employ their citizens are experiencing a mere 9% or so growth while the rest of the world is in a recession.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:01:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "jwr6"
    }, 
    {
        "content": "Union were necessary when: Most Americans held a middle school education. Transportation was limited. Poor health working conditions prevailed. Long hours were standard. 12 hours a day or more and 6 day work week with no benefits. This day and age people can pack up and move to another city and another state if necessary. There are labor laws in place and OSHA monitors safety conditions. They may not establish amount of pay out, but there is a minimum standard of pay and overtime has been established. Any corporation will try to keep the good workers and make incentives to keep them. They know they may get stuck with a slacker if they let the good people go. Many Americans work for non-union corporation and have found it rewarding. This day and age if you don't make it in the world, either you haven't put in the effort and educated yourself in a specific field or your working for a minimum wage that fit your qualifications.", 
        "intTime": 20090309, 
        "postID": 38, 
        "quote": "", 
        "reply": "Union were necessary when: Most Americans held a middle school education. Transportation was limited. Poor health working conditions prevailed. Long hours were standard. 12 hours a day or more and 6 day work week with no benefits. This day and age people can pack up and move to another city and another state if necessary. There are labor laws in place and OSHA monitors safety conditions. They may not establish amount of pay out, but there is a minimum standard of pay and overtime has been established. Any corporation will try to keep the good workers and make incentives to keep them. They know they may get stuck with a slacker if they let the good people go. Many Americans work for non-union corporation and have found it rewarding. This day and age if you don't make it in the world, either you haven't put in the effort and educated yourself in a specific field or your working for a minimum wage that fit your qualifications.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:25:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "airwing1"
    }, 
    {
        "content": "Unions = Organized Crime Union Dons no loger give a tinkers damn about the rank and file. It's all about 2 things and 2 things only - MONEY AND POWER. I think the whole lot of them should be tried under racketeering charges and sent up for a VERY LONG time. Furthermore I wont shed a single tear if unions were abolished entirely.", 
        "intTime": 20090309, 
        "postID": 39, 
        "quote": "", 
        "reply": "Unions = Organized Crime Union Dons no loger give a tinkers damn about the rank and file. It's all about 2 things and 2 things only - MONEY AND POWER. I think the whole lot of them should be tried under racketeering charges and sent up for a VERY LONG time. Furthermore I wont shed a single tear if unions were abolished entirely.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:30:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "navy8086"
    }, 
    {
        "content": "Maybe the unions will not be allowed in the voting booths to monitor how union members vote anymore... Sen. Jim DeMint (R-SC) and a group of congressional Republicans have introduced the Secret Ballot Protection Act to protect the right of workers to a secret ballot in choosing whether or not to unionize. This move is meant to preempt the egregiously misnamed Employee Free Choice Act (EFCA), which is designed to remove workers' right to a secret ballot. Democrats are pushing EFCA as a thank you for the millions of dollars unions gave to Obama and various high-profile liberal campaigns in 2008. It seeks to publicize the union voting process so that union stewards and supporters can intimidate workers who choose to reject what they have to offer. Reports of such intimidation are already surfacing in Oregon, and many Republicans are worried about the impact of wider union influence in the American economy. As DeMint noted, \"Why would we take the business model that has virtually destroyed the American auto industry and try to force it onto the entire American economy?\"", 
        "intTime": 20090309, 
        "postID": 40, 
        "quote": "", 
        "reply": "Maybe the unions will not be allowed in the voting booths to monitor how union members vote anymore... Sen. Jim DeMint (R-SC) and a group of congressional Republicans have introduced the Secret Ballot Protection Act to protect the right of workers to a secret ballot in choosing whether or not to unionize. This move is meant to preempt the egregiously misnamed Employee Free Choice Act (EFCA), which is designed to remove workers' right to a secret ballot. Democrats are pushing EFCA as a thank you for the millions of dollars unions gave to Obama and various high-profile liberal campaigns in 2008. It seeks to publicize the union voting process so that union stewards and supporters can intimidate workers who choose to reject what they have to offer. Reports of such intimidation are already surfacing in Oregon, and many Republicans are worried about the impact of wider union influence in the American economy. As DeMint noted, \"Why would we take the business model that has virtually destroyed the American auto industry and try to force it onto the entire American economy?\"", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:39:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Maybe the unions will not be allowed in the voting booths to monitor how union members vote anymore... Sen. Jim DeMint (R-SC) and a group of congressional Republicans have introduced the Secret Ballot Protection Act to protect the right of workers to a secret ballot in choosing whether or not to unionize. This move is meant to preempt the egregiously misnamed Employee Free Choice Act (EFCA), which is designed to remove workers' right to a secret ballot. Democrats are pushing EFCA as a thank you for the millions of dollars unions gave to Obama and various high-profile liberal campaigns in 2008. It seeks to publicize the union voting process so that union stewards and supporters can intimidate workers who choose to reject what they have to offer. Reports of such intimidation are already surfacing in Oregon, and many Republicans are worried about the impact of wider union influence in the American economy. As DeMint noted, \"Why would we take the business model that has virtually destroyed the American auto industry and try to force it onto the entire American economy?\" My Boy!", 
        "intTime": 20090309, 
        "postID": 41, 
        "quote": "Originally posted by Mom2APAJ: Maybe the unions will not be allowed in the voting booths to monitor how union members vote anymore... Sen. Jim DeMint (R-SC) and a group of congressional Republicans have introduced the Secret Ballot Protection Act to protect the right of workers to a secret ballot in choosing whether or not to unionize. This move is meant to preempt the egregiously misnamed Employee Free Choice Act (EFCA), which is designed to remove workers' right to a secret ballot. Democrats are pushing EFCA as a thank you for the millions of dollars unions gave to Obama and various high-profile liberal campaigns in 2008. It seeks to publicize the union voting process so that union stewards and supporters can intimidate workers who choose to reject what they have to offer. Reports of such intimidation are already surfacing in Oregon, and many Republicans are worried about the impact of wider union influence in the American economy. As DeMint noted, \"Why would we take the business model that has virtually destroyed the American auto industry and try to force it onto the entire American economy?\"", 
        "reply": " My Boy!", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 07:45:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans.", 
        "intTime": 20090309, 
        "postID": 42, 
        "quote": "", 
        "reply": "This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 08:19:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created. Spin, deflect, avoid", 
        "intTime": 20090309, 
        "postID": 43, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by GunnyRet03: quote: Originally posted by FrJohn1123: quote: Says Stimulus Is Aimed at Boosting Union Jobs So what? I am pretty sure we have enough minimum wage jobs already. Yeh, everyone that is not union is min wage. Google \"job creation\" over shrub's watch and see how many other than minimum wage jobs were created.", 
        "reply": " Spin, deflect, avoid", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 09:38:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives.", 
        "intTime": 20090309, 
        "postID": 44, 
        "quote": "Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans.", 
        "reply": " Sounds like VP meeting with oil executives.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 09:41:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Biden described teachers, police officers, firefighters, hospital workers and factory workers are the \"nation's heart and soul.\" And while bankers and financiers are \"necessary,\" \"they are not the spine of the system,\" he said. BULL SHYTE!!!! I've personally seen where the unions were a DIRECT THREAT to patient care. A couple of years ago something like 20 nursing homes went on stirke, some of the workers were guilty of (all designed to make the replacement workers lives hell): - Removing wrist bands from patient, made IDing a patient harder.(Med errors WERE made) - Crazy gluing locks shut - smearing CRAP all over shower stall - One nurse gave diabetic patient candy before she walked off on strike. - Enticing confused patiets from the picket line to go outside THere were other incidences, but you get the picture I BLAME the union thugs that create this kind of work enviorment, especailly during contract negoiations. As a SAD note, no one was prosecuted or lost thier jobs for the above criminal acts. IN MY NOT SO HUMBLE OPINION, UNIONS HAVE NO PLACE AND SHOULD BE BANNED FROM THE HEALTH CARE INDUSTRY", 
        "intTime": 20090309, 
        "postID": 45, 
        "quote": "Biden described teachers, police officers, firefighters, hospital workers and factory workers are the \"nation's heart and soul.\" And while bankers and financiers are \"necessary,\" \"they are not the spine of the system,\" he said.", 
        "reply": " BULL SHYTE!!!! I've personally seen where the unions were a DIRECT THREAT to patient care. A couple of years ago something like 20 nursing homes went on stirke, some of the workers were guilty of (all designed to make the replacement workers lives hell): - Removing wrist bands from patient, made IDing a patient harder.(Med errors WERE made) - Crazy gluing locks shut - smearing CRAP all over shower stall - One nurse gave diabetic patient candy before she walked off on strike. - Enticing confused patiets from the picket line to go outside THere were other incidences, but you get the picture I BLAME the union thugs that create this kind of work enviorment, especailly during contract negoiations. As a SAD note, no one was prosecuted or lost thier jobs for the above criminal acts. IN MY NOT SO HUMBLE OPINION, UNIONS HAVE NO PLACE AND SHOULD BE BANNED FROM THE HEALTH CARE INDUSTRY", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 09:52:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option.", 
        "intTime": 20090309, 
        "postID": 46, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives.", 
        "reply": " Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 10:31:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option. WTF are you talking about? Do I need a secret decoder ring?", 
        "intTime": 20090309, 
        "postID": 47, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option.", 
        "reply": " WTF are you talking about? Do I need a secret decoder ring?", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 11:20:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option. WTF are you talking about? Do I need a secret decoder ring? Tell ya what junior, to be brutally honest, you need a hell of a lot more that a decoder ring.", 
        "intTime": 20090309, 
        "postID": 48, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by adminnco1: This brings disingenuous to a new low. A quasi secret meeting as a posh resort nominally to discuss the rights of workers but in reality simply a planning session for the destruction of democracy in America. The assault on the secret ballot is repugnant to any sense of decency and should be renounced and repudiated. To do otherwise simply surrenders our birthrights as Americans. Sounds like VP meeting with oil executives. Perhaps, but at least his party could be voted out office via the secret ballot. If current VP has his way that may no longer be an option. WTF are you talking about? Do I need a secret decoder ring?", 
        "reply": " Tell ya what junior, to be brutally honest, you need a hell of a lot more that a decoder ring.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 11:25:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "adminnco1"
    }, 
    {
        "content": "It appears that the often quoted Buffet by the left is warning against Card Check.", 
        "intTime": 20090309, 
        "postID": 49, 
        "quote": "", 
        "reply": "It appears that the often quoted Buffet by the left is warning against Card Check.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 11:31:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "All unions are not created equal. The building trades is a good example of this. There is a good balance in the building trades that could not exist without unions. Some of you may know that construction is not a steady industry. A company will get a project that lasts a year and may get a handful of projects here and there for the following year. It would not be cost effective to keep the same labor force in that second year as that big project that took place the year prior. In this case, the employer lays off the workers that it doesn't need. Then those workers go to their Union hall to sign the out of work list. Usually, within a week, they are put on another project with another employer. Problem solved. Also, since the union does all of the training and certification, the companies do not need to pay to train (most training funds are funding from employee wages, not their benefits package). And, when employers bid jobs, labor is extremely easy to calculate because the wages are standardized per region and in line with the agreement that the union has made with all of the union contractors in that particular region. On the flipside of that, let's say that a relatively small company that typically does 20 man projects finally gets a really BIG project like a stadium or something similar that requires roughly 300 trained and certified tradesmen (Laborers, Ironworkers, Pipefitters, Carpenters, Operators, etc). Obviously, that company does not have that many employees already and finding that many tradesmen that are certified and trained through the classifieds will probably yield much smaller numbers than what is required for the job. This is a simple fix in union projects: All the employer has to do is call the union halls for each trade and request the number of tradesmen they need. Problem solved. As for the pay, what most Construction Craft Tradesmen make is not as much as you may think. Plus, many of them are skilled workers and do extremely dangerous work. For instance, take an Ironworker who has to do 8000 hous of OJT as well as 1000 hours of classroom training before he gets Journeyman status. The majority of his days are spent many feet above ground, walking on beams that are 4\" to 8\" wide. That is 8+ hours a day, 5 days a week, every week. Many times, the only way for him to get from one level to the other is to climb the iron to the next level. If he is not trained in the proper techniques of welding and connecting steel, blueprint reading, and structural integrity measure, that building could collapse years in the future. Plus, ironworkers do not wear a harness when they are walking the iron because it is actually increases the danger of the job. Would you say that $24 an hour is paying this guy too much? If so, then you are nuts! Or, let's look at a Construction Craft Laborer. This guy must do 4000 hours of OJT and 500 hours of classroom training to get Journeyman status. This is probably some of the most grueling and dangerous work you will find in construction. Not only do these guys to all the environmental remediation (asbestos removal, HAZMAT removal, Radioactive waste removal, etc), they also do all of the demolition projects (explosive demo, controlled demo, refractory demo, etc). That means that a Laborer will spend much of his days behind a pnuematic hammer/mut, climbing structures at great height, working with highly dangerous materials, cutting steal structure at great height (aka, high burning), working inside steel manufacturing furnaces and ovens in temps up to 150 degrees, etc. Many of these guys bodies are completely broken when they finally retire at 55-60. Is $20 an hour too much for this guy? If so, then you are nuts. The simple fact is, unless you have a college degree or you have a skill, you shouldn't be making $50,000 a year. But, if you have a skill (such as a tradesman) or a degree, you have earned that $50,000 a year. You have paid your dues, so to speak. Now, the UAW, Teamsters, Grocery workers, etc. Yeah, those are problems. They are paying people massive amounts of money to do something that a chimp could do. But, for people who have no idea what they are talking about to lump in every union in America together and think that they operate the same way is just ignorant. Also, keep in mind that the Building Tradesmen do not get holiday pay, sick pay, etc. If they don't work, they don't get paid.", 
        "intTime": 20090309, 
        "postID": 50, 
        "quote": "", 
        "reply": "All unions are not created equal. The building trades is a good example of this. There is a good balance in the building trades that could not exist without unions. Some of you may know that construction is not a steady industry. A company will get a project that lasts a year and may get a handful of projects here and there for the following year. It would not be cost effective to keep the same labor force in that second year as that big project that took place the year prior. In this case, the employer lays off the workers that it doesn't need. Then those workers go to their Union hall to sign the out of work list. Usually, within a week, they are put on another project with another employer. Problem solved. Also, since the union does all of the training and certification, the companies do not need to pay to train (most training funds are funding from employee wages, not their benefits package). And, when employers bid jobs, labor is extremely easy to calculate because the wages are standardized per region and in line with the agreement that the union has made with all of the union contractors in that particular region. On the flipside of that, let's say that a relatively small company that typically does 20 man projects finally gets a really BIG project like a stadium or something similar that requires roughly 300 trained and certified tradesmen (Laborers, Ironworkers, Pipefitters, Carpenters, Operators, etc). Obviously, that company does not have that many employees already and finding that many tradesmen that are certified and trained through the classifieds will probably yield much smaller numbers than what is required for the job. This is a simple fix in union projects: All the employer has to do is call the union halls for each trade and request the number of tradesmen they need. Problem solved. As for the pay, what most Construction Craft Tradesmen make is not as much as you may think. Plus, many of them are skilled workers and do extremely dangerous work. For instance, take an Ironworker who has to do 8000 hous of OJT as well as 1000 hours of classroom training before he gets Journeyman status. The majority of his days are spent many feet above ground, walking on beams that are 4\" to 8\" wide. That is 8+ hours a day, 5 days a week, every week. Many times, the only way for him to get from one level to the other is to climb the iron to the next level. If he is not trained in the proper techniques of welding and connecting steel, blueprint reading, and structural integrity measure, that building could collapse years in the future. Plus, ironworkers do not wear a harness when they are walking the iron because it is actually increases the danger of the job. Would you say that $24 an hour is paying this guy too much? If so, then you are nuts! Or, let's look at a Construction Craft Laborer. This guy must do 4000 hours of OJT and 500 hours of classroom training to get Journeyman status. This is probably some of the most grueling and dangerous work you will find in construction. Not only do these guys to all the environmental remediation (asbestos removal, HAZMAT removal, Radioactive waste removal, etc), they also do all of the demolition projects (explosive demo, controlled demo, refractory demo, etc). That means that a Laborer will spend much of his days behind a pnuematic hammer/mut, climbing structures at great height, working with highly dangerous materials, cutting steal structure at great height (aka, high burning), working inside steel manufacturing furnaces and ovens in temps up to 150 degrees, etc. Many of these guys bodies are completely broken when they finally retire at 55-60. Is $20 an hour too much for this guy? If so, then you are nuts. The simple fact is, unless you have a college degree or you have a skill, you shouldn't be making $50,000 a year. But, if you have a skill (such as a tradesman) or a degree, you have earned that $50,000 a year. You have paid your dues, so to speak. Now, the UAW, Teamsters, Grocery workers, etc. Yeah, those are problems. They are paying people massive amounts of money to do something that a chimp could do. But, for people who have no idea what they are talking about to lump in every union in America together and think that they operate the same way is just ignorant. Also, keep in mind that the Building Tradesmen do not get holiday pay, sick pay, etc. If they don't work, they don't get paid.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 13:09:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: All unions are not created equal. The building trades is a good example of this. There is a good balance in the building trades that could not exist without unions. Some of you may know that construction is not a steady industry. A company will get a project that lasts a year and may get a handful of projects here and there for the following year. It would not be cost effective to keep the same labor force in that second year as that big project that took place the year prior. In this case, the employer lays off the workers that it doesn't need. Then those workers go to their Union hall to sign the out of work list. Usually, within a week, they are put on another project with another employer. Problem solved. Also, since the union does all of the training and certification, the companies do not need to pay to train (most training funds are funding from employee wages, not their benefits package). And, when employers bid jobs, labor is extremely easy to calculate because the wages are standardized per region and in line with the agreement that the union has made with all of the union contractors in that particular region. On the flipside of that, let's say that a relatively small company that typically does 20 man projects finally gets a really BIG project like a stadium or something similar that requires roughly 300 trained and certified tradesmen (Laborers, Ironworkers, Pipefitters, Carpenters, Operators, etc). Obviously, that company does not have that many employees already and finding that many tradesmen that are certified and trained through the classifieds will probably yield much smaller numbers than what is required for the job. This is a simple fix in union projects: All the employer has to do is call the union halls for each trade and request the number of tradesmen they need. Problem solved. As for the pay, what most Construction Craft Tradesmen make is not as much as you may think. Plus, many of them are skilled workers and do extremely dangerous work. For instance, take an Ironworker who has to do 8000 hous of OJT as well as 1000 hours of classroom training before he gets Journeyman status. The majority of his days are spent many feet above ground, walking on beams that are 4\" to 8\" wide. That is 8+ hours a day, 5 days a week, every week. Many times, the only way for him to get from one level to the other is to climb the iron to the next level. Would you say that $24 an hour is paying this guy too much? If so, then you are nuts! Or, let's look at a Construction Craft Laborer. This guy must do 4000 hours of OJT and 500 hours of classroom training to get Journeyman status. This is probably some of the most grueling and dangerous work you will find in construction. Not only do these guys to all the environmental remediation (asbestos removal, HAZMAT removal, Radioactive waste removal, etc), they also do all of the demolition projects (explosive demo, controlled demo, etc). That means that a Laborer will spend much of his days behind a pnuematic hammer/mut, climbing structures at great height, working with highly dangerous materials, cutting steal structure at great height (aka, high burning), working inside steel manufacturing furnaces and ovens in temps up to 150 degrees, etc. Many of these guys bodies are completely broken when they finally retire at 55-60. Is $20 an hour too much for this guy? If so, then you are nuts. The simple fact is, unless you have a college degree or you have a skill, you shouldn't be making $50,000 a year. But, if you have a skill (such as a tradesman) or a degree, you have earned that $50,000 a year. Now, the UAW, Teamsters, Grocery workers, etc. Yeah, those are problems. They are paying people massive amounts of money to do something that a chimp could do. But, for people who have no idea what they are talking about to lump in every union in America together and think that they operate the same way is just ignorant. Well laid out. I do have issue though that the general thought process (as shown by Joe the plumber) that if you are not union then you are not skilled. I have worked many years in construction and have worked right along union people doing the same jobs. I know there are many skilled workers out there who are union and non-union. What I did see as a non-union worker working next to the union worker was non-unions were harassed and put in danger by the union workers. I saw deliberate slow downs to hamper the non-union companies (they probably still have not found their steel ). The productivity was not even close comparing the two. Non-unions ran circles around the unions on every job that I was on because we had to. There were other jobs waiting on us which drove us. I did not see a difference in quality. Both can be poor or good , but when a good empowered inspector was on the site quality was high. However, a private companies very reputation is on the line and our owners were up our rears making sure the customer got what they paid for. Other than the deliberate endangerment and harassment I do not care. If the customer wants to pay for it then it is on them. I do not like the mandate that X amount of government work must be union labor and I think this is the most unfair to the tax payer. I do appreciate the sheer volume of training Union members receive but know first hand that OJT is where the real experience is gained. However, there was one job where a private contractor brought in “illegals?” by the bus load and the whole job site went to crap very quickly.", 
        "intTime": 20090309, 
        "postID": 51, 
        "quote": "All unions are not created equal. The building trades is a good example of this. There is a good balance in the building trades that could not exist without unions. Some of you may know that construction is not a steady industry. A company will get a project that lasts a year and may get a handful of projects here and there for the following year. It would not be cost effective to keep the same labor force in that second year as that big project that took place the year prior. In this case, the employer lays off the workers that it doesn't need. Then those workers go to their Union hall to sign the out of work list. Usually, within a week, they are put on another project with another employer. Problem solved. Also, since the union does all of the training and certification, the companies do not need to pay to train (most training funds are funding from employee wages, not their benefits package). And, when employers bid jobs, labor is extremely easy to calculate because the wages are standardized per region and in line with the agreement that the union has made with all of the union contractors in that particular region. On the flipside of that, let's say that a relatively small company that typically does 20 man projects finally gets a really BIG project like a stadium or something similar that requires roughly 300 trained and certified tradesmen (Laborers, Ironworkers, Pipefitters, Carpenters, Operators, etc). Obviously, that company does not have that many employees already and finding that many tradesmen that are certified and trained through the classifieds will probably yield much smaller numbers than what is required for the job. This is a simple fix in union projects: All the employer has to do is call the union halls for each trade and request the number of tradesmen they need. Problem solved. As for the pay, what most Construction Craft Tradesmen make is not as much as you may think. Plus, many of them are skilled workers and do extremely dangerous work. For instance, take an Ironworker who has to do 8000 hous of OJT as well as 1000 hours of classroom training before he gets Journeyman status. The majority of his days are spent many feet above ground, walking on beams that are 4\" to 8\" wide. That is 8+ hours a day, 5 days a week, every week. Many times, the only way for him to get from one level to the other is to climb the iron to the next level. Would you say that $24 an hour is paying this guy too much? If so, then you are nuts! Or, let's look at a Construction Craft Laborer. This guy must do 4000 hours of OJT and 500 hours of classroom training to get Journeyman status. This is probably some of the most grueling and dangerous work you will find in construction. Not only do these guys to all the environmental remediation (asbestos removal, HAZMAT removal, Radioactive waste removal, etc), they also do all of the demolition projects (explosive demo, controlled demo, etc). That means that a Laborer will spend much of his days behind a pnuematic hammer/mut, climbing structures at great height, working with highly dangerous materials, cutting steal structure at great height (aka, high burning), working inside steel manufacturing furnaces and ovens in temps up to 150 degrees, etc. Many of these guys bodies are completely broken when they finally retire at 55-60. Is $20 an hour too much for this guy? If so, then you are nuts. The simple fact is, unless you have a college degree or you have a skill, you shouldn't be making $50,000 a year. But, if you have a skill (such as a tradesman) or a degree, you have earned that $50,000 a year. Now, the UAW, Teamsters, Grocery workers, etc. Yeah, those are problems. They are paying people massive amounts of money to do something that a chimp could do. But, for people who have no idea what they are talking about to lump in every union in America together and think that they operate the same way is just ignorant.", 
        "reply": " Well laid out. I do have issue though that the general thought process (as shown by Joe the plumber) that if you are not union then you are not skilled. I have worked many years in construction and have worked right along union people doing the same jobs. I know there are many skilled workers out there who are union and non-union. What I did see as a non-union worker working next to the union worker was non-unions were harassed and put in danger by the union workers. I saw deliberate slow downs to hamper the non-union companies (they probably still have not found their steel ). The productivity was not even close comparing the two. Non-unions ran circles around the unions on every job that I was on because we had to. There were other jobs waiting on us which drove us. I did not see a difference in quality. Both can be poor or good , but when a good empowered inspector was on the site quality was high. However, a private companies very reputation is on the line and our owners were up our rears making sure the customer got what they paid for. Other than the deliberate endangerment and harassment I do not care. If the customer wants to pay for it then it is on them. I do not like the mandate that X amount of government work must be union labor and I think this is the most unfair to the tax payer. I do appreciate the sheer volume of training Union members receive but know first hand that OJT is where the real experience is gained. However, there was one job where a private contractor brought in “illegals?” by the bus load and the whole job site went to crap very quickly.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 13:36:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "ACR26"
    }, 
    {
        "content": "Trust me, I have seen that before. When I was active in the Ironworkers I worked for one company. You basically have two kinds of workers in the Building Trades; company men and union men. Our workers, though in the same union, were company men. We didn't like to hop from company to company. And, we wanted to move up past scale pay. Everybody that worked at our company was of the same mindset. So, we worked out butts off and that set a standard. If you came out of the hall and could not keep up, you got your two checks and we brought in the next guy. It really depends on the company and the local. When we would work out of town and were required to bring in guys from that local, those local guys would often try to slow down the job (especially if it were a time and materials job). The company wouldn't take it. They would just lay off whoever couldn't hack it. We eventually went through 80% of the Ironworkers in that town before they got the hint. We got that job done under budget and before deadline. If the balance is kept between the Union and the Contractor, then everything is great for both parties. Once one side makes waves and starts shifting that balance, then that is when it turns into a turd.", 
        "intTime": 20090309, 
        "postID": 52, 
        "quote": "", 
        "reply": "Trust me, I have seen that before. When I was active in the Ironworkers I worked for one company. You basically have two kinds of workers in the Building Trades; company men and union men. Our workers, though in the same union, were company men. We didn't like to hop from company to company. And, we wanted to move up past scale pay. Everybody that worked at our company was of the same mindset. So, we worked out butts off and that set a standard. If you came out of the hall and could not keep up, you got your two checks and we brought in the next guy. It really depends on the company and the local. When we would work out of town and were required to bring in guys from that local, those local guys would often try to slow down the job (especially if it were a time and materials job). The company wouldn't take it. They would just lay off whoever couldn't hack it. We eventually went through 80% of the Ironworkers in that town before they got the hint. We got that job done under budget and before deadline. If the balance is kept between the Union and the Contractor, then everything is great for both parties. Once one side makes waves and starts shifting that balance, then that is when it turns into a turd.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 14:46:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "10Tenths"
    }, 
    {
        "content": "did you expect something else from the good millionaire senator, you know, the one that needs to be muzzled for all his 'errors in decorum'", 
        "intTime": 20090309, 
        "postID": 53, 
        "quote": "", 
        "reply": "did you expect something else from the good millionaire senator, you know, the one that needs to be muzzled for all his 'errors in decorum'", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 14:48:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "Ira1945"
    }, 
    {
        "content": "I was a member of a union for 17 years and was happy to be a member.I think I know why Biden met w/ the AFL/CIO at a posh hotel in Fla. It is good for the economy of that area where the meeting was held and Obama, in his attempt to make business feel guilty about having meetings and retreats, thus damaging economies is appalling. The workers at the hotel are probably mmembers of a union signatory under AFL jurisdiction as well as those who remodeled the hotel. It seems like Obama's (obama means volcano) positions are not helpful to this nation. Time will tell but it does not seem like it will be a long time.", 
        "intTime": 20090309, 
        "postID": 54, 
        "quote": "", 
        "reply": "I was a member of a union for 17 years and was happy to be a member.I think I know why Biden met w/ the AFL/CIO at a posh hotel in Fla. It is good for the economy of that area where the meeting was held and Obama, in his attempt to make business feel guilty about having meetings and retreats, thus damaging economies is appalling. The workers at the hotel are probably mmembers of a union signatory under AFL jurisdiction as well as those who remodeled the hotel. It seems like Obama's (obama means volcano) positions are not helpful to this nation. Time will tell but it does not seem like it will be a long time.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 17:05:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "5727609"
    }, 
    {
        "content": "Actually it's kinda nice that one of these maroons finally comes right out and says what we all knew anyway!!~!!!", 
        "intTime": 20090309, 
        "postID": 55, 
        "quote": "", 
        "reply": "Actually it's kinda nice that one of these maroons finally comes right out and says what we all knew anyway!!~!!!", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-09 18:26:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "tawodi"
    }, 
    {
        "content": "There are great unions, and then there are the ones that give the great unions a bad name. To think that only Union workers get the greatest salaries is wrong. There are both Union and non Union companies that offer competitive wages, bonuses and what have you. I support those good Unions that haven't forgot where they come from and who they are there for and represent. The Workers. Folks can get raises without a union. If the people at say a non union company, are due for a contract revision, they go about other ways about bargaining for a contract. People do actually take this step. The workers at the company get together, pitch in and hire a lawyer. They see it as cheaper in the long run. If they all contribute toward a lawyer/s it would be a one time fee, until the said contract is up in say four or five years. Therefore, there is no union dues to pay every week. To break it down, say there is 60 workers at a plant. They each contribute $15 a week to union dues. So each month they all contribute $3600 for dues. So for the year it adds up to $43,200. Times that by say, four years until the contract is up and that equals $172,800 in dues. Those people would not spend anywhere near that for a lawyer/s to negotiate a contract every four years. If they hire a lawyer at say $250 an hour for two weeks it would cost $20,000. For a month it would cost $40,000. It would cost $666 for each worker ($12 a week for only one year) once every four years. So that would net a savings of $132,800 (if $40,000 was needed for the lawyer).", 
        "intTime": 20090311, 
        "postID": 56, 
        "quote": "", 
        "reply": "There are great unions, and then there are the ones that give the great unions a bad name. To think that only Union workers get the greatest salaries is wrong. There are both Union and non Union companies that offer competitive wages, bonuses and what have you. I support those good Unions that haven't forgot where they come from and who they are there for and represent. The Workers. Folks can get raises without a union. If the people at say a non union company, are due for a contract revision, they go about other ways about bargaining for a contract. People do actually take this step. The workers at the company get together, pitch in and hire a lawyer. They see it as cheaper in the long run. If they all contribute toward a lawyer/s it would be a one time fee, until the said contract is up in say four or five years. Therefore, there is no union dues to pay every week. To break it down, say there is 60 workers at a plant. They each contribute $15 a week to union dues. So each month they all contribute $3600 for dues. So for the year it adds up to $43,200. Times that by say, four years until the contract is up and that equals $172,800 in dues. Those people would not spend anywhere near that for a lawyer/s to negotiate a contract every four years. If they hire a lawyer at say $250 an hour for two weeks it would cost $20,000. For a month it would cost $40,000. It would cost $666 for each worker ($12 a week for only one year) once every four years. So that would net a savings of $132,800 (if $40,000 was needed for the lawyer).", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 13:43:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "Well the US could buy SCAB russian warships,tanks and planes...AFL-CIO", 
        "intTime": 20090311, 
        "postID": 57, 
        "quote": "", 
        "reply": "Well the US could buy SCAB russian warships,tanks and planes...AFL-CIO", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 15:34:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "scottrj50"
    }, 
    {
        "content": "SCAB huh? Right there it is all ugly and puss filled", 
        "intTime": 20090311, 
        "postID": 58, 
        "quote": "", 
        "reply": "SCAB huh? Right there it is all ugly and puss filled", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 15:41:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Biden Says Stimulus Is Aimed at Boosting Union Jobs Yeh - in China and the Middle East... That's where all if CitiCorp's bailout money has been going, while they refuse to loan money to companies here in America. Citicorp = ChinaCorp Wandering and Wondering", 
        "intTime": 20090311, 
        "postID": 59, 
        "quote": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "reply": " Yeh - in China and the Middle East... That's where all if CitiCorp's bailout money has been going, while they refuse to loan money to companies here in America. Citicorp = ChinaCorp Wandering and Wondering", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 16:00:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Another case for unions in the United Mine Workers. To this day there are fewer accidents and deaths in union mines. I am sure everyone remembers the recent mining deaths in West Virginia, all in nonunion mines. Also considering the danger of the job, and the skill it does take to work a coal mine I think they are easily worth 20 to 30 an hour.", 
        "intTime": 20090311, 
        "postID": 60, 
        "quote": "", 
        "reply": "Another case for unions in the United Mine Workers. To this day there are fewer accidents and deaths in union mines. I am sure everyone remembers the recent mining deaths in West Virginia, all in nonunion mines. Also considering the danger of the job, and the skill it does take to work a coal mine I think they are easily worth 20 to 30 an hour.", 
        "threadID": "409192893_1940023712001", 
        "time": "2009-03-11 17:27:00", 
        "title": "Biden Says Stimulus Is Aimed at Boosting Union Jobs", 
        "userID": "nspreitler"
    }
]