[
    {
        "content": "We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? Question: Should USA gang's be label and treated as terrorist organizations? Choices: YES NO  ", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "", 
        "reply": "We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? Question: Should USA gang's be label and treated as terrorist organizations? Choices: YES NO  ", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 00:08:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "", 
        "reply": "What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 09:25:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. Yup.", 
        "intTime": 20090305, 
        "postID": 3, 
        "quote": "Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "reply": " Yup.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 09:28:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? No...they are criminals, not \"insurgents\" or some other such label that would bestow on them any kind of credibility besides being packs of mad dogs-- They should be hunted down and exterminated as if they had rabies - nothing more - - Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 4, 
        "quote": "Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law?", 
        "reply": " No...they are criminals, not \"insurgents\" or some other such label that would bestow on them any kind of credibility besides being packs of mad dogs-- They should be hunted down and exterminated as if they had rabies - nothing more - - Wandering and Wondering", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 09:34:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. Yup. Roger That . . .", 
        "intTime": 20090305, 
        "postID": 5, 
        "quote": "Originally posted by MaddogK: quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. Yup.", 
        "reply": " Roger That . . .", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 09:44:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "We could send them to GITMO to languish in legal limbo for years like other terrorists, because putting them through the legal system could result in them \"being freed to kill more Americans.\"", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "", 
        "reply": "We could send them to GITMO to languish in legal limbo for years like other terrorists, because putting them through the legal system could result in them \"being freed to kill more Americans.\"", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 10:27:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "Esample1"
    }, 
    {
        "content": "I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "", 
        "reply": "I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 11:06:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by esample1: We could send them to GITMO to languish in legal limbo for years like other terrorists, because putting them through the legal system could result in them \"being freed to kill more Americans.\"", 
        "intTime": 20090305, 
        "postID": 8, 
        "quote": "Originally posted by esample1: We could send them to GITMO to languish in legal limbo for years like other terrorists, because putting them through the legal system could result in them \"being freed to kill more Americans.\"", 
        "reply": "", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 11:10:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "Knele"
    }, 
    {
        "content": "New York is already prosecuting street gangs as terrorist organizations.", 
        "intTime": 20090305, 
        "postID": 9, 
        "quote": "", 
        "reply": "New York is already prosecuting street gangs as terrorist organizations.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 12:41:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto... It's more of a debate and to see what people think about the subject. Anti terrorist laws would allow law enforcement to be alot more effective in fighting gangs by targeting business who are fronts for drug trades at the same time preventing major crimes from happening. But at the cost of human rights pretty much going down the drain.The thought of being label as a terrorist is effective just by it self. There already Gang Injunctions & Civil Abatement in Los Angeles. which arn't very effective since they target only a member of the gang. while being put on the list of terrorist organizations would target the whole gang state side and around the world. Take the founder of the Black P Stones. who tried to buy weapons from Libya.", 
        "intTime": 20090305, 
        "postID": 10, 
        "quote": "Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "reply": " It's more of a debate and to see what people think about the subject. Anti terrorist laws would allow law enforcement to be alot more effective in fighting gangs by targeting business who are fronts for drug trades at the same time preventing major crimes from happening. But at the cost of human rights pretty much going down the drain.The thought of being label as a terrorist is effective just by it self. There already Gang Injunctions & Civil Abatement in Los Angeles. which arn't very effective since they target only a member of the gang. while being put on the list of terrorist organizations would target the whole gang state side and around the world. Take the founder of the Black P Stones. who tried to buy weapons from Libya.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 13:41:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Though some of you may disagree with my logic, I voted \"no\". My reason...federal agencies such as the FBI, etc, have \"Terrorist Units\" and seperate \"Organized Crime Units\". In my opinion, US gangs fall under the \"Organized Crime\" category. Diverting funding for terrorist invesigations to local gangs would only take money away from hunting down those overseas who seek to do us harm. I am not for one second saying that gangs aren't a threat but I hope you can understand my reasoning. boazjones....I'm not sure why you want to turn this into some kind of racist thread. I don't see it that way at all. Remember, \"US gangs\" in my opinion includes the many motorcycle gangs across the U.S. and as you know, the majority of those are most likely white. Motorcycle gangs are obviously just as dangerous as other gangs in places like L.A., etc. Don", 
        "intTime": 20090306, 
        "postID": 11, 
        "quote": "", 
        "reply": "Though some of you may disagree with my logic, I voted \"no\". My reason...federal agencies such as the FBI, etc, have \"Terrorist Units\" and seperate \"Organized Crime Units\". In my opinion, US gangs fall under the \"Organized Crime\" category. Diverting funding for terrorist invesigations to local gangs would only take money away from hunting down those overseas who seek to do us harm. I am not for one second saying that gangs aren't a threat but I hope you can understand my reasoning. boazjones....I'm not sure why you want to turn this into some kind of racist thread. I don't see it that way at all. Remember, \"US gangs\" in my opinion includes the many motorcycle gangs across the U.S. and as you know, the majority of those are most likely white. Motorcycle gangs are obviously just as dangerous as other gangs in places like L.A., etc. Don", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 05:26:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. Agreed they are criminals treat them as such.", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "reply": " Agreed they are criminals treat them as such.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 05:44:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "rayld2"
    }, 
    {
        "content": "So who is the next terrorist, the opposition party? This kind of mission creep is exactly the problem with special terrorist laws. Once someone uses the magic word rights seem to vanish.", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "", 
        "reply": "So who is the next terrorist, the opposition party? This kind of mission creep is exactly the problem with special terrorist laws. Once someone uses the magic word rights seem to vanish.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 06:23:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "thorin001"
    }, 
    {
        "content": "I can see gangs being policed as organized crime, servailed as terrorist organizations, and where effective prosecuted as terrorists if it will result in longer sentences. Have to effectivly use the laws on the books.", 
        "intTime": 20090306, 
        "postID": 14, 
        "quote": "", 
        "reply": "I can see gangs being policed as organized crime, servailed as terrorist organizations, and where effective prosecuted as terrorists if it will result in longer sentences. Have to effectivly use the laws on the books.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 06:31:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Remember, \"US gangs\" in my opinion includes the many motorcycle gangs across the U.S. and as you know, the majority of those are most likely white. Motorcycle gangs are obviously just as dangerous as other gangs in places like L.A., etc. Don Lest we not forget the 'Skinheads', KKK, etc. And as someone else mentioned (mission creep), the word could be extended once used, like for the Democrats... Wait, what they've been doing to us recently should be covered under 'Organized Crime' - Guess that makes the DEMs a 'mob'.", 
        "intTime": 20090306, 
        "postID": 15, 
        "quote": "Remember, \"US gangs\" in my opinion includes the many motorcycle gangs across the U.S. and as you know, the majority of those are most likely white. Motorcycle gangs are obviously just as dangerous as other gangs in places like L.A., etc. Don", 
        "reply": " Lest we not forget the 'Skinheads', KKK, etc. And as someone else mentioned (mission creep), the word could be extended once used, like for the Democrats... Wait, what they've been doing to us recently should be covered under 'Organized Crime' - Guess that makes the DEMs a 'mob'.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 06:46:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "Smitty"
    }, 
    {
        "content": "quote: Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto... Talking about reading into a post & extracting things that wasn't said!", 
        "intTime": 20090306, 
        "postID": 16, 
        "quote": "Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "reply": " Talking about reading into a post & extracting things that wasn't said!", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 07:36:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). Perhaps not in my neighborhood but definitely in my city. The number of drive by shootings definitely indicates something is amiss. Several have happened at the mall I occasionally visit and as the incidents were confirmed as gang related it is a problem that impacts directly on me. 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). The question is nonsensical and racist, it is unworthy of further response. 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). So now recognizing that there is a problem is \"ranting\"? What a load of fertilizer. It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto... I interact with African-Americans and Hispanics every day and they have the same concerns that I have. Does that make them bad people or do such labels only apply to certain members of the population? If that is true so much for celebrating diversity.", 
        "intTime": 20090306, 
        "postID": 17, 
        "quote": "Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). Perhaps not in my neighborhood but definitely in my city. The number of drive by shootings definitely indicates something is amiss. Several have happened at the mall I occasionally visit and as the incidents were confirmed as gang related it is a problem that impacts directly on me. 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). The question is nonsensical and racist, it is unworthy of further response. 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). So now recognizing that there is a problem is \"ranting\"? What a load of fertilizer. It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "reply": " I interact with African-Americans and Hispanics every day and they have the same concerns that I have. Does that make them bad people or do such labels only apply to certain members of the population? If that is true so much for celebrating diversity.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 08:09:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "I see it like this 70% of heroin comes out of Afghanistan. Which has to sell on the streets. Which I doubt any single person will do since the gangs would be more effective. So they must use gangs. Which the money they make selling it on the street goes back to Afghanistan to fund the Taliban and AQ in there war of jihad around the world. also the drug trade funds the arms going to cartels around the world. Which we have to send troops to support the fight against them. In the end they are supporting terrorist. because they are trying to bring down a government we support by mostly using terror to do it.", 
        "intTime": 20090306, 
        "postID": 18, 
        "quote": "", 
        "reply": "I see it like this 70% of heroin comes out of Afghanistan. Which has to sell on the streets. Which I doubt any single person will do since the gangs would be more effective. So they must use gangs. Which the money they make selling it on the street goes back to Afghanistan to fund the Taliban and AQ in there war of jihad around the world. also the drug trade funds the arms going to cartels around the world. Which we have to send troops to support the fight against them. In the end they are supporting terrorist. because they are trying to bring down a government we support by mostly using terror to do it.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 20:35:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "What about militias? White supremacist groups?", 
        "intTime": 20090306, 
        "postID": 19, 
        "quote": "", 
        "reply": "What about militias? White supremacist groups?", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 20:58:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? No. I believe that we have enough laws under which to prosecute violent multiple felons which make up the vast majority of gang members. What additional measures do you hope would be used against gangs if they were considered terrorists? Predator UAVs launching hellfire missiles at large drug buys? Or perhaps a couple JDAMS dropped on em by a F-16 if they were beyond city limits? Treating criminal gangs as terrorist organizations is completely unnecessary.", 
        "intTime": 20090306, 
        "postID": 20, 
        "quote": "Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law?", 
        "reply": " No. I believe that we have enough laws under which to prosecute violent multiple felons which make up the vast majority of gang members. What additional measures do you hope would be used against gangs if they were considered terrorists? Predator UAVs launching hellfire missiles at large drug buys? Or perhaps a couple JDAMS dropped on em by a F-16 if they were beyond city limits? Treating criminal gangs as terrorist organizations is completely unnecessary.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:11:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs", 
        "intTime": 20090306, 
        "postID": 21, 
        "quote": "Originally posted by mcgreer: What about militias? White supremacist groups?", 
        "reply": " militias are terrorist WSG are gangs", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:25:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by world_king377: quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs Militias are not necessarily terrorists. You see the world in stark black and white, don't you?", 
        "intTime": 20090306, 
        "postID": 22, 
        "quote": "Originally posted by world_king377: quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs", 
        "reply": " Militias are not necessarily terrorists. You see the world in stark black and white, don't you?", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:33:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? No. I believe that we have enough laws under which to prosecute violent multiple felons which make up the vast majority of gang members. What additional measures do you hope would be used against gangs if they were considered terrorists? Predator UAVs launching hellfire missiles at large drug buys? Or perhaps a couple JDAMS dropped on em by a F-16 if they were beyond city limits? Treating criminal gangs as terrorist organizations is completely unnecessary. in today's world it might be a necessary evil. the laws We have for gangs aren't willing working as well. since more gangs are being created and becoming bigger. Terrorist law's would able the law enforcement to do a lot more right now then they could with out it. gangs aren't just streets now many are rivaling the mafia,cartels and other groups including terrorist. the only difference being terrorist groups and gangs are the ideas.", 
        "intTime": 20090306, 
        "postID": 23, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? No. I believe that we have enough laws under which to prosecute violent multiple felons which make up the vast majority of gang members. What additional measures do you hope would be used against gangs if they were considered terrorists? Predator UAVs launching hellfire missiles at large drug buys? Or perhaps a couple JDAMS dropped on em by a F-16 if they were beyond city limits? Treating criminal gangs as terrorist organizations is completely unnecessary.", 
        "reply": " in today's world it might be a necessary evil. the laws We have for gangs aren't willing working as well. since more gangs are being created and becoming bigger. Terrorist law's would able the law enforcement to do a lot more right now then they could with out it. gangs aren't just streets now many are rivaling the mafia,cartels and other groups including terrorist. the only difference being terrorist groups and gangs are the ideas.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:36:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by world_king377: quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs Militias are not necessarily terrorists. You see the world in stark black and white, don't you? depends on the militias some are terrorist. While some aren't so its depends on the group. but the question is will they use terror as a weapon.", 
        "intTime": 20090306, 
        "postID": 24, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by world_king377: quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs Militias are not necessarily terrorists. You see the world in stark black and white, don't you?", 
        "reply": " depends on the militias some are terrorist. While some aren't so its depends on the group. but the question is will they use terror as a weapon.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:39:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "It's the intent not the method that matters. terrorism is \"violent or destructive acts (as bombing) committed by groups in order to intimidate a population or government into granting their demands.\" What do gangs do? They shoot other gang members. Why do they do it? Because they want to make as much money as possible, and the quickest way to do that is through illegal activities. There is no \"cause\" that gangs fight for. Well....unless you count money as a \"cause\".", 
        "intTime": 20090306, 
        "postID": 25, 
        "quote": "", 
        "reply": "It's the intent not the method that matters. terrorism is \"violent or destructive acts (as bombing) committed by groups in order to intimidate a population or government into granting their demands.\" What do gangs do? They shoot other gang members. Why do they do it? Because they want to make as much money as possible, and the quickest way to do that is through illegal activities. There is no \"cause\" that gangs fight for. Well....unless you count money as a \"cause\".", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 22:02:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. I agree its all about illegal money. The only way to hurt them is in the pocket book. The way to do that is to re issue all 100 dollar bills. Let everyone exchange them for 101 dollar bills in 30-60 days or lose them. That would create quite a cost for them trying to get rid of all that drug money. To say nothing of the tax evaders who have money vaulted and would have to account where it came from. Thats why it will never happen to many politicians and other wheeler dealers would lose to much they cant show.", 
        "intTime": 20090306, 
        "postID": 26, 
        "quote": "Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "reply": " I agree its all about illegal money. The only way to hurt them is in the pocket book. The way to do that is to re issue all 100 dollar bills. Let everyone exchange them for 101 dollar bills in 30-60 days or lose them. That would create quite a cost for them trying to get rid of all that drug money. To say nothing of the tax evaders who have money vaulted and would have to account where it came from. Thats why it will never happen to many politicians and other wheeler dealers would lose to much they cant show.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 22:07:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: It's the intent not the method that matters. terrorism is \"violent or destructive acts (as bombing) committed by groups in order to intimidate a population or government into granting their demands.\" What do gangs do? They shoot other gang members. Why do they do it? Because they want to make as much money as possible, and the quickest way to do that is through illegal activities. There is no \"cause\" that gangs fight for. Well....unless you count money as a \"cause\". Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. The only difference between a gang and a terrorist is the ideas. But then again depending on the group of terrorist or gang they both can be put side to side and both would be the same.", 
        "intTime": 20090306, 
        "postID": 27, 
        "quote": "Originally posted by karlhungusjr: It's the intent not the method that matters. terrorism is \"violent or destructive acts (as bombing) committed by groups in order to intimidate a population or government into granting their demands.\" What do gangs do? They shoot other gang members. Why do they do it? Because they want to make as much money as possible, and the quickest way to do that is through illegal activities. There is no \"cause\" that gangs fight for. Well....unless you count money as a \"cause\".", 
        "reply": " Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. The only difference between a gang and a terrorist is the ideas. But then again depending on the group of terrorist or gang they both can be put side to side and both would be the same.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 23:17:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. I guess you missed this part \"It's the intent not the method that matters.\" of my post.", 
        "intTime": 20090306, 
        "postID": 28, 
        "quote": "Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official.", 
        "reply": " I guess you missed this part \"It's the intent not the method that matters.\" of my post.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 23:26:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. I guess you missed this part \"It's the intent not the method that matters.\" of my post. It depends on the group and the gang.", 
        "intTime": 20090306, 
        "postID": 29, 
        "quote": "Originally posted by karlhungusjr: quote: Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. I guess you missed this part \"It's the intent not the method that matters.\" of my post.", 
        "reply": " It depends on the group and the gang.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 23:34:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: It depends on the group and the gang. If a gang uses violent or destructive acts in order to intimidate a population or government into granting their demands, then yes. They are \"terrorists\".", 
        "intTime": 20090306, 
        "postID": 30, 
        "quote": "It depends on the group and the gang.", 
        "reply": " If a gang uses violent or destructive acts in order to intimidate a population or government into granting their demands, then yes. They are \"terrorists\".", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 23:40:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? Question: Should USA gang's be label and treated as terrorist organizations? Choices: YES NO  ", 
        "intTime": 20090305, 
        "postID": 31, 
        "quote": "", 
        "reply": "We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? Question: Should USA gang's be label and treated as terrorist organizations? Choices: YES NO  ", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 00:08:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "intTime": 20090305, 
        "postID": 32, 
        "quote": "", 
        "reply": "What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 09:25:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. Yup.", 
        "intTime": 20090305, 
        "postID": 33, 
        "quote": "Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "reply": " Yup.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 09:28:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? No...they are criminals, not \"insurgents\" or some other such label that would bestow on them any kind of credibility besides being packs of mad dogs-- They should be hunted down and exterminated as if they had rabies - nothing more - - Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 34, 
        "quote": "Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law?", 
        "reply": " No...they are criminals, not \"insurgents\" or some other such label that would bestow on them any kind of credibility besides being packs of mad dogs-- They should be hunted down and exterminated as if they had rabies - nothing more - - Wandering and Wondering", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 09:34:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. Yup. Roger That . . .", 
        "intTime": 20090305, 
        "postID": 35, 
        "quote": "Originally posted by MaddogK: quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. Yup.", 
        "reply": " Roger That . . .", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 09:44:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "We could send them to GITMO to languish in legal limbo for years like other terrorists, because putting them through the legal system could result in them \"being freed to kill more Americans.\"", 
        "intTime": 20090305, 
        "postID": 36, 
        "quote": "", 
        "reply": "We could send them to GITMO to languish in legal limbo for years like other terrorists, because putting them through the legal system could result in them \"being freed to kill more Americans.\"", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 10:27:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "Esample1"
    }, 
    {
        "content": "I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "intTime": 20090305, 
        "postID": 37, 
        "quote": "", 
        "reply": "I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 11:06:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by esample1: We could send them to GITMO to languish in legal limbo for years like other terrorists, because putting them through the legal system could result in them \"being freed to kill more Americans.\"", 
        "intTime": 20090305, 
        "postID": 38, 
        "quote": "Originally posted by esample1: We could send them to GITMO to languish in legal limbo for years like other terrorists, because putting them through the legal system could result in them \"being freed to kill more Americans.\"", 
        "reply": "", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 11:10:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "Knele"
    }, 
    {
        "content": "New York is already prosecuting street gangs as terrorist organizations.", 
        "intTime": 20090305, 
        "postID": 39, 
        "quote": "", 
        "reply": "New York is already prosecuting street gangs as terrorist organizations.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 12:41:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto... It's more of a debate and to see what people think about the subject. Anti terrorist laws would allow law enforcement to be alot more effective in fighting gangs by targeting business who are fronts for drug trades at the same time preventing major crimes from happening. But at the cost of human rights pretty much going down the drain.The thought of being label as a terrorist is effective just by it self. There already Gang Injunctions & Civil Abatement in Los Angeles. which arn't very effective since they target only a member of the gang. while being put on the list of terrorist organizations would target the whole gang state side and around the world. Take the founder of the Black P Stones. who tried to buy weapons from Libya.", 
        "intTime": 20090305, 
        "postID": 40, 
        "quote": "Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "reply": " It's more of a debate and to see what people think about the subject. Anti terrorist laws would allow law enforcement to be alot more effective in fighting gangs by targeting business who are fronts for drug trades at the same time preventing major crimes from happening. But at the cost of human rights pretty much going down the drain.The thought of being label as a terrorist is effective just by it self. There already Gang Injunctions & Civil Abatement in Los Angeles. which arn't very effective since they target only a member of the gang. while being put on the list of terrorist organizations would target the whole gang state side and around the world. Take the founder of the Black P Stones. who tried to buy weapons from Libya.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-05 13:41:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Though some of you may disagree with my logic, I voted \"no\". My reason...federal agencies such as the FBI, etc, have \"Terrorist Units\" and seperate \"Organized Crime Units\". In my opinion, US gangs fall under the \"Organized Crime\" category. Diverting funding for terrorist invesigations to local gangs would only take money away from hunting down those overseas who seek to do us harm. I am not for one second saying that gangs aren't a threat but I hope you can understand my reasoning. boazjones....I'm not sure why you want to turn this into some kind of racist thread. I don't see it that way at all. Remember, \"US gangs\" in my opinion includes the many motorcycle gangs across the U.S. and as you know, the majority of those are most likely white. Motorcycle gangs are obviously just as dangerous as other gangs in places like L.A., etc. Don", 
        "intTime": 20090306, 
        "postID": 41, 
        "quote": "", 
        "reply": "Though some of you may disagree with my logic, I voted \"no\". My reason...federal agencies such as the FBI, etc, have \"Terrorist Units\" and seperate \"Organized Crime Units\". In my opinion, US gangs fall under the \"Organized Crime\" category. Diverting funding for terrorist invesigations to local gangs would only take money away from hunting down those overseas who seek to do us harm. I am not for one second saying that gangs aren't a threat but I hope you can understand my reasoning. boazjones....I'm not sure why you want to turn this into some kind of racist thread. I don't see it that way at all. Remember, \"US gangs\" in my opinion includes the many motorcycle gangs across the U.S. and as you know, the majority of those are most likely white. Motorcycle gangs are obviously just as dangerous as other gangs in places like L.A., etc. Don", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 05:26:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. Agreed they are criminals treat them as such.", 
        "intTime": 20090306, 
        "postID": 42, 
        "quote": "Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "reply": " Agreed they are criminals treat them as such.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 05:44:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "rayld2"
    }, 
    {
        "content": "So who is the next terrorist, the opposition party? This kind of mission creep is exactly the problem with special terrorist laws. Once someone uses the magic word rights seem to vanish.", 
        "intTime": 20090306, 
        "postID": 43, 
        "quote": "", 
        "reply": "So who is the next terrorist, the opposition party? This kind of mission creep is exactly the problem with special terrorist laws. Once someone uses the magic word rights seem to vanish.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 06:23:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "thorin001"
    }, 
    {
        "content": "I can see gangs being policed as organized crime, servailed as terrorist organizations, and where effective prosecuted as terrorists if it will result in longer sentences. Have to effectivly use the laws on the books.", 
        "intTime": 20090306, 
        "postID": 44, 
        "quote": "", 
        "reply": "I can see gangs being policed as organized crime, servailed as terrorist organizations, and where effective prosecuted as terrorists if it will result in longer sentences. Have to effectivly use the laws on the books.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 06:31:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Remember, \"US gangs\" in my opinion includes the many motorcycle gangs across the U.S. and as you know, the majority of those are most likely white. Motorcycle gangs are obviously just as dangerous as other gangs in places like L.A., etc. Don Lest we not forget the 'Skinheads', KKK, etc. And as someone else mentioned (mission creep), the word could be extended once used, like for the Democrats... Wait, what they've been doing to us recently should be covered under 'Organized Crime' - Guess that makes the DEMs a 'mob'.", 
        "intTime": 20090306, 
        "postID": 45, 
        "quote": "Remember, \"US gangs\" in my opinion includes the many motorcycle gangs across the U.S. and as you know, the majority of those are most likely white. Motorcycle gangs are obviously just as dangerous as other gangs in places like L.A., etc. Don", 
        "reply": " Lest we not forget the 'Skinheads', KKK, etc. And as someone else mentioned (mission creep), the word could be extended once used, like for the Democrats... Wait, what they've been doing to us recently should be covered under 'Organized Crime' - Guess that makes the DEMs a 'mob'.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 06:46:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "Smitty"
    }, 
    {
        "content": "quote: Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto... Talking about reading into a post & extracting things that wasn't said!", 
        "intTime": 20090306, 
        "postID": 46, 
        "quote": "Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "reply": " Talking about reading into a post & extracting things that wasn't said!", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 07:36:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). Perhaps not in my neighborhood but definitely in my city. The number of drive by shootings definitely indicates something is amiss. Several have happened at the mall I occasionally visit and as the incidents were confirmed as gang related it is a problem that impacts directly on me. 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). The question is nonsensical and racist, it is unworthy of further response. 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). So now recognizing that there is a problem is \"ranting\"? What a load of fertilizer. It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto... I interact with African-Americans and Hispanics every day and they have the same concerns that I have. Does that make them bad people or do such labels only apply to certain members of the population? If that is true so much for celebrating diversity.", 
        "intTime": 20090306, 
        "postID": 47, 
        "quote": "Originally posted by boazjones: I'm not really sure how to respond to this question. What's more important are the underlying factors behind \"why was this thread started?\" 1. Do you have a problem with gangs in your neighborhood? (probably not). Perhaps not in my neighborhood but definitely in my city. The number of drive by shootings definitely indicates something is amiss. Several have happened at the mall I occasionally visit and as the incidents were confirmed as gang related it is a problem that impacts directly on me. 2. Are you voicing your frustration with problems in the African-American and Hispanic communities? (probably so). The question is nonsensical and racist, it is unworthy of further response. 3. Will your ranting accomplish anything besides distance yourself from those who are affected? (probably not). So now recognizing that there is a problem is \"ranting\"? What a load of fertilizer. It is a difficult situation for the African-American and Hispanic communities; and, while you sit back in the comfort and protection of your planned subdivision, you should be grateful that the closest you'll ever get to a gang is playing Grand Theft Auto...", 
        "reply": " I interact with African-Americans and Hispanics every day and they have the same concerns that I have. Does that make them bad people or do such labels only apply to certain members of the population? If that is true so much for celebrating diversity.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 08:09:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "I see it like this 70% of heroin comes out of Afghanistan. Which has to sell on the streets. Which I doubt any single person will do since the gangs would be more effective. So they must use gangs. Which the money they make selling it on the street goes back to Afghanistan to fund the Taliban and AQ in there war of jihad around the world. also the drug trade funds the arms going to cartels around the world. Which we have to send troops to support the fight against them. In the end they are supporting terrorist. because they are trying to bring down a government we support by mostly using terror to do it.", 
        "intTime": 20090306, 
        "postID": 48, 
        "quote": "", 
        "reply": "I see it like this 70% of heroin comes out of Afghanistan. Which has to sell on the streets. Which I doubt any single person will do since the gangs would be more effective. So they must use gangs. Which the money they make selling it on the street goes back to Afghanistan to fund the Taliban and AQ in there war of jihad around the world. also the drug trade funds the arms going to cartels around the world. Which we have to send troops to support the fight against them. In the end they are supporting terrorist. because they are trying to bring down a government we support by mostly using terror to do it.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 20:35:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "What about militias? White supremacist groups?", 
        "intTime": 20090306, 
        "postID": 49, 
        "quote": "", 
        "reply": "What about militias? White supremacist groups?", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 20:58:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? No. I believe that we have enough laws under which to prosecute violent multiple felons which make up the vast majority of gang members. What additional measures do you hope would be used against gangs if they were considered terrorists? Predator UAVs launching hellfire missiles at large drug buys? Or perhaps a couple JDAMS dropped on em by a F-16 if they were beyond city limits? Treating criminal gangs as terrorist organizations is completely unnecessary.", 
        "intTime": 20090306, 
        "postID": 50, 
        "quote": "Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law?", 
        "reply": " No. I believe that we have enough laws under which to prosecute violent multiple felons which make up the vast majority of gang members. What additional measures do you hope would be used against gangs if they were considered terrorists? Predator UAVs launching hellfire missiles at large drug buys? Or perhaps a couple JDAMS dropped on em by a F-16 if they were beyond city limits? Treating criminal gangs as terrorist organizations is completely unnecessary.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:11:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs", 
        "intTime": 20090306, 
        "postID": 51, 
        "quote": "Originally posted by mcgreer: What about militias? White supremacist groups?", 
        "reply": " militias are terrorist WSG are gangs", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:25:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by world_king377: quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs Militias are not necessarily terrorists. You see the world in stark black and white, don't you?", 
        "intTime": 20090306, 
        "postID": 52, 
        "quote": "Originally posted by world_king377: quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs", 
        "reply": " Militias are not necessarily terrorists. You see the world in stark black and white, don't you?", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:33:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? No. I believe that we have enough laws under which to prosecute violent multiple felons which make up the vast majority of gang members. What additional measures do you hope would be used against gangs if they were considered terrorists? Predator UAVs launching hellfire missiles at large drug buys? Or perhaps a couple JDAMS dropped on em by a F-16 if they were beyond city limits? Treating criminal gangs as terrorist organizations is completely unnecessary. in today's world it might be a necessary evil. the laws We have for gangs aren't willing working as well. since more gangs are being created and becoming bigger. Terrorist law's would able the law enforcement to do a lot more right now then they could with out it. gangs aren't just streets now many are rivaling the mafia,cartels and other groups including terrorist. the only difference being terrorist groups and gangs are the ideas.", 
        "intTime": 20090306, 
        "postID": 53, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by world_king377: We all know the united states has a major gang problem. In the USA there are over 20,000 gangs,with over 1 million members. Many USA gangs have went from small protective street gangs to international gangs. MS-13 has over 30,000 members in over a dozen country's they rival cartels in many senses. The crips and bloods have spread throughout the USA like a wild fire out of control. Many of these gangs openly target other gang members only to end up killing a person who was in the wrong place at the wrong time. Many gangs control there turf as if its there own little nation. They smuggle weapons and drugs and people. They kill cops, city officials and other. They do millions of dollars in damages. So the point being in today's world should gangs be consider terrorist organizations and should they be treated as such under United States law? No. I believe that we have enough laws under which to prosecute violent multiple felons which make up the vast majority of gang members. What additional measures do you hope would be used against gangs if they were considered terrorists? Predator UAVs launching hellfire missiles at large drug buys? Or perhaps a couple JDAMS dropped on em by a F-16 if they were beyond city limits? Treating criminal gangs as terrorist organizations is completely unnecessary.", 
        "reply": " in today's world it might be a necessary evil. the laws We have for gangs aren't willing working as well. since more gangs are being created and becoming bigger. Terrorist law's would able the law enforcement to do a lot more right now then they could with out it. gangs aren't just streets now many are rivaling the mafia,cartels and other groups including terrorist. the only difference being terrorist groups and gangs are the ideas.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:36:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by world_king377: quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs Militias are not necessarily terrorists. You see the world in stark black and white, don't you? depends on the militias some are terrorist. While some aren't so its depends on the group. but the question is will they use terror as a weapon.", 
        "intTime": 20090306, 
        "postID": 54, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by world_king377: quote: Originally posted by mcgreer: What about militias? White supremacist groups? militias are terrorist WSG are gangs Militias are not necessarily terrorists. You see the world in stark black and white, don't you?", 
        "reply": " depends on the militias some are terrorist. While some aren't so its depends on the group. but the question is will they use terror as a weapon.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 21:39:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "It's the intent not the method that matters. terrorism is \"violent or destructive acts (as bombing) committed by groups in order to intimidate a population or government into granting their demands.\" What do gangs do? They shoot other gang members. Why do they do it? Because they want to make as much money as possible, and the quickest way to do that is through illegal activities. There is no \"cause\" that gangs fight for. Well....unless you count money as a \"cause\".", 
        "intTime": 20090306, 
        "postID": 55, 
        "quote": "", 
        "reply": "It's the intent not the method that matters. terrorism is \"violent or destructive acts (as bombing) committed by groups in order to intimidate a population or government into granting their demands.\" What do gangs do? They shoot other gang members. Why do they do it? Because they want to make as much money as possible, and the quickest way to do that is through illegal activities. There is no \"cause\" that gangs fight for. Well....unless you count money as a \"cause\".", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 22:02:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts. I agree its all about illegal money. The only way to hurt them is in the pocket book. The way to do that is to re issue all 100 dollar bills. Let everyone exchange them for 101 dollar bills in 30-60 days or lose them. That would create quite a cost for them trying to get rid of all that drug money. To say nothing of the tax evaders who have money vaulted and would have to account where it came from. Thats why it will never happen to many politicians and other wheeler dealers would lose to much they cant show.", 
        "intTime": 20090306, 
        "postID": 56, 
        "quote": "Originally posted by transport1: What should happen is that they are targeted under the RICO laws as organized crime syndicates, and any and all assets be seized as found. Taking their money is what hurts.", 
        "reply": " I agree its all about illegal money. The only way to hurt them is in the pocket book. The way to do that is to re issue all 100 dollar bills. Let everyone exchange them for 101 dollar bills in 30-60 days or lose them. That would create quite a cost for them trying to get rid of all that drug money. To say nothing of the tax evaders who have money vaulted and would have to account where it came from. Thats why it will never happen to many politicians and other wheeler dealers would lose to much they cant show.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 22:07:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: It's the intent not the method that matters. terrorism is \"violent or destructive acts (as bombing) committed by groups in order to intimidate a population or government into granting their demands.\" What do gangs do? They shoot other gang members. Why do they do it? Because they want to make as much money as possible, and the quickest way to do that is through illegal activities. There is no \"cause\" that gangs fight for. Well....unless you count money as a \"cause\". Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. The only difference between a gang and a terrorist is the ideas. But then again depending on the group of terrorist or gang they both can be put side to side and both would be the same.", 
        "intTime": 20090306, 
        "postID": 57, 
        "quote": "Originally posted by karlhungusjr: It's the intent not the method that matters. terrorism is \"violent or destructive acts (as bombing) committed by groups in order to intimidate a population or government into granting their demands.\" What do gangs do? They shoot other gang members. Why do they do it? Because they want to make as much money as possible, and the quickest way to do that is through illegal activities. There is no \"cause\" that gangs fight for. Well....unless you count money as a \"cause\".", 
        "reply": " Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. The only difference between a gang and a terrorist is the ideas. But then again depending on the group of terrorist or gang they both can be put side to side and both would be the same.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 23:17:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. I guess you missed this part \"It's the intent not the method that matters.\" of my post.", 
        "intTime": 20090306, 
        "postID": 58, 
        "quote": "Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official.", 
        "reply": " I guess you missed this part \"It's the intent not the method that matters.\" of my post.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 23:26:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. I guess you missed this part \"It's the intent not the method that matters.\" of my post. It depends on the group and the gang.", 
        "intTime": 20090306, 
        "postID": 59, 
        "quote": "Originally posted by karlhungusjr: quote: Gangs also want control and they use terror as a weapon just as much as terrorist use it. They shoot a snitch as a warning to all who talks. They bribe officials when they need something and if they cant they kill that official. I guess you missed this part \"It's the intent not the method that matters.\" of my post.", 
        "reply": " It depends on the group and the gang.", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 23:34:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: It depends on the group and the gang. If a gang uses violent or destructive acts in order to intimidate a population or government into granting their demands, then yes. They are \"terrorists\".", 
        "intTime": 20090306, 
        "postID": 60, 
        "quote": "It depends on the group and the gang.", 
        "reply": " If a gang uses violent or destructive acts in order to intimidate a population or government into granting their demands, then yes. They are \"terrorists\".", 
        "threadID": "409192893_2040069612001", 
        "time": "2009-03-06 23:40:00", 
        "title": "Should US gangs be selected to be label as terrorist organizations?", 
        "userID": "karlhungusjr"
    }
]