[
    {
        "content": "WASHINGTON – The Justice Department said Wednesday it would drop corruption charges against former Sen. Ted Stevens because it withheld evidence from the senator's defense team. The reversal is an embarrassing black eye for the Justice Department, which won a conviction against the Alaska Republican in October and is now asking to overturn it. Stevens, 85, the patriarch of Alaska politics since before statehood, lost his re-election bid in November and has been awaiting sentencing. He was the longest serving Republican senator. He was convicted of seven felony counts of lying on Senate financial disclosure forms to conceal hundreds of thousands of dollars in gifts and home renovations from a wealthy oil contractor. The trial was beset by government missteps, culminating recently when a federal judge took the unusual step of holding the Justice Department in contempt. In early morning court filings, the Justice Department admitted it never turned over notes from an interview with the oil contractor, who estimated the value of the renovation work as far less than he testified at trial. \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. The Justice Department is investigating the conduct of the prosecutors who tried the Stevens case.", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "WASHINGTON – The Justice Department said Wednesday it would drop corruption charges against former Sen. Ted Stevens because it withheld evidence from the senator's defense team. The reversal is an embarrassing black eye for the Justice Department, which won a conviction against the Alaska Republican in October and is now asking to overturn it. Stevens, 85, the patriarch of Alaska politics since before statehood, lost his re-election bid in November and has been awaiting sentencing. He was the longest serving Republican senator. He was convicted of seven felony counts of lying on Senate financial disclosure forms to conceal hundreds of thousands of dollars in gifts and home renovations from a wealthy oil contractor. The trial was beset by government missteps, culminating recently when a federal judge took the unusual step of holding the Justice Department in contempt. In early morning court filings, the Justice Department admitted it never turned over notes from an interview with the oil contractor, who estimated the value of the renovation work as far less than he testified at trial. \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. The Justice Department is investigating the conduct of the prosecutors who tried the Stevens case.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 06:21:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "samh32"
    }, 
    {
        "content": "Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE !", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE !", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 06:25:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by samh32: \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. I disagree with this decision because it leaves Stevens in limbo - it removes the guilty verdict without the option of providing another verdict in its place. If the evidence was incorrect or manufactured, say so. That way he is publicly exonerated. If you still think he is guilty, do a retrial (fairly this time) so that we can get a real verdict. This half-assed decision to just drop the case lets Repub's claim their guy was unjustly prosecuted while Dem's claim he got off easy! No resolution, and the American people (esp Alaskans) deserve one.", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "Originally posted by samh32: \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday.", 
        "reply": " I disagree with this decision because it leaves Stevens in limbo - it removes the guilty verdict without the option of providing another verdict in its place. If the evidence was incorrect or manufactured, say so. That way he is publicly exonerated. If you still think he is guilty, do a retrial (fairly this time) so that we can get a real verdict. This half-assed decision to just drop the case lets Repub's claim their guy was unjustly prosecuted while Dem's claim he got off easy! No resolution, and the American people (esp Alaskans) deserve one.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 06:51:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Holder is a hack. he is probably just setting up a precedent so he wont go after the corrupt turds on the left.", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "", 
        "reply": "Holder is a hack. he is probably just setting up a precedent so he wont go after the corrupt turds on the left.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 07:44:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by samh32: \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. I disagree with this decision because it leaves Stevens in limbo - it removes the guilty verdict without the option of providing another verdict in its place. If the evidence was incorrect or manufactured, say so. That way he is publicly exonerated. If you still think he is guilty, do a retrial (fairly this time) so that we can get a real verdict. This half-assed decision to just drop the case lets Repub's claim their guy was unjustly prosecuted while Dem's claim he got off easy! No resolution, and the American people (esp Alaskans) deserve one. Prosecutoral Misconduct is corruption, that said, I agree it doesn't say if Stevens is corrupt as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by samh32: \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. I disagree with this decision because it leaves Stevens in limbo - it removes the guilty verdict without the option of providing another verdict in its place. If the evidence was incorrect or manufactured, say so. That way he is publicly exonerated. If you still think he is guilty, do a retrial (fairly this time) so that we can get a real verdict. This half-assed decision to just drop the case lets Repub's claim their guy was unjustly prosecuted while Dem's claim he got off easy! No resolution, and the American people (esp Alaskans) deserve one.", 
        "reply": " Prosecutoral Misconduct is corruption, that said, I agree it doesn't say if Stevens is corrupt as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 07:47:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "L0A1"
    }, 
    {
        "content": "Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen.", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "", 
        "reply": "Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 07:56:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc...", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen.", 
        "reply": " Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc...", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:05:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Uh!! Hey! wait?! NO LINK, NO SOURCE CITED. Aint today APRIL FOOLS DAY !??", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "", 
        "reply": "Uh!! Hey! wait?! NO LINK, NO SOURCE CITED. Aint today APRIL FOOLS DAY !??", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:07:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "navy8086"
    }, 
    {
        "content": "There is already a thread in the In The News forum. Since this is about a news story this should be there. http://forums.military.com/eve/forums/a/tpc/f/672198221/m/2540015912001", 
        "intTime": 20090401, 
        "postID": 9, 
        "quote": "", 
        "reply": "There is already a thread in the In The News forum. Since this is about a news story this should be there. http://forums.military.com/eve/forums/a/tpc/f/672198221/m/2540015912001", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:19:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Holder is a hack. he is probably just setting up a precedent so he wont go after the corrupt turds on the left. BS the Republican Justice Department did not follow the rules, which is why the Judge delayed sentencing and censored the prosecutors from the REPUBLICAN Justice Department, it was because the probelms with the prosecution may have required a retrial, etc. that Mr Holder decided to drop the case. If actually seems based on the evidence already presented that Mr Stevens would LOSE a retrial but at his age with appeals and precedural motions, etc, he might not actually live long enough finish a retrial. Personally I think Mr Holder should also do a little extra for (to) the prosecutors who broke the rules in this case to show others that such conduct will not be accepted. For example an official reprimands on their records.", 
        "intTime": 20090401, 
        "postID": 10, 
        "quote": "Originally posted by GunnyRet03: Holder is a hack. he is probably just setting up a precedent so he wont go after the corrupt turds on the left.", 
        "reply": " BS the Republican Justice Department did not follow the rules, which is why the Judge delayed sentencing and censored the prosecutors from the REPUBLICAN Justice Department, it was because the probelms with the prosecution may have required a retrial, etc. that Mr Holder decided to drop the case. If actually seems based on the evidence already presented that Mr Stevens would LOSE a retrial but at his age with appeals and precedural motions, etc, he might not actually live long enough finish a retrial. Personally I think Mr Holder should also do a little extra for (to) the prosecutors who broke the rules in this case to show others that such conduct will not be accepted. For example an official reprimands on their records.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:22:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc... Does that work for all crimes? Let off one murderer because another goes free? How about thieves? In dropping the case against Stevens without expressly indicating his innocence they have weakened the chances of going after other crooked politicians. Prosecute Stevens fairly, and then go after the rest of the *******s on both sides of the aisle. This crap of letting them go is one of the few ways the higher-ups in the parties genuinely do collude.", 
        "intTime": 20090401, 
        "postID": 11, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc...", 
        "reply": " Does that work for all crimes? Let off one murderer because another goes free? How about thieves? In dropping the case against Stevens without expressly indicating his innocence they have weakened the chances of going after other crooked politicians. Prosecute Stevens fairly, and then go after the rest of the *******s on both sides of the aisle. This crap of letting them go is one of the few ways the higher-ups in the parties genuinely do collude.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:31:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc... Does that work for all crimes? Let off one murderer because another goes free? How about thieves? In dropping the case against Stevens without expressly indicating his innocence they have weakened the chances of going after other crooked politicians. Prosecute Stevens fairly, and then go after the rest of the *******s on both sides of the aisle. This crap of letting them go is one of the few ways the higher-ups in the parties genuinely do collude. Exactly, all it will do is allow them to try and justify letting the next corrupt politician go or even worse, stop prosecuting them all together. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 12, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc... Does that work for all crimes? Let off one murderer because another goes free? How about thieves? In dropping the case against Stevens without expressly indicating his innocence they have weakened the chances of going after other crooked politicians. Prosecute Stevens fairly, and then go after the rest of the *******s on both sides of the aisle. This crap of letting them go is one of the few ways the higher-ups in the parties genuinely do collude.", 
        "reply": " Exactly, all it will do is allow them to try and justify letting the next corrupt politician go or even worse, stop prosecuting them all together. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:33:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE ! So in other words...No jail time for this guy as well!", 
        "intTime": 20090401, 
        "postID": 13, 
        "quote": "Originally posted by navy8086: Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE !", 
        "reply": " So in other words...No jail time for this guy as well!", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 10:07:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by navy8086: Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE ! So in other words...No jail time for this guy as well! Probably not. quote: An analysis conducted by the Center for Responsive Politics found that Madoff and his wife, Ruth, gave the bulk of their campaign contributions to Democrats. The couple donated $238,200 to federal candidates, parties and committees since 1991, and Democrats received 88 percent of those donations. Madoff gave $11,400 to nine Republicans in the same time period. None of them is in office now.", 
        "intTime": 20090401, 
        "postID": 14, 
        "quote": "Originally posted by samh32: quote: Originally posted by navy8086: Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE ! So in other words...No jail time for this guy as well!", 
        "reply": " Probably not. quote: An analysis conducted by the Center for Responsive Politics found that Madoff and his wife, Ruth, gave the bulk of their campaign contributions to Democrats. The couple donated $238,200 to federal candidates, parties and committees since 1991, and Democrats received 88 percent of those donations. Madoff gave $11,400 to nine Republicans in the same time period. None of them is in office now.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 11:09:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Madoff gave $11,400 to nine Republicans in the same time period. None of them is in office now. Because they're all in jail!", 
        "intTime": 20090401, 
        "postID": 15, 
        "quote": "Originally posted by GunnyRet03: Madoff gave $11,400 to nine Republicans in the same time period. None of them is in office now.", 
        "reply": " Because they're all in jail!", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 11:19:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "samh32"
    }, 
    {
        "content": "Honestly, I don't give a crap if there is a (R) or (D) after his name, this is unacceptable. If he did the crime, then he should be prosecuted and if found guilty sentenced. I would only add that his age and health SHOULD be taken into consideration when sentenced. Now, he's been given a pass and RIGHTLY SO. He was not given a fair trial in court. His lawyers were unable to present the full and complete defence that's guarenteed by the Constitution, The prosecuters screwed the pooch, wether intetnional or not. They should be investigated and held accountable. If it was an accident, they should be fired for incompetence, if by design, then have them brought up on charges. The DOJ and the courts are the LAST place partisan politics should be played.", 
        "intTime": 20090401, 
        "postID": 16, 
        "quote": "", 
        "reply": "Honestly, I don't give a crap if there is a (R) or (D) after his name, this is unacceptable. If he did the crime, then he should be prosecuted and if found guilty sentenced. I would only add that his age and health SHOULD be taken into consideration when sentenced. Now, he's been given a pass and RIGHTLY SO. He was not given a fair trial in court. His lawyers were unable to present the full and complete defence that's guarenteed by the Constitution, The prosecuters screwed the pooch, wether intetnional or not. They should be investigated and held accountable. If it was an accident, they should be fired for incompetence, if by design, then have them brought up on charges. The DOJ and the courts are the LAST place partisan politics should be played.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 11:42:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "navy8086"
    }, 
    {
        "content": "At least rename the Airport. That'll fix his little red wagon. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090401, 
        "postID": 17, 
        "quote": "", 
        "reply": "At least rename the Airport. That'll fix his little red wagon. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 12:05:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "rm444"
    }, 
    {
        "content": "This is just insane. An example was set here, a bad one.", 
        "intTime": 20090401, 
        "postID": 18, 
        "quote": "", 
        "reply": "This is just insane. An example was set here, a bad one.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 14:13:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Sorry about your Senate seat there, guy. But you see, the only crooks we want in D.C. are Dems/libs/lefties and 0bama administration cabinet members and other appointees. Tax cheats preferred. And Sebelius had to \"fix\" three years worth of tax forms before her confirmation hearing, and, oh yeah, make sure she paid $7000", 
        "intTime": 20090401, 
        "postID": 19, 
        "quote": "Originally posted by SSgtRobertMorris: Sorry about your Senate seat there, guy. But you see, the only crooks we want in D.C. are Dems/libs/lefties and 0bama administration cabinet members and other appointees. Tax cheats preferred.", 
        "reply": " And Sebelius had to \"fix\" three years worth of tax forms before her confirmation hearing, and, oh yeah, make sure she paid $7000", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 14:16:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "transport1"
    }, 
    {
        "content": "The crux of the case was that Stevens got more than faIR VALUE for the work done, as he did pay the contractor some. The first statment of payments, under oath, showed fair valus paid. In court, work was magnified, payment minimized. Stevens was denied access to the first testimony, which was exculpatory in nature. This is illegal. Thus, there is great reluctance to re-try. After all, I'd call the prosecutors and make THEM explain why THEY railroaded me, wouldn't you? And so, case closed, much less embarassing.", 
        "intTime": 20090401, 
        "postID": 20, 
        "quote": "", 
        "reply": "The crux of the case was that Stevens got more than faIR VALUE for the work done, as he did pay the contractor some. The first statment of payments, under oath, showed fair valus paid. In court, work was magnified, payment minimized. Stevens was denied access to the first testimony, which was exculpatory in nature. This is illegal. Thus, there is great reluctance to re-try. After all, I'd call the prosecutors and make THEM explain why THEY railroaded me, wouldn't you? And so, case closed, much less embarassing.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 18:11:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: You can't possibly think Stevens was innocent....could you? He got the Bush special. No honest, perceptive person will believe that Franken is innocent, either, as but one example. Or Dodd, or Frank.", 
        "intTime": 20090401, 
        "postID": 21, 
        "quote": "Originally posted by dmuhler: You can't possibly think Stevens was innocent....could you? He got the Bush special.", 
        "reply": " No honest, perceptive person will believe that Franken is innocent, either, as but one example. Or Dodd, or Frank.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 18:37:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "RRR52"
    }, 
    {
        "content": "As the Attorney General, Eric Holder saw an abuse of power from prosecutors, and he did the right thing. Kinda like when someone is put in jail for 30 years for rape by a crooked prosecutor.", 
        "intTime": 20090402, 
        "postID": 22, 
        "quote": "", 
        "reply": "As the Attorney General, Eric Holder saw an abuse of power from prosecutors, and he did the right thing. Kinda like when someone is put in jail for 30 years for rape by a crooked prosecutor.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-02 01:20:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: You can't possibly think Stevens was innocent....could you? He got the Bush special. What's the \"Bush Special\"?(something tells me I'm gonna regret asking)", 
        "intTime": 20090402, 
        "postID": 23, 
        "quote": "Originally posted by dmuhler: You can't possibly think Stevens was innocent....could you? He got the Bush special.", 
        "reply": " What's the \"Bush Special\"?(something tells me I'm gonna regret asking)", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-02 07:02:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "67NOV"
    }, 
    {
        "content": "Well D, our political biases makes us see what we think is happening. I'm guilty of such things(though I'll deny it! ) But, I tend to think of what happened with the Gotti trials, as somewhat similar here. The prosecution screwed up a couple times, until they got it right. The only reason they got it \"right\" is that they managed to keep Bruce Coutler(sp) out of the court room.", 
        "intTime": 20090402, 
        "postID": 24, 
        "quote": "", 
        "reply": "Well D, our political biases makes us see what we think is happening. I'm guilty of such things(though I'll deny it! ) But, I tend to think of what happened with the Gotti trials, as somewhat similar here. The prosecution screwed up a couple times, until they got it right. The only reason they got it \"right\" is that they managed to keep Bruce Coutler(sp) out of the court room.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-02 07:40:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: No honest, perceptive person will believe that Franken is innocent Innocent of what? Canilbalism", 
        "intTime": 20090402, 
        "postID": 25, 
        "quote": "Originally posted by dmuhler: quote: No honest, perceptive person will believe that Franken is innocent Innocent of what?", 
        "reply": " Canilbalism", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-02 07:42:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "67NOV"
    }, 
    {
        "content": "WASHINGTON – The Justice Department said Wednesday it would drop corruption charges against former Sen. Ted Stevens because it withheld evidence from the senator's defense team. The reversal is an embarrassing black eye for the Justice Department, which won a conviction against the Alaska Republican in October and is now asking to overturn it. Stevens, 85, the patriarch of Alaska politics since before statehood, lost his re-election bid in November and has been awaiting sentencing. He was the longest serving Republican senator. He was convicted of seven felony counts of lying on Senate financial disclosure forms to conceal hundreds of thousands of dollars in gifts and home renovations from a wealthy oil contractor. The trial was beset by government missteps, culminating recently when a federal judge took the unusual step of holding the Justice Department in contempt. In early morning court filings, the Justice Department admitted it never turned over notes from an interview with the oil contractor, who estimated the value of the renovation work as far less than he testified at trial. \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. The Justice Department is investigating the conduct of the prosecutors who tried the Stevens case.", 
        "intTime": 20090401, 
        "postID": 26, 
        "quote": "", 
        "reply": "WASHINGTON – The Justice Department said Wednesday it would drop corruption charges against former Sen. Ted Stevens because it withheld evidence from the senator's defense team. The reversal is an embarrassing black eye for the Justice Department, which won a conviction against the Alaska Republican in October and is now asking to overturn it. Stevens, 85, the patriarch of Alaska politics since before statehood, lost his re-election bid in November and has been awaiting sentencing. He was the longest serving Republican senator. He was convicted of seven felony counts of lying on Senate financial disclosure forms to conceal hundreds of thousands of dollars in gifts and home renovations from a wealthy oil contractor. The trial was beset by government missteps, culminating recently when a federal judge took the unusual step of holding the Justice Department in contempt. In early morning court filings, the Justice Department admitted it never turned over notes from an interview with the oil contractor, who estimated the value of the renovation work as far less than he testified at trial. \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. The Justice Department is investigating the conduct of the prosecutors who tried the Stevens case.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 06:21:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "samh32"
    }, 
    {
        "content": "Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE !", 
        "intTime": 20090401, 
        "postID": 27, 
        "quote": "", 
        "reply": "Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE !", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 06:25:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by samh32: \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. I disagree with this decision because it leaves Stevens in limbo - it removes the guilty verdict without the option of providing another verdict in its place. If the evidence was incorrect or manufactured, say so. That way he is publicly exonerated. If you still think he is guilty, do a retrial (fairly this time) so that we can get a real verdict. This half-assed decision to just drop the case lets Repub's claim their guy was unjustly prosecuted while Dem's claim he got off easy! No resolution, and the American people (esp Alaskans) deserve one.", 
        "intTime": 20090401, 
        "postID": 28, 
        "quote": "Originally posted by samh32: \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday.", 
        "reply": " I disagree with this decision because it leaves Stevens in limbo - it removes the guilty verdict without the option of providing another verdict in its place. If the evidence was incorrect or manufactured, say so. That way he is publicly exonerated. If you still think he is guilty, do a retrial (fairly this time) so that we can get a real verdict. This half-assed decision to just drop the case lets Repub's claim their guy was unjustly prosecuted while Dem's claim he got off easy! No resolution, and the American people (esp Alaskans) deserve one.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 06:51:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "Holder is a hack. he is probably just setting up a precedent so he wont go after the corrupt turds on the left.", 
        "intTime": 20090401, 
        "postID": 29, 
        "quote": "", 
        "reply": "Holder is a hack. he is probably just setting up a precedent so he wont go after the corrupt turds on the left.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 07:44:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by samh32: \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. I disagree with this decision because it leaves Stevens in limbo - it removes the guilty verdict without the option of providing another verdict in its place. If the evidence was incorrect or manufactured, say so. That way he is publicly exonerated. If you still think he is guilty, do a retrial (fairly this time) so that we can get a real verdict. This half-assed decision to just drop the case lets Repub's claim their guy was unjustly prosecuted while Dem's claim he got off easy! No resolution, and the American people (esp Alaskans) deserve one. Prosecutoral Misconduct is corruption, that said, I agree it doesn't say if Stevens is corrupt as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 30, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by samh32: \"I have determined that it is in the interest of justice to dismiss the indictment and not proceed with a new trial,\" Attorney General Eric Holder said in a statement released Wednesday. I disagree with this decision because it leaves Stevens in limbo - it removes the guilty verdict without the option of providing another verdict in its place. If the evidence was incorrect or manufactured, say so. That way he is publicly exonerated. If you still think he is guilty, do a retrial (fairly this time) so that we can get a real verdict. This half-assed decision to just drop the case lets Repub's claim their guy was unjustly prosecuted while Dem's claim he got off easy! No resolution, and the American people (esp Alaskans) deserve one.", 
        "reply": " Prosecutoral Misconduct is corruption, that said, I agree it doesn't say if Stevens is corrupt as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 07:47:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "L0A1"
    }, 
    {
        "content": "Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen.", 
        "intTime": 20090401, 
        "postID": 31, 
        "quote": "", 
        "reply": "Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 07:56:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc...", 
        "intTime": 20090401, 
        "postID": 32, 
        "quote": "Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen.", 
        "reply": " Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc...", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:05:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Uh!! Hey! wait?! NO LINK, NO SOURCE CITED. Aint today APRIL FOOLS DAY !??", 
        "intTime": 20090401, 
        "postID": 33, 
        "quote": "", 
        "reply": "Uh!! Hey! wait?! NO LINK, NO SOURCE CITED. Aint today APRIL FOOLS DAY !??", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:07:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "navy8086"
    }, 
    {
        "content": "There is already a thread in the In The News forum. Since this is about a news story this should be there. http://forums.military.com/eve/forums/a/tpc/f/672198221/m/2540015912001", 
        "intTime": 20090401, 
        "postID": 34, 
        "quote": "", 
        "reply": "There is already a thread in the In The News forum. Since this is about a news story this should be there. http://forums.military.com/eve/forums/a/tpc/f/672198221/m/2540015912001", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:19:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Holder is a hack. he is probably just setting up a precedent so he wont go after the corrupt turds on the left. BS the Republican Justice Department did not follow the rules, which is why the Judge delayed sentencing and censored the prosecutors from the REPUBLICAN Justice Department, it was because the probelms with the prosecution may have required a retrial, etc. that Mr Holder decided to drop the case. If actually seems based on the evidence already presented that Mr Stevens would LOSE a retrial but at his age with appeals and precedural motions, etc, he might not actually live long enough finish a retrial. Personally I think Mr Holder should also do a little extra for (to) the prosecutors who broke the rules in this case to show others that such conduct will not be accepted. For example an official reprimands on their records.", 
        "intTime": 20090401, 
        "postID": 35, 
        "quote": "Originally posted by GunnyRet03: Holder is a hack. he is probably just setting up a precedent so he wont go after the corrupt turds on the left.", 
        "reply": " BS the Republican Justice Department did not follow the rules, which is why the Judge delayed sentencing and censored the prosecutors from the REPUBLICAN Justice Department, it was because the probelms with the prosecution may have required a retrial, etc. that Mr Holder decided to drop the case. If actually seems based on the evidence already presented that Mr Stevens would LOSE a retrial but at his age with appeals and precedural motions, etc, he might not actually live long enough finish a retrial. Personally I think Mr Holder should also do a little extra for (to) the prosecutors who broke the rules in this case to show others that such conduct will not be accepted. For example an official reprimands on their records.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:22:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc... Does that work for all crimes? Let off one murderer because another goes free? How about thieves? In dropping the case against Stevens without expressly indicating his innocence they have weakened the chances of going after other crooked politicians. Prosecute Stevens fairly, and then go after the rest of the *******s on both sides of the aisle. This crap of letting them go is one of the few ways the higher-ups in the parties genuinely do collude.", 
        "intTime": 20090401, 
        "postID": 36, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc...", 
        "reply": " Does that work for all crimes? Let off one murderer because another goes free? How about thieves? In dropping the case against Stevens without expressly indicating his innocence they have weakened the chances of going after other crooked politicians. Prosecute Stevens fairly, and then go after the rest of the *******s on both sides of the aisle. This crap of letting them go is one of the few ways the higher-ups in the parties genuinely do collude.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:31:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc... Does that work for all crimes? Let off one murderer because another goes free? How about thieves? In dropping the case against Stevens without expressly indicating his innocence they have weakened the chances of going after other crooked politicians. Prosecute Stevens fairly, and then go after the rest of the *******s on both sides of the aisle. This crap of letting them go is one of the few ways the higher-ups in the parties genuinely do collude. Exactly, all it will do is allow them to try and justify letting the next corrupt politician go or even worse, stop prosecuting them all together. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 37, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: Let's see, Charley Rangel cajoled AIG to donate $10,000 to a school that will be named after him a week before AIG bailout money was allocated. Charley Rangel cheated on his income taxes for years yet he is not being prosecuted, fined, or made to pay all he owes. I see no problem letting Stevens off the hook. Not overturning the conviction could cause others in the Obama administration to be looked at. We all know that isn't going to happen. Yeh, and that list is long of hacks on the left, that are not being tried with similar infractions. reid and his real estate deals, Dodd and his mortgage etc etc... Does that work for all crimes? Let off one murderer because another goes free? How about thieves? In dropping the case against Stevens without expressly indicating his innocence they have weakened the chances of going after other crooked politicians. Prosecute Stevens fairly, and then go after the rest of the *******s on both sides of the aisle. This crap of letting them go is one of the few ways the higher-ups in the parties genuinely do collude.", 
        "reply": " Exactly, all it will do is allow them to try and justify letting the next corrupt politician go or even worse, stop prosecuting them all together. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 08:33:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE ! So in other words...No jail time for this guy as well!", 
        "intTime": 20090401, 
        "postID": 38, 
        "quote": "Originally posted by navy8086: Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE !", 
        "reply": " So in other words...No jail time for this guy as well!", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 10:07:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by navy8086: Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE ! So in other words...No jail time for this guy as well! Probably not. quote: An analysis conducted by the Center for Responsive Politics found that Madoff and his wife, Ruth, gave the bulk of their campaign contributions to Democrats. The couple donated $238,200 to federal candidates, parties and committees since 1991, and Democrats received 88 percent of those donations. Madoff gave $11,400 to nine Republicans in the same time period. None of them is in office now.", 
        "intTime": 20090401, 
        "postID": 39, 
        "quote": "Originally posted by samh32: quote: Originally posted by navy8086: Not condoning what he did, but at 85 ANY jail time would probably turn into a LIFE SENTENCE ! So in other words...No jail time for this guy as well!", 
        "reply": " Probably not. quote: An analysis conducted by the Center for Responsive Politics found that Madoff and his wife, Ruth, gave the bulk of their campaign contributions to Democrats. The couple donated $238,200 to federal candidates, parties and committees since 1991, and Democrats received 88 percent of those donations. Madoff gave $11,400 to nine Republicans in the same time period. None of them is in office now.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 11:09:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Madoff gave $11,400 to nine Republicans in the same time period. None of them is in office now. Because they're all in jail!", 
        "intTime": 20090401, 
        "postID": 40, 
        "quote": "Originally posted by GunnyRet03: Madoff gave $11,400 to nine Republicans in the same time period. None of them is in office now.", 
        "reply": " Because they're all in jail!", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 11:19:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "samh32"
    }, 
    {
        "content": "Honestly, I don't give a crap if there is a (R) or (D) after his name, this is unacceptable. If he did the crime, then he should be prosecuted and if found guilty sentenced. I would only add that his age and health SHOULD be taken into consideration when sentenced. Now, he's been given a pass and RIGHTLY SO. He was not given a fair trial in court. His lawyers were unable to present the full and complete defence that's guarenteed by the Constitution, The prosecuters screwed the pooch, wether intetnional or not. They should be investigated and held accountable. If it was an accident, they should be fired for incompetence, if by design, then have them brought up on charges. The DOJ and the courts are the LAST place partisan politics should be played.", 
        "intTime": 20090401, 
        "postID": 41, 
        "quote": "", 
        "reply": "Honestly, I don't give a crap if there is a (R) or (D) after his name, this is unacceptable. If he did the crime, then he should be prosecuted and if found guilty sentenced. I would only add that his age and health SHOULD be taken into consideration when sentenced. Now, he's been given a pass and RIGHTLY SO. He was not given a fair trial in court. His lawyers were unable to present the full and complete defence that's guarenteed by the Constitution, The prosecuters screwed the pooch, wether intetnional or not. They should be investigated and held accountable. If it was an accident, they should be fired for incompetence, if by design, then have them brought up on charges. The DOJ and the courts are the LAST place partisan politics should be played.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 11:42:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "navy8086"
    }, 
    {
        "content": "At least rename the Airport. That'll fix his little red wagon. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090401, 
        "postID": 42, 
        "quote": "", 
        "reply": "At least rename the Airport. That'll fix his little red wagon. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 12:05:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "rm444"
    }, 
    {
        "content": "This is just insane. An example was set here, a bad one.", 
        "intTime": 20090401, 
        "postID": 43, 
        "quote": "", 
        "reply": "This is just insane. An example was set here, a bad one.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 14:13:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Sorry about your Senate seat there, guy. But you see, the only crooks we want in D.C. are Dems/libs/lefties and 0bama administration cabinet members and other appointees. Tax cheats preferred. And Sebelius had to \"fix\" three years worth of tax forms before her confirmation hearing, and, oh yeah, make sure she paid $7000", 
        "intTime": 20090401, 
        "postID": 44, 
        "quote": "Originally posted by SSgtRobertMorris: Sorry about your Senate seat there, guy. But you see, the only crooks we want in D.C. are Dems/libs/lefties and 0bama administration cabinet members and other appointees. Tax cheats preferred.", 
        "reply": " And Sebelius had to \"fix\" three years worth of tax forms before her confirmation hearing, and, oh yeah, make sure she paid $7000", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 14:16:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "transport1"
    }, 
    {
        "content": "The crux of the case was that Stevens got more than faIR VALUE for the work done, as he did pay the contractor some. The first statment of payments, under oath, showed fair valus paid. In court, work was magnified, payment minimized. Stevens was denied access to the first testimony, which was exculpatory in nature. This is illegal. Thus, there is great reluctance to re-try. After all, I'd call the prosecutors and make THEM explain why THEY railroaded me, wouldn't you? And so, case closed, much less embarassing.", 
        "intTime": 20090401, 
        "postID": 45, 
        "quote": "", 
        "reply": "The crux of the case was that Stevens got more than faIR VALUE for the work done, as he did pay the contractor some. The first statment of payments, under oath, showed fair valus paid. In court, work was magnified, payment minimized. Stevens was denied access to the first testimony, which was exculpatory in nature. This is illegal. Thus, there is great reluctance to re-try. After all, I'd call the prosecutors and make THEM explain why THEY railroaded me, wouldn't you? And so, case closed, much less embarassing.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 18:11:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: You can't possibly think Stevens was innocent....could you? He got the Bush special. No honest, perceptive person will believe that Franken is innocent, either, as but one example. Or Dodd, or Frank.", 
        "intTime": 20090401, 
        "postID": 46, 
        "quote": "Originally posted by dmuhler: You can't possibly think Stevens was innocent....could you? He got the Bush special.", 
        "reply": " No honest, perceptive person will believe that Franken is innocent, either, as but one example. Or Dodd, or Frank.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-01 18:37:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "RRR52"
    }, 
    {
        "content": "As the Attorney General, Eric Holder saw an abuse of power from prosecutors, and he did the right thing. Kinda like when someone is put in jail for 30 years for rape by a crooked prosecutor.", 
        "intTime": 20090402, 
        "postID": 47, 
        "quote": "", 
        "reply": "As the Attorney General, Eric Holder saw an abuse of power from prosecutors, and he did the right thing. Kinda like when someone is put in jail for 30 years for rape by a crooked prosecutor.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-02 01:20:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: You can't possibly think Stevens was innocent....could you? He got the Bush special. What's the \"Bush Special\"?(something tells me I'm gonna regret asking)", 
        "intTime": 20090402, 
        "postID": 48, 
        "quote": "Originally posted by dmuhler: You can't possibly think Stevens was innocent....could you? He got the Bush special.", 
        "reply": " What's the \"Bush Special\"?(something tells me I'm gonna regret asking)", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-02 07:02:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "67NOV"
    }, 
    {
        "content": "Well D, our political biases makes us see what we think is happening. I'm guilty of such things(though I'll deny it! ) But, I tend to think of what happened with the Gotti trials, as somewhat similar here. The prosecution screwed up a couple times, until they got it right. The only reason they got it \"right\" is that they managed to keep Bruce Coutler(sp) out of the court room.", 
        "intTime": 20090402, 
        "postID": 49, 
        "quote": "", 
        "reply": "Well D, our political biases makes us see what we think is happening. I'm guilty of such things(though I'll deny it! ) But, I tend to think of what happened with the Gotti trials, as somewhat similar here. The prosecution screwed up a couple times, until they got it right. The only reason they got it \"right\" is that they managed to keep Bruce Coutler(sp) out of the court room.", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-02 07:40:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: No honest, perceptive person will believe that Franken is innocent Innocent of what? Canilbalism", 
        "intTime": 20090402, 
        "postID": 50, 
        "quote": "Originally posted by dmuhler: quote: No honest, perceptive person will believe that Franken is innocent Innocent of what?", 
        "reply": " Canilbalism", 
        "threadID": "409192893_5920025912001", 
        "time": "2009-04-02 07:42:00", 
        "title": "US seeks to drop case against former Sen. Stevens", 
        "userID": "67NOV"
    }
]