[
    {
        "content": "For all those who think Obama has caused this and that \"no one knew\" about the impending economic disaster, I am posting a copy of a post I did at my Blog on April 12, 2008. It is an interesting post as it mixes the military with the economy. I am not \"linking\" to it here for fear people will say I am \"self promoting\". So, here was my post: TITLE: What if The Soldiers Come Home... To A Dead Economy... quote: First, I apologize for not writing for a while. I took a much needed vacation and when I came back, as usual, there was a lot of \"catching up\" to do. I am back however and have a lot of thoughts I want to share. The biggest one is on the economy. Many years ago, back when this blog was actually hosted at a completely different site, I wrote a piece called \"What if the Soldiers Came Home and There was No Country?\". The basic theme of this was while the soldiers were fighting for \"freedom\" (I cannot remember which excuse it was back then.. started with WMD, then went to Get Saddam and then to freedom for Iraqis .. let's just call it freedom) our Country's economy was in a shambles. Our debt was out of control (both trade deficit and public debt), the personal debt was out of control, companies were moving production overseas at a rapid pace and the leeches on Wall Street were extracting more and more of the wealth from the people who were really doing the work. My fear at that moment was the soldiers would eventually come home and find the Country they were defending was in tatters as the swarm of grasshoppers who consumed the land had moved on to other pastures. This was, of course, a prediction and like any prediction it was tough to prove. The warning signs were all there but you could not prove it. The expected right wing lunies came on the site to say \"No, everything is fine.. don't worry...\". In fact, I remember one statistic they used to tout was to \"look at home ownership\" and how rich people are with their homes. Well, I think the announcement by GE yesterday was kind of the solidifying force which told the Country that yes, we are in a recession and yes, things are really really bad. Yes, the soldier is coming home to a Country in tatters. Of course, the White House is quick to bail out Wall Street with a \"Bear Stearns\" bail out but thinks the \"market\" should handle the fact that many are losing their homes. A very predictable response from this administration. At the end of the day, the Bush administration will be the one known as the administration which brought the United States on the brink of collapse. We are caught up in wars we have no business in, our economy is beyond a recession (can anyone spell depression), our military is busted and we are far less safe and far less comfortable than we were just a few short years ago. This is the legacy of the Bush administration. It would not be so amazing if it were not so predictable. Many on the left predicted this and because it took a while to develop the right wingers continued to say we were \"nay sayers\". Well, here we are. Osama Bin Laden could not have dreamed of a better outcome than what he has been handed by the Bush Administration. He must be celebrating wildly that he suckered Bush into this disaster. UPDATE: Here is what the G-7 Has to say about the World Economy and the slide in the dollar.", 
        "intTime": 20090307, 
        "postID": 1, 
        "quote": "First, I apologize for not writing for a while. I took a much needed vacation and when I came back, as usual, there was a lot of \"catching up\" to do. I am back however and have a lot of thoughts I want to share. The biggest one is on the economy. Many years ago, back when this blog was actually hosted at a completely different site, I wrote a piece called \"What if the Soldiers Came Home and There was No Country?\". The basic theme of this was while the soldiers were fighting for \"freedom\" (I cannot remember which excuse it was back then.. started with WMD, then went to Get Saddam and then to freedom for Iraqis .. let's just call it freedom) our Country's economy was in a shambles. Our debt was out of control (both trade deficit and public debt), the personal debt was out of control, companies were moving production overseas at a rapid pace and the leeches on Wall Street were extracting more and more of the wealth from the people who were really doing the work. My fear at that moment was the soldiers would eventually come home and find the Country they were defending was in tatters as the swarm of grasshoppers who consumed the land had moved on to other pastures. This was, of course, a prediction and like any prediction it was tough to prove. The warning signs were all there but you could not prove it. The expected right wing lunies came on the site to say \"No, everything is fine.. don't worry...\". In fact, I remember one statistic they used to tout was to \"look at home ownership\" and how rich people are with their homes. Well, I think the announcement by GE yesterday was kind of the solidifying force which told the Country that yes, we are in a recession and yes, things are really really bad. Yes, the soldier is coming home to a Country in tatters. Of course, the White House is quick to bail out Wall Street with a \"Bear Stearns\" bail out but thinks the \"market\" should handle the fact that many are losing their homes. A very predictable response from this administration. At the end of the day, the Bush administration will be the one known as the administration which brought the United States on the brink of collapse. We are caught up in wars we have no business in, our economy is beyond a recession (can anyone spell depression), our military is busted and we are far less safe and far less comfortable than we were just a few short years ago. This is the legacy of the Bush administration. It would not be so amazing if it were not so predictable. Many on the left predicted this and because it took a while to develop the right wingers continued to say we were \"nay sayers\". Well, here we are. Osama Bin Laden could not have dreamed of a better outcome than what he has been handed by the Bush Administration. He must be celebrating wildly that he suckered Bush into this disaster. UPDATE: Here is what the G-7 Has to say about the World Economy and the slide in the dollar.", 
        "reply": "For all those who think Obama has caused this and that \"no one knew\" about the impending economic disaster, I am posting a copy of a post I did at my Blog on April 12, 2008. It is an interesting post as it mixes the military with the economy. I am not \"linking\" to it here for fear people will say I am \"self promoting\". So, here was my post: TITLE: What if The Soldiers Come Home... To A Dead Economy... ", 
        "threadID": "409192893_4500032712001", 
        "time": "2009-03-07 17:21:00", 
        "title": "What if The Soldiers Come Home to A Dead Economy? - Written in APRIL of 2008", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "---- \"we are caught up in (wars) we should not be in\". I think you ment to say \"war', as in singular. The Afgan war won`t be over untill our troops have their photos of bin laud.`s head being pizzed on by pigs. -- As for the other war, we should pull out yesterday, and let the wholesale slaughter begin. We can start teaching the world the meaning of the word, \"independence\" by pulling the 50k troops out of Japan, like NOW. The (helpless) Japs know ALL about military Power. Let them re build on THEIR dime. The same goes for Euro & the rest of this cesspool world. If Iran nukes Israel, the Israelis will nuke every sand flea within 700 miles of Iran and thus contaminating the oil fields for the next 300 years. The whole world knows the Jews have around 280 small to med. warheads, but have never tested them. India & the Packies are crazies, but nothing like the psycho ragheads. Now is the time for building 50' stone walls on Both our boarders. We also need another 20 \"Boomer subs\". This is truly a Brave New World. --- Good luck.", 
        "intTime": 20090307, 
        "postID": 2, 
        "quote": "", 
        "reply": "---- \"we are caught up in (wars) we should not be in\". I think you ment to say \"war', as in singular. The Afgan war won`t be over untill our troops have their photos of bin laud.`s head being pizzed on by pigs. -- As for the other war, we should pull out yesterday, and let the wholesale slaughter begin. We can start teaching the world the meaning of the word, \"independence\" by pulling the 50k troops out of Japan, like NOW. The (helpless) Japs know ALL about military Power. Let them re build on THEIR dime. The same goes for Euro & the rest of this cesspool world. If Iran nukes Israel, the Israelis will nuke every sand flea within 700 miles of Iran and thus contaminating the oil fields for the next 300 years. The whole world knows the Jews have around 280 small to med. warheads, but have never tested them. India & the Packies are crazies, but nothing like the psycho ragheads. Now is the time for building 50' stone walls on Both our boarders. We also need another 20 \"Boomer subs\". This is truly a Brave New World. --- Good luck.", 
        "threadID": "409192893_4500032712001", 
        "time": "2009-03-07 18:36:00", 
        "title": "What if The Soldiers Come Home to A Dead Economy? - Written in APRIL of 2008", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "I don't think anybody thinks Obama started our current economic condition. Especially since this thing started a little over a year ago between December of 2007 and January of 2008 depending on what source you use. Furthermore, almost everybody that pays attention to the market, invests in real estate and pays attention to GDP knew about it by February of 2008. I know I did, so I would suppose that many more did, as well. But, the problem is how it is being handled. We know exactly how we got here. That is not a hard issue to figure out. But, how to get out of it is what seems to be escaping those in public office. There are essentially three economic schools of thought that are being thought of in relation to this problem. They are: Keynesian School, New Keynesian School and Austrian School. Both Keynesian schools are government serving (big government) in that they promote price and wage fixing and inflation. This allows the government to get the most out of the dollars that they print and also allows them to utilize extremely large amounts of money without taxing the public. However, since Keynesian economics are short term implementations, they must be used quickly. The major drawback is that after it's implementation has run it's course inflation sets in (usually 6-18 months afterward). That is where the so called inflation tax sets in. The New Keynesian school differs from the traditional Keynesian school in that it primarily focuses on microeconomics rather that macroeconomics. Neither has ever stimulated any real growth. The Austrian school is pretty simple. It is all about a laissez faire approach. Get rid of inflation altogether by getting rid of FIAT currency. Do not spend more that you have in reserve (balance your checkbook). Banks must hold 100% reserves to cover deposits. Let the markets determine prices, interest rates, business cycle, etc rather than a central planner. There is more, but those are the basics. No one knows if the Austrian School would work as it has never been implemented. Whatever school you follow, it doesn't take a rocket scientist to figure out that they way out of this mess isn't to use the same recipe that got us into this mess in the first place (only on a much larger scale). And, that \"bad\" recipe is exactly what Obama is promoting. The funny thing is that he is doing absolutely nothing differently than what Bush did. It is exactly the same approach.", 
        "intTime": 20090307, 
        "postID": 3, 
        "quote": "", 
        "reply": "I don't think anybody thinks Obama started our current economic condition. Especially since this thing started a little over a year ago between December of 2007 and January of 2008 depending on what source you use. Furthermore, almost everybody that pays attention to the market, invests in real estate and pays attention to GDP knew about it by February of 2008. I know I did, so I would suppose that many more did, as well. But, the problem is how it is being handled. We know exactly how we got here. That is not a hard issue to figure out. But, how to get out of it is what seems to be escaping those in public office. There are essentially three economic schools of thought that are being thought of in relation to this problem. They are: Keynesian School, New Keynesian School and Austrian School. Both Keynesian schools are government serving (big government) in that they promote price and wage fixing and inflation. This allows the government to get the most out of the dollars that they print and also allows them to utilize extremely large amounts of money without taxing the public. However, since Keynesian economics are short term implementations, they must be used quickly. The major drawback is that after it's implementation has run it's course inflation sets in (usually 6-18 months afterward). That is where the so called inflation tax sets in. The New Keynesian school differs from the traditional Keynesian school in that it primarily focuses on microeconomics rather that macroeconomics. Neither has ever stimulated any real growth. The Austrian school is pretty simple. It is all about a laissez faire approach. Get rid of inflation altogether by getting rid of FIAT currency. Do not spend more that you have in reserve (balance your checkbook). Banks must hold 100% reserves to cover deposits. Let the markets determine prices, interest rates, business cycle, etc rather than a central planner. There is more, but those are the basics. No one knows if the Austrian School would work as it has never been implemented. Whatever school you follow, it doesn't take a rocket scientist to figure out that they way out of this mess isn't to use the same recipe that got us into this mess in the first place (only on a much larger scale). And, that \"bad\" recipe is exactly what Obama is promoting. The funny thing is that he is doing absolutely nothing differently than what Bush did. It is exactly the same approach.", 
        "threadID": "409192893_4500032712001", 
        "time": "2009-03-07 19:48:00", 
        "title": "What if The Soldiers Come Home to A Dead Economy? - Written in APRIL of 2008", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: I don't think anybody thinks Obama started our current economic condition. Especially since this thing started a little over a year ago between December of 2007 and January of 2008 depending on what source you use. Furthermore, almost everybody that pays attention to the market, invests in real estate and pays attention to GDP knew about it by February of 2008. I know I did, so I would suppose that many more did, as well. .... There are essentially three economic schools of thought that are being thought of in relation to this problem. They are: Keynesian School, New Keynesian School and Austrian School. Both Keynesian schools are government serving (big government) in that they promote price and wage fixing and inflation. This allows the government to get the most out of the dollars that they print and also allows them to utilize extremely large amounts of money without taxing the public. However, since Keynesian economics are short term implementations, they must be used quickly. The major drawback is that after it's implementation has run it's course inflation sets in (usually 6-18 months afterward). That is where the so called inflation tax sets in. The New Keynesian school differs from the traditional Keynesian school in that it primarily focuses on microeconomics rather that macroeconomics. Neither has ever stimulated any real growth. The Austrian school is pretty simple. It is all about a laissez faire approach. Get rid of inflation altogether by getting rid of FIAT currency. Do not spend more that you have in reserve (balance your checkbook). Banks must hold 100% reserves to cover deposits. Let the markets determine prices, interest rates, business cycle, etc rather than a central planner. There is more, but those are the basics. No one knows if the Austrian School would work as it has never been implemented. Whatever school you follow, it doesn't take a rocket scientist to figure out that they way out of this mess isn't to use the same recipe that got us into this mess in the first place (only on a much larger scale). And, that \"bad\" recipe is exactly what Obama is promoting. The funny thing is that he is doing absolutely nothing differently than what Bush did. It is exactly the same approach. First, are you reading the posts on this BB and listening to the Republican party? There are many, very high level people, who are claiming this is an \"Obama\" problem. So, I am glad we are all in agreement that it is not and I will leave it at that but to believe that \"no one\" thinks this is \"Obama's fault\" is ignoring the political enemy and you do that at your own peril. Second, I am sure there are hundreds of variations of the \"schools\" you mention above. The fact of the matter is without spending on something, anything, this economy will spiral into a massive depression. Now, you may say we need that to \"cleanse the pipes\" of the economic system but that is in fact what would happen without this massive Government spending. While deficit spending is a problem (I submit with PAYGO under Clinton, we actually were living within our means and drawing down the overall debt), that is not the problem that got us into this very acute economic spiral. I submit the issue is trust and solvency of the banking system. As soon as the banking system became essentially insolvent due to massive incompetence and malpractice by the Bush regulators, the Government had to start printing money; a complete collapse of the banking system is a \"nuclear bomb\" scenario. What the Government is not telling us now, but the markets are, is that even the amount of stimulus going in today is not enough due to the continued insolvency of the banking system. There is a big difference between what President Obama is trying to do and what Bush did and that is re-regulation of our financial system. The financial system hates it and therefore you have morons like \"Rick Santelli\" but reality is a very tightly regulated banking system is what is needed in this Country. Having said all that, right now there has to be a spender of last resort or get ready for 30% unemployment. Yes, this will cause inflation but I heard it said this way once: When the patient is on the operating table and he goes into cardiac arrest, the doctors crack open the chest and massage the heart; they worry about the side-effects once they are certain the patient will live. Right now the US economy is in cardiac arrest.", 
        "intTime": 20090308, 
        "postID": 4, 
        "quote": "Originally posted by 10tenths: I don't think anybody thinks Obama started our current economic condition. Especially since this thing started a little over a year ago between December of 2007 and January of 2008 depending on what source you use. Furthermore, almost everybody that pays attention to the market, invests in real estate and pays attention to GDP knew about it by February of 2008. I know I did, so I would suppose that many more did, as well. .... There are essentially three economic schools of thought that are being thought of in relation to this problem. They are: Keynesian School, New Keynesian School and Austrian School. Both Keynesian schools are government serving (big government) in that they promote price and wage fixing and inflation. This allows the government to get the most out of the dollars that they print and also allows them to utilize extremely large amounts of money without taxing the public. However, since Keynesian economics are short term implementations, they must be used quickly. The major drawback is that after it's implementation has run it's course inflation sets in (usually 6-18 months afterward). That is where the so called inflation tax sets in. The New Keynesian school differs from the traditional Keynesian school in that it primarily focuses on microeconomics rather that macroeconomics. Neither has ever stimulated any real growth. The Austrian school is pretty simple. It is all about a laissez faire approach. Get rid of inflation altogether by getting rid of FIAT currency. Do not spend more that you have in reserve (balance your checkbook). Banks must hold 100% reserves to cover deposits. Let the markets determine prices, interest rates, business cycle, etc rather than a central planner. There is more, but those are the basics. No one knows if the Austrian School would work as it has never been implemented. Whatever school you follow, it doesn't take a rocket scientist to figure out that they way out of this mess isn't to use the same recipe that got us into this mess in the first place (only on a much larger scale). And, that \"bad\" recipe is exactly what Obama is promoting. The funny thing is that he is doing absolutely nothing differently than what Bush did. It is exactly the same approach.", 
        "reply": " First, are you reading the posts on this BB and listening to the Republican party? There are many, very high level people, who are claiming this is an \"Obama\" problem. So, I am glad we are all in agreement that it is not and I will leave it at that but to believe that \"no one\" thinks this is \"Obama's fault\" is ignoring the political enemy and you do that at your own peril. Second, I am sure there are hundreds of variations of the \"schools\" you mention above. The fact of the matter is without spending on something, anything, this economy will spiral into a massive depression. Now, you may say we need that to \"cleanse the pipes\" of the economic system but that is in fact what would happen without this massive Government spending. While deficit spending is a problem (I submit with PAYGO under Clinton, we actually were living within our means and drawing down the overall debt), that is not the problem that got us into this very acute economic spiral. I submit the issue is trust and solvency of the banking system. As soon as the banking system became essentially insolvent due to massive incompetence and malpractice by the Bush regulators, the Government had to start printing money; a complete collapse of the banking system is a \"nuclear bomb\" scenario. What the Government is not telling us now, but the markets are, is that even the amount of stimulus going in today is not enough due to the continued insolvency of the banking system. There is a big difference between what President Obama is trying to do and what Bush did and that is re-regulation of our financial system. The financial system hates it and therefore you have morons like \"Rick Santelli\" but reality is a very tightly regulated banking system is what is needed in this Country. Having said all that, right now there has to be a spender of last resort or get ready for 30% unemployment. Yes, this will cause inflation but I heard it said this way once: When the patient is on the operating table and he goes into cardiac arrest, the doctors crack open the chest and massage the heart; they worry about the side-effects once they are certain the patient will live. Right now the US economy is in cardiac arrest.", 
        "threadID": "409192893_4500032712001", 
        "time": "2009-03-08 05:43:00", 
        "title": "What if The Soldiers Come Home to A Dead Economy? - Written in APRIL of 2008", 
        "userID": "michigancaptain"
    }, 
    {
        "content": "And, what do you suppose will happen when all of that FIAT currency that the Fed has been printing that the banks are using to increase their reserve is released into the economy? These cycles are nothing new. Except this time we are not increasing the money supply to fund a war, we are doing it to fund the crippled banks. The same that caused the problem in the first place and have caused most of the problems in the past. Sooner or later we are going to overcome this problem whether we spend or we don't spend. The big difference is that we are doing it the long and hard way. And, it is going to bite us in the rear in the end.", 
        "intTime": 20090308, 
        "postID": 5, 
        "quote": "", 
        "reply": "And, what do you suppose will happen when all of that FIAT currency that the Fed has been printing that the banks are using to increase their reserve is released into the economy? These cycles are nothing new. Except this time we are not increasing the money supply to fund a war, we are doing it to fund the crippled banks. The same that caused the problem in the first place and have caused most of the problems in the past. Sooner or later we are going to overcome this problem whether we spend or we don't spend. The big difference is that we are doing it the long and hard way. And, it is going to bite us in the rear in the end.", 
        "threadID": "409192893_4500032712001", 
        "time": "2009-03-08 11:36:00", 
        "title": "What if The Soldiers Come Home to A Dead Economy? - Written in APRIL of 2008", 
        "userID": "10Tenths"
    }
]