[
    {
        "content": "Yup, that's right AIG is suing the government. Why can't we throw the people in charge of this greedy corporation in prison and I mean in a real prison,not some pathetic country club? +++http://online.wsj.com/article/SB1235...googlenews_wsj In the midst of its negotiation with the federal government over revised terms of its bailout, American International Group Inc. sued the U.S. on Friday over a disputed $306 million in taxes, interest and penalties.", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "Yup, that's right AIG is suing the government. Why can't we throw the people in charge of this greedy corporation in prison and I mean in a real prison,not some pathetic country club? +++http://online.wsj.com/article/SB1235...googlenews_wsj In the midst of its negotiation with the federal government over revised terms of its bailout, American International Group Inc. sued the U.S. on Friday over a disputed $306 million in taxes, interest and penalties.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 14:49:00", 
        "title": "AIG sues Government.", 
        "userID": "R102"
    }, 
    {
        "content": "I just heard on FOX News that AIG is getting another 30 billion. Fox calls AIG a \"dead man walking.\" I think the President has to take a step back and reconsider these bailouts. The greedy b@st@rds will just want more and more.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "", 
        "reply": "I just heard on FOX News that AIG is getting another 30 billion. Fox calls AIG a \"dead man walking.\" I think the President has to take a step back and reconsider these bailouts. The greedy b@st@rds will just want more and more.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 15:09:00", 
        "title": "AIG sues Government.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by s******_mech: I just heard on FOX News that AIG is getting another 30 billion. Fox calls AIG a \"dead man walking.\" I think the President has to take a step back and reconsider these bailouts. The greedy b@st@rds will just want more and more. I am inclined to agree with you. Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO.", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "Originally posted by s******_mech: I just heard on FOX News that AIG is getting another 30 billion. Fox calls AIG a \"dead man walking.\" I think the President has to take a step back and reconsider these bailouts. The greedy b@st@rds will just want more and more.", 
        "reply": " I am inclined to agree with you. Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 15:12:00", 
        "title": "AIG sues Government.", 
        "userID": "R102"
    }, 
    {
        "content": "quote: Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO. Nice to agree with you on something. Toss in GM and Chrysler (hurt me to say that since I drive a Sebring) and a few others ... and the world will be, long term, a better place. I thought that AIG was looking to break itself up and that the initial federal aid was designed to carry it along while it did so. Guess the market for the piece parts isn't very good.", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO.", 
        "reply": " Nice to agree with you on something. Toss in GM and Chrysler (hurt me to say that since I drive a Sebring) and a few others ... and the world will be, long term, a better place. I thought that AIG was looking to break itself up and that the initial federal aid was designed to carry it along while it did so. Guess the market for the piece parts isn't very good.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 15:22:00", 
        "title": "AIG sues Government.", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO. Nice to agree with you on something. Toss in GM and Chrysler (hurt me to say that since I drive a Sebring) and a few others ... and the world will be, long term, a better place. I thought that AIG was looking to break itself up and that the initial federal aid was designed to carry it along while it did so. Guess the market for the piece parts isn't very good. A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry.", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "Originally posted by I_M_Qwerty: quote: Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO. Nice to agree with you on something. Toss in GM and Chrysler (hurt me to say that since I drive a Sebring) and a few others ... and the world will be, long term, a better place. I thought that AIG was looking to break itself up and that the initial federal aid was designed to carry it along while it did so. Guess the market for the piece parts isn't very good.", 
        "reply": " A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 15:30:00", 
        "title": "AIG sues Government.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO. Nice to agree with you on something. Toss in GM and Chrysler (hurt me to say that since I drive a Sebring) and a few others ... and the world will be, long term, a better place. Yes. I would try and keep Ford. I thought that AIG was looking to break itself up and that the initial federal aid was designed to carry it along while it did so. Guess the market for the piece parts isn't very good. True. I had heard the same thing.", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "Originally posted by I_M_Qwerty: quote: Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO. Nice to agree with you on something. Toss in GM and Chrysler (hurt me to say that since I drive a Sebring) and a few others ... and the world will be, long term, a better place. Yes. I would try and keep Ford. I thought that AIG was looking to break itself up and that the initial federal aid was designed to carry it along while it did so. Guess the market for the piece parts isn't very good.", 
        "reply": " True. I had heard the same thing.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 15:49:00", 
        "title": "AIG sues Government.", 
        "userID": "R102"
    }, 
    {
        "content": "quote: A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry. I also want to see some CEOs go to prison.", 
        "intTime": 20090302, 
        "postID": 7, 
        "quote": "A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry.", 
        "reply": " I also want to see some CEOs go to prison.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 15:50:00", 
        "title": "AIG sues Government.", 
        "userID": "R102"
    }, 
    {
        "content": "quote: Originally posted by R102: quote: A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry. I also want to see some CEOs go to prison. Right after Franks,Maxine Waters, and Greg Meeks.", 
        "intTime": 20090302, 
        "postID": 8, 
        "quote": "Originally posted by R102: quote: A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry. I also want to see some CEOs go to prison.", 
        "reply": " Right after Franks,Maxine Waters, and Greg Meeks.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 16:06:00", 
        "title": "AIG sues Government.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: I am inclined to agree with you. Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO. AIG will never take a fall, the teachers unions 401K is invested in AIG.", 
        "intTime": 20090302, 
        "postID": 9, 
        "quote": "I am inclined to agree with you. Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO.", 
        "reply": " AIG will never take a fall, the teachers unions 401K is invested in AIG.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 16:29:00", 
        "title": "AIG sues Government.", 
        "userID": "airwing1"
    }, 
    {
        "content": "AIG just needs to be broken up period... not sold off, broken up. Then let the resultant pieces survive or fail on their own. It is the best course of action if you wish to save jobs and protect your bail out investments. As for the Teachers Union's, et al., Stock holdings - They are gone regardless... all we are doing now is allowing the favored to cash out and otherwise lessen their risk.", 
        "intTime": 20090302, 
        "postID": 10, 
        "quote": "", 
        "reply": "AIG just needs to be broken up period... not sold off, broken up. Then let the resultant pieces survive or fail on their own. It is the best course of action if you wish to save jobs and protect your bail out investments. As for the Teachers Union's, et al., Stock holdings - They are gone regardless... all we are doing now is allowing the favored to cash out and otherwise lessen their risk.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 16:41:00", 
        "title": "AIG sues Government.", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by R102: quote: A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry. I also want to see some CEOs go to prison. Right after Franks,Maxine Waters, and Greg Meeks. That's fine by me.", 
        "intTime": 20090302, 
        "postID": 11, 
        "quote": "Originally posted by threerings: quote: Originally posted by R102: quote: A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry. I also want to see some CEOs go to prison. Right after Franks,Maxine Waters, and Greg Meeks.", 
        "reply": " That's fine by me.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 17:06:00", 
        "title": "AIG sues Government.", 
        "userID": "R102"
    }, 
    {
        "content": "quote: Originally posted by R102: quote: Originally posted by threerings: quote: Originally posted by R102: quote: A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry. I also want to see some CEOs go to prison. Right after Franks,Maxine Waters, and Greg Meeks. That's fine by me. Don't forget Gramm..", 
        "intTime": 20090302, 
        "postID": 12, 
        "quote": "Originally posted by R102: quote: Originally posted by threerings: quote: Originally posted by R102: quote: A trifecta.. You guys are absolutely right and throw in Citi and BofA while we are at it. This in for a penny in for a pound stuff will suck our wallets dry. I also want to see some CEOs go to prison. Right after Franks,Maxine Waters, and Greg Meeks. That's fine by me.", 
        "reply": " Don't forget Gramm..", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 17:16:00", 
        "title": "AIG sues Government.", 
        "userID": "floersh"
    }, 
    {
        "content": "*sigh* This whole notion of \"they're too big to fail\" is a perfect illustration of why anti-trust laws shouldn't be ignored. Amazing - they wanted to use anti-trust laws to try to prevent Whole Foods Markets from buying out Wild Oats (note: Wild Oats was going bankrupt on its own), but it was okay for companies like AIG to become so big that their insolvency could collapse the entire economy. \"Hey Feds! They've got too much organic granola for their own good! STOP THEM! But give your money to AIG because they need a handout!\" Seriously, this is so twisted it's nauseating. Anti-trust laws were ignored when it was convenient for the sake of the largest, most powerful corporations in the world, and look where it got us. There should never be a company so big and powerful that its failure could collapse the global economy, but yet, here we are. What the hell ever happened to real capitalism? Businesses are SUPPOSED to be born, and die, depending on competition. REAL capitalism, GOOD capitalism, promotes growth. These twisted games of politics manipulating profits for corporate biggies have been going on for YEARS, all relying on a fake monetary system to support them. Our economy is a sham, and the fact that it's imploding like this is proof.", 
        "intTime": 20090302, 
        "postID": 13, 
        "quote": "", 
        "reply": "*sigh* This whole notion of \"they're too big to fail\" is a perfect illustration of why anti-trust laws shouldn't be ignored. Amazing - they wanted to use anti-trust laws to try to prevent Whole Foods Markets from buying out Wild Oats (note: Wild Oats was going bankrupt on its own), but it was okay for companies like AIG to become so big that their insolvency could collapse the entire economy. \"Hey Feds! They've got too much organic granola for their own good! STOP THEM! But give your money to AIG because they need a handout!\" Seriously, this is so twisted it's nauseating. Anti-trust laws were ignored when it was convenient for the sake of the largest, most powerful corporations in the world, and look where it got us. There should never be a company so big and powerful that its failure could collapse the global economy, but yet, here we are. What the hell ever happened to real capitalism? Businesses are SUPPOSED to be born, and die, depending on competition. REAL capitalism, GOOD capitalism, promotes growth. These twisted games of politics manipulating profits for corporate biggies have been going on for YEARS, all relying on a fake monetary system to support them. Our economy is a sham, and the fact that it's imploding like this is proof.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 20:48:00", 
        "title": "AIG sues Government.", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "These big monsters go bust, then so does the government - then what?? Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 14, 
        "quote": "", 
        "reply": "These big monsters go bust, then so does the government - then what?? Wandering and Wondering", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 20:53:00", 
        "title": "AIG sues Government.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: These big monsters go bust, then so does the government - then what?? I don't know, but either way things are not looking overly rosy at the moment. I do hope this stimulus package will work. I am not holding my breath though.", 
        "intTime": 20090302, 
        "postID": 15, 
        "quote": "Originally posted by greywolfghost: These big monsters go bust, then so does the government - then what??", 
        "reply": " I don't know, but either way things are not looking overly rosy at the moment. I do hope this stimulus package will work. I am not holding my breath though.", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-02 21:37:00", 
        "title": "AIG sues Government.", 
        "userID": "R102"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO. Nice to agree with you on something. Toss in GM and Chrysler (hurt me to say that since I drive a Sebring) and a few others ... and the world will be, long term, a better place. I thought that AIG was looking to break itself up and that the initial federal aid was designed to carry it along while it did so. Guess the market for the piece parts isn't very good. I never thought I would see the day! The three of us agreeing on something! Great! Frisco", 
        "intTime": 20090303, 
        "postID": 16, 
        "quote": "Originally posted by I_M_Qwerty: quote: Some of this companies are going to have to take a fall. AIG is one of the ones that needs to go IMO. Nice to agree with you on something. Toss in GM and Chrysler (hurt me to say that since I drive a Sebring) and a few others ... and the world will be, long term, a better place. I thought that AIG was looking to break itself up and that the initial federal aid was designed to carry it along while it did so. Guess the market for the piece parts isn't very good.", 
        "reply": " I never thought I would see the day! The three of us agreeing on something! Great! Frisco", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-03 04:20:00", 
        "title": "AIG sues Government.", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: These big monsters go bust, then so does the government - then what?? Well I hate to say this, because it will probably make 1929 look rosey. But we need to get the government out of every aspect of our lives. So in respect the government going bust may not be necessarily a bad thing. They won't have the money to do anything and therefore maybe after the economic wreakage is cleared we will be able to rebuild this country as it was meant to be. Anyway, where in the Constitution does it say the government has the authority to keep these companies afloat? Either way it is not going to be a pretty time in this country's history. Frisco", 
        "intTime": 20090303, 
        "postID": 17, 
        "quote": "Originally posted by greywolfghost: These big monsters go bust, then so does the government - then what??", 
        "reply": " Well I hate to say this, because it will probably make 1929 look rosey. But we need to get the government out of every aspect of our lives. So in respect the government going bust may not be necessarily a bad thing. They won't have the money to do anything and therefore maybe after the economic wreakage is cleared we will be able to rebuild this country as it was meant to be. Anyway, where in the Constitution does it say the government has the authority to keep these companies afloat? Either way it is not going to be a pretty time in this country's history. Frisco", 
        "threadID": "409192893_4680007612001", 
        "time": "2009-03-03 04:24:00", 
        "title": "AIG sues Government.", 
        "userID": "FriscoLady01"
    }
]