[
    {
        "content": "+++http://townhall.com/columnists/AustinHill/2009/03/22/ethical_dilemmas_amid_the_presidents_charm?page=full&comments=true Since then there have been three additional infusions of our money into the AIG Corporation, the most recent one happening last month at the hand of President Obama. And here lies a moral dilemma that is being ignored: President Obama willingly accepted donations from AIG to his presidential campaign last year, and now this year he has handed-over billions of our tax dollars to the company. Was it a “quid pro quo,” “return the favor” move from Obama? The situation certainly entails a conflict of interests. Given this, and given his recent desire to play the “give the money back” game, President Obama needs to start by giving back to AIG the money they gave him for his campaign. Sadly, there is no evidence that President Obama has any intention or desire to resolve this ethical dilemma. Our government is also morally culpable for the “terms” of the AIG bailout. Ever since the bonus payouts to AIG employees became a “controversy” in the media, President Obama has insisted that he knew “nothing,” prior to authorizing the bailout funds, about AIG’s contractual obligations to pay bonuses to their executives, and has expressed indignation over the matter. Yet last Wednesday, Senator Christopher Dodd stated on CNN that indeed, he and “the administration” knew very well that AIG had obligations to pay bonuses to their executives, that he (Dodd) attempted to legislatively prevent those bonuses from being paid, and that “the administration” pressured him to not prevent the bonus payments. So Senator Dodd and President Obama are saying different things about our government’s relationship to AIG. Both stories may be false, but they cannot both be true at the same time. If one of these men is speaking truthfully, then the other is lying. Worse yet has been the public response from President Obama and members of Congress to taxpayer outrage. In a spectacular game of “CYA,” President Obama, Speaker of the House Nancy Pelosi, Congressman Barney Frank, Senator Christopher Dodd, and Republican Senator Chuck Grassley (just to name a few) have all sought to deflect criticism of themselves for spending billions of our dollars on a failing corporation, by making 73 AIG executives the object of public scorn. Nothing is known publicly about the bonus recipients themselves. Yet it is probable that, despite the overall failure of the AIG \"team,\" the anonymous 73 had to achieve some significant individual goals to qualify for a bonus. OJ Simpson was once a record-setting, history making, hall-of-famer, “bonus worthy” running back, yet nearly his entire NFL career was spent with a “failed” team called the Buffalo Bills. The situation with the AIG executives is likely similar. But details don’t matter for power-hungry politicians. To divert negative attention from themselves, President Obama and members of Congress have begun a process of “occupational profiling.” The idea of singling-out Americans according to their ethnicity for special government harassment and punishment - - “racial profiling” - - is abhorrent. But the leaders of our government have singled-out anyone with the word “executive” in their job title, for very ugly treatment. President Obama is correct to say that there are “moral and ethical” issues entailed in this mess. Americans need to focus on what those issues truly are.", 
        "intTime": 20090322, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://townhall.com/columnists/AustinHill/2009/03/22/ethical_dilemmas_amid_the_presidents_charm?page=full&comments=true Since then there have been three additional infusions of our money into the AIG Corporation, the most recent one happening last month at the hand of President Obama. And here lies a moral dilemma that is being ignored: President Obama willingly accepted donations from AIG to his presidential campaign last year, and now this year he has handed-over billions of our tax dollars to the company. Was it a “quid pro quo,” “return the favor” move from Obama? The situation certainly entails a conflict of interests. Given this, and given his recent desire to play the “give the money back” game, President Obama needs to start by giving back to AIG the money they gave him for his campaign. Sadly, there is no evidence that President Obama has any intention or desire to resolve this ethical dilemma. Our government is also morally culpable for the “terms” of the AIG bailout. Ever since the bonus payouts to AIG employees became a “controversy” in the media, President Obama has insisted that he knew “nothing,” prior to authorizing the bailout funds, about AIG’s contractual obligations to pay bonuses to their executives, and has expressed indignation over the matter. Yet last Wednesday, Senator Christopher Dodd stated on CNN that indeed, he and “the administration” knew very well that AIG had obligations to pay bonuses to their executives, that he (Dodd) attempted to legislatively prevent those bonuses from being paid, and that “the administration” pressured him to not prevent the bonus payments. So Senator Dodd and President Obama are saying different things about our government’s relationship to AIG. Both stories may be false, but they cannot both be true at the same time. If one of these men is speaking truthfully, then the other is lying. Worse yet has been the public response from President Obama and members of Congress to taxpayer outrage. In a spectacular game of “CYA,” President Obama, Speaker of the House Nancy Pelosi, Congressman Barney Frank, Senator Christopher Dodd, and Republican Senator Chuck Grassley (just to name a few) have all sought to deflect criticism of themselves for spending billions of our dollars on a failing corporation, by making 73 AIG executives the object of public scorn. Nothing is known publicly about the bonus recipients themselves. Yet it is probable that, despite the overall failure of the AIG \"team,\" the anonymous 73 had to achieve some significant individual goals to qualify for a bonus. OJ Simpson was once a record-setting, history making, hall-of-famer, “bonus worthy” running back, yet nearly his entire NFL career was spent with a “failed” team called the Buffalo Bills. The situation with the AIG executives is likely similar. But details don’t matter for power-hungry politicians. To divert negative attention from themselves, President Obama and members of Congress have begun a process of “occupational profiling.” The idea of singling-out Americans according to their ethnicity for special government harassment and punishment - - “racial profiling” - - is abhorrent. But the leaders of our government have singled-out anyone with the word “executive” in their job title, for very ugly treatment. President Obama is correct to say that there are “moral and ethical” issues entailed in this mess. Americans need to focus on what those issues truly are.", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 13:18:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "threerings"
    }, 
    {
        "content": "Riiiiiight...", 
        "intTime": 20090322, 
        "postID": 2, 
        "quote": "", 
        "reply": "Riiiiiight...", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 15:35:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Ah, the Orator speaks... with his usual lack of veracity or acumen... but with his typical BDS showing. Barry raked in a great deal from AIG and AIG staff THIS election... and now, after giving away millions, they need a bailout from.... hold on... wait for it... Barry, the guy they helped put in office...", 
        "intTime": 20090322, 
        "postID": 3, 
        "quote": "", 
        "reply": "Ah, the Orator speaks... with his usual lack of veracity or acumen... but with his typical BDS showing. Barry raked in a great deal from AIG and AIG staff THIS election... and now, after giving away millions, they need a bailout from.... hold on... wait for it... Barry, the guy they helped put in office...", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 16:21:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Barry signed the stimulus bill that approved the bailout for AIG. As you are so quick to say, since he sign it and its on his watch, its his responsibility.", 
        "intTime": 20090322, 
        "postID": 4, 
        "quote": "", 
        "reply": "Barry signed the stimulus bill that approved the bailout for AIG. As you are so quick to say, since he sign it and its on his watch, its his responsibility.", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 16:28:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "You're both in your respective left and right fields. The first two bailouts were from the FRB with Geithner as point man for the Fed. The third was under the Bush administration (40 billion) with SECTREAS Paulson as point man and using TARP I funds. The fourth is under the Obama administration (30 billion) with SECTREAS Geithner as point man and using TARP II funds. The stimulus bill has jack all nothing to do with the bailout funds.", 
        "intTime": 20090322, 
        "postID": 5, 
        "quote": "", 
        "reply": "You're both in your respective left and right fields. The first two bailouts were from the FRB with Geithner as point man for the Fed. The third was under the Bush administration (40 billion) with SECTREAS Paulson as point man and using TARP I funds. The fourth is under the Obama administration (30 billion) with SECTREAS Geithner as point man and using TARP II funds. The stimulus bill has jack all nothing to do with the bailout funds.", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 16:52:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Mom2APAJ: Barry signed the stimulus bill that approved the bailout for AIG. As you are so quick to say, since he sign it and its on his watch, its his responsibility. We are not talking about responsibility. We are talking about a crime. The author of this thread posits that The president accepted a bribe. It is non-sense, but if were true then it could be equally true of Bush. Of course you aren't talking about responsibility since its Barry at the helm. The crime is stealing BILLIONS of taxpayer dollars to fund already funded programs, the special interest groups, and pork stuck in the stimulus... (please note I did NOT say Dem or Rep pork just PORK in the bill the US doesn't need and can't afford).", 
        "intTime": 20090322, 
        "postID": 6, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Mom2APAJ: Barry signed the stimulus bill that approved the bailout for AIG. As you are so quick to say, since he sign it and its on his watch, its his responsibility. We are not talking about responsibility. We are talking about a crime. The author of this thread posits that The president accepted a bribe. It is non-sense, but if were true then it could be equally true of Bush.", 
        "reply": " Of course you aren't talking about responsibility since its Barry at the helm. The crime is stealing BILLIONS of taxpayer dollars to fund already funded programs, the special interest groups, and pork stuck in the stimulus... (please note I did NOT say Dem or Rep pork just PORK in the bill the US doesn't need and can't afford).", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 17:03:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: Barry signed the stimulus bill that approved the bailout for AIG. As you are so quick to say, since he sign it and its on his watch, its his responsibility. Sorry, I fat fingered my post. It should have read: Barry signed the stimulus bill AND approved the bailout for AIG. As you are so quick to say, since he sign it and its on his watch, its his responsibility.", 
        "intTime": 20090322, 
        "postID": 7, 
        "quote": "Originally posted by Mom2APAJ: Barry signed the stimulus bill that approved the bailout for AIG. As you are so quick to say, since he sign it and its on his watch, its his responsibility.", 
        "reply": " Sorry, I fat fingered my post. It should have read: Barry signed the stimulus bill AND approved the bailout for AIG. As you are so quick to say, since he sign it and its on his watch, its his responsibility.", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 17:05:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Bailouts!!!!....We just got done with eight years of bailing out oil rich countries...get a grip...AIG has been part of everyones life for many many years.", 
        "intTime": 20090322, 
        "postID": 8, 
        "quote": "", 
        "reply": "Bailouts!!!!....We just got done with eight years of bailing out oil rich countries...get a grip...AIG has been part of everyones life for many many years.", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 19:46:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: You're both in your respective left and right fields. The first two bailouts were from the FRB with Geithner as point man for the Fed. The third was under the Bush administration (40 billion) with SECTREAS Paulson as point man and using TARP I funds. The fourth is under the Obama administration (30 billion) with SECTREAS Geithner as point man and using TARP II funds. The stimulus bill has jack all nothing to do with the bailout funds. Holy crap! Somebodies actually been paying attention.", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by I_M_Qwerty: You're both in your respective left and right fields. The first two bailouts were from the FRB with Geithner as point man for the Fed. The third was under the Bush administration (40 billion) with SECTREAS Paulson as point man and using TARP I funds. The fourth is under the Obama administration (30 billion) with SECTREAS Geithner as point man and using TARP II funds. The stimulus bill has jack all nothing to do with the bailout funds.", 
        "reply": " Holy crap! Somebodies actually been paying attention.", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-22 20:56:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Ahh oh wise one.....hmmm accusing the POTUS of a crime with zero evidence.....that is all you did during the last Admin. You had zero evidence but it didn't stop you now did it? Maybe YOU should be sacked... This message has been edited. Last edited by: dhd123, Mon 23 March 2009 02:01 AM", 
        "intTime": 20090323, 
        "postID": 10, 
        "quote": "", 
        "reply": "Ahh oh wise one.....hmmm accusing the POTUS of a crime with zero evidence.....that is all you did during the last Admin. You had zero evidence but it didn't stop you now did it? Maybe YOU should be sacked... This message has been edited. Last edited by: dhd123, Mon 23 March 2009 02:01 AM", 
        "threadID": "409192893_1560085812001", 
        "time": "2009-03-23 01:45:00", 
        "title": "Obama: quid pro quo with AIG?", 
        "userID": "dhd123"
    }
]