[
    {
        "content": "Why has President Obama not stepped forward to calm the waters between his number one supporter and the CIA? If Pelosi is innocent why hasn't she provided any documents to clear her? Could it be that the reason Obama has not made any public press releases is because deep down he wants her gone? After all, as of late she has not been providing him with any good press.", 
        "intTime": 20090518, 
        "postID": 1, 
        "quote": "", 
        "reply": "Why has President Obama not stepped forward to calm the waters between his number one supporter and the CIA? If Pelosi is innocent why hasn't she provided any documents to clear her? Could it be that the reason Obama has not made any public press releases is because deep down he wants her gone? After all, as of late she has not been providing him with any good press.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 04:13:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Duster6"
    }, 
    {
        "content": "He has bigger fish to fry. Peleosi will get past this witch hunt and if Sen Freinstein was smart, she would get the investigation going. Remember Rove admitted a crime had been committed....and he would know.", 
        "intTime": 20090518, 
        "postID": 2, 
        "quote": "", 
        "reply": "He has bigger fish to fry. Peleosi will get past this witch hunt and if Sen Freinstein was smart, she would get the investigation going. Remember Rove admitted a crime had been committed....and he would know.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 04:33:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "SenClaghorn"
    }, 
    {
        "content": "I doubt if he'd lose any sleep over her leaving. But I don't think he is or would actively try to make her leave.", 
        "intTime": 20090518, 
        "postID": 3, 
        "quote": "", 
        "reply": "I doubt if he'd lose any sleep over her leaving. But I don't think he is or would actively try to make her leave.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 04:51:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "his best bet is to ride his popularity and stay out of the mud slinging", 
        "intTime": 20090518, 
        "postID": 4, 
        "quote": "", 
        "reply": "his best bet is to ride his popularity and stay out of the mud slinging", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 05:04:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "All I can say is that if I were President of the United States of America and one of my staff or other politician with a Top Secret security clearance with a National Security identifier, I'd step up to the plate and order some type of special prosecutor to conduct an investigation into this matter. I would think the people of this country would want to know the truth about this.", 
        "intTime": 20090518, 
        "postID": 5, 
        "quote": "", 
        "reply": "All I can say is that if I were President of the United States of America and one of my staff or other politician with a Top Secret security clearance with a National Security identifier, I'd step up to the plate and order some type of special prosecutor to conduct an investigation into this matter. I would think the people of this country would want to know the truth about this.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 05:12:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Duster6"
    }, 
    {
        "content": "Not much he can really do, she was elected by the people in her State/District. However, when she's up for re-election he certainly doesn't have to campaign on her behalf..", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "", 
        "reply": "Not much he can really do, she was elected by the people in her State/District. However, when she's up for re-election he certainly doesn't have to campaign on her behalf..", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 15:23:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Why has President Obama not stepped forward to calm the waters between his number one supporter and the CIA? If Pelosi is innocent why hasn't she provided any documents to clear her? Could it be that the reason Obama has not made any public press releases is because deep down he wants her gone? After all, as of late she has not been providing him with any good press. She has been an obsticle for awhile. I believe deep down inside (maybe not soo deep) he wants her gone. He would have less of a hqard time with hoyer as speaker then Pelosi because of how polarising she is. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: Why has President Obama not stepped forward to calm the waters between his number one supporter and the CIA? If Pelosi is innocent why hasn't she provided any documents to clear her? Could it be that the reason Obama has not made any public press releases is because deep down he wants her gone? After all, as of late she has not been providing him with any good press.", 
        "reply": " She has been an obsticle for awhile. I believe deep down inside (maybe not soo deep) he wants her gone. He would have less of a hqard time with hoyer as speaker then Pelosi because of how polarising she is. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 15:37:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "L0A1"
    }, 
    {
        "content": "When SanFranNan becomes too big a liability for Barry, he'll follow his SOP and throw her under the bus, until then he'll keep quiet and see which way the polls are running. Nothing unusual here, Chicago politics as usual.", 
        "intTime": 20090518, 
        "postID": 8, 
        "quote": "", 
        "reply": "When SanFranNan becomes too big a liability for Barry, he'll follow his SOP and throw her under the bus, until then he'll keep quiet and see which way the polls are running. Nothing unusual here, Chicago politics as usual.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 15:50:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Political necessity MOM? It does happen and will happen on a daily basis. What is the old saying? \"Live by the sword and die by the sword\"!", 
        "intTime": 20090518, 
        "postID": 9, 
        "quote": "", 
        "reply": "Political necessity MOM? It does happen and will happen on a daily basis. What is the old saying? \"Live by the sword and die by the sword\"!", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-18 23:21:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Why has President Obama not stepped forward to calm the waters between his number one supporter and the CIA? If Pelosi is innocent why hasn't she provided any documents to clear her? Could it be that the reason Obama has not made any public press releases is because deep down he wants her gone? After all, as of late she has not been providing him with any good press. If Pelosi is guilty, why haven't her detractors come up with proof? Remember, in this country, you're presumed innocent. But, to the subject of the thread: I'm not at all convinced that it's not just the Republican's after Nancy's hide. I think I see the deft hand of Hillary Clinton involved too. For instance, who's running the CIA now, the agency which is in a very public, and very unusual, tiff with the Speaker? That's right, a Clintonite. I guess I should put on my tin hat, but I'm not at all convinced that the Clinton's, and their supporters, aren't working overtime behind the scenes trying to torpedo Obama so Hillary can make a public break with him just in time to run again in 2012 under the banner of bringing the \"change\" Obama failed to deliver. \"Their\" guy in the Speakers chair would go a long way toward that goal.", 
        "intTime": 20090519, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: Why has President Obama not stepped forward to calm the waters between his number one supporter and the CIA? If Pelosi is innocent why hasn't she provided any documents to clear her? Could it be that the reason Obama has not made any public press releases is because deep down he wants her gone? After all, as of late she has not been providing him with any good press.", 
        "reply": " If Pelosi is guilty, why haven't her detractors come up with proof? Remember, in this country, you're presumed innocent. But, to the subject of the thread: I'm not at all convinced that it's not just the Republican's after Nancy's hide. I think I see the deft hand of Hillary Clinton involved too. For instance, who's running the CIA now, the agency which is in a very public, and very unusual, tiff with the Speaker? That's right, a Clintonite. I guess I should put on my tin hat, but I'm not at all convinced that the Clinton's, and their supporters, aren't working overtime behind the scenes trying to torpedo Obama so Hillary can make a public break with him just in time to run again in 2012 under the banner of bringing the \"change\" Obama failed to deliver. \"Their\" guy in the Speakers chair would go a long way toward that goal.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 03:13:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "stillkit"
    }, 
    {
        "content": "President Obama doesn't like Pelosi, but she has too much power for him to intercede. So, he's content to stand on the sidelines and watch her crash and burn all by herself. This message has been edited. Last edited by: Kegler300, Tue 19 May 2009 04:04 AM \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 11, 
        "quote": "", 
        "reply": "President Obama doesn't like Pelosi, but she has too much power for him to intercede. So, he's content to stand on the sidelines and watch her crash and burn all by herself. This message has been edited. Last edited by: Kegler300, Tue 19 May 2009 04:04 AM \"The World's Finest\"", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 03:49:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Have you ever had an aunt or cousin you didn't particularly want at a family event but it's too hard to ask them not to come or to leave when they make a scene? Well...there ya go. Don", 
        "intTime": 20090519, 
        "postID": 12, 
        "quote": "", 
        "reply": "Have you ever had an aunt or cousin you didn't particularly want at a family event but it's too hard to ask them not to come or to leave when they make a scene? Well...there ya go. Don", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 03:58:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Looks to me like Pres. Obama is quietly, and with finesse, throwing Nancy under the bus. She's a sinkhole on the road to his agenda.", 
        "intTime": 20090519, 
        "postID": 13, 
        "quote": "", 
        "reply": "Looks to me like Pres. Obama is quietly, and with finesse, throwing Nancy under the bus. She's a sinkhole on the road to his agenda.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 07:01:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by Duster6: Why has President Obama not stepped forward to calm the waters between his number one supporter and the CIA? If Pelosi is innocent why hasn't she provided any documents to clear her? Could it be that the reason Obama has not made any public press releases is because deep down he wants her gone? After all, as of late she has not been providing him with any good press. If Pelosi is guilty, why haven't her detractors come up with proof? Remember, in this country, you're presumed innocent. But, to the subject of the thread: I'm not at all convinced that it's not just the Republican's after Nancy's hide. I think I see the deft hand of Hillary Clinton involved too. For instance, who's running the CIA now, the agency which is in a very public, and very unusual, tiff with the Speaker? That's right, a Clintonite. I guess I should put on my tin hat, but I'm not at all convinced that the Clinton's, and their supporters, aren't working overtime behind the scenes trying to torpedo Obama so Hillary can make a public break with him just in time to run again in 2012 under the banner of bringing the \"change\" Obama failed to deliver. \"Their\" guy in the Speakers chair would go a long way toward that goal. I'll have to agree with you about Hillzilla. I wouldn't put anything past The Beast. Nada. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090519, 
        "postID": 14, 
        "quote": "Originally posted by stillkit: quote: Originally posted by Duster6: Why has President Obama not stepped forward to calm the waters between his number one supporter and the CIA? If Pelosi is innocent why hasn't she provided any documents to clear her? Could it be that the reason Obama has not made any public press releases is because deep down he wants her gone? After all, as of late she has not been providing him with any good press. If Pelosi is guilty, why haven't her detractors come up with proof? Remember, in this country, you're presumed innocent. But, to the subject of the thread: I'm not at all convinced that it's not just the Republican's after Nancy's hide. I think I see the deft hand of Hillary Clinton involved too. For instance, who's running the CIA now, the agency which is in a very public, and very unusual, tiff with the Speaker? That's right, a Clintonite. I guess I should put on my tin hat, but I'm not at all convinced that the Clinton's, and their supporters, aren't working overtime behind the scenes trying to torpedo Obama so Hillary can make a public break with him just in time to run again in 2012 under the banner of bringing the \"change\" Obama failed to deliver. \"Their\" guy in the Speakers chair would go a long way toward that goal.", 
        "reply": " I'll have to agree with you about Hillzilla. I wouldn't put anything past The Beast. Nada. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 07:39:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "I would love to see Hillary as the new Speaker of the Out House.", 
        "intTime": 20090519, 
        "postID": 15, 
        "quote": "", 
        "reply": "I would love to see Hillary as the new Speaker of the Out House.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 07:46:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: I guess I should put on my tin hat, but I'm not at all convinced that the Clinton's, and their supporters, aren't working overtime behind the scenes trying to torpedo Obama so Hillary can make a public break with him just in time to run again in 2012 under the banner of bringing the \"change\" Obama failed to deliver. \"Their\" guy in the Speakers chair would go a long way toward that goal. That is too funny Kit. I guess there will always be those that choose to believe the Clintons are behind everything. Personally, they are not that smart, nor resourceful and there base is on its way to other pastures since Novembers loss.", 
        "intTime": 20090519, 
        "postID": 16, 
        "quote": "I guess I should put on my tin hat, but I'm not at all convinced that the Clinton's, and their supporters, aren't working overtime behind the scenes trying to torpedo Obama so Hillary can make a public break with him just in time to run again in 2012 under the banner of bringing the \"change\" Obama failed to deliver. \"Their\" guy in the Speakers chair would go a long way toward that goal.", 
        "reply": " That is too funny Kit. I guess there will always be those that choose to believe the Clintons are behind everything. Personally, they are not that smart, nor resourceful and there base is on its way to other pastures since Novembers loss.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 07:55:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: President Obama doesn't like Pelosi, but she has too much power for him to intercede. So, he's content to stand on the sidelines and watch her crash and burn all by herself. You may want it to happen, but it won't happen. Let's just all sit back and watch what will never happen. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090519, 
        "postID": 17, 
        "quote": "Originally posted by Kegler300: President Obama doesn't like Pelosi, but she has too much power for him to intercede. So, he's content to stand on the sidelines and watch her crash and burn all by herself.", 
        "reply": " You may want it to happen, but it won't happen. Let's just all sit back and watch what will never happen. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 09:18:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "Obama made it clear that she is fully capable of taking care of herself. I agree.", 
        "intTime": 20090519, 
        "postID": 18, 
        "quote": "", 
        "reply": "Obama made it clear that she is fully capable of taking care of herself. I agree.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 09:21:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree. I agree also. Regardless of how Nancy may come across to others, she is one tough lady! MOST people, underestimate her! That underestimation is the weakness of others who just don't know her. What's the saying? Dumb as a fox........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090519, 
        "postID": 19, 
        "quote": "Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree.", 
        "reply": " I agree also. Regardless of how Nancy may come across to others, she is one tough lady! MOST people, underestimate her! That underestimation is the weakness of others who just don't know her. What's the saying? Dumb as a fox........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 09:33:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree. President Obama is a Fox, he knows what battles to fight and which ones to step away from. He is distancing himself from this, which is the right thing to do in his case. I think he knows this is going to hurt her and personally think she has been a hinderance in him getting his agenda passed. Don't forget that she wrote the stim pack, he only signed it. an see him set her up for that fall when or if it does fail. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 20, 
        "quote": "Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree.", 
        "reply": " President Obama is a Fox, he knows what battles to fight and which ones to step away from. He is distancing himself from this, which is the right thing to do in his case. I think he knows this is going to hurt her and personally think she has been a hinderance in him getting his agenda passed. Don't forget that she wrote the stim pack, he only signed it. an see him set her up for that fall when or if it does fail. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 09:36:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree. President Obama is a Fox, he knows what battles to fight and which ones to step away from. He is distancing himself from this, which is the right thing to do in his case. I think he knows this is going to hurt her and personally think she has been a hinderance in him getting his agenda passed. Don't forget that she wrote the stim pack, he only signed it. an see him set her up for that fall when or if it does fail. The way you put it above it sounds as if Obama is a sissy and is getting ready to throw Nancy under the bus. Maybe she should be the President instead of Mr. Girlie Man.????", 
        "intTime": 20090519, 
        "postID": 21, 
        "quote": "Originally posted by L0A1: quote: Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree. President Obama is a Fox, he knows what battles to fight and which ones to step away from. He is distancing himself from this, which is the right thing to do in his case. I think he knows this is going to hurt her and personally think she has been a hinderance in him getting his agenda passed. Don't forget that she wrote the stim pack, he only signed it. an see him set her up for that fall when or if it does fail.", 
        "reply": " The way you put it above it sounds as if Obama is a sissy and is getting ready to throw Nancy under the bus. Maybe she should be the President instead of Mr. Girlie Man.????", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 14:19:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by L0A1: quote: Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree. President Obama is a Fox, he knows what battles to fight and which ones to step away from. He is distancing himself from this, which is the right thing to do in his case. I think he knows this is going to hurt her and personally think she has been a hinderance in him getting his agenda passed. Don't forget that she wrote the stim pack, he only signed it. an see him set her up for that fall when or if it does fail. The way you put it above it sounds as if Obama is a sissy and is getting ready to throw Nancy under the bus. Maybe she should be the President instead of Mr. Girlie Man.???? Throwing her under the bus seems like a reality if things get bad enough. It's good to have scapegoats. Isn't that how our Government works? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 22, 
        "quote": "Originally posted by Duster6: quote: Originally posted by L0A1: quote: Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree. President Obama is a Fox, he knows what battles to fight and which ones to step away from. He is distancing himself from this, which is the right thing to do in his case. I think he knows this is going to hurt her and personally think she has been a hinderance in him getting his agenda passed. Don't forget that she wrote the stim pack, he only signed it. an see him set her up for that fall when or if it does fail. The way you put it above it sounds as if Obama is a sissy and is getting ready to throw Nancy under the bus. Maybe she should be the President instead of Mr. Girlie Man.????", 
        "reply": " Throwing her under the bus seems like a reality if things get bad enough. It's good to have scapegoats. Isn't that how our Government works? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 14:45:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Duster6: quote: Originally posted by L0A1: quote: Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree. President Obama is a Fox, he knows what battles to fight and which ones to step away from. He is distancing himself from this, which is the right thing to do in his case. I think he knows this is going to hurt her and personally think she has been a hinderance in him getting his agenda passed. Don't forget that she wrote the stim pack, he only signed it. an see him set her up for that fall when or if it does fail. The way you put it above it sounds as if Obama is a sissy and is getting ready to throw Nancy under the bus. Maybe she should be the President instead of Mr. Girlie Man.???? Throwing her under the bus seems like a reality if things get bad enough. It's good to have scapegoats. Isn't that how our Government works?", 
        "intTime": 20090519, 
        "postID": 23, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Duster6: quote: Originally posted by L0A1: quote: Originally posted by DMarkUhler: Obama made it clear that she is fully capable of taking care of herself. I agree. President Obama is a Fox, he knows what battles to fight and which ones to step away from. He is distancing himself from this, which is the right thing to do in his case. I think he knows this is going to hurt her and personally think she has been a hinderance in him getting his agenda passed. Don't forget that she wrote the stim pack, he only signed it. an see him set her up for that fall when or if it does fail. The way you put it above it sounds as if Obama is a sissy and is getting ready to throw Nancy under the bus. Maybe she should be the President instead of Mr. Girlie Man.???? Throwing her under the bus seems like a reality if things get bad enough. It's good to have scapegoats. Isn't that how our Government works?", 
        "reply": "", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 15:15:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Obama just came out with a statement supporting Pelosi. Do you think maybe this could all be another Obama rope-a-dope with Pelosi as a feint as opposed to a victim? I really don't see where she's in any danger but I can see where the repubs could walk into an inverted Vee.", 
        "intTime": 20090519, 
        "postID": 24, 
        "quote": "", 
        "reply": "Obama just came out with a statement supporting Pelosi. Do you think maybe this could all be another Obama rope-a-dope with Pelosi as a feint as opposed to a victim? I really don't see where she's in any danger but I can see where the repubs could walk into an inverted Vee.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 15:18:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Obama just came out with a statement supporting Pelosi. Do you think maybe this could all be another Obama rope-a-dope with Pelosi as a feint as opposed to a victim? I really don't see where she's in any danger but I can see where the repubs could walk into an inverted Vee. It could be, one thing I won't say is Obama is stupid. He is a smart man. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 25, 
        "quote": "Originally posted by Thud357L: Obama just came out with a statement supporting Pelosi. Do you think maybe this could all be another Obama rope-a-dope with Pelosi as a feint as opposed to a victim? I really don't see where she's in any danger but I can see where the repubs could walk into an inverted Vee.", 
        "reply": " It could be, one thing I won't say is Obama is stupid. He is a smart man. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 15:27:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "L0A1"
    }, 
    {
        "content": "There is no reason to throw her under anything. This women has the leadership position amongst 500 plus powerful men. She did not get there by being stupid. Obama understands this an is letting her take care of herself. Now watch ....the news the story are changing as we speak. Looks as though the CIA has a series of recollections that some are taking as fact. More will follow I am sure.", 
        "intTime": 20090519, 
        "postID": 26, 
        "quote": "", 
        "reply": "There is no reason to throw her under anything. This women has the leadership position amongst 500 plus powerful men. She did not get there by being stupid. Obama understands this an is letting her take care of herself. Now watch ....the news the story are changing as we speak. Looks as though the CIA has a series of recollections that some are taking as fact. More will follow I am sure.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 16:35:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Thud357L: Obama just came out with a statement supporting Pelosi. Do you think maybe this could all be another Obama rope-a-dope with Pelosi as a feint as opposed to a victim? I really don't see where she's in any danger but I can see where the repubs could walk into an inverted Vee. It could be, one thing I won't say is Obama is stupid. He is a smart man. Well The Nancy says, \"We need a truth committee!\" The Republicans figure they finally got her ass so they say, \"Yeah!\" The Republicans are now asking for a Truth Committee. They are just whistlin' happy down the trail. Hell, Cheney's probably had kittens by now.", 
        "intTime": 20090519, 
        "postID": 27, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Thud357L: Obama just came out with a statement supporting Pelosi. Do you think maybe this could all be another Obama rope-a-dope with Pelosi as a feint as opposed to a victim? I really don't see where she's in any danger but I can see where the repubs could walk into an inverted Vee. It could be, one thing I won't say is Obama is stupid. He is a smart man.", 
        "reply": " Well The Nancy says, \"We need a truth committee!\" The Republicans figure they finally got her ass so they say, \"Yeah!\" The Republicans are now asking for a Truth Committee. They are just whistlin' happy down the trail. Hell, Cheney's probably had kittens by now.", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-19 18:07:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Thud357L"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090521, 
        "postID": 28, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "409192893_5360055322001", 
        "time": "2009-05-21 03:46:00", 
        "title": "Does Obama want Pelosi out?", 
        "userID": "Kegler300"
    }
]