[
    {
        "content": "+++http://www.obsessionthemovie.com/", 
        "intTime": 20090429, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://www.obsessionthemovie.com/", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-04-29 16:10:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.obsessionthemovie.com/ threerings this is a start. Thanks", 
        "intTime": 20090502, 
        "postID": 2, 
        "quote": "Originally posted by threerings: +++http://www.obsessionthemovie.com/", 
        "reply": " threerings this is a start. Thanks", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:13:00", 
        "title": "Radical Islam", 
        "userID": "21335484"
    }, 
    {
        "content": "I saw that a while back. Intense and brutal. It's worth watching.", 
        "intTime": 20090502, 
        "postID": 3, 
        "quote": "", 
        "reply": "I saw that a while back. Intense and brutal. It's worth watching.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:18:00", 
        "title": "Radical Islam", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "\"Obsession - The Movie\" The radical Islamist equivilent to the radical Christianist \"Jesus Camp - The Movie\" \"www.jesuscampthemovie.com\" They should be run as a double feature...", 
        "intTime": 20090502, 
        "postID": 4, 
        "quote": "", 
        "reply": "\"Obsession - The Movie\" The radical Islamist equivilent to the radical Christianist \"Jesus Camp - The Movie\" \"www.jesuscampthemovie.com\" They should be run as a double feature...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:23:00", 
        "title": "Radical Islam", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"Obsession - The Movie\" The radical Islamist equivilent to the radical Christianist \"Jesus Camp - The Movie\" \"www.jesuscampthemovie.com\" They should be run as a double feature... lol...I have never heard of that one. I have known my share of \"christian\" fanatics in real life though. That was enough for me.", 
        "intTime": 20090502, 
        "postID": 5, 
        "quote": "Originally posted by Fightdirector: \"Obsession - The Movie\" The radical Islamist equivilent to the radical Christianist \"Jesus Camp - The Movie\" \"www.jesuscampthemovie.com\" They should be run as a double feature...", 
        "reply": " lol...I have never heard of that one. I have known my share of \"christian\" fanatics in real life though. That was enough for me.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:30:00", 
        "title": "Radical Islam", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.obsessionthemovie.com/ I'm not sure who sent it, but that DVD was mailed (free) to all the residents here in my town prior to election time. It was lined up in all the mailboxes. Too bad the message was ignored and we got what we got. And what we're going to get. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090502, 
        "postID": 6, 
        "quote": "Originally posted by threerings: +++http://www.obsessionthemovie.com/", 
        "reply": " I'm not sure who sent it, but that DVD was mailed (free) to all the residents here in my town prior to election time. It was lined up in all the mailboxes. Too bad the message was ignored and we got what we got. And what we're going to get. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:42:00", 
        "title": "Radical Islam", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.obsessionthemovie.com/ Obsession? A perfume worn in the movie Debbie Does Dallas", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "Originally posted by threerings: +++http://www.obsessionthemovie.com/", 
        "reply": " Obsession? A perfume worn in the movie Debbie Does Dallas", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 18:04:00", 
        "title": "Radical Islam", 
        "userID": "scottrj50"
    }, 
    {
        "content": "In an exclusive statement for the obsessionwithhate website, Dr. Khaleel Mohammed, the only Obsession interviewee who is an Islamic Studies Professor, delivers a new lethal blow to the film's credibility, exposing what many already knew: “Sadly, it would seem that I have allowed myself to be used. I gave an interview to the makers of “obsession” wherein I explained the meaning of Jihad, and its misuse by extremists. I understood that the film would be used objectively, focusing on fanatics who seek to spread violence. I am aware that there is a disclaimer at the beginning of the film that says it is not about Islam in general, but only about extremist interpretations. \"But the material from some of the speakers gives the lie to the disclaimer: many of them are not experts, or have used the mantle of academic qualifications to purvey hate. That their alarmist drivel should be mixed with my whittled down interview proves that the intent of the film is not to educate, but to mislead. The free distribution of the film to voters in particular districts shows the political chicanery that is the motive, and the secrecy about the financing of the distribution only underlines the evil intent in circulating this vile piece of propaganda. \"Evidence seems to indicate the involvement of Aish ha-Torah in this dishonest enterprise. I find that particularly distressing, because any Jewish organization ought to realize what the film seeks to do: they demonize an entire community to the point where a government takes action to further beleaguer its citizens and resident aliens simply because of their religious identity. This bigotry over religion and identity is precisely what caused the Shoah — and it is sad that those who ought to have learned what hate can engender should seek to imitate Nazi propagandism. \"Yet — for all the nefarious intent of the distributors of the film — I must also accept culpability for allowing myself to be so used. I still oppose many of the traditional interpretations of Islam—but that has nothing to do with the film Obsession. I cannot stand by silently and allow my participation in such satanic demonization of innocents. I apologize to my fellow Muslims for appearing in such a film. I apologize to my Jewish teachers and friends-- who have warned me time and again about falling into such a situation—for not heeding their counsel. And I expect now that those who support the film will make me their target. But again: I am no diplomat, and I love a good fight. I am obsessed with the truth. Let’s get it on. “", 
        "intTime": 20090507, 
        "postID": 8, 
        "quote": "", 
        "reply": "In an exclusive statement for the obsessionwithhate website, Dr. Khaleel Mohammed, the only Obsession interviewee who is an Islamic Studies Professor, delivers a new lethal blow to the film's credibility, exposing what many already knew: “Sadly, it would seem that I have allowed myself to be used. I gave an interview to the makers of “obsession” wherein I explained the meaning of Jihad, and its misuse by extremists. I understood that the film would be used objectively, focusing on fanatics who seek to spread violence. I am aware that there is a disclaimer at the beginning of the film that says it is not about Islam in general, but only about extremist interpretations. \"But the material from some of the speakers gives the lie to the disclaimer: many of them are not experts, or have used the mantle of academic qualifications to purvey hate. That their alarmist drivel should be mixed with my whittled down interview proves that the intent of the film is not to educate, but to mislead. The free distribution of the film to voters in particular districts shows the political chicanery that is the motive, and the secrecy about the financing of the distribution only underlines the evil intent in circulating this vile piece of propaganda. \"Evidence seems to indicate the involvement of Aish ha-Torah in this dishonest enterprise. I find that particularly distressing, because any Jewish organization ought to realize what the film seeks to do: they demonize an entire community to the point where a government takes action to further beleaguer its citizens and resident aliens simply because of their religious identity. This bigotry over religion and identity is precisely what caused the Shoah — and it is sad that those who ought to have learned what hate can engender should seek to imitate Nazi propagandism. \"Yet — for all the nefarious intent of the distributors of the film — I must also accept culpability for allowing myself to be so used. I still oppose many of the traditional interpretations of Islam—but that has nothing to do with the film Obsession. I cannot stand by silently and allow my participation in such satanic demonization of innocents. I apologize to my fellow Muslims for appearing in such a film. I apologize to my Jewish teachers and friends-- who have warned me time and again about falling into such a situation—for not heeding their counsel. And I expect now that those who support the film will make me their target. But again: I am no diplomat, and I love a good fight. I am obsessed with the truth. Let’s get it on. “", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 09:51:00", 
        "title": "Radical Islam", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: SgtSalaamv2 What are you saying? Just because this guy you are quoting is upset doesn't make the movie less objective. It does disclaim that the movie is not about Islam but about Extremist using Islam for their own needs. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090507, 
        "postID": 9, 
        "quote": "SgtSalaamv2", 
        "reply": " What are you saying? Just because this guy you are quoting is upset doesn't make the movie less objective. It does disclaim that the movie is not about Islam but about Extremist using Islam for their own needs. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 10:01:00", 
        "title": "Radical Islam", 
        "userID": "L0A1"
    }, 
    {
        "content": "Salaamv2...what? There are no \"Radical Islam\"ists? really? Very convenient for arguement sake?!", 
        "intTime": 20090507, 
        "postID": 10, 
        "quote": "", 
        "reply": "Salaamv2...what? There are no \"Radical Islam\"ists? really? Very convenient for arguement sake?!", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 10:05:00", 
        "title": "Radical Islam", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today.", 
        "intTime": 20090507, 
        "postID": 11, 
        "quote": "", 
        "reply": "Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 11:06:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam.", 
        "intTime": 20090507, 
        "postID": 12, 
        "quote": "Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today.", 
        "reply": " The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 11:36:00", 
        "title": "Radical Islam", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Thsi is my kind of \"obsession\" \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090507, 
        "postID": 13, 
        "quote": "", 
        "reply": "Thsi is my kind of \"obsession\" \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 11:49:00", 
        "title": "Radical Islam", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers.", 
        "intTime": 20090507, 
        "postID": 14, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam.", 
        "reply": " Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:21:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. Was there any ethnic violence in Iraq prior to our ousting of Saddam? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090507, 
        "postID": 15, 
        "quote": "Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers.", 
        "reply": " Was there any ethnic violence in Iraq prior to our ousting of Saddam? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:24:00", 
        "title": "Radical Islam", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.", 
        "intTime": 20090507, 
        "postID": 16, 
        "quote": "Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers.", 
        "reply": " I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:40:00", 
        "title": "Radical Islam", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes. I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD. I'm also saying this: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith.", 
        "intTime": 20090507, 
        "postID": 17, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.", 
        "reply": " I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD. I'm also saying this: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:54:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. Was there any ethnic violence in Iraq prior to our ousting of Saddam? Ethnic Violence? Prior to OUR ousting of Saddam? I guess you don't have a good memory. quote: Iraq planned and sponsored international terrorism in 2000. Although Baghdad focused on antidissident activity overseas, the regime continued to support various terrorist groups. The regime has not attempted an anti-Western terrorist attack since its failed plot to assassinate former President Bush in 1993 in Kuwait. To intimidate or silence Iraqi opponents of the regime living overseas, the IIS reportedly opened several new stations in foreign capitals during 2000. Various opposition groups joined in warning Iraqi dissidents abroad against newly established \"expatriates' associations,\" which, they asserted, are IIS front organizations. Opposition leaders in London contended that the IIS had dispatched women agents to infiltrate their ranks and was targeting dissidents for assassination. In Germany, an Iraqi opposition figure denounced the IIS for murdering his son, who had recently left Iraq to join him abroad. Dr. Ayad `Allawi, Secretary General of the Iraqi National Accord, an opposition group, stated that relatives of dissidents living abroad are often arrested and jailed to intimidate activists overseas. In northern Iraq, Iraqi agents reportedly killed a locally well-known religious personality who declined to echo the regime line. The regional security director in As Sulaymaniyah stated that Iraqi operatives were responsible for the car-bomb explosion that injured a score of passersby. Officials of the Iraqi Communist Party asserted that an attack on a provincial party headquarters had been thwarted when party security officers shot and wounded a terrorist employed by the IIS. (*http://www.terrorismfiles.org/countries/iraq.html*) quote: The nation's recent history was shaped by Saddam Hussein, a brutal dictator who ruled Iraq from July 1979 to April 2003. Iraq launched an enormously destructive but ultimately inconclusive war against Iran in 1980. The country invaded and annexed Kuwait in August 1990, and occupied it until expelled by a U.S.-led coalition in February 1991. Citing the threat posed by the Hussein regime to the U.S. and to American allies and interests in the Middle East, the U.S. led an invasion of Iraq in March 2003 and occupied Baghdad, Iraq's capital, the following month, establishing an interim civilian administration under U.S. military command. Sovereign authority was transferred to an interim Iraqi government in June 2004. A new constitution was ratified in October 2005, and legislative elections were held two months later. Saddam Hussein was tried and convicted of one of the key charges against him, and executed on Dec. 30, 2006. As that year ended, the U.S. and its coalition partners still had nearly 160,000 troops in Iraq, to oversee reconstruction and help establish security in the face of an ongoing insurgency and sectarian violence. (*http://www.history.com/encyclopedia.do?articleId=212866*)", 
        "intTime": 20090507, 
        "postID": 18, 
        "quote": "Originally posted by NSNN: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. Was there any ethnic violence in Iraq prior to our ousting of Saddam?", 
        "reply": " Ethnic Violence? Prior to OUR ousting of Saddam? I guess you don't have a good memory. quote: Iraq planned and sponsored international terrorism in 2000. Although Baghdad focused on antidissident activity overseas, the regime continued to support various terrorist groups. The regime has not attempted an anti-Western terrorist attack since its failed plot to assassinate former President Bush in 1993 in Kuwait. To intimidate or silence Iraqi opponents of the regime living overseas, the IIS reportedly opened several new stations in foreign capitals during 2000. Various opposition groups joined in warning Iraqi dissidents abroad against newly established \"expatriates' associations,\" which, they asserted, are IIS front organizations. Opposition leaders in London contended that the IIS had dispatched women agents to infiltrate their ranks and was targeting dissidents for assassination. In Germany, an Iraqi opposition figure denounced the IIS for murdering his son, who had recently left Iraq to join him abroad. Dr. Ayad `Allawi, Secretary General of the Iraqi National Accord, an opposition group, stated that relatives of dissidents living abroad are often arrested and jailed to intimidate activists overseas. In northern Iraq, Iraqi agents reportedly killed a locally well-known religious personality who declined to echo the regime line. The regional security director in As Sulaymaniyah stated that Iraqi operatives were responsible for the car-bomb explosion that injured a score of passersby. Officials of the Iraqi Communist Party asserted that an attack on a provincial party headquarters had been thwarted when party security officers shot and wounded a terrorist employed by the IIS. (*http://www.terrorismfiles.org/countries/iraq.html*) quote: The nation's recent history was shaped by Saddam Hussein, a brutal dictator who ruled Iraq from July 1979 to April 2003. Iraq launched an enormously destructive but ultimately inconclusive war against Iran in 1980. The country invaded and annexed Kuwait in August 1990, and occupied it until expelled by a U.S.-led coalition in February 1991. Citing the threat posed by the Hussein regime to the U.S. and to American allies and interests in the Middle East, the U.S. led an invasion of Iraq in March 2003 and occupied Baghdad, Iraq's capital, the following month, establishing an interim civilian administration under U.S. military command. Sovereign authority was transferred to an interim Iraqi government in June 2004. A new constitution was ratified in October 2005, and legislative elections were held two months later. Saddam Hussein was tried and convicted of one of the key charges against him, and executed on Dec. 30, 2006. As that year ended, the U.S. and its coalition partners still had nearly 160,000 troops in Iraq, to oversee reconstruction and help establish security in the face of an ongoing insurgency and sectarian violence. (*http://www.history.com/encyclopedia.do?articleId=212866*)", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:55:00", 
        "title": "Radical Islam", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. The Muslims of the US military might disagree with you.", 
        "intTime": 20090507, 
        "postID": 19, 
        "quote": "The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith.", 
        "reply": " The Muslims of the US military might disagree with you.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 13:03:00", 
        "title": "Radical Islam", 
        "userID": "foxred03"
    }, 
    {
        "content": "[QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.[/QUOTE] That statement makes no sense to me - it's like saying it had nothing to do with the religion, but everything to do with the religion. If it had nothing to do with Islam, how could they pervert it to their own ends? Would you say the same of Minister Phelps from Kansas, that it has nothing to do with Christianity, but those perverting it for thier own purposes?", 
        "intTime": 20090507, 
        "postID": 20, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.[/QUOTE] That statement makes no sense to me - it's like saying it had nothing to do with the religion, but everything to do with the religion. If it had nothing to do with Islam, how could they pervert it to their own ends? Would you say the same of Minister Phelps from Kansas, that it has nothing to do with Christianity, but those perverting it for thier own purposes?", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 13:11:00", 
        "title": "Radical Islam", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. The Muslims of the US military might disagree with you. Like the one who tossed a gernade into a tent of 101st soldiers? Or the ones giving endless cultural briefs that amount to: accept us, no matter how barbaric we act and please dont attempt to ask any questions because we cant respond to them?", 
        "intTime": 20090507, 
        "postID": 21, 
        "quote": "Originally posted by foxred03: quote: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. The Muslims of the US military might disagree with you.", 
        "reply": " Like the one who tossed a gernade into a tent of 101st soldiers? Or the ones giving endless cultural briefs that amount to: accept us, no matter how barbaric we act and please dont attempt to ask any questions because we cant respond to them?", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 15:13:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by transport1: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.[/QUOTE] That statement makes no sense to me - it's like saying it had nothing to do with the religion, but everything to do with the religion. If it had nothing to do with Islam, how could they pervert it to their own ends? Would you say the same of Minister Phelps from Kansas, that it has nothing to do with Christianity, but those perverting it for thier own purposes? Phelps has nothing to do with Christianity. He doesn't represent the vast majority of Christians, his views don't reflect the opionions of the vast majority. He is an extremist, not even a fundamentalist because his views are far from fundamental Christians. He is the same as a Muslim extremist, he spews a perverted religion to make his own point.", 
        "intTime": 20090507, 
        "postID": 22, 
        "quote": "Originally posted by transport1: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.[/QUOTE] That statement makes no sense to me - it's like saying it had nothing to do with the religion, but everything to do with the religion. If it had nothing to do with Islam, how could they pervert it to their own ends? Would you say the same of Minister Phelps from Kansas, that it has nothing to do with Christianity, but those perverting it for thier own purposes?", 
        "reply": " Phelps has nothing to do with Christianity. He doesn't represent the vast majority of Christians, his views don't reflect the opionions of the vast majority. He is an extremist, not even a fundamentalist because his views are far from fundamental Christians. He is the same as a Muslim extremist, he spews a perverted religion to make his own point.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 16:41:00", 
        "title": "Radical Islam", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes. I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD. I'm also saying this: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. That may be true for some, but not most. The majority of Muslims in my experience don't care what the rest of the world does. The shop owner in Baghdad wants to earn a living, they don't care that American Christians eat pork or drink beer. I would also disagree about them not being willing to defend anoyone that isn't Muslim. They don't really care about what religion someone is, my terps and the dozens of Iraqis I advised didn't care that I wasn't Muslim. What they do care about is respect for their culture. If you go in and show no regard for their traditions they won't do anything for you. If you go in polite, drink the tea, have lunch with them, observe some of their customs, and learn a little of the language they will treat you like a brother. I have no doubt that my terps and some of the IA soldiers would have taken a bullet for me.", 
        "intTime": 20090507, 
        "postID": 23, 
        "quote": "Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes. I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD. I'm also saying this: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith.", 
        "reply": " That may be true for some, but not most. The majority of Muslims in my experience don't care what the rest of the world does. The shop owner in Baghdad wants to earn a living, they don't care that American Christians eat pork or drink beer. I would also disagree about them not being willing to defend anoyone that isn't Muslim. They don't really care about what religion someone is, my terps and the dozens of Iraqis I advised didn't care that I wasn't Muslim. What they do care about is respect for their culture. If you go in and show no regard for their traditions they won't do anything for you. If you go in polite, drink the tea, have lunch with them, observe some of their customs, and learn a little of the language they will treat you like a brother. I have no doubt that my terps and some of the IA soldiers would have taken a bullet for me.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 16:49:00", 
        "title": "Radical Islam", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Phelps has nothing to do with Christianity. He doesn't represent the vast majority of Christians, his views don't reflect the opionions of the vast majority. He is an extremist, not even a fundamentalist because his views are far from fundamental Christians. He is the same as a Muslim extremist, he spews a perverted religion to make his own point. That is true. Just because a religious fanatic uses a religion to promote their evil acts, does not mean they are representing the real beliefs of that religion. They interpret their professed religion in such a way, that it will allow them a \"reason\" in their own mind for commiting the atrocites that they commit. I have known \"Christian\" fanatics and they are as far from true Christianity as one can get. The same can be said for the true Islam. Religious extremists can come in all religions and yet in reality, have absolutely nothing to do with any religion. It is all about fanaticism, period. It gets worse when the strenght of said fanatics lies in their numbers and that is why Radical \"Islam\" is so dangerous. That and the fact they want all of us dead. That is not what the true Muslims believe. It is time though to stop with the nitpicking and just call them what they are... murdering terrorists.", 
        "intTime": 20090507, 
        "postID": 24, 
        "quote": "Originally posted by nspreitler: Phelps has nothing to do with Christianity. He doesn't represent the vast majority of Christians, his views don't reflect the opionions of the vast majority. He is an extremist, not even a fundamentalist because his views are far from fundamental Christians. He is the same as a Muslim extremist, he spews a perverted religion to make his own point.", 
        "reply": " That is true. Just because a religious fanatic uses a religion to promote their evil acts, does not mean they are representing the real beliefs of that religion. They interpret their professed religion in such a way, that it will allow them a \"reason\" in their own mind for commiting the atrocites that they commit. I have known \"Christian\" fanatics and they are as far from true Christianity as one can get. The same can be said for the true Islam. Religious extremists can come in all religions and yet in reality, have absolutely nothing to do with any religion. It is all about fanaticism, period. It gets worse when the strenght of said fanatics lies in their numbers and that is why Radical \"Islam\" is so dangerous. That and the fact they want all of us dead. That is not what the true Muslims believe. It is time though to stop with the nitpicking and just call them what they are... murdering terrorists.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 17:15:00", 
        "title": "Radical Islam", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Of course, you all understand that the islamofascists ALL think of themselves as good Allah worshiping Muslims, don't you? And is you don't agree, they'll gleefully kill you shouting \"Allahu Akbar!\" That many of the sects tolerate each other as near apostates and would be at each other's throats were Christians and Jews unavailable.....", 
        "intTime": 20090507, 
        "postID": 25, 
        "quote": "", 
        "reply": "Of course, you all understand that the islamofascists ALL think of themselves as good Allah worshiping Muslims, don't you? And is you don't agree, they'll gleefully kill you shouting \"Allahu Akbar!\" That many of the sects tolerate each other as near apostates and would be at each other's throats were Christians and Jews unavailable.....", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 18:53:00", 
        "title": "Radical Islam", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Salaamv2...what? There are no \"Radical Islam\"ists? really? Very convenient for arguement sake?! Well I don't understand your Fox \"News\" terms, but I don't recall ever stating anywhere that there are no terrorists who call themselves Muslim. Stay on topic. The response was about the \"truth\" of the propaganda that was handed out in hopes of getting McCain elected that failed miserably. quote: A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. Got any sources to back up that diatribe? quote: I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD What is Islam's nature, please tell us. Oh and be sure to use authentic Islamic sources i.e. Quran, Hadith, Tafsir as these are the only sources Muslims follow. quote: They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. Wow, how about I hand over my DD214 so you can spit on it? quote: Like the one who tossed a gernade into a tent of 101st soldiers? Or the ones giving endless cultural briefs that amount to: accept us, no matter how barbaric we act and please dont attempt to ask any questions because we cant respond to them? Let's see ONE guy frags his platoon and some troops are asked by the CO to give a brief, and somehow that means that 20k plus active duty, countless vets, and thousands of Muslims who fought and died in many of our conflicts, are liars. How about you take a trip to Arlington and start kicking over all those crescent engraved headstones..... quote: That is true. Just because a religious fanatic uses a religion to promote their evil acts, does not mean they are representing the real beliefs of that religion. They interpret their professed religion in such a way, that it will allow them a \"reason\" in their own mind for commiting the atrocites that they commit. I have known \"Christian\" fanatics and they are as far from true Christianity as one can get. The same can be said for the true Islam. Religious extremists can come in all religions and yet in reality, have absolutely nothing to do with any religion. It is all about fanaticism, period. It gets worse when the strenght of said fanatics lies in their numbers and that is why Radical \"Islam\" is so dangerous. That and the fact they want all of us dead. That is not what the true Muslims believe. It is time though to stop with the nitpicking and just call them what they are... murdering terrorists. Couldn't have said it better! Amen, Amen, and Amen", 
        "intTime": 20090508, 
        "postID": 26, 
        "quote": "Salaamv2...what? There are no \"Radical Islam\"ists? really? Very convenient for arguement sake?!", 
        "reply": " Well I don't understand your Fox \"News\" terms, but I don't recall ever stating anywhere that there are no terrorists who call themselves Muslim. Stay on topic. The response was about the \"truth\" of the propaganda that was handed out in hopes of getting McCain elected that failed miserably. quote: A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. Got any sources to back up that diatribe? quote: I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD What is Islam's nature, please tell us. Oh and be sure to use authentic Islamic sources i.e. Quran, Hadith, Tafsir as these are the only sources Muslims follow. quote: They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. Wow, how about I hand over my DD214 so you can spit on it? quote: Like the one who tossed a gernade into a tent of 101st soldiers? Or the ones giving endless cultural briefs that amount to: accept us, no matter how barbaric we act and please dont attempt to ask any questions because we cant respond to them? Let's see ONE guy frags his platoon and some troops are asked by the CO to give a brief, and somehow that means that 20k plus active duty, countless vets, and thousands of Muslims who fought and died in many of our conflicts, are liars. How about you take a trip to Arlington and start kicking over all those crescent engraved headstones..... quote: That is true. Just because a religious fanatic uses a religion to promote their evil acts, does not mean they are representing the real beliefs of that religion. They interpret their professed religion in such a way, that it will allow them a \"reason\" in their own mind for commiting the atrocites that they commit. I have known \"Christian\" fanatics and they are as far from true Christianity as one can get. The same can be said for the true Islam. Religious extremists can come in all religions and yet in reality, have absolutely nothing to do with any religion. It is all about fanaticism, period. It gets worse when the strenght of said fanatics lies in their numbers and that is why Radical \"Islam\" is so dangerous. That and the fact they want all of us dead. That is not what the true Muslims believe. It is time though to stop with the nitpicking and just call them what they are... murdering terrorists. Couldn't have said it better! Amen, Amen, and Amen", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-08 11:06:00", 
        "title": "Radical Islam", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons...", 
        "intTime": 20090508, 
        "postID": 27, 
        "quote": "", 
        "reply": "Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-08 16:05:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons... We all know how it would go. All your going to do is the same ole tired Orientalist tactic which is arbitrarily find a verse in the Qur'an that is an example of the propraghanda you and the terrorists believe about Islam, I will counter by doing the same exact topic with the Bible by posting arbitrarily verses that talk about the same exact things. You and or other Bible believers will tell me I'm reading the Bible out of context, which I will agree (because of common sense and religious study) I will say the same about the Qur'an and then you and all those that agree with you, will refuse to agree with the same logic. In other words, the goal posts change depending on who's religion is being talked about. It's supposed to be understood according to your logic that: Verses in the Bible that are violent have to be understood in context of the entire scripture and when necessary interpretation from Christian scholars. Christians who are violent, support violence, etc. are not true Christians and this minority doesn't represent all Christians no matter what they say. However.... It's to be understood that if we are talking about Islam, none of those rules exist, because: Versus in the Qur'an that are \"violent\" are not to be understood in context, it doesn't matter what Islamic scholars say, they must be understood in the literal English interpretation as going to the Arabic source would be akin to contextual arguments and no such thing exists when judging Islam. When Muslims do violent things even if they are the minority they absolutely represent all Muslims and are definitely true Muslims because they say so and it doesn't matter what other Muslims say even if they are in the majority. So please if you feel like being a typical hypocrite will prove something, go ahead and post your 10-20 oft misinterpreted, misread, and out of context verses and/or Hadith that are so popular with the anti-Islam statements. I will dissect each and everyone of them in context, giving insight into the original language, history, and scholarly sources, and the people can judge for themselves whether: A non-Muslim who studies from non-Muslim or so-called \"former\" Muslim sources knows more about Islam.. or A practicing Muslim who studies from Muslim and non-Muslim sources knows more about Islam...", 
        "intTime": 20090512, 
        "postID": 28, 
        "quote": "Originally posted by threerings: Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons...", 
        "reply": " We all know how it would go. All your going to do is the same ole tired Orientalist tactic which is arbitrarily find a verse in the Qur'an that is an example of the propraghanda you and the terrorists believe about Islam, I will counter by doing the same exact topic with the Bible by posting arbitrarily verses that talk about the same exact things. You and or other Bible believers will tell me I'm reading the Bible out of context, which I will agree (because of common sense and religious study) I will say the same about the Qur'an and then you and all those that agree with you, will refuse to agree with the same logic. In other words, the goal posts change depending on who's religion is being talked about. It's supposed to be understood according to your logic that: Verses in the Bible that are violent have to be understood in context of the entire scripture and when necessary interpretation from Christian scholars. Christians who are violent, support violence, etc. are not true Christians and this minority doesn't represent all Christians no matter what they say. However.... It's to be understood that if we are talking about Islam, none of those rules exist, because: Versus in the Qur'an that are \"violent\" are not to be understood in context, it doesn't matter what Islamic scholars say, they must be understood in the literal English interpretation as going to the Arabic source would be akin to contextual arguments and no such thing exists when judging Islam. When Muslims do violent things even if they are the minority they absolutely represent all Muslims and are definitely true Muslims because they say so and it doesn't matter what other Muslims say even if they are in the majority. So please if you feel like being a typical hypocrite will prove something, go ahead and post your 10-20 oft misinterpreted, misread, and out of context verses and/or Hadith that are so popular with the anti-Islam statements. I will dissect each and everyone of them in context, giving insight into the original language, history, and scholarly sources, and the people can judge for themselves whether: A non-Muslim who studies from non-Muslim or so-called \"former\" Muslim sources knows more about Islam.. or A practicing Muslim who studies from Muslim and non-Muslim sources knows more about Islam...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-12 11:30:00", 
        "title": "Radical Islam", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: quote: Originally posted by threerings: Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons... We all know how it would go. All your going to do is the same ole tired Orientalist tactic which is arbitrarily find a verse in the Qur'an that is an example of the propraghanda you and the terrorists believe about Islam, I will counter by doing the same exact topic with the Bible by posting arbitrarily verses that talk about the same exact things. You and or other Bible believers will tell me I'm reading the Bible out of context, which I will agree (because of common sense and religious study) I will say the same about the Qur'an and then you and all those that agree with you, will refuse to agree with the same logic. In other words, the goal posts change depending on who's religion is being talked about. It's supposed to be understood according to your logic that: Verses in the Bible that are violent have to be understood in context of the entire scripture and when necessary interpretation from Christian scholars. Christians who are violent, support violence, etc. are not true Christians and this minority doesn't represent all Christians no matter what they say. However.... It's to be understood that if we are talking about Islam, none of those rules exist, because: Versus in the Qur'an that are \"violent\" are not to be understood in context, it doesn't matter what Islamic scholars say, they must be understood in the literal English interpretation as going to the Arabic source would be akin to contextual arguments and no such thing exists when judging Islam. When Muslims do violent things even if they are the minority they absolutely represent all Muslims and are definitely true Muslims because they say so and it doesn't matter what other Muslims say even if they are in the majority. So please if you feel like being a typical hypocrite will prove something, go ahead and post your 10-20 oft misinterpreted, misread, and out of context verses and/or Hadith that are so popular with the anti-Islam statements. I will dissect each and everyone of them in context, giving insight into the original language, history, and scholarly sources, and the people can judge for themselves whether: A non-Muslim who studies from non-Muslim or so-called \"former\" Muslim sources knows more about Islam.. or A practicing Muslim who studies from Muslim and non-Muslim sources knows more about Islam... You cant use another religion to defend the crimes of muslims. That just makes no sense. It makes no sense because the bad actions of one group do not justify the bad actions of another. Beyond that it makes no context in the current world situation. How many people today are using the bible to justify horriffic crimes? How many are using the Quran? But the question is relly even more simple than that.. If you can anwser this honestly: Are people using the Quran to justify violence? Without question, yes. Have people used the Quran to justify violence since its writing? Again, without question, yes. Do muslim people show a desire to move beyond the current desire to use violence as a politcal tool in thier culture? Based on the actions of muslims in Egypt, Palestine, Iran, Turkey, SA, Syria, and a dozen other places, NO! Everyplace muslims rule they repress others, they rule through power and not law. The majority seek to control the actions, thoughts and beliefs of everyone else. Stop trying to place Islam into the context of the Christian faith. The values, ideas, and concepts that allowed those of the Christian faith to develop beyond the violence in the bible need to be developed within the muslim faith. But they cannot, because the muslim faith dominates every aspect of the muslim culture. You cant even think with the call to prayer coming at you from every direction 230 times a day...", 
        "intTime": 20090512, 
        "postID": 29, 
        "quote": "Originally posted by Sgt_Salaam: quote: Originally posted by threerings: Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons... We all know how it would go. All your going to do is the same ole tired Orientalist tactic which is arbitrarily find a verse in the Qur'an that is an example of the propraghanda you and the terrorists believe about Islam, I will counter by doing the same exact topic with the Bible by posting arbitrarily verses that talk about the same exact things. You and or other Bible believers will tell me I'm reading the Bible out of context, which I will agree (because of common sense and religious study) I will say the same about the Qur'an and then you and all those that agree with you, will refuse to agree with the same logic. In other words, the goal posts change depending on who's religion is being talked about. It's supposed to be understood according to your logic that: Verses in the Bible that are violent have to be understood in context of the entire scripture and when necessary interpretation from Christian scholars. Christians who are violent, support violence, etc. are not true Christians and this minority doesn't represent all Christians no matter what they say. However.... It's to be understood that if we are talking about Islam, none of those rules exist, because: Versus in the Qur'an that are \"violent\" are not to be understood in context, it doesn't matter what Islamic scholars say, they must be understood in the literal English interpretation as going to the Arabic source would be akin to contextual arguments and no such thing exists when judging Islam. When Muslims do violent things even if they are the minority they absolutely represent all Muslims and are definitely true Muslims because they say so and it doesn't matter what other Muslims say even if they are in the majority. So please if you feel like being a typical hypocrite will prove something, go ahead and post your 10-20 oft misinterpreted, misread, and out of context verses and/or Hadith that are so popular with the anti-Islam statements. I will dissect each and everyone of them in context, giving insight into the original language, history, and scholarly sources, and the people can judge for themselves whether: A non-Muslim who studies from non-Muslim or so-called \"former\" Muslim sources knows more about Islam.. or A practicing Muslim who studies from Muslim and non-Muslim sources knows more about Islam...", 
        "reply": " You cant use another religion to defend the crimes of muslims. That just makes no sense. It makes no sense because the bad actions of one group do not justify the bad actions of another. Beyond that it makes no context in the current world situation. How many people today are using the bible to justify horriffic crimes? How many are using the Quran? But the question is relly even more simple than that.. If you can anwser this honestly: Are people using the Quran to justify violence? Without question, yes. Have people used the Quran to justify violence since its writing? Again, without question, yes. Do muslim people show a desire to move beyond the current desire to use violence as a politcal tool in thier culture? Based on the actions of muslims in Egypt, Palestine, Iran, Turkey, SA, Syria, and a dozen other places, NO! Everyplace muslims rule they repress others, they rule through power and not law. The majority seek to control the actions, thoughts and beliefs of everyone else. Stop trying to place Islam into the context of the Christian faith. The values, ideas, and concepts that allowed those of the Christian faith to develop beyond the violence in the bible need to be developed within the muslim faith. But they cannot, because the muslim faith dominates every aspect of the muslim culture. You cant even think with the call to prayer coming at you from every direction 230 times a day...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-12 12:52:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: You cant use another religion to defend the crimes of muslims. That just makes no sense. It makes no sense because the bad actions of one group do not justify the bad actions of another. Beyond that it makes no context in the current world situation. Your entire argument falls apart from this quote alone because you demonstrate that you were not paying attention or read what I wrote. I never once used one religion to defend another, that's just idiotic. What I criticized was the bias that's obviously used from those who think like you when criticizing Muslims. My commentary was simply that your logic is poor when you can't apply it universally i.e. if one group of adherents of \"x\" religion are bad because of some verses in their texts or the actions of some of their members, then one group of adherents of \"y\" religion are equally bad because of some verses in their texts or the actions of some of their members. That would be perfectly acceptable. However, what you and others continually do is say that \"x\" is completely different than \"y\" and \"y\" should be held to a completely different standard than \"x\" even if \"y\" meets the same conditions/criteria of \"x\". In order to make that argument, one would have to expound on why the conditions of \"y\" merit greater or lesser variance in the opinion of who's bad or not. However, you guys when called to expound never do, but only give more illogical statements like those that follow your initial commentary, as I will point out.... quote: How many people today are using the bible to justify horriffic crimes? How many are using the Quran? Well, how do you define \"horrific crime\"? You would have to define that term in order to make sense, because you can measure anything until you define it. For instance, even if we agreed and we do that beheading is \"horrific\" than how many Muslims have actually done it out of 1.5 billion? What number would be high enough to condemn all Muslims or low enough to admit that it's not characteristic of all Muslims? Furthermore, considering that you brought up very specific books (Bible and Qur'an) you would have to identify where in either book it is written that one should do said horrific acts. In the case of the example of beheading, where does it state in the Qur'an that it's perfectly acceptable to murder innocent people through beheading such as reporters like Daniel Pearl, or POW's, or innocent men and women both Muslim and non-Muslim? Show me said verse where this command is given for Muslims to murder innocent people especially through beheading and I will never type another word on the internet. Show me where Muslims are expressly told it's their religious duty to do just that and I would have to admit that 1 billion Muslims don't actually follow the Qur'an. But back to the topic of \"horrific\" I believe that beheading as an example is horrific especially when it's done to innocents whether it's a reporter, captive, spouse, etc. But I also think there are many other horrific things in this world such as adultery, lying, stealing, idolatry, fornication, etc. Now considering that this is a majority Christian nation who I imagine read the Bible, or even just the members of this board, are you ready to condemn either the Bible or all Christians based on the actions, words, deeds, etc. of your fellow board members and/or countrymen? Surely, many justify their actions based on teachings in the Bible, many of these actions horrific. For instance, I think it very horrific that one would even believe that just because they believe a specific dogma they are forgiven for their transgressions. I believe that's the number one problem with that group of religious types and why conditions do not mirror in America what I would expect would be an accurate representation of what Jesus (as) taught for example. I think it's horrible that there would be ATM's, credit apps, etc. at \"megachurches\" and the Bible being used as justification for this elaborate money making scheme while their are people in the very cities of these churches who don't have food to eat. But like I said, my definition of horrible may be different than yours. Define that first, then maybe we could get somewhere. quote: But the question is relly even more simple than that.. If you can anwser this honestly: Are people using the Quran to justify violence? Without question, yes. Have people used the Quran to justify violence since its writing? Again, without question, yes. Yes, to all the above. But you have proved nothing. I stated before this post that this is exactly what you would do. Because you could replace the word \"Qur'an\" with Bible, Vedas, or any religious text and would come to the same conclusions. The real question isn't whether or not people use a text or book to justify anything, but whether or not the actual text or book justifies what the people actually say it does. A completely different issue. Can you without question prove that the Qur'an in fact commands Muslims to commit wanton violence? Can you without question prove that since inception all Muslims have understood and practiced Islam according to that command? The answer is no you cannot. This has been the number one stumbling block for the original Orientalist and now the neo-Orientalists as they rehash the same tired arguments to try and label and condemn an entire religion and people. The motives have just changed. What none of you have been willing to accept based upon your illogical conclusions and arrogant assumptions that your calculations never account for the biggest 800 pound gorilla in the room? If the Qur'an teaches what you say it does, then why \"since inception\" it hasn't been characteristic of Muslims across the board to exhibit these traits? Why do so many variables exist and in such numbers. You would have to come to the conclusion that either the overwhelming majority of Muslims don't actually understand or believe in the Qur'an or that the minority who commit these crimes and say it's in the Qur'an are actually just religious fanatics who don't understand or believe in the Qur'an. You can't have it both ways.... It's highly illogical and I have a theory that most Orientalists knew it like they do today, that the arguments are illogical and only state what they state to be part of a smear campaign and nothing more, that way arguments don't have to make sense. Just re-read the illogical statements below that I haven't responded to at this point....There illogical and your premise is all over the place. Just stick to the original assertion which is according to you, others like you, and the terrorists: The Qur'an without a doubt teaches violence and because of that Muslims are violent. I will continue to laugh in your face, other like you, and the terrorists, and call you ideologues who don't use logic, because if your assertions were true than why do those who actually believe that and act on it, don't even account for 5% of the total Muslim population? Since when has it ever been logical that 5% should be considered more characteristic of a trait than 95%? quote: Do muslim people show a desire to move beyond the current desire to use violence as a politcal tool in thier culture? Where did you get these talking points? Do you even know how retarded that one sounds? What is \"Muslim people\"? What is \"Muslim Culture\"? How can you assert a premise that one has to move beyond anything without first defining the very people and thing in which you state need to move beyond? How can you even inquire about the desire of a group which you have not defined? How can you state matter of fact that in \"their\" culture violence is used as a political tool without ever bothering to define anything about the culture, who belongs to it, and about the politics of said culture, since you brought it up? I mean you can make these assertions as you did without one grain of logic, fact, or evidence to back up your talking points or open ended statements, but that doesn't make them logical or remotely make sense, other than the obvious observation that they are just a barrage of totally unrelated statements that have no desire to prove anything but to continue to support and emotionally charged ideology and illicit a response in kind in a gotcha fashion. quote: Based on the actions of muslims in Egypt, Palestine, Iran, Turkey, SA, Syria, and a dozen other places, NO! No to what? Are you willing to be taken seriously or not? Did you honestly type this consciously thinking that it's perfectly logical to look at a billion people across the planet on every continent and judge them by the actions of people in specific locales? Not to mention you didn't even define the actions or how many in said countries participate in said actions. Not even to mention that the cultures of the countries you listed are in some cases different as night and day. For instance, Saudi Arabia's majority religious belief is Wahhabism, in which this particular ideology which isn't even 100 years old is mainly practiced there. It's also interesting to note that the majority of the 9/11 highjackers were from SA and were Wahhabis (not that I'm expressly blaming Wahhabism, I'm not as illogical as some). Iran on the other hand is majority Shia Muslim, which makes up roughly 10% of all Muslims worldwide, the majority live in Iran, Iraq, and Dearborn, MI (just joking). However, it's interesting to note that 300k Christians live in Tehran (a good chunk converts) The Iranian Parliament has both Christians and Jews on it, plus their right to be is in their constitution, polls show that the Majority of Iranians have a favorable view of the West with programs like Oprah being highly watched through satellite and a number one TV program being and Iranian produced drama about a Jewish family during the Holocaust, now isn't that ironic, add to the fact that Iranians are Persian and Saudi's Arab and a whole other discussion would emerge. But we all know those who subscribe to talking points like the zingers you shot out are either oblivious to these facts, or don't care and bank on your support coming from the ignorant masses who buy the stupid books or visit the anti-Muslim/Islam sites, it's a booming industry. I should write an anti-Islam book so I could make money and get speaking engagements on right wing radio, college campuses, etc. You guys love this stuff!!! I'm not even going to get into secular Turkey who still have issues with Muslim women wearing headscarves. Seeing how you named them in a list with Saudi Arabia who won't even let women drive, shows me that you didn't put much thought into your words. quote: Everyplace muslims rule they repress others, they rule through power and not law. The majority seek to control the actions, thoughts and beliefs of everyone else. Really? Using my last example Turkey a Muslim country BTW, it's the very secular law that they cite to ensure that practicing Muslims not be able to display that identity in government positions. But that's just one example. What about a Muslim country like Senegal? It's a Democratic country with 11 plus million people 95% practice Islam. Do you want to continue to type such fanciful statements that you can't back up? In order, for your statement to make a semblance of sense or be remotely true, you would have to be able to state that your mad rant \"Everyplace muslims rule..\" could actually be proven and not easily debunked with just two examples of countries where \"Muslims rule\" surely based on this alone that whole \"everyplace\" comment has to be called what it is...a lie....The fact is that the majority of the 48 Muslim countries (at least listed by wikipedia) are either democracies or republics. 24 of those countries even with more than 70% of the country being Muslim still have either \"secular\" or \"none\" listed as their state religion. Your entire bs about \"everyplace Muslims\" rule is fiction and is evidence that it's a talking point you heard or read somewhere, that you have not even researched for yourself. I will make it easy for you, go to wikipedia and search \"Muslim Countries\" and you will get the statistics most come from the CIA World Factbook..... quote: Stop trying to place Islam into the context of the Christian faith. I'm not, haven't, and won't. Why would I compare my faith with the one I left...... quote: The values, ideas, and concepts that allowed those of the Christian faith to develop beyond the violence in the bible need to be developed within the muslim faith. Which are?..... Furthermore, do you know the difference between \"faith\" \"religion\" and those who claim to have one or both? They are huge! For instance, What's the Christian faith and what's the Islamic faith? I will make it simple so as not to take too much of your time as you have mine. The majority of Christians (notice the wording because I know that some does not equal all) believe as a matter of faith that Jesus (as) is God, was crucified, died, and rose from the grave three days later for the sins of man so that if you believe in him you will have eternal life. The majority of a several billion Christians believe this in some same or form. All Muslims (notice the changing in words) believe that their is One God, al-illah (The God) of Abraham who sent Muhammad (saw) as a Messenger and Prophet to the Arabs and revealed the Qur'an. Muslims believe this as one of the 5 pillars of our faith. La illaha illallah muhammadan rasoollullah There is no god but The God and Muhammad is the Messenger of The God (literal translation). The following pillars are salah (prayer) zawm (fasting) zikat (charity) Hajj (pilgrimage) All Muslims accept this as their faith the most important being the belief in One God. That is the faiths more or less. The religions are how those who claim to hold the faith practice and interpret the faith in their daily lives using a myriad of methods which are too numerous to name... quote: But they cannot, because the muslim faith dominates every aspect of the muslim culture. You cant even think with the call to prayer coming at you from every direction 230 times a day... That's the best thing about being a Muslim, thanks for reminding me. I love having a faith that is so integrated within my life that I face every waking moment of my life trying to act according to my beliefs. I love making my life so God conscious that I institutionalize my prayers to Him 5 times a day or more and not relegating my devotion to my Creator to once a week if at all. I find it sad that you actually think that your making fun of Muslims or mocking us with that comment. If you think that not praying at least 5 times a day is too much I pray for your soul. That's the least we can do for the Lord of all the universe. It's like one of my favorite Gospel songs \"I will bless the Lord\" my favorite part \"and His praises shall continually be from my mouth\" How can one claim to believe in God yet, think it's OK to not \"burden\" one's self with such \"trivial\" things like prayer? You find us funny for thinking of God every waking moment, we think your funny for not. Last I checked, American Culture could use a healthy dose of God in our DAILY culture, unless of course you believe this society is the perfect example of Jesus' teachings, then of course I have nothing else to say to such blasphemous ideas. Thanks for giving me something to do today...", 
        "intTime": 20090514, 
        "postID": 30, 
        "quote": "Originally posted by threerings: You cant use another religion to defend the crimes of muslims. That just makes no sense. It makes no sense because the bad actions of one group do not justify the bad actions of another. Beyond that it makes no context in the current world situation.", 
        "reply": " Your entire argument falls apart from this quote alone because you demonstrate that you were not paying attention or read what I wrote. I never once used one religion to defend another, that's just idiotic. What I criticized was the bias that's obviously used from those who think like you when criticizing Muslims. My commentary was simply that your logic is poor when you can't apply it universally i.e. if one group of adherents of \"x\" religion are bad because of some verses in their texts or the actions of some of their members, then one group of adherents of \"y\" religion are equally bad because of some verses in their texts or the actions of some of their members. That would be perfectly acceptable. However, what you and others continually do is say that \"x\" is completely different than \"y\" and \"y\" should be held to a completely different standard than \"x\" even if \"y\" meets the same conditions/criteria of \"x\". In order to make that argument, one would have to expound on why the conditions of \"y\" merit greater or lesser variance in the opinion of who's bad or not. However, you guys when called to expound never do, but only give more illogical statements like those that follow your initial commentary, as I will point out.... quote: How many people today are using the bible to justify horriffic crimes? How many are using the Quran? Well, how do you define \"horrific crime\"? You would have to define that term in order to make sense, because you can measure anything until you define it. For instance, even if we agreed and we do that beheading is \"horrific\" than how many Muslims have actually done it out of 1.5 billion? What number would be high enough to condemn all Muslims or low enough to admit that it's not characteristic of all Muslims? Furthermore, considering that you brought up very specific books (Bible and Qur'an) you would have to identify where in either book it is written that one should do said horrific acts. In the case of the example of beheading, where does it state in the Qur'an that it's perfectly acceptable to murder innocent people through beheading such as reporters like Daniel Pearl, or POW's, or innocent men and women both Muslim and non-Muslim? Show me said verse where this command is given for Muslims to murder innocent people especially through beheading and I will never type another word on the internet. Show me where Muslims are expressly told it's their religious duty to do just that and I would have to admit that 1 billion Muslims don't actually follow the Qur'an. But back to the topic of \"horrific\" I believe that beheading as an example is horrific especially when it's done to innocents whether it's a reporter, captive, spouse, etc. But I also think there are many other horrific things in this world such as adultery, lying, stealing, idolatry, fornication, etc. Now considering that this is a majority Christian nation who I imagine read the Bible, or even just the members of this board, are you ready to condemn either the Bible or all Christians based on the actions, words, deeds, etc. of your fellow board members and/or countrymen? Surely, many justify their actions based on teachings in the Bible, many of these actions horrific. For instance, I think it very horrific that one would even believe that just because they believe a specific dogma they are forgiven for their transgressions. I believe that's the number one problem with that group of religious types and why conditions do not mirror in America what I would expect would be an accurate representation of what Jesus (as) taught for example. I think it's horrible that there would be ATM's, credit apps, etc. at \"megachurches\" and the Bible being used as justification for this elaborate money making scheme while their are people in the very cities of these churches who don't have food to eat. But like I said, my definition of horrible may be different than yours. Define that first, then maybe we could get somewhere. quote: But the question is relly even more simple than that.. If you can anwser this honestly: Are people using the Quran to justify violence? Without question, yes. Have people used the Quran to justify violence since its writing? Again, without question, yes. Yes, to all the above. But you have proved nothing. I stated before this post that this is exactly what you would do. Because you could replace the word \"Qur'an\" with Bible, Vedas, or any religious text and would come to the same conclusions. The real question isn't whether or not people use a text or book to justify anything, but whether or not the actual text or book justifies what the people actually say it does. A completely different issue. Can you without question prove that the Qur'an in fact commands Muslims to commit wanton violence? Can you without question prove that since inception all Muslims have understood and practiced Islam according to that command? The answer is no you cannot. This has been the number one stumbling block for the original Orientalist and now the neo-Orientalists as they rehash the same tired arguments to try and label and condemn an entire religion and people. The motives have just changed. What none of you have been willing to accept based upon your illogical conclusions and arrogant assumptions that your calculations never account for the biggest 800 pound gorilla in the room? If the Qur'an teaches what you say it does, then why \"since inception\" it hasn't been characteristic of Muslims across the board to exhibit these traits? Why do so many variables exist and in such numbers. You would have to come to the conclusion that either the overwhelming majority of Muslims don't actually understand or believe in the Qur'an or that the minority who commit these crimes and say it's in the Qur'an are actually just religious fanatics who don't understand or believe in the Qur'an. You can't have it both ways.... It's highly illogical and I have a theory that most Orientalists knew it like they do today, that the arguments are illogical and only state what they state to be part of a smear campaign and nothing more, that way arguments don't have to make sense. Just re-read the illogical statements below that I haven't responded to at this point....There illogical and your premise is all over the place. Just stick to the original assertion which is according to you, others like you, and the terrorists: The Qur'an without a doubt teaches violence and because of that Muslims are violent. I will continue to laugh in your face, other like you, and the terrorists, and call you ideologues who don't use logic, because if your assertions were true than why do those who actually believe that and act on it, don't even account for 5% of the total Muslim population? Since when has it ever been logical that 5% should be considered more characteristic of a trait than 95%? quote: Do muslim people show a desire to move beyond the current desire to use violence as a politcal tool in thier culture? Where did you get these talking points? Do you even know how retarded that one sounds? What is \"Muslim people\"? What is \"Muslim Culture\"? How can you assert a premise that one has to move beyond anything without first defining the very people and thing in which you state need to move beyond? How can you even inquire about the desire of a group which you have not defined? How can you state matter of fact that in \"their\" culture violence is used as a political tool without ever bothering to define anything about the culture, who belongs to it, and about the politics of said culture, since you brought it up? I mean you can make these assertions as you did without one grain of logic, fact, or evidence to back up your talking points or open ended statements, but that doesn't make them logical or remotely make sense, other than the obvious observation that they are just a barrage of totally unrelated statements that have no desire to prove anything but to continue to support and emotionally charged ideology and illicit a response in kind in a gotcha fashion. quote: Based on the actions of muslims in Egypt, Palestine, Iran, Turkey, SA, Syria, and a dozen other places, NO! No to what? Are you willing to be taken seriously or not? Did you honestly type this consciously thinking that it's perfectly logical to look at a billion people across the planet on every continent and judge them by the actions of people in specific locales? Not to mention you didn't even define the actions or how many in said countries participate in said actions. Not even to mention that the cultures of the countries you listed are in some cases different as night and day. For instance, Saudi Arabia's majority religious belief is Wahhabism, in which this particular ideology which isn't even 100 years old is mainly practiced there. It's also interesting to note that the majority of the 9/11 highjackers were from SA and were Wahhabis (not that I'm expressly blaming Wahhabism, I'm not as illogical as some). Iran on the other hand is majority Shia Muslim, which makes up roughly 10% of all Muslims worldwide, the majority live in Iran, Iraq, and Dearborn, MI (just joking). However, it's interesting to note that 300k Christians live in Tehran (a good chunk converts) The Iranian Parliament has both Christians and Jews on it, plus their right to be is in their constitution, polls show that the Majority of Iranians have a favorable view of the West with programs like Oprah being highly watched through satellite and a number one TV program being and Iranian produced drama about a Jewish family during the Holocaust, now isn't that ironic, add to the fact that Iranians are Persian and Saudi's Arab and a whole other discussion would emerge. But we all know those who subscribe to talking points like the zingers you shot out are either oblivious to these facts, or don't care and bank on your support coming from the ignorant masses who buy the stupid books or visit the anti-Muslim/Islam sites, it's a booming industry. I should write an anti-Islam book so I could make money and get speaking engagements on right wing radio, college campuses, etc. You guys love this stuff!!! I'm not even going to get into secular Turkey who still have issues with Muslim women wearing headscarves. Seeing how you named them in a list with Saudi Arabia who won't even let women drive, shows me that you didn't put much thought into your words. quote: Everyplace muslims rule they repress others, they rule through power and not law. The majority seek to control the actions, thoughts and beliefs of everyone else. Really? Using my last example Turkey a Muslim country BTW, it's the very secular law that they cite to ensure that practicing Muslims not be able to display that identity in government positions. But that's just one example. What about a Muslim country like Senegal? It's a Democratic country with 11 plus million people 95% practice Islam. Do you want to continue to type such fanciful statements that you can't back up? In order, for your statement to make a semblance of sense or be remotely true, you would have to be able to state that your mad rant \"Everyplace muslims rule..\" could actually be proven and not easily debunked with just two examples of countries where \"Muslims rule\" surely based on this alone that whole \"everyplace\" comment has to be called what it is...a lie....The fact is that the majority of the 48 Muslim countries (at least listed by wikipedia) are either democracies or republics. 24 of those countries even with more than 70% of the country being Muslim still have either \"secular\" or \"none\" listed as their state religion. Your entire bs about \"everyplace Muslims\" rule is fiction and is evidence that it's a talking point you heard or read somewhere, that you have not even researched for yourself. I will make it easy for you, go to wikipedia and search \"Muslim Countries\" and you will get the statistics most come from the CIA World Factbook..... quote: Stop trying to place Islam into the context of the Christian faith. I'm not, haven't, and won't. Why would I compare my faith with the one I left...... quote: The values, ideas, and concepts that allowed those of the Christian faith to develop beyond the violence in the bible need to be developed within the muslim faith. Which are?..... Furthermore, do you know the difference between \"faith\" \"religion\" and those who claim to have one or both? They are huge! For instance, What's the Christian faith and what's the Islamic faith? I will make it simple so as not to take too much of your time as you have mine. The majority of Christians (notice the wording because I know that some does not equal all) believe as a matter of faith that Jesus (as) is God, was crucified, died, and rose from the grave three days later for the sins of man so that if you believe in him you will have eternal life. The majority of a several billion Christians believe this in some same or form. All Muslims (notice the changing in words) believe that their is One God, al-illah (The God) of Abraham who sent Muhammad (saw) as a Messenger and Prophet to the Arabs and revealed the Qur'an. Muslims believe this as one of the 5 pillars of our faith. La illaha illallah muhammadan rasoollullah There is no god but The God and Muhammad is the Messenger of The God (literal translation). The following pillars are salah (prayer) zawm (fasting) zikat (charity) Hajj (pilgrimage) All Muslims accept this as their faith the most important being the belief in One God. That is the faiths more or less. The religions are how those who claim to hold the faith practice and interpret the faith in their daily lives using a myriad of methods which are too numerous to name... quote: But they cannot, because the muslim faith dominates every aspect of the muslim culture. You cant even think with the call to prayer coming at you from every direction 230 times a day... That's the best thing about being a Muslim, thanks for reminding me. I love having a faith that is so integrated within my life that I face every waking moment of my life trying to act according to my beliefs. I love making my life so God conscious that I institutionalize my prayers to Him 5 times a day or more and not relegating my devotion to my Creator to once a week if at all. I find it sad that you actually think that your making fun of Muslims or mocking us with that comment. If you think that not praying at least 5 times a day is too much I pray for your soul. That's the least we can do for the Lord of all the universe. It's like one of my favorite Gospel songs \"I will bless the Lord\" my favorite part \"and His praises shall continually be from my mouth\" How can one claim to believe in God yet, think it's OK to not \"burden\" one's self with such \"trivial\" things like prayer? You find us funny for thinking of God every waking moment, we think your funny for not. Last I checked, American Culture could use a healthy dose of God in our DAILY culture, unless of course you believe this society is the perfect example of Jesus' teachings, then of course I have nothing else to say to such blasphemous ideas. Thanks for giving me something to do today...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-14 09:01:00", 
        "title": "Radical Islam", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "+++http://www.obsessionthemovie.com/", 
        "intTime": 20090429, 
        "postID": 31, 
        "quote": "", 
        "reply": "+++http://www.obsessionthemovie.com/", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-04-29 16:10:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.obsessionthemovie.com/ threerings this is a start. Thanks", 
        "intTime": 20090502, 
        "postID": 32, 
        "quote": "Originally posted by threerings: +++http://www.obsessionthemovie.com/", 
        "reply": " threerings this is a start. Thanks", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:13:00", 
        "title": "Radical Islam", 
        "userID": "21335484"
    }, 
    {
        "content": "I saw that a while back. Intense and brutal. It's worth watching.", 
        "intTime": 20090502, 
        "postID": 33, 
        "quote": "", 
        "reply": "I saw that a while back. Intense and brutal. It's worth watching.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:18:00", 
        "title": "Radical Islam", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "\"Obsession - The Movie\" The radical Islamist equivilent to the radical Christianist \"Jesus Camp - The Movie\" \"www.jesuscampthemovie.com\" They should be run as a double feature...", 
        "intTime": 20090502, 
        "postID": 34, 
        "quote": "", 
        "reply": "\"Obsession - The Movie\" The radical Islamist equivilent to the radical Christianist \"Jesus Camp - The Movie\" \"www.jesuscampthemovie.com\" They should be run as a double feature...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:23:00", 
        "title": "Radical Islam", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"Obsession - The Movie\" The radical Islamist equivilent to the radical Christianist \"Jesus Camp - The Movie\" \"www.jesuscampthemovie.com\" They should be run as a double feature... lol...I have never heard of that one. I have known my share of \"christian\" fanatics in real life though. That was enough for me.", 
        "intTime": 20090502, 
        "postID": 35, 
        "quote": "Originally posted by Fightdirector: \"Obsession - The Movie\" The radical Islamist equivilent to the radical Christianist \"Jesus Camp - The Movie\" \"www.jesuscampthemovie.com\" They should be run as a double feature...", 
        "reply": " lol...I have never heard of that one. I have known my share of \"christian\" fanatics in real life though. That was enough for me.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:30:00", 
        "title": "Radical Islam", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.obsessionthemovie.com/ I'm not sure who sent it, but that DVD was mailed (free) to all the residents here in my town prior to election time. It was lined up in all the mailboxes. Too bad the message was ignored and we got what we got. And what we're going to get. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090502, 
        "postID": 36, 
        "quote": "Originally posted by threerings: +++http://www.obsessionthemovie.com/", 
        "reply": " I'm not sure who sent it, but that DVD was mailed (free) to all the residents here in my town prior to election time. It was lined up in all the mailboxes. Too bad the message was ignored and we got what we got. And what we're going to get. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 17:42:00", 
        "title": "Radical Islam", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by threerings: +++http://www.obsessionthemovie.com/ Obsession? A perfume worn in the movie Debbie Does Dallas", 
        "intTime": 20090502, 
        "postID": 37, 
        "quote": "Originally posted by threerings: +++http://www.obsessionthemovie.com/", 
        "reply": " Obsession? A perfume worn in the movie Debbie Does Dallas", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-02 18:04:00", 
        "title": "Radical Islam", 
        "userID": "scottrj50"
    }, 
    {
        "content": "In an exclusive statement for the obsessionwithhate website, Dr. Khaleel Mohammed, the only Obsession interviewee who is an Islamic Studies Professor, delivers a new lethal blow to the film's credibility, exposing what many already knew: “Sadly, it would seem that I have allowed myself to be used. I gave an interview to the makers of “obsession” wherein I explained the meaning of Jihad, and its misuse by extremists. I understood that the film would be used objectively, focusing on fanatics who seek to spread violence. I am aware that there is a disclaimer at the beginning of the film that says it is not about Islam in general, but only about extremist interpretations. \"But the material from some of the speakers gives the lie to the disclaimer: many of them are not experts, or have used the mantle of academic qualifications to purvey hate. That their alarmist drivel should be mixed with my whittled down interview proves that the intent of the film is not to educate, but to mislead. The free distribution of the film to voters in particular districts shows the political chicanery that is the motive, and the secrecy about the financing of the distribution only underlines the evil intent in circulating this vile piece of propaganda. \"Evidence seems to indicate the involvement of Aish ha-Torah in this dishonest enterprise. I find that particularly distressing, because any Jewish organization ought to realize what the film seeks to do: they demonize an entire community to the point where a government takes action to further beleaguer its citizens and resident aliens simply because of their religious identity. This bigotry over religion and identity is precisely what caused the Shoah — and it is sad that those who ought to have learned what hate can engender should seek to imitate Nazi propagandism. \"Yet — for all the nefarious intent of the distributors of the film — I must also accept culpability for allowing myself to be so used. I still oppose many of the traditional interpretations of Islam—but that has nothing to do with the film Obsession. I cannot stand by silently and allow my participation in such satanic demonization of innocents. I apologize to my fellow Muslims for appearing in such a film. I apologize to my Jewish teachers and friends-- who have warned me time and again about falling into such a situation—for not heeding their counsel. And I expect now that those who support the film will make me their target. But again: I am no diplomat, and I love a good fight. I am obsessed with the truth. Let’s get it on. “", 
        "intTime": 20090507, 
        "postID": 38, 
        "quote": "", 
        "reply": "In an exclusive statement for the obsessionwithhate website, Dr. Khaleel Mohammed, the only Obsession interviewee who is an Islamic Studies Professor, delivers a new lethal blow to the film's credibility, exposing what many already knew: “Sadly, it would seem that I have allowed myself to be used. I gave an interview to the makers of “obsession” wherein I explained the meaning of Jihad, and its misuse by extremists. I understood that the film would be used objectively, focusing on fanatics who seek to spread violence. I am aware that there is a disclaimer at the beginning of the film that says it is not about Islam in general, but only about extremist interpretations. \"But the material from some of the speakers gives the lie to the disclaimer: many of them are not experts, or have used the mantle of academic qualifications to purvey hate. That their alarmist drivel should be mixed with my whittled down interview proves that the intent of the film is not to educate, but to mislead. The free distribution of the film to voters in particular districts shows the political chicanery that is the motive, and the secrecy about the financing of the distribution only underlines the evil intent in circulating this vile piece of propaganda. \"Evidence seems to indicate the involvement of Aish ha-Torah in this dishonest enterprise. I find that particularly distressing, because any Jewish organization ought to realize what the film seeks to do: they demonize an entire community to the point where a government takes action to further beleaguer its citizens and resident aliens simply because of their religious identity. This bigotry over religion and identity is precisely what caused the Shoah — and it is sad that those who ought to have learned what hate can engender should seek to imitate Nazi propagandism. \"Yet — for all the nefarious intent of the distributors of the film — I must also accept culpability for allowing myself to be so used. I still oppose many of the traditional interpretations of Islam—but that has nothing to do with the film Obsession. I cannot stand by silently and allow my participation in such satanic demonization of innocents. I apologize to my fellow Muslims for appearing in such a film. I apologize to my Jewish teachers and friends-- who have warned me time and again about falling into such a situation—for not heeding their counsel. And I expect now that those who support the film will make me their target. But again: I am no diplomat, and I love a good fight. I am obsessed with the truth. Let’s get it on. “", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 09:51:00", 
        "title": "Radical Islam", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "quote: SgtSalaamv2 What are you saying? Just because this guy you are quoting is upset doesn't make the movie less objective. It does disclaim that the movie is not about Islam but about Extremist using Islam for their own needs. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090507, 
        "postID": 39, 
        "quote": "SgtSalaamv2", 
        "reply": " What are you saying? Just because this guy you are quoting is upset doesn't make the movie less objective. It does disclaim that the movie is not about Islam but about Extremist using Islam for their own needs. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 10:01:00", 
        "title": "Radical Islam", 
        "userID": "L0A1"
    }, 
    {
        "content": "Salaamv2...what? There are no \"Radical Islam\"ists? really? Very convenient for arguement sake?!", 
        "intTime": 20090507, 
        "postID": 40, 
        "quote": "", 
        "reply": "Salaamv2...what? There are no \"Radical Islam\"ists? really? Very convenient for arguement sake?!", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 10:05:00", 
        "title": "Radical Islam", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today.", 
        "intTime": 20090507, 
        "postID": 41, 
        "quote": "", 
        "reply": "Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 11:06:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam.", 
        "intTime": 20090507, 
        "postID": 42, 
        "quote": "Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today.", 
        "reply": " The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 11:36:00", 
        "title": "Radical Islam", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Thsi is my kind of \"obsession\" \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090507, 
        "postID": 43, 
        "quote": "", 
        "reply": "Thsi is my kind of \"obsession\" \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 11:49:00", 
        "title": "Radical Islam", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers.", 
        "intTime": 20090507, 
        "postID": 44, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam.", 
        "reply": " Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:21:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. Was there any ethnic violence in Iraq prior to our ousting of Saddam? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090507, 
        "postID": 45, 
        "quote": "Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers.", 
        "reply": " Was there any ethnic violence in Iraq prior to our ousting of Saddam? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:24:00", 
        "title": "Radical Islam", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.", 
        "intTime": 20090507, 
        "postID": 46, 
        "quote": "Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers.", 
        "reply": " I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:40:00", 
        "title": "Radical Islam", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes. I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD. I'm also saying this: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith.", 
        "intTime": 20090507, 
        "postID": 47, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.", 
        "reply": " I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD. I'm also saying this: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:54:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. Was there any ethnic violence in Iraq prior to our ousting of Saddam? Ethnic Violence? Prior to OUR ousting of Saddam? I guess you don't have a good memory. quote: Iraq planned and sponsored international terrorism in 2000. Although Baghdad focused on antidissident activity overseas, the regime continued to support various terrorist groups. The regime has not attempted an anti-Western terrorist attack since its failed plot to assassinate former President Bush in 1993 in Kuwait. To intimidate or silence Iraqi opponents of the regime living overseas, the IIS reportedly opened several new stations in foreign capitals during 2000. Various opposition groups joined in warning Iraqi dissidents abroad against newly established \"expatriates' associations,\" which, they asserted, are IIS front organizations. Opposition leaders in London contended that the IIS had dispatched women agents to infiltrate their ranks and was targeting dissidents for assassination. In Germany, an Iraqi opposition figure denounced the IIS for murdering his son, who had recently left Iraq to join him abroad. Dr. Ayad `Allawi, Secretary General of the Iraqi National Accord, an opposition group, stated that relatives of dissidents living abroad are often arrested and jailed to intimidate activists overseas. In northern Iraq, Iraqi agents reportedly killed a locally well-known religious personality who declined to echo the regime line. The regional security director in As Sulaymaniyah stated that Iraqi operatives were responsible for the car-bomb explosion that injured a score of passersby. Officials of the Iraqi Communist Party asserted that an attack on a provincial party headquarters had been thwarted when party security officers shot and wounded a terrorist employed by the IIS. (*http://www.terrorismfiles.org/countries/iraq.html*) quote: The nation's recent history was shaped by Saddam Hussein, a brutal dictator who ruled Iraq from July 1979 to April 2003. Iraq launched an enormously destructive but ultimately inconclusive war against Iran in 1980. The country invaded and annexed Kuwait in August 1990, and occupied it until expelled by a U.S.-led coalition in February 1991. Citing the threat posed by the Hussein regime to the U.S. and to American allies and interests in the Middle East, the U.S. led an invasion of Iraq in March 2003 and occupied Baghdad, Iraq's capital, the following month, establishing an interim civilian administration under U.S. military command. Sovereign authority was transferred to an interim Iraqi government in June 2004. A new constitution was ratified in October 2005, and legislative elections were held two months later. Saddam Hussein was tried and convicted of one of the key charges against him, and executed on Dec. 30, 2006. As that year ended, the U.S. and its coalition partners still had nearly 160,000 troops in Iraq, to oversee reconstruction and help establish security in the face of an ongoing insurgency and sectarian violence. (*http://www.history.com/encyclopedia.do?articleId=212866*)", 
        "intTime": 20090507, 
        "postID": 48, 
        "quote": "Originally posted by NSNN: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. Was there any ethnic violence in Iraq prior to our ousting of Saddam?", 
        "reply": " Ethnic Violence? Prior to OUR ousting of Saddam? I guess you don't have a good memory. quote: Iraq planned and sponsored international terrorism in 2000. Although Baghdad focused on antidissident activity overseas, the regime continued to support various terrorist groups. The regime has not attempted an anti-Western terrorist attack since its failed plot to assassinate former President Bush in 1993 in Kuwait. To intimidate or silence Iraqi opponents of the regime living overseas, the IIS reportedly opened several new stations in foreign capitals during 2000. Various opposition groups joined in warning Iraqi dissidents abroad against newly established \"expatriates' associations,\" which, they asserted, are IIS front organizations. Opposition leaders in London contended that the IIS had dispatched women agents to infiltrate their ranks and was targeting dissidents for assassination. In Germany, an Iraqi opposition figure denounced the IIS for murdering his son, who had recently left Iraq to join him abroad. Dr. Ayad `Allawi, Secretary General of the Iraqi National Accord, an opposition group, stated that relatives of dissidents living abroad are often arrested and jailed to intimidate activists overseas. In northern Iraq, Iraqi agents reportedly killed a locally well-known religious personality who declined to echo the regime line. The regional security director in As Sulaymaniyah stated that Iraqi operatives were responsible for the car-bomb explosion that injured a score of passersby. Officials of the Iraqi Communist Party asserted that an attack on a provincial party headquarters had been thwarted when party security officers shot and wounded a terrorist employed by the IIS. (*http://www.terrorismfiles.org/countries/iraq.html*) quote: The nation's recent history was shaped by Saddam Hussein, a brutal dictator who ruled Iraq from July 1979 to April 2003. Iraq launched an enormously destructive but ultimately inconclusive war against Iran in 1980. The country invaded and annexed Kuwait in August 1990, and occupied it until expelled by a U.S.-led coalition in February 1991. Citing the threat posed by the Hussein regime to the U.S. and to American allies and interests in the Middle East, the U.S. led an invasion of Iraq in March 2003 and occupied Baghdad, Iraq's capital, the following month, establishing an interim civilian administration under U.S. military command. Sovereign authority was transferred to an interim Iraqi government in June 2004. A new constitution was ratified in October 2005, and legislative elections were held two months later. Saddam Hussein was tried and convicted of one of the key charges against him, and executed on Dec. 30, 2006. As that year ended, the U.S. and its coalition partners still had nearly 160,000 troops in Iraq, to oversee reconstruction and help establish security in the face of an ongoing insurgency and sectarian violence. (*http://www.history.com/encyclopedia.do?articleId=212866*)", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 12:55:00", 
        "title": "Radical Islam", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. The Muslims of the US military might disagree with you.", 
        "intTime": 20090507, 
        "postID": 49, 
        "quote": "The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith.", 
        "reply": " The Muslims of the US military might disagree with you.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 13:03:00", 
        "title": "Radical Islam", 
        "userID": "foxred03"
    }, 
    {
        "content": "[QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.[/QUOTE] That statement makes no sense to me - it's like saying it had nothing to do with the religion, but everything to do with the religion. If it had nothing to do with Islam, how could they pervert it to their own ends? Would you say the same of Minister Phelps from Kansas, that it has nothing to do with Christianity, but those perverting it for thier own purposes?", 
        "intTime": 20090507, 
        "postID": 50, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.[/QUOTE] That statement makes no sense to me - it's like saying it had nothing to do with the religion, but everything to do with the religion. If it had nothing to do with Islam, how could they pervert it to their own ends? Would you say the same of Minister Phelps from Kansas, that it has nothing to do with Christianity, but those perverting it for thier own purposes?", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 13:11:00", 
        "title": "Radical Islam", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. The Muslims of the US military might disagree with you. Like the one who tossed a gernade into a tent of 101st soldiers? Or the ones giving endless cultural briefs that amount to: accept us, no matter how barbaric we act and please dont attempt to ask any questions because we cant respond to them?", 
        "intTime": 20090507, 
        "postID": 51, 
        "quote": "Originally posted by foxred03: quote: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. The Muslims of the US military might disagree with you.", 
        "reply": " Like the one who tossed a gernade into a tent of 101st soldiers? Or the ones giving endless cultural briefs that amount to: accept us, no matter how barbaric we act and please dont attempt to ask any questions because we cant respond to them?", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 15:13:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by transport1: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.[/QUOTE] That statement makes no sense to me - it's like saying it had nothing to do with the religion, but everything to do with the religion. If it had nothing to do with Islam, how could they pervert it to their own ends? Would you say the same of Minister Phelps from Kansas, that it has nothing to do with Christianity, but those perverting it for thier own purposes? Phelps has nothing to do with Christianity. He doesn't represent the vast majority of Christians, his views don't reflect the opionions of the vast majority. He is an extremist, not even a fundamentalist because his views are far from fundamental Christians. He is the same as a Muslim extremist, he spews a perverted religion to make his own point.", 
        "intTime": 20090507, 
        "postID": 52, 
        "quote": "Originally posted by transport1: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: [QUOTE]Originally posted by nspreitler: [QUOTE]Originally posted by threerings: I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes.[/QUOTE] That statement makes no sense to me - it's like saying it had nothing to do with the religion, but everything to do with the religion. If it had nothing to do with Islam, how could they pervert it to their own ends? Would you say the same of Minister Phelps from Kansas, that it has nothing to do with Christianity, but those perverting it for thier own purposes?", 
        "reply": " Phelps has nothing to do with Christianity. He doesn't represent the vast majority of Christians, his views don't reflect the opionions of the vast majority. He is an extremist, not even a fundamentalist because his views are far from fundamental Christians. He is the same as a Muslim extremist, he spews a perverted religion to make his own point.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 16:41:00", 
        "title": "Radical Islam", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes. I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD. I'm also saying this: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. That may be true for some, but not most. The majority of Muslims in my experience don't care what the rest of the world does. The shop owner in Baghdad wants to earn a living, they don't care that American Christians eat pork or drink beer. I would also disagree about them not being willing to defend anoyone that isn't Muslim. They don't really care about what religion someone is, my terps and the dozens of Iraqis I advised didn't care that I wasn't Muslim. What they do care about is respect for their culture. If you go in and show no regard for their traditions they won't do anything for you. If you go in polite, drink the tea, have lunch with them, observe some of their customs, and learn a little of the language they will treat you like a brother. I have no doubt that my terps and some of the IA soldiers would have taken a bullet for me.", 
        "intTime": 20090507, 
        "postID": 53, 
        "quote": "Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: quote: Originally posted by nspreitler: quote: Originally posted by threerings: Salaamv underscores the problem with Islam as a whole: namely the refusal to admit that a good number of the flock use Islam as an excuse to bring violence. I think it runs deeper. A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. For all the atrocities other faiths have been guilty of there has also been a general acceptance among the faithful that they where wrong. The crusades ended 600 years ago, yet they are still used as an argument to justify the islamic violence of today. The Middle east has moved through periods of violence and tolerance just like Europe. Baghdad at one point was the model for tolerance, and that even existed until 2003. There are Iraqis of multiple faiths that had no major issues living together. Shia, Sunni, Christian, and Mandaeans (followers of John the Baptist). Now the religious minorities in Iraq are far more persecuted than they were before. The Mandaean popualation in Iraq has gone from 70,000 before 2003 to about 7,000 now. Even Iran has allowed other religions throughouy its history, and even today has a population of about 25,000 Jews. The extremists use Islam as a reason to promote hatred, just like extremists groups in the US used Christianity as a front to oppose civil rights. However, it isn't the majority of Muslims and it certainly isn't an actual part of Islam. Ya, Saddam feeding people to lions was a great period of moderation. As soon as the U.S. took over, WE created all the issues between Sunni and Shia? Really? No, Saddam kept a lid on things with a bloody iron hand. People vanished in the middle of the night, sisters and moms where raped at will...real torture was the order of the day. You know one of my duties in Iraq? I got to catalog the torture devices left on my FOB by Saddam's regime. I got to help catalog the use of those devices, speak to victims, watch videos.... So dont tell me how nice and moderate Iraq was prior to the savage invasion of the imperial conquers. I never said Iraq was better off under Saddam, but the iron hand that he did use was effective in keeping sectarian violence at bay. However, his use of force against the Shia majority was enough to force thousands over to Iran and resulted in the creation of the Badr Corps which today has a lot of influence in the Iraqi government. The Saddam government is notable in that it was secular, and the violence under Saddam has nothing to do with Islam. Many people are under the impression that Saddam's Iraq was like Afghanistan with the treatment of women and education. That just isn't true, Saddam ruled a secular Iraq under the premise of pan-arabism, which is secular socialism. Iraq as far back as the Middle Ages was notable for its diversity and tolerance of religions. When the Europeans were torturing and killing anyone that disagreed with the Catholic church, Baghdad had a thriving community of Christians, Muslims, and other religions. Those other religions in Iraq existed there for thousands of years, usually in peace, until 2003. It isn't our fault Iraq imploded on itself, and I never called us \"imperial conquers\". I was there to, and I lived and worked with the IA on their base. I heard the horror stories about Saddam, and I know several Iraqis that suffered greatly under him including one man who's father and brother were killed in order for Saddam to confiscate a car. I have a different perspective than you do, you have the belief that Islam is the cause of the violence. My opinion is that it has nothing to do with Islam, it is extremists that pervert the religion for their own purposes. I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD. I'm also saying this: The VAST majority of muslims, while NOT violent, are bent on bending the world to their will and vision. They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith.", 
        "reply": " That may be true for some, but not most. The majority of Muslims in my experience don't care what the rest of the world does. The shop owner in Baghdad wants to earn a living, they don't care that American Christians eat pork or drink beer. I would also disagree about them not being willing to defend anoyone that isn't Muslim. They don't really care about what religion someone is, my terps and the dozens of Iraqis I advised didn't care that I wasn't Muslim. What they do care about is respect for their culture. If you go in and show no regard for their traditions they won't do anything for you. If you go in polite, drink the tea, have lunch with them, observe some of their customs, and learn a little of the language they will treat you like a brother. I have no doubt that my terps and some of the IA soldiers would have taken a bullet for me.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 16:49:00", 
        "title": "Radical Islam", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Phelps has nothing to do with Christianity. He doesn't represent the vast majority of Christians, his views don't reflect the opionions of the vast majority. He is an extremist, not even a fundamentalist because his views are far from fundamental Christians. He is the same as a Muslim extremist, he spews a perverted religion to make his own point. That is true. Just because a religious fanatic uses a religion to promote their evil acts, does not mean they are representing the real beliefs of that religion. They interpret their professed religion in such a way, that it will allow them a \"reason\" in their own mind for commiting the atrocites that they commit. I have known \"Christian\" fanatics and they are as far from true Christianity as one can get. The same can be said for the true Islam. Religious extremists can come in all religions and yet in reality, have absolutely nothing to do with any religion. It is all about fanaticism, period. It gets worse when the strenght of said fanatics lies in their numbers and that is why Radical \"Islam\" is so dangerous. That and the fact they want all of us dead. That is not what the true Muslims believe. It is time though to stop with the nitpicking and just call them what they are... murdering terrorists.", 
        "intTime": 20090507, 
        "postID": 54, 
        "quote": "Originally posted by nspreitler: Phelps has nothing to do with Christianity. He doesn't represent the vast majority of Christians, his views don't reflect the opionions of the vast majority. He is an extremist, not even a fundamentalist because his views are far from fundamental Christians. He is the same as a Muslim extremist, he spews a perverted religion to make his own point.", 
        "reply": " That is true. Just because a religious fanatic uses a religion to promote their evil acts, does not mean they are representing the real beliefs of that religion. They interpret their professed religion in such a way, that it will allow them a \"reason\" in their own mind for commiting the atrocites that they commit. I have known \"Christian\" fanatics and they are as far from true Christianity as one can get. The same can be said for the true Islam. Religious extremists can come in all religions and yet in reality, have absolutely nothing to do with any religion. It is all about fanaticism, period. It gets worse when the strenght of said fanatics lies in their numbers and that is why Radical \"Islam\" is so dangerous. That and the fact they want all of us dead. That is not what the true Muslims believe. It is time though to stop with the nitpicking and just call them what they are... murdering terrorists.", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 17:15:00", 
        "title": "Radical Islam", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Of course, you all understand that the islamofascists ALL think of themselves as good Allah worshiping Muslims, don't you? And is you don't agree, they'll gleefully kill you shouting \"Allahu Akbar!\" That many of the sects tolerate each other as near apostates and would be at each other's throats were Christians and Jews unavailable.....", 
        "intTime": 20090507, 
        "postID": 55, 
        "quote": "", 
        "reply": "Of course, you all understand that the islamofascists ALL think of themselves as good Allah worshiping Muslims, don't you? And is you don't agree, they'll gleefully kill you shouting \"Allahu Akbar!\" That many of the sects tolerate each other as near apostates and would be at each other's throats were Christians and Jews unavailable.....", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-07 18:53:00", 
        "title": "Radical Islam", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Salaamv2...what? There are no \"Radical Islam\"ists? really? Very convenient for arguement sake?! Well I don't understand your Fox \"News\" terms, but I don't recall ever stating anywhere that there are no terrorists who call themselves Muslim. Stay on topic. The response was about the \"truth\" of the propaganda that was handed out in hopes of getting McCain elected that failed miserably. quote: A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. Got any sources to back up that diatribe? quote: I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD What is Islam's nature, please tell us. Oh and be sure to use authentic Islamic sources i.e. Quran, Hadith, Tafsir as these are the only sources Muslims follow. quote: They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. Wow, how about I hand over my DD214 so you can spit on it? quote: Like the one who tossed a gernade into a tent of 101st soldiers? Or the ones giving endless cultural briefs that amount to: accept us, no matter how barbaric we act and please dont attempt to ask any questions because we cant respond to them? Let's see ONE guy frags his platoon and some troops are asked by the CO to give a brief, and somehow that means that 20k plus active duty, countless vets, and thousands of Muslims who fought and died in many of our conflicts, are liars. How about you take a trip to Arlington and start kicking over all those crescent engraved headstones..... quote: That is true. Just because a religious fanatic uses a religion to promote their evil acts, does not mean they are representing the real beliefs of that religion. They interpret their professed religion in such a way, that it will allow them a \"reason\" in their own mind for commiting the atrocites that they commit. I have known \"Christian\" fanatics and they are as far from true Christianity as one can get. The same can be said for the true Islam. Religious extremists can come in all religions and yet in reality, have absolutely nothing to do with any religion. It is all about fanaticism, period. It gets worse when the strenght of said fanatics lies in their numbers and that is why Radical \"Islam\" is so dangerous. That and the fact they want all of us dead. That is not what the true Muslims believe. It is time though to stop with the nitpicking and just call them what they are... murdering terrorists. Couldn't have said it better! Amen, Amen, and Amen", 
        "intTime": 20090508, 
        "postID": 56, 
        "quote": "Salaamv2...what? There are no \"Radical Islam\"ists? really? Very convenient for arguement sake?!", 
        "reply": " Well I don't understand your Fox \"News\" terms, but I don't recall ever stating anywhere that there are no terrorists who call themselves Muslim. Stay on topic. The response was about the \"truth\" of the propaganda that was handed out in hopes of getting McCain elected that failed miserably. quote: A reading of ANY history of Islam shows a core that values violence as a means of gaining and holding power, as a tool to control the masses. Unlike other religions, Islam has never really moved beyond that.. Got any sources to back up that diatribe? quote: I beleive that Islam's nature lends itself to the development of extremists. Islam stopped developing in any real way about 1200 AD What is Islam's nature, please tell us. Oh and be sure to use authentic Islamic sources i.e. Quran, Hadith, Tafsir as these are the only sources Muslims follow. quote: They may not be willing to kill in the name of Alah, but they are also not willing to defend anyone not of the faith. Wow, how about I hand over my DD214 so you can spit on it? quote: Like the one who tossed a gernade into a tent of 101st soldiers? Or the ones giving endless cultural briefs that amount to: accept us, no matter how barbaric we act and please dont attempt to ask any questions because we cant respond to them? Let's see ONE guy frags his platoon and some troops are asked by the CO to give a brief, and somehow that means that 20k plus active duty, countless vets, and thousands of Muslims who fought and died in many of our conflicts, are liars. How about you take a trip to Arlington and start kicking over all those crescent engraved headstones..... quote: That is true. Just because a religious fanatic uses a religion to promote their evil acts, does not mean they are representing the real beliefs of that religion. They interpret their professed religion in such a way, that it will allow them a \"reason\" in their own mind for commiting the atrocites that they commit. I have known \"Christian\" fanatics and they are as far from true Christianity as one can get. The same can be said for the true Islam. Religious extremists can come in all religions and yet in reality, have absolutely nothing to do with any religion. It is all about fanaticism, period. It gets worse when the strenght of said fanatics lies in their numbers and that is why Radical \"Islam\" is so dangerous. That and the fact they want all of us dead. That is not what the true Muslims believe. It is time though to stop with the nitpicking and just call them what they are... murdering terrorists. Couldn't have said it better! Amen, Amen, and Amen", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-08 11:06:00", 
        "title": "Radical Islam", 
        "userID": "SgtSalaamv2"
    }, 
    {
        "content": "Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons...", 
        "intTime": 20090508, 
        "postID": 57, 
        "quote": "", 
        "reply": "Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-08 16:05:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons... We all know how it would go. All your going to do is the same ole tired Orientalist tactic which is arbitrarily find a verse in the Qur'an that is an example of the propraghanda you and the terrorists believe about Islam, I will counter by doing the same exact topic with the Bible by posting arbitrarily verses that talk about the same exact things. You and or other Bible believers will tell me I'm reading the Bible out of context, which I will agree (because of common sense and religious study) I will say the same about the Qur'an and then you and all those that agree with you, will refuse to agree with the same logic. In other words, the goal posts change depending on who's religion is being talked about. It's supposed to be understood according to your logic that: Verses in the Bible that are violent have to be understood in context of the entire scripture and when necessary interpretation from Christian scholars. Christians who are violent, support violence, etc. are not true Christians and this minority doesn't represent all Christians no matter what they say. However.... It's to be understood that if we are talking about Islam, none of those rules exist, because: Versus in the Qur'an that are \"violent\" are not to be understood in context, it doesn't matter what Islamic scholars say, they must be understood in the literal English interpretation as going to the Arabic source would be akin to contextual arguments and no such thing exists when judging Islam. When Muslims do violent things even if they are the minority they absolutely represent all Muslims and are definitely true Muslims because they say so and it doesn't matter what other Muslims say even if they are in the majority. So please if you feel like being a typical hypocrite will prove something, go ahead and post your 10-20 oft misinterpreted, misread, and out of context verses and/or Hadith that are so popular with the anti-Islam statements. I will dissect each and everyone of them in context, giving insight into the original language, history, and scholarly sources, and the people can judge for themselves whether: A non-Muslim who studies from non-Muslim or so-called \"former\" Muslim sources knows more about Islam.. or A practicing Muslim who studies from Muslim and non-Muslim sources knows more about Islam...", 
        "intTime": 20090512, 
        "postID": 58, 
        "quote": "Originally posted by threerings: Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons...", 
        "reply": " We all know how it would go. All your going to do is the same ole tired Orientalist tactic which is arbitrarily find a verse in the Qur'an that is an example of the propraghanda you and the terrorists believe about Islam, I will counter by doing the same exact topic with the Bible by posting arbitrarily verses that talk about the same exact things. You and or other Bible believers will tell me I'm reading the Bible out of context, which I will agree (because of common sense and religious study) I will say the same about the Qur'an and then you and all those that agree with you, will refuse to agree with the same logic. In other words, the goal posts change depending on who's religion is being talked about. It's supposed to be understood according to your logic that: Verses in the Bible that are violent have to be understood in context of the entire scripture and when necessary interpretation from Christian scholars. Christians who are violent, support violence, etc. are not true Christians and this minority doesn't represent all Christians no matter what they say. However.... It's to be understood that if we are talking about Islam, none of those rules exist, because: Versus in the Qur'an that are \"violent\" are not to be understood in context, it doesn't matter what Islamic scholars say, they must be understood in the literal English interpretation as going to the Arabic source would be akin to contextual arguments and no such thing exists when judging Islam. When Muslims do violent things even if they are the minority they absolutely represent all Muslims and are definitely true Muslims because they say so and it doesn't matter what other Muslims say even if they are in the majority. So please if you feel like being a typical hypocrite will prove something, go ahead and post your 10-20 oft misinterpreted, misread, and out of context verses and/or Hadith that are so popular with the anti-Islam statements. I will dissect each and everyone of them in context, giving insight into the original language, history, and scholarly sources, and the people can judge for themselves whether: A non-Muslim who studies from non-Muslim or so-called \"former\" Muslim sources knows more about Islam.. or A practicing Muslim who studies from Muslim and non-Muslim sources knows more about Islam...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-12 11:30:00", 
        "title": "Radical Islam", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "quote: Originally posted by Sgt_Salaam: quote: Originally posted by threerings: Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons... We all know how it would go. All your going to do is the same ole tired Orientalist tactic which is arbitrarily find a verse in the Qur'an that is an example of the propraghanda you and the terrorists believe about Islam, I will counter by doing the same exact topic with the Bible by posting arbitrarily verses that talk about the same exact things. You and or other Bible believers will tell me I'm reading the Bible out of context, which I will agree (because of common sense and religious study) I will say the same about the Qur'an and then you and all those that agree with you, will refuse to agree with the same logic. In other words, the goal posts change depending on who's religion is being talked about. It's supposed to be understood according to your logic that: Verses in the Bible that are violent have to be understood in context of the entire scripture and when necessary interpretation from Christian scholars. Christians who are violent, support violence, etc. are not true Christians and this minority doesn't represent all Christians no matter what they say. However.... It's to be understood that if we are talking about Islam, none of those rules exist, because: Versus in the Qur'an that are \"violent\" are not to be understood in context, it doesn't matter what Islamic scholars say, they must be understood in the literal English interpretation as going to the Arabic source would be akin to contextual arguments and no such thing exists when judging Islam. When Muslims do violent things even if they are the minority they absolutely represent all Muslims and are definitely true Muslims because they say so and it doesn't matter what other Muslims say even if they are in the majority. So please if you feel like being a typical hypocrite will prove something, go ahead and post your 10-20 oft misinterpreted, misread, and out of context verses and/or Hadith that are so popular with the anti-Islam statements. I will dissect each and everyone of them in context, giving insight into the original language, history, and scholarly sources, and the people can judge for themselves whether: A non-Muslim who studies from non-Muslim or so-called \"former\" Muslim sources knows more about Islam.. or A practicing Muslim who studies from Muslim and non-Muslim sources knows more about Islam... You cant use another religion to defend the crimes of muslims. That just makes no sense. It makes no sense because the bad actions of one group do not justify the bad actions of another. Beyond that it makes no context in the current world situation. How many people today are using the bible to justify horriffic crimes? How many are using the Quran? But the question is relly even more simple than that.. If you can anwser this honestly: Are people using the Quran to justify violence? Without question, yes. Have people used the Quran to justify violence since its writing? Again, without question, yes. Do muslim people show a desire to move beyond the current desire to use violence as a politcal tool in thier culture? Based on the actions of muslims in Egypt, Palestine, Iran, Turkey, SA, Syria, and a dozen other places, NO! Everyplace muslims rule they repress others, they rule through power and not law. The majority seek to control the actions, thoughts and beliefs of everyone else. Stop trying to place Islam into the context of the Christian faith. The values, ideas, and concepts that allowed those of the Christian faith to develop beyond the violence in the bible need to be developed within the muslim faith. But they cannot, because the muslim faith dominates every aspect of the muslim culture. You cant even think with the call to prayer coming at you from every direction 230 times a day...", 
        "intTime": 20090512, 
        "postID": 59, 
        "quote": "Originally posted by Sgt_Salaam: quote: Originally posted by threerings: Really want me to quote the Quran? Must we have THIS debate, AGAIN? I'd rather use current sources...Maybe I'll break out my cartoons... We all know how it would go. All your going to do is the same ole tired Orientalist tactic which is arbitrarily find a verse in the Qur'an that is an example of the propraghanda you and the terrorists believe about Islam, I will counter by doing the same exact topic with the Bible by posting arbitrarily verses that talk about the same exact things. You and or other Bible believers will tell me I'm reading the Bible out of context, which I will agree (because of common sense and religious study) I will say the same about the Qur'an and then you and all those that agree with you, will refuse to agree with the same logic. In other words, the goal posts change depending on who's religion is being talked about. It's supposed to be understood according to your logic that: Verses in the Bible that are violent have to be understood in context of the entire scripture and when necessary interpretation from Christian scholars. Christians who are violent, support violence, etc. are not true Christians and this minority doesn't represent all Christians no matter what they say. However.... It's to be understood that if we are talking about Islam, none of those rules exist, because: Versus in the Qur'an that are \"violent\" are not to be understood in context, it doesn't matter what Islamic scholars say, they must be understood in the literal English interpretation as going to the Arabic source would be akin to contextual arguments and no such thing exists when judging Islam. When Muslims do violent things even if they are the minority they absolutely represent all Muslims and are definitely true Muslims because they say so and it doesn't matter what other Muslims say even if they are in the majority. So please if you feel like being a typical hypocrite will prove something, go ahead and post your 10-20 oft misinterpreted, misread, and out of context verses and/or Hadith that are so popular with the anti-Islam statements. I will dissect each and everyone of them in context, giving insight into the original language, history, and scholarly sources, and the people can judge for themselves whether: A non-Muslim who studies from non-Muslim or so-called \"former\" Muslim sources knows more about Islam.. or A practicing Muslim who studies from Muslim and non-Muslim sources knows more about Islam...", 
        "reply": " You cant use another religion to defend the crimes of muslims. That just makes no sense. It makes no sense because the bad actions of one group do not justify the bad actions of another. Beyond that it makes no context in the current world situation. How many people today are using the bible to justify horriffic crimes? How many are using the Quran? But the question is relly even more simple than that.. If you can anwser this honestly: Are people using the Quran to justify violence? Without question, yes. Have people used the Quran to justify violence since its writing? Again, without question, yes. Do muslim people show a desire to move beyond the current desire to use violence as a politcal tool in thier culture? Based on the actions of muslims in Egypt, Palestine, Iran, Turkey, SA, Syria, and a dozen other places, NO! Everyplace muslims rule they repress others, they rule through power and not law. The majority seek to control the actions, thoughts and beliefs of everyone else. Stop trying to place Islam into the context of the Christian faith. The values, ideas, and concepts that allowed those of the Christian faith to develop beyond the violence in the bible need to be developed within the muslim faith. But they cannot, because the muslim faith dominates every aspect of the muslim culture. You cant even think with the call to prayer coming at you from every direction 230 times a day...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-12 12:52:00", 
        "title": "Radical Islam", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: You cant use another religion to defend the crimes of muslims. That just makes no sense. It makes no sense because the bad actions of one group do not justify the bad actions of another. Beyond that it makes no context in the current world situation. Your entire argument falls apart from this quote alone because you demonstrate that you were not paying attention or read what I wrote. I never once used one religion to defend another, that's just idiotic. What I criticized was the bias that's obviously used from those who think like you when criticizing Muslims. My commentary was simply that your logic is poor when you can't apply it universally i.e. if one group of adherents of \"x\" religion are bad because of some verses in their texts or the actions of some of their members, then one group of adherents of \"y\" religion are equally bad because of some verses in their texts or the actions of some of their members. That would be perfectly acceptable. However, what you and others continually do is say that \"x\" is completely different than \"y\" and \"y\" should be held to a completely different standard than \"x\" even if \"y\" meets the same conditions/criteria of \"x\". In order to make that argument, one would have to expound on why the conditions of \"y\" merit greater or lesser variance in the opinion of who's bad or not. However, you guys when called to expound never do, but only give more illogical statements like those that follow your initial commentary, as I will point out.... quote: How many people today are using the bible to justify horriffic crimes? How many are using the Quran? Well, how do you define \"horrific crime\"? You would have to define that term in order to make sense, because you can measure anything until you define it. For instance, even if we agreed and we do that beheading is \"horrific\" than how many Muslims have actually done it out of 1.5 billion? What number would be high enough to condemn all Muslims or low enough to admit that it's not characteristic of all Muslims? Furthermore, considering that you brought up very specific books (Bible and Qur'an) you would have to identify where in either book it is written that one should do said horrific acts. In the case of the example of beheading, where does it state in the Qur'an that it's perfectly acceptable to murder innocent people through beheading such as reporters like Daniel Pearl, or POW's, or innocent men and women both Muslim and non-Muslim? Show me said verse where this command is given for Muslims to murder innocent people especially through beheading and I will never type another word on the internet. Show me where Muslims are expressly told it's their religious duty to do just that and I would have to admit that 1 billion Muslims don't actually follow the Qur'an. But back to the topic of \"horrific\" I believe that beheading as an example is horrific especially when it's done to innocents whether it's a reporter, captive, spouse, etc. But I also think there are many other horrific things in this world such as adultery, lying, stealing, idolatry, fornication, etc. Now considering that this is a majority Christian nation who I imagine read the Bible, or even just the members of this board, are you ready to condemn either the Bible or all Christians based on the actions, words, deeds, etc. of your fellow board members and/or countrymen? Surely, many justify their actions based on teachings in the Bible, many of these actions horrific. For instance, I think it very horrific that one would even believe that just because they believe a specific dogma they are forgiven for their transgressions. I believe that's the number one problem with that group of religious types and why conditions do not mirror in America what I would expect would be an accurate representation of what Jesus (as) taught for example. I think it's horrible that there would be ATM's, credit apps, etc. at \"megachurches\" and the Bible being used as justification for this elaborate money making scheme while their are people in the very cities of these churches who don't have food to eat. But like I said, my definition of horrible may be different than yours. Define that first, then maybe we could get somewhere. quote: But the question is relly even more simple than that.. If you can anwser this honestly: Are people using the Quran to justify violence? Without question, yes. Have people used the Quran to justify violence since its writing? Again, without question, yes. Yes, to all the above. But you have proved nothing. I stated before this post that this is exactly what you would do. Because you could replace the word \"Qur'an\" with Bible, Vedas, or any religious text and would come to the same conclusions. The real question isn't whether or not people use a text or book to justify anything, but whether or not the actual text or book justifies what the people actually say it does. A completely different issue. Can you without question prove that the Qur'an in fact commands Muslims to commit wanton violence? Can you without question prove that since inception all Muslims have understood and practiced Islam according to that command? The answer is no you cannot. This has been the number one stumbling block for the original Orientalist and now the neo-Orientalists as they rehash the same tired arguments to try and label and condemn an entire religion and people. The motives have just changed. What none of you have been willing to accept based upon your illogical conclusions and arrogant assumptions that your calculations never account for the biggest 800 pound gorilla in the room? If the Qur'an teaches what you say it does, then why \"since inception\" it hasn't been characteristic of Muslims across the board to exhibit these traits? Why do so many variables exist and in such numbers. You would have to come to the conclusion that either the overwhelming majority of Muslims don't actually understand or believe in the Qur'an or that the minority who commit these crimes and say it's in the Qur'an are actually just religious fanatics who don't understand or believe in the Qur'an. You can't have it both ways.... It's highly illogical and I have a theory that most Orientalists knew it like they do today, that the arguments are illogical and only state what they state to be part of a smear campaign and nothing more, that way arguments don't have to make sense. Just re-read the illogical statements below that I haven't responded to at this point....There illogical and your premise is all over the place. Just stick to the original assertion which is according to you, others like you, and the terrorists: The Qur'an without a doubt teaches violence and because of that Muslims are violent. I will continue to laugh in your face, other like you, and the terrorists, and call you ideologues who don't use logic, because if your assertions were true than why do those who actually believe that and act on it, don't even account for 5% of the total Muslim population? Since when has it ever been logical that 5% should be considered more characteristic of a trait than 95%? quote: Do muslim people show a desire to move beyond the current desire to use violence as a politcal tool in thier culture? Where did you get these talking points? Do you even know how retarded that one sounds? What is \"Muslim people\"? What is \"Muslim Culture\"? How can you assert a premise that one has to move beyond anything without first defining the very people and thing in which you state need to move beyond? How can you even inquire about the desire of a group which you have not defined? How can you state matter of fact that in \"their\" culture violence is used as a political tool without ever bothering to define anything about the culture, who belongs to it, and about the politics of said culture, since you brought it up? I mean you can make these assertions as you did without one grain of logic, fact, or evidence to back up your talking points or open ended statements, but that doesn't make them logical or remotely make sense, other than the obvious observation that they are just a barrage of totally unrelated statements that have no desire to prove anything but to continue to support and emotionally charged ideology and illicit a response in kind in a gotcha fashion. quote: Based on the actions of muslims in Egypt, Palestine, Iran, Turkey, SA, Syria, and a dozen other places, NO! No to what? Are you willing to be taken seriously or not? Did you honestly type this consciously thinking that it's perfectly logical to look at a billion people across the planet on every continent and judge them by the actions of people in specific locales? Not to mention you didn't even define the actions or how many in said countries participate in said actions. Not even to mention that the cultures of the countries you listed are in some cases different as night and day. For instance, Saudi Arabia's majority religious belief is Wahhabism, in which this particular ideology which isn't even 100 years old is mainly practiced there. It's also interesting to note that the majority of the 9/11 highjackers were from SA and were Wahhabis (not that I'm expressly blaming Wahhabism, I'm not as illogical as some). Iran on the other hand is majority Shia Muslim, which makes up roughly 10% of all Muslims worldwide, the majority live in Iran, Iraq, and Dearborn, MI (just joking). However, it's interesting to note that 300k Christians live in Tehran (a good chunk converts) The Iranian Parliament has both Christians and Jews on it, plus their right to be is in their constitution, polls show that the Majority of Iranians have a favorable view of the West with programs like Oprah being highly watched through satellite and a number one TV program being and Iranian produced drama about a Jewish family during the Holocaust, now isn't that ironic, add to the fact that Iranians are Persian and Saudi's Arab and a whole other discussion would emerge. But we all know those who subscribe to talking points like the zingers you shot out are either oblivious to these facts, or don't care and bank on your support coming from the ignorant masses who buy the stupid books or visit the anti-Muslim/Islam sites, it's a booming industry. I should write an anti-Islam book so I could make money and get speaking engagements on right wing radio, college campuses, etc. You guys love this stuff!!! I'm not even going to get into secular Turkey who still have issues with Muslim women wearing headscarves. Seeing how you named them in a list with Saudi Arabia who won't even let women drive, shows me that you didn't put much thought into your words. quote: Everyplace muslims rule they repress others, they rule through power and not law. The majority seek to control the actions, thoughts and beliefs of everyone else. Really? Using my last example Turkey a Muslim country BTW, it's the very secular law that they cite to ensure that practicing Muslims not be able to display that identity in government positions. But that's just one example. What about a Muslim country like Senegal? It's a Democratic country with 11 plus million people 95% practice Islam. Do you want to continue to type such fanciful statements that you can't back up? In order, for your statement to make a semblance of sense or be remotely true, you would have to be able to state that your mad rant \"Everyplace muslims rule..\" could actually be proven and not easily debunked with just two examples of countries where \"Muslims rule\" surely based on this alone that whole \"everyplace\" comment has to be called what it is...a lie....The fact is that the majority of the 48 Muslim countries (at least listed by wikipedia) are either democracies or republics. 24 of those countries even with more than 70% of the country being Muslim still have either \"secular\" or \"none\" listed as their state religion. Your entire bs about \"everyplace Muslims\" rule is fiction and is evidence that it's a talking point you heard or read somewhere, that you have not even researched for yourself. I will make it easy for you, go to wikipedia and search \"Muslim Countries\" and you will get the statistics most come from the CIA World Factbook..... quote: Stop trying to place Islam into the context of the Christian faith. I'm not, haven't, and won't. Why would I compare my faith with the one I left...... quote: The values, ideas, and concepts that allowed those of the Christian faith to develop beyond the violence in the bible need to be developed within the muslim faith. Which are?..... Furthermore, do you know the difference between \"faith\" \"religion\" and those who claim to have one or both? They are huge! For instance, What's the Christian faith and what's the Islamic faith? I will make it simple so as not to take too much of your time as you have mine. The majority of Christians (notice the wording because I know that some does not equal all) believe as a matter of faith that Jesus (as) is God, was crucified, died, and rose from the grave three days later for the sins of man so that if you believe in him you will have eternal life. The majority of a several billion Christians believe this in some same or form. All Muslims (notice the changing in words) believe that their is One God, al-illah (The God) of Abraham who sent Muhammad (saw) as a Messenger and Prophet to the Arabs and revealed the Qur'an. Muslims believe this as one of the 5 pillars of our faith. La illaha illallah muhammadan rasoollullah There is no god but The God and Muhammad is the Messenger of The God (literal translation). The following pillars are salah (prayer) zawm (fasting) zikat (charity) Hajj (pilgrimage) All Muslims accept this as their faith the most important being the belief in One God. That is the faiths more or less. The religions are how those who claim to hold the faith practice and interpret the faith in their daily lives using a myriad of methods which are too numerous to name... quote: But they cannot, because the muslim faith dominates every aspect of the muslim culture. You cant even think with the call to prayer coming at you from every direction 230 times a day... That's the best thing about being a Muslim, thanks for reminding me. I love having a faith that is so integrated within my life that I face every waking moment of my life trying to act according to my beliefs. I love making my life so God conscious that I institutionalize my prayers to Him 5 times a day or more and not relegating my devotion to my Creator to once a week if at all. I find it sad that you actually think that your making fun of Muslims or mocking us with that comment. If you think that not praying at least 5 times a day is too much I pray for your soul. That's the least we can do for the Lord of all the universe. It's like one of my favorite Gospel songs \"I will bless the Lord\" my favorite part \"and His praises shall continually be from my mouth\" How can one claim to believe in God yet, think it's OK to not \"burden\" one's self with such \"trivial\" things like prayer? You find us funny for thinking of God every waking moment, we think your funny for not. Last I checked, American Culture could use a healthy dose of God in our DAILY culture, unless of course you believe this society is the perfect example of Jesus' teachings, then of course I have nothing else to say to such blasphemous ideas. Thanks for giving me something to do today...", 
        "intTime": 20090514, 
        "postID": 60, 
        "quote": "Originally posted by threerings: You cant use another religion to defend the crimes of muslims. That just makes no sense. It makes no sense because the bad actions of one group do not justify the bad actions of another. Beyond that it makes no context in the current world situation.", 
        "reply": " Your entire argument falls apart from this quote alone because you demonstrate that you were not paying attention or read what I wrote. I never once used one religion to defend another, that's just idiotic. What I criticized was the bias that's obviously used from those who think like you when criticizing Muslims. My commentary was simply that your logic is poor when you can't apply it universally i.e. if one group of adherents of \"x\" religion are bad because of some verses in their texts or the actions of some of their members, then one group of adherents of \"y\" religion are equally bad because of some verses in their texts or the actions of some of their members. That would be perfectly acceptable. However, what you and others continually do is say that \"x\" is completely different than \"y\" and \"y\" should be held to a completely different standard than \"x\" even if \"y\" meets the same conditions/criteria of \"x\". In order to make that argument, one would have to expound on why the conditions of \"y\" merit greater or lesser variance in the opinion of who's bad or not. However, you guys when called to expound never do, but only give more illogical statements like those that follow your initial commentary, as I will point out.... quote: How many people today are using the bible to justify horriffic crimes? How many are using the Quran? Well, how do you define \"horrific crime\"? You would have to define that term in order to make sense, because you can measure anything until you define it. For instance, even if we agreed and we do that beheading is \"horrific\" than how many Muslims have actually done it out of 1.5 billion? What number would be high enough to condemn all Muslims or low enough to admit that it's not characteristic of all Muslims? Furthermore, considering that you brought up very specific books (Bible and Qur'an) you would have to identify where in either book it is written that one should do said horrific acts. In the case of the example of beheading, where does it state in the Qur'an that it's perfectly acceptable to murder innocent people through beheading such as reporters like Daniel Pearl, or POW's, or innocent men and women both Muslim and non-Muslim? Show me said verse where this command is given for Muslims to murder innocent people especially through beheading and I will never type another word on the internet. Show me where Muslims are expressly told it's their religious duty to do just that and I would have to admit that 1 billion Muslims don't actually follow the Qur'an. But back to the topic of \"horrific\" I believe that beheading as an example is horrific especially when it's done to innocents whether it's a reporter, captive, spouse, etc. But I also think there are many other horrific things in this world such as adultery, lying, stealing, idolatry, fornication, etc. Now considering that this is a majority Christian nation who I imagine read the Bible, or even just the members of this board, are you ready to condemn either the Bible or all Christians based on the actions, words, deeds, etc. of your fellow board members and/or countrymen? Surely, many justify their actions based on teachings in the Bible, many of these actions horrific. For instance, I think it very horrific that one would even believe that just because they believe a specific dogma they are forgiven for their transgressions. I believe that's the number one problem with that group of religious types and why conditions do not mirror in America what I would expect would be an accurate representation of what Jesus (as) taught for example. I think it's horrible that there would be ATM's, credit apps, etc. at \"megachurches\" and the Bible being used as justification for this elaborate money making scheme while their are people in the very cities of these churches who don't have food to eat. But like I said, my definition of horrible may be different than yours. Define that first, then maybe we could get somewhere. quote: But the question is relly even more simple than that.. If you can anwser this honestly: Are people using the Quran to justify violence? Without question, yes. Have people used the Quran to justify violence since its writing? Again, without question, yes. Yes, to all the above. But you have proved nothing. I stated before this post that this is exactly what you would do. Because you could replace the word \"Qur'an\" with Bible, Vedas, or any religious text and would come to the same conclusions. The real question isn't whether or not people use a text or book to justify anything, but whether or not the actual text or book justifies what the people actually say it does. A completely different issue. Can you without question prove that the Qur'an in fact commands Muslims to commit wanton violence? Can you without question prove that since inception all Muslims have understood and practiced Islam according to that command? The answer is no you cannot. This has been the number one stumbling block for the original Orientalist and now the neo-Orientalists as they rehash the same tired arguments to try and label and condemn an entire religion and people. The motives have just changed. What none of you have been willing to accept based upon your illogical conclusions and arrogant assumptions that your calculations never account for the biggest 800 pound gorilla in the room? If the Qur'an teaches what you say it does, then why \"since inception\" it hasn't been characteristic of Muslims across the board to exhibit these traits? Why do so many variables exist and in such numbers. You would have to come to the conclusion that either the overwhelming majority of Muslims don't actually understand or believe in the Qur'an or that the minority who commit these crimes and say it's in the Qur'an are actually just religious fanatics who don't understand or believe in the Qur'an. You can't have it both ways.... It's highly illogical and I have a theory that most Orientalists knew it like they do today, that the arguments are illogical and only state what they state to be part of a smear campaign and nothing more, that way arguments don't have to make sense. Just re-read the illogical statements below that I haven't responded to at this point....There illogical and your premise is all over the place. Just stick to the original assertion which is according to you, others like you, and the terrorists: The Qur'an without a doubt teaches violence and because of that Muslims are violent. I will continue to laugh in your face, other like you, and the terrorists, and call you ideologues who don't use logic, because if your assertions were true than why do those who actually believe that and act on it, don't even account for 5% of the total Muslim population? Since when has it ever been logical that 5% should be considered more characteristic of a trait than 95%? quote: Do muslim people show a desire to move beyond the current desire to use violence as a politcal tool in thier culture? Where did you get these talking points? Do you even know how retarded that one sounds? What is \"Muslim people\"? What is \"Muslim Culture\"? How can you assert a premise that one has to move beyond anything without first defining the very people and thing in which you state need to move beyond? How can you even inquire about the desire of a group which you have not defined? How can you state matter of fact that in \"their\" culture violence is used as a political tool without ever bothering to define anything about the culture, who belongs to it, and about the politics of said culture, since you brought it up? I mean you can make these assertions as you did without one grain of logic, fact, or evidence to back up your talking points or open ended statements, but that doesn't make them logical or remotely make sense, other than the obvious observation that they are just a barrage of totally unrelated statements that have no desire to prove anything but to continue to support and emotionally charged ideology and illicit a response in kind in a gotcha fashion. quote: Based on the actions of muslims in Egypt, Palestine, Iran, Turkey, SA, Syria, and a dozen other places, NO! No to what? Are you willing to be taken seriously or not? Did you honestly type this consciously thinking that it's perfectly logical to look at a billion people across the planet on every continent and judge them by the actions of people in specific locales? Not to mention you didn't even define the actions or how many in said countries participate in said actions. Not even to mention that the cultures of the countries you listed are in some cases different as night and day. For instance, Saudi Arabia's majority religious belief is Wahhabism, in which this particular ideology which isn't even 100 years old is mainly practiced there. It's also interesting to note that the majority of the 9/11 highjackers were from SA and were Wahhabis (not that I'm expressly blaming Wahhabism, I'm not as illogical as some). Iran on the other hand is majority Shia Muslim, which makes up roughly 10% of all Muslims worldwide, the majority live in Iran, Iraq, and Dearborn, MI (just joking). However, it's interesting to note that 300k Christians live in Tehran (a good chunk converts) The Iranian Parliament has both Christians and Jews on it, plus their right to be is in their constitution, polls show that the Majority of Iranians have a favorable view of the West with programs like Oprah being highly watched through satellite and a number one TV program being and Iranian produced drama about a Jewish family during the Holocaust, now isn't that ironic, add to the fact that Iranians are Persian and Saudi's Arab and a whole other discussion would emerge. But we all know those who subscribe to talking points like the zingers you shot out are either oblivious to these facts, or don't care and bank on your support coming from the ignorant masses who buy the stupid books or visit the anti-Muslim/Islam sites, it's a booming industry. I should write an anti-Islam book so I could make money and get speaking engagements on right wing radio, college campuses, etc. You guys love this stuff!!! I'm not even going to get into secular Turkey who still have issues with Muslim women wearing headscarves. Seeing how you named them in a list with Saudi Arabia who won't even let women drive, shows me that you didn't put much thought into your words. quote: Everyplace muslims rule they repress others, they rule through power and not law. The majority seek to control the actions, thoughts and beliefs of everyone else. Really? Using my last example Turkey a Muslim country BTW, it's the very secular law that they cite to ensure that practicing Muslims not be able to display that identity in government positions. But that's just one example. What about a Muslim country like Senegal? It's a Democratic country with 11 plus million people 95% practice Islam. Do you want to continue to type such fanciful statements that you can't back up? In order, for your statement to make a semblance of sense or be remotely true, you would have to be able to state that your mad rant \"Everyplace muslims rule..\" could actually be proven and not easily debunked with just two examples of countries where \"Muslims rule\" surely based on this alone that whole \"everyplace\" comment has to be called what it is...a lie....The fact is that the majority of the 48 Muslim countries (at least listed by wikipedia) are either democracies or republics. 24 of those countries even with more than 70% of the country being Muslim still have either \"secular\" or \"none\" listed as their state religion. Your entire bs about \"everyplace Muslims\" rule is fiction and is evidence that it's a talking point you heard or read somewhere, that you have not even researched for yourself. I will make it easy for you, go to wikipedia and search \"Muslim Countries\" and you will get the statistics most come from the CIA World Factbook..... quote: Stop trying to place Islam into the context of the Christian faith. I'm not, haven't, and won't. Why would I compare my faith with the one I left...... quote: The values, ideas, and concepts that allowed those of the Christian faith to develop beyond the violence in the bible need to be developed within the muslim faith. Which are?..... Furthermore, do you know the difference between \"faith\" \"religion\" and those who claim to have one or both? They are huge! For instance, What's the Christian faith and what's the Islamic faith? I will make it simple so as not to take too much of your time as you have mine. The majority of Christians (notice the wording because I know that some does not equal all) believe as a matter of faith that Jesus (as) is God, was crucified, died, and rose from the grave three days later for the sins of man so that if you believe in him you will have eternal life. The majority of a several billion Christians believe this in some same or form. All Muslims (notice the changing in words) believe that their is One God, al-illah (The God) of Abraham who sent Muhammad (saw) as a Messenger and Prophet to the Arabs and revealed the Qur'an. Muslims believe this as one of the 5 pillars of our faith. La illaha illallah muhammadan rasoollullah There is no god but The God and Muhammad is the Messenger of The God (literal translation). The following pillars are salah (prayer) zawm (fasting) zikat (charity) Hajj (pilgrimage) All Muslims accept this as their faith the most important being the belief in One God. That is the faiths more or less. The religions are how those who claim to hold the faith practice and interpret the faith in their daily lives using a myriad of methods which are too numerous to name... quote: But they cannot, because the muslim faith dominates every aspect of the muslim culture. You cant even think with the call to prayer coming at you from every direction 230 times a day... That's the best thing about being a Muslim, thanks for reminding me. I love having a faith that is so integrated within my life that I face every waking moment of my life trying to act according to my beliefs. I love making my life so God conscious that I institutionalize my prayers to Him 5 times a day or more and not relegating my devotion to my Creator to once a week if at all. I find it sad that you actually think that your making fun of Muslims or mocking us with that comment. If you think that not praying at least 5 times a day is too much I pray for your soul. That's the least we can do for the Lord of all the universe. It's like one of my favorite Gospel songs \"I will bless the Lord\" my favorite part \"and His praises shall continually be from my mouth\" How can one claim to believe in God yet, think it's OK to not \"burden\" one's self with such \"trivial\" things like prayer? You find us funny for thinking of God every waking moment, we think your funny for not. Last I checked, American Culture could use a healthy dose of God in our DAILY culture, unless of course you believe this society is the perfect example of Jesus' teachings, then of course I have nothing else to say to such blasphemous ideas. Thanks for giving me something to do today...", 
        "threadID": "409192893_2250001222001", 
        "time": "2009-05-14 09:01:00", 
        "title": "Radical Islam", 
        "userID": "Sgt_Salaam"
    }
]