[
    {
        "content": "Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "intTime": 20090404, 
        "postID": 1, 
        "quote": "", 
        "reply": "Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 20:13:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 2, 
        "quote": "Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "reply": " might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 20:40:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion Whooops Mea culpa. Thats what I get for forwarding to fast. Good catch M5", 
        "intTime": 20090404, 
        "postID": 3, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion", 
        "reply": " Whooops Mea culpa. Thats what I get for forwarding to fast. Good catch M5", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:14:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "intTime": 20090404, 
        "postID": 4, 
        "quote": "", 
        "reply": "why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:18:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion Pickey, pickey, pickey! Only off by a factor of 20. Close enough for government work!", 
        "intTime": 20090404, 
        "postID": 5, 
        "quote": "might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion", 
        "reply": " Pickey, pickey, pickey! Only off by a factor of 20. Close enough for government work!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:43:00", 
        "title": "Patriotic Retirement", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it.... outlaws... the inference is for the 40MM who actually work are to retire so as 40MM who do not work will have jobs..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 6, 
        "quote": "Originally posted by outlaws93: why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "reply": " outlaws... the inference is for the 40MM who actually work are to retire so as 40MM who do not work will have jobs..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:13:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "yea and then my mom would be forced out of work.... although the 1million would be very handy but it is not the right thing to do... it would further break our country... i could see it if we had a surplus... but we dont...", 
        "intTime": 20090404, 
        "postID": 7, 
        "quote": "", 
        "reply": "yea and then my mom would be forced out of work.... although the 1million would be very handy but it is not the right thing to do... it would further break our country... i could see it if we had a surplus... but we dont...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:23:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "if you want to open jobs up then deport all illegals who are here working illegally...", 
        "intTime": 20090404, 
        "postID": 8, 
        "quote": "", 
        "reply": "if you want to open jobs up then deport all illegals who are here working illegally...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:24:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 9, 
        "quote": "", 
        "reply": "How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:32:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 10, 
        "quote": "Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then?", 
        "reply": " careful there young man what you say... you might just become one, one day. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:35:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 11, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day.", 
        "reply": " I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:42:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "intTime": 20090404, 
        "postID": 12, 
        "quote": "Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally...", 
        "reply": " Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:43:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100% both federally and by the state i get money from both...", 
        "intTime": 20090404, 
        "postID": 13, 
        "quote": "Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me.", 
        "reply": " see i am rated 100% both federally and by the state i get money from both...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:47:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100% Not by the VA you're not. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 14, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100%", 
        "reply": " Not by the VA you're not. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:48:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "intTime": 20090404, 
        "postID": 15, 
        "quote": "", 
        "reply": "if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:49:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party. well they are against illegals half of their literature is about them...", 
        "intTime": 20090404, 
        "postID": 16, 
        "quote": "Originally posted by john2x: quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "reply": " well they are against illegals half of their literature is about them...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:51:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point??? If you don't get it then there is no way I can explain it to you. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 17, 
        "quote": "Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "reply": " If you don't get it then there is no way I can explain it to you. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:54:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "intTime": 20090404, 
        "postID": 18, 
        "quote": "Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me.", 
        "reply": " I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:56:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "intTime": 20090404, 
        "postID": 19, 
        "quote": "Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "reply": " i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 23:05:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Not a problem. As long a the government keeps printing money we'll be fine!", 
        "intTime": 20090405, 
        "postID": 20, 
        "quote": "", 
        "reply": "Not a problem. As long a the government keeps printing money we'll be fine!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 00:08:00", 
        "title": "Patriotic Retirement", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "If the United States would make it mandatory that every person in this country serve three years in the military once they turn 18 than you would not have to worry too much about all this disability nor shortage here, there, everywhere.", 
        "intTime": 20090405, 
        "postID": 21, 
        "quote": "", 
        "reply": "If the United States would make it mandatory that every person in this country serve three years in the military once they turn 18 than you would not have to worry too much about all this disability nor shortage here, there, everywhere.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 01:29:00", 
        "title": "Patriotic Retirement", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point??? His point is simple - his disability comes as a direct result of him serving on Active Duty - your's doesn't.", 
        "intTime": 20090405, 
        "postID": 22, 
        "quote": "Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "reply": " His point is simple - his disability comes as a direct result of him serving on Active Duty - your's doesn't.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 05:09:00", 
        "title": "Patriotic Retirement", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: Outlaw there is no TOS violation here, If your going to start something with one of your comments dont alert when your head gets handed to you. We have better things to do than saving you from your own mouth. why am i unable to e-mail you???", 
        "intTime": 20090405, 
        "postID": 23, 
        "quote": "Originally posted by NEMESIS1960: Outlaw there is no TOS violation here, If your going to start something with one of your comments dont alert when your head gets handed to you. We have better things to do than saving you from your own mouth.", 
        "reply": " why am i unable to e-mail you???", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:40:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system... Totally disabled means theres nothing productive your able to do how many fit that profile? Do You? I doubt it.nmost dont. In Fact it was just disclosed that every member of the LIRR that retired was on disability pension and SS. Further investigation uncovered that union leaders were advising them to apply and were charging them 1,000 each to ensure they got it. A few leaders were indicted and admitted the scam. Then the story dropped and I wrote a letter to the newspaper asking why they stopped following the ongoing investigation and got no reply. So my next letter will be to the AG. Its been going on for years.", 
        "intTime": 20090405, 
        "postID": 24, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "reply": " Totally disabled means theres nothing productive your able to do how many fit that profile? Do You? I doubt it.nmost dont. In Fact it was just disclosed that every member of the LIRR that retired was on disability pension and SS. Further investigation uncovered that union leaders were advising them to apply and were charging them 1,000 each to ensure they got it. A few leaders were indicted and admitted the scam. Then the story dropped and I wrote a letter to the newspaper asking why they stopped following the ongoing investigation and got no reply. So my next letter will be to the AG. Its been going on for years.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:49:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "intTime": 20090405, 
        "postID": 25, 
        "quote": "Totally disabled means theres nothing productive your able to do how many fit that profile?", 
        "reply": " yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:53:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable... Well lets be seious for a moment,you obviously can type with 40,000 posts, you are able to run around and play paintball,Your able to buy all these fancy weapons and go to the range. And your trying to say theres nothing you can do? Judging by your age you spent you early years on drugs and travel then became disabled before 25. So you obviously never held a job or contributed anything into the system. And now with all the activities your involved in expect us to believe theres nothing your able to do? Many disabled hold viable productive jobs and theat why theres even a law that prevents disciminating against the disabled. please dont tell me there is nothing productive you can do??", 
        "intTime": 20090405, 
        "postID": 26, 
        "quote": "Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "reply": " Well lets be seious for a moment,you obviously can type with 40,000 posts, you are able to run around and play paintball,Your able to buy all these fancy weapons and go to the range. And your trying to say theres nothing you can do? Judging by your age you spent you early years on drugs and travel then became disabled before 25. So you obviously never held a job or contributed anything into the system. And now with all the activities your involved in expect us to believe theres nothing your able to do? Many disabled hold viable productive jobs and theat why theres even a law that prevents disciminating against the disabled. please dont tell me there is nothing productive you can do??", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:10:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable... Thats what hes supposed to do when he gets in court thats his job, what do you think? Are you totally disabled? Do you feel theres nothing you can do? Or is it just a matter of dollars and cents. Not being able to earn what you can get for free without lifting a finger? BTW whats a neuro surgeon got to do with back injury? Unless its from the time the cops beat you on the head leaving permanent Dents as you once posted? Which is it a brain injury or a back injury?", 
        "intTime": 20090405, 
        "postID": 27, 
        "quote": "Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "reply": " Thats what hes supposed to do when he gets in court thats his job, what do you think? Are you totally disabled? Do you feel theres nothing you can do? Or is it just a matter of dollars and cents. Not being able to earn what you can get for free without lifting a finger? BTW whats a neuro surgeon got to do with back injury? Unless its from the time the cops beat you on the head leaving permanent Dents as you once posted? Which is it a brain injury or a back injury?", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:28:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "outlaws...... I have to agree with John.... if you are able to do the things you say you do then there is something out there you could be doing. So your doctor says you're 100%; in many cases that doesn't say much.. hell, I know several folks who are 100% because of PTSD.. and ya know what? They were coached on how to get the 100%.. and they are not any more disabled then I in that regard. How do I know? Because I was prompted to do the same.. I did the paperwork, didn't rate at all, and then the \"coach\" started advising me, oh, and he's one of the persons now getting monies for being 100% PTSD.. and he laughs how much he gets for his regular retirement plus the government payment. Just food for thought. I'm not saying you don't have something coming but please do not attempt to convince us how helpless you are. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090405, 
        "postID": 28, 
        "quote": "", 
        "reply": "outlaws...... I have to agree with John.... if you are able to do the things you say you do then there is something out there you could be doing. So your doctor says you're 100%; in many cases that doesn't say much.. hell, I know several folks who are 100% because of PTSD.. and ya know what? They were coached on how to get the 100%.. and they are not any more disabled then I in that regard. How do I know? Because I was prompted to do the same.. I did the paperwork, didn't rate at all, and then the \"coach\" started advising me, oh, and he's one of the persons now getting monies for being 100% PTSD.. and he laughs how much he gets for his regular retirement plus the government payment. Just food for thought. I'm not saying you don't have something coming but please do not attempt to convince us how helpless you are. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:30:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "nope nothing... think there is then hire me and find out...", 
        "intTime": 20090405, 
        "postID": 29, 
        "quote": "", 
        "reply": "nope nothing... think there is then hire me and find out...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:45:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "intTime": 20090404, 
        "postID": 30, 
        "quote": "", 
        "reply": "Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 20:13:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 31, 
        "quote": "Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "reply": " might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 20:40:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion Whooops Mea culpa. Thats what I get for forwarding to fast. Good catch M5", 
        "intTime": 20090404, 
        "postID": 32, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion", 
        "reply": " Whooops Mea culpa. Thats what I get for forwarding to fast. Good catch M5", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:14:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "intTime": 20090404, 
        "postID": 33, 
        "quote": "", 
        "reply": "why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:18:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion Pickey, pickey, pickey! Only off by a factor of 20. Close enough for government work!", 
        "intTime": 20090404, 
        "postID": 34, 
        "quote": "might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion", 
        "reply": " Pickey, pickey, pickey! Only off by a factor of 20. Close enough for government work!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:43:00", 
        "title": "Patriotic Retirement", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it.... outlaws... the inference is for the 40MM who actually work are to retire so as 40MM who do not work will have jobs..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 35, 
        "quote": "Originally posted by outlaws93: why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "reply": " outlaws... the inference is for the 40MM who actually work are to retire so as 40MM who do not work will have jobs..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:13:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "yea and then my mom would be forced out of work.... although the 1million would be very handy but it is not the right thing to do... it would further break our country... i could see it if we had a surplus... but we dont...", 
        "intTime": 20090404, 
        "postID": 36, 
        "quote": "", 
        "reply": "yea and then my mom would be forced out of work.... although the 1million would be very handy but it is not the right thing to do... it would further break our country... i could see it if we had a surplus... but we dont...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:23:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "if you want to open jobs up then deport all illegals who are here working illegally...", 
        "intTime": 20090404, 
        "postID": 37, 
        "quote": "", 
        "reply": "if you want to open jobs up then deport all illegals who are here working illegally...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:24:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 38, 
        "quote": "", 
        "reply": "How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:32:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 39, 
        "quote": "Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then?", 
        "reply": " careful there young man what you say... you might just become one, one day. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:35:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 40, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day.", 
        "reply": " I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:42:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "intTime": 20090404, 
        "postID": 41, 
        "quote": "Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally...", 
        "reply": " Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:43:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100% both federally and by the state i get money from both...", 
        "intTime": 20090404, 
        "postID": 42, 
        "quote": "Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me.", 
        "reply": " see i am rated 100% both federally and by the state i get money from both...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:47:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100% Not by the VA you're not. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 43, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100%", 
        "reply": " Not by the VA you're not. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:48:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "intTime": 20090404, 
        "postID": 44, 
        "quote": "", 
        "reply": "if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:49:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party. well they are against illegals half of their literature is about them...", 
        "intTime": 20090404, 
        "postID": 45, 
        "quote": "Originally posted by john2x: quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "reply": " well they are against illegals half of their literature is about them...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:51:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point??? If you don't get it then there is no way I can explain it to you. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 46, 
        "quote": "Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "reply": " If you don't get it then there is no way I can explain it to you. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:54:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "intTime": 20090404, 
        "postID": 47, 
        "quote": "Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me.", 
        "reply": " I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:56:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "intTime": 20090404, 
        "postID": 48, 
        "quote": "Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "reply": " i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 23:05:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Not a problem. As long a the government keeps printing money we'll be fine!", 
        "intTime": 20090405, 
        "postID": 49, 
        "quote": "", 
        "reply": "Not a problem. As long a the government keeps printing money we'll be fine!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 00:08:00", 
        "title": "Patriotic Retirement", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "If the United States would make it mandatory that every person in this country serve three years in the military once they turn 18 than you would not have to worry too much about all this disability nor shortage here, there, everywhere.", 
        "intTime": 20090405, 
        "postID": 50, 
        "quote": "", 
        "reply": "If the United States would make it mandatory that every person in this country serve three years in the military once they turn 18 than you would not have to worry too much about all this disability nor shortage here, there, everywhere.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 01:29:00", 
        "title": "Patriotic Retirement", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point??? His point is simple - his disability comes as a direct result of him serving on Active Duty - your's doesn't.", 
        "intTime": 20090405, 
        "postID": 51, 
        "quote": "Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "reply": " His point is simple - his disability comes as a direct result of him serving on Active Duty - your's doesn't.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 05:09:00", 
        "title": "Patriotic Retirement", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: Outlaw there is no TOS violation here, If your going to start something with one of your comments dont alert when your head gets handed to you. We have better things to do than saving you from your own mouth. why am i unable to e-mail you???", 
        "intTime": 20090405, 
        "postID": 52, 
        "quote": "Originally posted by NEMESIS1960: Outlaw there is no TOS violation here, If your going to start something with one of your comments dont alert when your head gets handed to you. We have better things to do than saving you from your own mouth.", 
        "reply": " why am i unable to e-mail you???", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:40:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system... Totally disabled means theres nothing productive your able to do how many fit that profile? Do You? I doubt it.nmost dont. In Fact it was just disclosed that every member of the LIRR that retired was on disability pension and SS. Further investigation uncovered that union leaders were advising them to apply and were charging them 1,000 each to ensure they got it. A few leaders were indicted and admitted the scam. Then the story dropped and I wrote a letter to the newspaper asking why they stopped following the ongoing investigation and got no reply. So my next letter will be to the AG. Its been going on for years.", 
        "intTime": 20090405, 
        "postID": 53, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "reply": " Totally disabled means theres nothing productive your able to do how many fit that profile? Do You? I doubt it.nmost dont. In Fact it was just disclosed that every member of the LIRR that retired was on disability pension and SS. Further investigation uncovered that union leaders were advising them to apply and were charging them 1,000 each to ensure they got it. A few leaders were indicted and admitted the scam. Then the story dropped and I wrote a letter to the newspaper asking why they stopped following the ongoing investigation and got no reply. So my next letter will be to the AG. Its been going on for years.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:49:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "intTime": 20090405, 
        "postID": 54, 
        "quote": "Totally disabled means theres nothing productive your able to do how many fit that profile?", 
        "reply": " yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:53:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable... Well lets be seious for a moment,you obviously can type with 40,000 posts, you are able to run around and play paintball,Your able to buy all these fancy weapons and go to the range. And your trying to say theres nothing you can do? Judging by your age you spent you early years on drugs and travel then became disabled before 25. So you obviously never held a job or contributed anything into the system. And now with all the activities your involved in expect us to believe theres nothing your able to do? Many disabled hold viable productive jobs and theat why theres even a law that prevents disciminating against the disabled. please dont tell me there is nothing productive you can do??", 
        "intTime": 20090405, 
        "postID": 55, 
        "quote": "Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "reply": " Well lets be seious for a moment,you obviously can type with 40,000 posts, you are able to run around and play paintball,Your able to buy all these fancy weapons and go to the range. And your trying to say theres nothing you can do? Judging by your age you spent you early years on drugs and travel then became disabled before 25. So you obviously never held a job or contributed anything into the system. And now with all the activities your involved in expect us to believe theres nothing your able to do? Many disabled hold viable productive jobs and theat why theres even a law that prevents disciminating against the disabled. please dont tell me there is nothing productive you can do??", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:10:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable... Thats what hes supposed to do when he gets in court thats his job, what do you think? Are you totally disabled? Do you feel theres nothing you can do? Or is it just a matter of dollars and cents. Not being able to earn what you can get for free without lifting a finger? BTW whats a neuro surgeon got to do with back injury? Unless its from the time the cops beat you on the head leaving permanent Dents as you once posted? Which is it a brain injury or a back injury?", 
        "intTime": 20090405, 
        "postID": 56, 
        "quote": "Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "reply": " Thats what hes supposed to do when he gets in court thats his job, what do you think? Are you totally disabled? Do you feel theres nothing you can do? Or is it just a matter of dollars and cents. Not being able to earn what you can get for free without lifting a finger? BTW whats a neuro surgeon got to do with back injury? Unless its from the time the cops beat you on the head leaving permanent Dents as you once posted? Which is it a brain injury or a back injury?", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:28:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "outlaws...... I have to agree with John.... if you are able to do the things you say you do then there is something out there you could be doing. So your doctor says you're 100%; in many cases that doesn't say much.. hell, I know several folks who are 100% because of PTSD.. and ya know what? They were coached on how to get the 100%.. and they are not any more disabled then I in that regard. How do I know? Because I was prompted to do the same.. I did the paperwork, didn't rate at all, and then the \"coach\" started advising me, oh, and he's one of the persons now getting monies for being 100% PTSD.. and he laughs how much he gets for his regular retirement plus the government payment. Just food for thought. I'm not saying you don't have something coming but please do not attempt to convince us how helpless you are. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090405, 
        "postID": 57, 
        "quote": "", 
        "reply": "outlaws...... I have to agree with John.... if you are able to do the things you say you do then there is something out there you could be doing. So your doctor says you're 100%; in many cases that doesn't say much.. hell, I know several folks who are 100% because of PTSD.. and ya know what? They were coached on how to get the 100%.. and they are not any more disabled then I in that regard. How do I know? Because I was prompted to do the same.. I did the paperwork, didn't rate at all, and then the \"coach\" started advising me, oh, and he's one of the persons now getting monies for being 100% PTSD.. and he laughs how much he gets for his regular retirement plus the government payment. Just food for thought. I'm not saying you don't have something coming but please do not attempt to convince us how helpless you are. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:30:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "nope nothing... think there is then hire me and find out...", 
        "intTime": 20090405, 
        "postID": 58, 
        "quote": "", 
        "reply": "nope nothing... think there is then hire me and find out...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:45:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "intTime": 20090404, 
        "postID": 59, 
        "quote": "", 
        "reply": "Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 20:13:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 60, 
        "quote": "Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!!", 
        "reply": " might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 20:40:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion Whooops Mea culpa. Thats what I get for forwarding to fast. Good catch M5", 
        "intTime": 20090404, 
        "postID": 61, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by john2x: Well This is a different way of looking at it as long as were throwing money around, whats another 40 Mil. Chump change? I love this plan! This was an article from the St. Petersburg Times Newspaper on Sunday. The Business Section asked readers for ideas on \"How Would You Fix the Economy?\" I thought this was the BEST idea. I think his guy nailed it! Dear Mr.President, Patriotic retirement: There are about 40 million people over 50 in the work force; pay them $1 million a piece severance with three stipulations: 1) They leave their jobs. Forty million job openings - Unemployment fixed. 2) They buy NEW American cars. Forty million cars ordered - Auto Industry fixed. 3) They either buy a house or pay off their mortgage- Housing Crisis fixed. Now that's a lot less money than two TRILLION frigging dollars @!!!!@!!!! SOUNDS LIKE A PLAN TO ME!!! might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion", 
        "reply": " Whooops Mea culpa. Thats what I get for forwarding to fast. Good catch M5", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:14:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "intTime": 20090404, 
        "postID": 62, 
        "quote": "", 
        "reply": "why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:18:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion Pickey, pickey, pickey! Only off by a factor of 20. Close enough for government work!", 
        "intTime": 20090404, 
        "postID": 63, 
        "quote": "might want to check the math there pal... 40,000,000 X 1,000,000 = 40,000,000,000,000 thats a tad more then 2 trillion", 
        "reply": " Pickey, pickey, pickey! Only off by a factor of 20. Close enough for government work!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 21:43:00", 
        "title": "Patriotic Retirement", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it.... outlaws... the inference is for the 40MM who actually work are to retire so as 40MM who do not work will have jobs..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 64, 
        "quote": "Originally posted by outlaws93: why should they get a million apeace?? did they put a million into ss?? then why give them that back??? sounds like a crappy plan to me... hey why not include the disable in your figures too.... still sounds like a socialist idea and i am not for it....", 
        "reply": " outlaws... the inference is for the 40MM who actually work are to retire so as 40MM who do not work will have jobs..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:13:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "yea and then my mom would be forced out of work.... although the 1million would be very handy but it is not the right thing to do... it would further break our country... i could see it if we had a surplus... but we dont...", 
        "intTime": 20090404, 
        "postID": 65, 
        "quote": "", 
        "reply": "yea and then my mom would be forced out of work.... although the 1million would be very handy but it is not the right thing to do... it would further break our country... i could see it if we had a surplus... but we dont...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:23:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "if you want to open jobs up then deport all illegals who are here working illegally...", 
        "intTime": 20090404, 
        "postID": 66, 
        "quote": "", 
        "reply": "if you want to open jobs up then deport all illegals who are here working illegally...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:24:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 67, 
        "quote": "", 
        "reply": "How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:32:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090404, 
        "postID": 68, 
        "quote": "Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then?", 
        "reply": " careful there young man what you say... you might just become one, one day. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:35:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 69, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day.", 
        "reply": " I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:42:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "intTime": 20090404, 
        "postID": 70, 
        "quote": "Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally...", 
        "reply": " Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:43:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100% both federally and by the state i get money from both...", 
        "intTime": 20090404, 
        "postID": 71, 
        "quote": "Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me.", 
        "reply": " see i am rated 100% both federally and by the state i get money from both...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:47:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100% Not by the VA you're not. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 72, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. see i am rated 100%", 
        "reply": " Not by the VA you're not. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:48:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "intTime": 20090404, 
        "postID": 73, 
        "quote": "", 
        "reply": "if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:49:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party. well they are against illegals half of their literature is about them...", 
        "intTime": 20090404, 
        "postID": 74, 
        "quote": "Originally posted by john2x: quote: Originally posted by outlaws93: if you want to open jobs up then deport all illegals who are here working illegally... Now you know that just isnt ever going to happen dont you? Why isnt this tea party about that issue? Because people just got tired and gave up. We yelled sent thousands of letters and faxes, made thousands of calls, had demonstrations, and politicians totally ignored us. Thats exactly whats going to happen with this tea party.", 
        "reply": " well they are against illegals half of their literature is about them...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:51:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point??? If you don't get it then there is no way I can explain it to you. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090404, 
        "postID": 75, 
        "quote": "Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "reply": " If you don't get it then there is no way I can explain it to you. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:54:00", 
        "title": "Patriotic Retirement", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "intTime": 20090404, 
        "postID": 76, 
        "quote": "Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me.", 
        "reply": " I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 22:56:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "intTime": 20090404, 
        "postID": 77, 
        "quote": "Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing", 
        "reply": " i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-04 23:05:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Not a problem. As long a the government keeps printing money we'll be fine!", 
        "intTime": 20090405, 
        "postID": 78, 
        "quote": "", 
        "reply": "Not a problem. As long a the government keeps printing money we'll be fine!", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 00:08:00", 
        "title": "Patriotic Retirement", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "If the United States would make it mandatory that every person in this country serve three years in the military once they turn 18 than you would not have to worry too much about all this disability nor shortage here, there, everywhere.", 
        "intTime": 20090405, 
        "postID": 79, 
        "quote": "", 
        "reply": "If the United States would make it mandatory that every person in this country serve three years in the military once they turn 18 than you would not have to worry too much about all this disability nor shortage here, there, everywhere.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 01:29:00", 
        "title": "Patriotic Retirement", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point??? His point is simple - his disability comes as a direct result of him serving on Active Duty - your's doesn't.", 
        "intTime": 20090405, 
        "postID": 80, 
        "quote": "Originally posted by outlaws93: if i was in the army i would be... if i went in to the va they would say i was 100% disable... i know the army recruiters here says i am.... so whats your point???", 
        "reply": " His point is simple - his disability comes as a direct result of him serving on Active Duty - your's doesn't.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 05:09:00", 
        "title": "Patriotic Retirement", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: Outlaw there is no TOS violation here, If your going to start something with one of your comments dont alert when your head gets handed to you. We have better things to do than saving you from your own mouth. why am i unable to e-mail you???", 
        "intTime": 20090405, 
        "postID": 81, 
        "quote": "Originally posted by NEMESIS1960: Outlaw there is no TOS violation here, If your going to start something with one of your comments dont alert when your head gets handed to you. We have better things to do than saving you from your own mouth.", 
        "reply": " why am i unable to e-mail you???", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:40:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system... Totally disabled means theres nothing productive your able to do how many fit that profile? Do You? I doubt it.nmost dont. In Fact it was just disclosed that every member of the LIRR that retired was on disability pension and SS. Further investigation uncovered that union leaders were advising them to apply and were charging them 1,000 each to ensure they got it. A few leaders were indicted and admitted the scam. Then the story dropped and I wrote a letter to the newspaper asking why they stopped following the ongoing investigation and got no reply. So my next letter will be to the AG. Its been going on for years.", 
        "intTime": 20090405, 
        "postID": 82, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by john2x: quote: Originally posted by jrnh5150: quote: Originally posted by m551sheridan: quote: Originally posted by jrnh5150: How about stop paying government funded disability? It's not my fault someone became disabled, so why should my tax dollars pay them to sit and do nothing? How much money would we save then? careful there young man what you say... you might just become one, one day. I already am. I am rated 60% disabled by the VA. The difference is in how people like me received our \"disabilities\" and those like........ Well, not like me. I tend to agree I believe in disability but I know its the most abused system we have. They give it out to easily and deprive the ligit ones of higer rates. Between the doctors and lawyers its become a lottery for some. I know people whos wives get disability and SS for chronic Fatigue syndrome complete with handicapped tags and free golf. It needs closer policing i dont agree they give it out too easily it is very difficult to get on it takes years and very selective.... especially when you are 25 and become 100% disable and still able to somewhat walk.... (not being confined to a wheelchair)... although i talked to one guy who was paralyzed from the waste down said it took him just as long and as many tries to get it as it did for me.... i also have a friend who has back problems but not as bad as i do that cant get disability... he has been trying for a decade now...well 9 years... now there are a lot of people who do abuse it and claim false disability but there are people like that who do that for all social programs... that happens but not everyone on them are scamming the system...", 
        "reply": " Totally disabled means theres nothing productive your able to do how many fit that profile? Do You? I doubt it.nmost dont. In Fact it was just disclosed that every member of the LIRR that retired was on disability pension and SS. Further investigation uncovered that union leaders were advising them to apply and were charging them 1,000 each to ensure they got it. A few leaders were indicted and admitted the scam. Then the story dropped and I wrote a letter to the newspaper asking why they stopped following the ongoing investigation and got no reply. So my next letter will be to the AG. Its been going on for years.", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:49:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "intTime": 20090405, 
        "postID": 83, 
        "quote": "Totally disabled means theres nothing productive your able to do how many fit that profile?", 
        "reply": " yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 09:53:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable... Well lets be seious for a moment,you obviously can type with 40,000 posts, you are able to run around and play paintball,Your able to buy all these fancy weapons and go to the range. And your trying to say theres nothing you can do? Judging by your age you spent you early years on drugs and travel then became disabled before 25. So you obviously never held a job or contributed anything into the system. And now with all the activities your involved in expect us to believe theres nothing your able to do? Many disabled hold viable productive jobs and theat why theres even a law that prevents disciminating against the disabled. please dont tell me there is nothing productive you can do??", 
        "intTime": 20090405, 
        "postID": 84, 
        "quote": "Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "reply": " Well lets be seious for a moment,you obviously can type with 40,000 posts, you are able to run around and play paintball,Your able to buy all these fancy weapons and go to the range. And your trying to say theres nothing you can do? Judging by your age you spent you early years on drugs and travel then became disabled before 25. So you obviously never held a job or contributed anything into the system. And now with all the activities your involved in expect us to believe theres nothing your able to do? Many disabled hold viable productive jobs and theat why theres even a law that prevents disciminating against the disabled. please dont tell me there is nothing productive you can do??", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:10:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable... Thats what hes supposed to do when he gets in court thats his job, what do you think? Are you totally disabled? Do you feel theres nothing you can do? Or is it just a matter of dollars and cents. Not being able to earn what you can get for free without lifting a finger? BTW whats a neuro surgeon got to do with back injury? Unless its from the time the cops beat you on the head leaving permanent Dents as you once posted? Which is it a brain injury or a back injury?", 
        "intTime": 20090405, 
        "postID": 85, 
        "quote": "Originally posted by outlaws93: quote: Totally disabled means theres nothing productive your able to do how many fit that profile? yup thats what i got...100% and the dr that diagnose me as that is a dr at Tulane dr appleblum the best neurosurgeon in the states....he was the dr taco bell sent me to and also the dr that referred me for disability... he stood up in a court of law and said i was 100% disable...", 
        "reply": " Thats what hes supposed to do when he gets in court thats his job, what do you think? Are you totally disabled? Do you feel theres nothing you can do? Or is it just a matter of dollars and cents. Not being able to earn what you can get for free without lifting a finger? BTW whats a neuro surgeon got to do with back injury? Unless its from the time the cops beat you on the head leaving permanent Dents as you once posted? Which is it a brain injury or a back injury?", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:28:00", 
        "title": "Patriotic Retirement", 
        "userID": "john2x"
    }, 
    {
        "content": "outlaws...... I have to agree with John.... if you are able to do the things you say you do then there is something out there you could be doing. So your doctor says you're 100%; in many cases that doesn't say much.. hell, I know several folks who are 100% because of PTSD.. and ya know what? They were coached on how to get the 100%.. and they are not any more disabled then I in that regard. How do I know? Because I was prompted to do the same.. I did the paperwork, didn't rate at all, and then the \"coach\" started advising me, oh, and he's one of the persons now getting monies for being 100% PTSD.. and he laughs how much he gets for his regular retirement plus the government payment. Just food for thought. I'm not saying you don't have something coming but please do not attempt to convince us how helpless you are. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090405, 
        "postID": 86, 
        "quote": "", 
        "reply": "outlaws...... I have to agree with John.... if you are able to do the things you say you do then there is something out there you could be doing. So your doctor says you're 100%; in many cases that doesn't say much.. hell, I know several folks who are 100% because of PTSD.. and ya know what? They were coached on how to get the 100%.. and they are not any more disabled then I in that regard. How do I know? Because I was prompted to do the same.. I did the paperwork, didn't rate at all, and then the \"coach\" started advising me, oh, and he's one of the persons now getting monies for being 100% PTSD.. and he laughs how much he gets for his regular retirement plus the government payment. Just food for thought. I'm not saying you don't have something coming but please do not attempt to convince us how helpless you are. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:30:00", 
        "title": "Patriotic Retirement", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "nope nothing... think there is then hire me and find out...", 
        "intTime": 20090405, 
        "postID": 87, 
        "quote": "", 
        "reply": "nope nothing... think there is then hire me and find out...", 
        "threadID": "409192893_6660068912001", 
        "time": "2009-04-05 10:45:00", 
        "title": "Patriotic Retirement", 
        "userID": "outlaws93"
    }
]