[
    {
        "content": "The U.S. Army dispatched soldiers to patrol the streets of Samson, Alabama, a small southern town where a rampaging gunman killed 10 people on Tuesday. This obvious violation of the Posse Comitatus Act prohibiting the federal uniformed services from exercising state and local law enforcement was completely ignored by the corporate media with the exception of Reuters and the London Telegraph featured stories U.S. Army Puts Soldiers on the Street in Alabama in Response to Shootings On September 30, 2008, the Army Times reported the 3rd Infantry Divisions 1st Brigade Combat Team, a component of Northern Command, would be on-call in response to natural or manmade emergencies and disasters, including terrorist attacks. The Army Times article reported the military would be used for crowd and traffic control and be issued nonlethal weapons designed to subdue unruly or dangerous individuals without killing them. According to the article, expectations are that another, as yet unnamed, active-duty brigade will take over and that the mission will be a permanent one.. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 1, 
        "quote": "", 
        "reply": "The U.S. Army dispatched soldiers to patrol the streets of Samson, Alabama, a small southern town where a rampaging gunman killed 10 people on Tuesday. This obvious violation of the Posse Comitatus Act prohibiting the federal uniformed services from exercising state and local law enforcement was completely ignored by the corporate media with the exception of Reuters and the London Telegraph featured stories U.S. Army Puts Soldiers on the Street in Alabama in Response to Shootings On September 30, 2008, the Army Times reported the 3rd Infantry Divisions 1st Brigade Combat Team, a component of Northern Command, would be on-call in response to natural or manmade emergencies and disasters, including terrorist attacks. The Army Times article reported the military would be used for crowd and traffic control and be issued nonlethal weapons designed to subdue unruly or dangerous individuals without killing them. According to the article, expectations are that another, as yet unnamed, active-duty brigade will take over and that the mission will be a permanent one.. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-19 19:17:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: The U.S. Army dispatched soldiers to patrol the streets of Samson, Alabama, a small southern town where a rampaging gunman killed 10 people on Tuesday. This obvious violation of the Posse Comitatus Act prohibiting the federal uniformed services from exercising state and local law enforcement was completely ignored by the corporate media with the exception of Reuters and the London Telegraph featured stories U.S. Army Puts Soldiers on the Street in Alabama in Response to Shootings On September 30, 2008, the Army Times reported the 3rd Infantry Division’s 1st Brigade Combat Team, a component of Northern Command, would be “on-call” in response to “natural or manmade emergencies and disasters, including terrorist attacks.” The Army Times article reported the military would be used for “crowd and traffic control” and be issued “nonlethal weapons designed to subdue unruly or dangerous individuals without killing them.” According to the article, “expectations are that another, as yet unnamed, active-duty brigade will take over and that the mission will be a permanent one.”. Do you have a link for that story?", 
        "intTime": 20090319, 
        "postID": 2, 
        "quote": "Originally posted by EngrOpsNCO: The U.S. Army dispatched soldiers to patrol the streets of Samson, Alabama, a small southern town where a rampaging gunman killed 10 people on Tuesday. This obvious violation of the Posse Comitatus Act prohibiting the federal uniformed services from exercising state and local law enforcement was completely ignored by the corporate media with the exception of Reuters and the London Telegraph featured stories U.S. Army Puts Soldiers on the Street in Alabama in Response to Shootings On September 30, 2008, the Army Times reported the 3rd Infantry Division’s 1st Brigade Combat Team, a component of Northern Command, would be “on-call” in response to “natural or manmade emergencies and disasters, including terrorist attacks.” The Army Times article reported the military would be used for “crowd and traffic control” and be issued “nonlethal weapons designed to subdue unruly or dangerous individuals without killing them.” According to the article, “expectations are that another, as yet unnamed, active-duty brigade will take over and that the mission will be a permanent one.”.", 
        "reply": " Do you have a link for that story?", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-19 19:34:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: The U.S. Army dispatched soldiers to patrol the streets of Samson, Alabama, a small southern town where a rampaging gunman killed 10 people on Tuesday. This obvious violation of the Posse Comitatus Act prohibiting the federal uniformed services from exercising state and local law enforcement was completely ignored by the corporate media with the exception of Reuters and the London Telegraph featured stories U.S. Army Puts Soldiers on the Street in Alabama in Response to Shootings On September 30, 2008, the Army Times reported the 3rd Infantry Division’s 1st Brigade Combat Team, a component of Northern Command, would be “on-call” in response to “natural or manmade emergencies and disasters, including terrorist attacks.” The Army Times article reported the military would be used for “crowd and traffic control” and be issued “nonlethal weapons designed to subdue unruly or dangerous individuals without killing them.” According to the article, “expectations are that another, as yet unnamed, active-duty brigade will take over and that the mission will be a permanent one.”. Do you have a link for that story? Yes, but you’re not going to like it Kit. I first read it on infowars. It has been confirmed in other places, google will bring up a few links. Most of the MSM is downplaying the whole thing. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 3, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: The U.S. Army dispatched soldiers to patrol the streets of Samson, Alabama, a small southern town where a rampaging gunman killed 10 people on Tuesday. This obvious violation of the Posse Comitatus Act prohibiting the federal uniformed services from exercising state and local law enforcement was completely ignored by the corporate media with the exception of Reuters and the London Telegraph featured stories U.S. Army Puts Soldiers on the Street in Alabama in Response to Shootings On September 30, 2008, the Army Times reported the 3rd Infantry Division’s 1st Brigade Combat Team, a component of Northern Command, would be “on-call” in response to “natural or manmade emergencies and disasters, including terrorist attacks.” The Army Times article reported the military would be used for “crowd and traffic control” and be issued “nonlethal weapons designed to subdue unruly or dangerous individuals without killing them.” According to the article, “expectations are that another, as yet unnamed, active-duty brigade will take over and that the mission will be a permanent one.”. Do you have a link for that story?", 
        "reply": " Yes, but you’re not going to like it Kit. I first read it on infowars. It has been confirmed in other places, google will bring up a few links. Most of the MSM is downplaying the whole thing. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-19 19:41:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: And they will be lead by General Disarray. Have mercy on their soles (and their souls). I wonder if Bush had of put federal troops in a small town for domestic reasons would you be so cavalier. Strike that, I'm not wondering at all. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 4, 
        "quote": "Originally posted by dmuhler: And they will be lead by General Disarray. Have mercy on their soles (and their souls).", 
        "reply": " I wonder if Bush had of put federal troops in a small town for domestic reasons would you be so cavalier. Strike that, I'm not wondering at all. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-19 19:43:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: Yes, but you’re not going to like it Kit. I first read it on infowars. It has been confirmed in other places, google will bring up a few links. Most of the MSM is downplaying the whole thing. Why would I care where you got it? In any case, the so-called MSM is sure on it now. The AP, USA Today and several major papers are covering the story of how it happened. It's not surprising that they didn't get onto it originally as it's apparently just a local story. From infowars own website, the Sheriff explained that his officers were covered up investigating a crime scene which stretched over 20 miles, with the likelihood that they'd be at it all night. His dispatcher reported that Ft. Rucker had called offering assistance in the form of lights, generators etc. if they needed it. He told the dispatcher to ask if they could send some MP's to relieve his officers from road blocks and the like, which they did by sending 25 soldiers. This hardly sounds like a conspiracy or the culmination of some grand plan. This sounds more like a small county Sheriff up to his ears in something the likes of which he'd never dealt with before and someone at Ft. Rucker just wanting to help. The Army is investigating how it happened and that investigation is getting pretty wide coverage.", 
        "intTime": 20090319, 
        "postID": 5, 
        "quote": "Originally posted by EngrOpsNCO: Yes, but you’re not going to like it Kit. I first read it on infowars. It has been confirmed in other places, google will bring up a few links. Most of the MSM is downplaying the whole thing.", 
        "reply": " Why would I care where you got it? In any case, the so-called MSM is sure on it now. The AP, USA Today and several major papers are covering the story of how it happened. It's not surprising that they didn't get onto it originally as it's apparently just a local story. From infowars own website, the Sheriff explained that his officers were covered up investigating a crime scene which stretched over 20 miles, with the likelihood that they'd be at it all night. His dispatcher reported that Ft. Rucker had called offering assistance in the form of lights, generators etc. if they needed it. He told the dispatcher to ask if they could send some MP's to relieve his officers from road blocks and the like, which they did by sending 25 soldiers. This hardly sounds like a conspiracy or the culmination of some grand plan. This sounds more like a small county Sheriff up to his ears in something the likes of which he'd never dealt with before and someone at Ft. Rucker just wanting to help. The Army is investigating how it happened and that investigation is getting pretty wide coverage.", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-19 19:58:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Their is a conspiracy thread you know. Need directions? Who said anything about conspiracy? \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 6, 
        "quote": "Originally posted by dmuhler: Their is a conspiracy thread you know. Need directions?", 
        "reply": " Who said anything about conspiracy? \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-19 20:07:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: Yes, but you’re not going to like it Kit. I first read it on infowars. It has been confirmed in other places, google will bring up a few links. Most of the MSM is downplaying the whole thing. Why would I care where you got it? In any case, the so-called MSM is sure on it now. The AP, USA Today and several major papers are covering the story of how it happened. It's not surprising that they didn't get onto it originally as it's apparently just a local story. From infowars own website, the Sheriff explained that his officers were covered up investigating a crime scene which stretched over 20 miles, with the likelihood that they'd be at it all night. His dispatcher reported that Ft. Rucker had called offering assistance in the form of lights, generators etc. if they needed it. He told the dispatcher to ask if they could send some MP's to relieve his officers from road blocks and the like, which they did by sending 25 soldiers. This hardly sounds like a conspiracy or the culmination of some grand plan. This sounds more like a small county Sheriff up to his ears in something the likes of which he'd never dealt with before and someone at Ft. Rucker just wanting to help. The Army is investigating how it happened and that investigation is getting pretty wide coverage. I never said conspiracy, but it is curious how this was reported in GB well before it was here. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090319, 
        "postID": 7, 
        "quote": "Originally posted by stillkit: quote: Originally posted by EngrOpsNCO: Yes, but you’re not going to like it Kit. I first read it on infowars. It has been confirmed in other places, google will bring up a few links. Most of the MSM is downplaying the whole thing. Why would I care where you got it? In any case, the so-called MSM is sure on it now. The AP, USA Today and several major papers are covering the story of how it happened. It's not surprising that they didn't get onto it originally as it's apparently just a local story. From infowars own website, the Sheriff explained that his officers were covered up investigating a crime scene which stretched over 20 miles, with the likelihood that they'd be at it all night. His dispatcher reported that Ft. Rucker had called offering assistance in the form of lights, generators etc. if they needed it. He told the dispatcher to ask if they could send some MP's to relieve his officers from road blocks and the like, which they did by sending 25 soldiers. This hardly sounds like a conspiracy or the culmination of some grand plan. This sounds more like a small county Sheriff up to his ears in something the likes of which he'd never dealt with before and someone at Ft. Rucker just wanting to help. The Army is investigating how it happened and that investigation is getting pretty wide coverage.", 
        "reply": " I never said conspiracy, but it is curious how this was reported in GB well before it was here. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-19 20:09:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "Funny how the 'conspiracy' theorists got it wrong. Fort Rucker doesn't host the 3ID. They're at Fort Benning - three hours away at least. Rucker only has its MP company. Sullivan013", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "", 
        "reply": "Funny how the 'conspiracy' theorists got it wrong. Fort Rucker doesn't host the 3ID. They're at Fort Benning - three hours away at least. Rucker only has its MP company. Sullivan013", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-20 01:43:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: I never said conspiracy, but it is curious how this was reported in GB well before it was here. Well now ... maybe, just maybe, that's because in this neck of the woods, it was perceived as a \"good news\" story and we all know our media doesn't like to report anything positive. The folks down here are grateful for the MPs responding (under control of the Provost Marshal no less) to the little 5-man Sampson LE call for help from adjacent communities. You think maybe the PM went to ensure that the MPs stayed within the constraints of Posse Comitatus? The MPs helped with traffic control and (maybe) with securing the crime scenes from contamination ... BFD. Unlike some places where the military and civilian communities are at loggerheads, around here the military and community actually cooperate pretty well. When a tornado hit Enterprise, AL two years ago, didn't see any stupid retards complaining about the Flatiron medevac flights that Ft Rucker flew ... or the soldiers that helped clear the rubble of the two schools flattened by the tornado that killed eight students ... or the other Flatiron medevacs routinely flown by Rucker for victims of car accidents and other incidents. There's always some irrational twit that will take a \"good deed\" and try and paint it as evil. Perhaps that's why there are so few good deeds these days. This message has been edited. Last edited by: I_M_Qwerty, Fri 20 March 2009 06:14 AM", 
        "intTime": 20090320, 
        "postID": 9, 
        "quote": "I never said conspiracy, but it is curious how this was reported in GB well before it was here.", 
        "reply": " Well now ... maybe, just maybe, that's because in this neck of the woods, it was perceived as a \"good news\" story and we all know our media doesn't like to report anything positive. The folks down here are grateful for the MPs responding (under control of the Provost Marshal no less) to the little 5-man Sampson LE call for help from adjacent communities. You think maybe the PM went to ensure that the MPs stayed within the constraints of Posse Comitatus? The MPs helped with traffic control and (maybe) with securing the crime scenes from contamination ... BFD. Unlike some places where the military and civilian communities are at loggerheads, around here the military and community actually cooperate pretty well. When a tornado hit Enterprise, AL two years ago, didn't see any stupid retards complaining about the Flatiron medevac flights that Ft Rucker flew ... or the soldiers that helped clear the rubble of the two schools flattened by the tornado that killed eight students ... or the other Flatiron medevacs routinely flown by Rucker for victims of car accidents and other incidents. There's always some irrational twit that will take a \"good deed\" and try and paint it as evil. Perhaps that's why there are so few good deeds these days. This message has been edited. Last edited by: I_M_Qwerty, Fri 20 March 2009 06:14 AM", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-20 05:50:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: I never said conspiracy, but it is curious how this was reported in GB well before it was here. Well now ... maybe, just maybe, that's because in this neck of the woods, it was perceived as a \"good news\" story and we all now are media doesn't like to report anything positive. The folks down here are grateful for the MPs responding (under control of the Provost Marshal no less) to the little 5-man Sampson LE call for help from adjacent communities. You think maybe the PM went to ensure that the MPs stayed within the constraints of Posse Comitatus? The MPs helped with traffic control and (maybe) with securing the crime scenes from contamination ... BFD. Unlike some places where the military and civilian communities are at loggerheads, around here the military and community actually cooperate pretty well. When a tornado hit Enterprise, AL two years ago, didn't see any stupid retards complaining about the Flatiron medevac flights that Ft Rucker flew ... or the soldiers that helped clear the rubble of the two schools flattened by the tornado that killed eight students ... or the other Flatiron medevacs flown by Rucker for victims of car accidents and other incidents. There's always some irrational twit that will take a \"good deed\" and try and paint it as evil. Perhaps that's why there are so few good deeds these days. And you can bet that the end result of the Army's investigation will be to put an end to such co-operation and fellowship for fear of generating bad publicity. And, some officer's career will go down the tubes. In this case, the conspiracist's rantings will only serve to harm the local citizens.", 
        "intTime": 20090320, 
        "postID": 10, 
        "quote": "Originally posted by I_M_Qwerty: quote: I never said conspiracy, but it is curious how this was reported in GB well before it was here. Well now ... maybe, just maybe, that's because in this neck of the woods, it was perceived as a \"good news\" story and we all now are media doesn't like to report anything positive. The folks down here are grateful for the MPs responding (under control of the Provost Marshal no less) to the little 5-man Sampson LE call for help from adjacent communities. You think maybe the PM went to ensure that the MPs stayed within the constraints of Posse Comitatus? The MPs helped with traffic control and (maybe) with securing the crime scenes from contamination ... BFD. Unlike some places where the military and civilian communities are at loggerheads, around here the military and community actually cooperate pretty well. When a tornado hit Enterprise, AL two years ago, didn't see any stupid retards complaining about the Flatiron medevac flights that Ft Rucker flew ... or the soldiers that helped clear the rubble of the two schools flattened by the tornado that killed eight students ... or the other Flatiron medevacs flown by Rucker for victims of car accidents and other incidents. There's always some irrational twit that will take a \"good deed\" and try and paint it as evil. Perhaps that's why there are so few good deeds these days.", 
        "reply": " And you can bet that the end result of the Army's investigation will be to put an end to such co-operation and fellowship for fear of generating bad publicity. And, some officer's career will go down the tubes. In this case, the conspiracist's rantings will only serve to harm the local citizens.", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-20 05:59:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: I never said conspiracy, but it is curious how this was reported in GB well before it was here. Well now ... maybe, just maybe, that's because in this neck of the woods, it was perceived as a \"good news\" story and we all know our media doesn't like to report anything positive. The folks down here are grateful for the MPs responding (under control of the Provost Marshal no less) to the little 5-man Sampson LE call for help from adjacent communities. You think maybe the PM went to ensure that the MPs stayed within the constraints of Posse Comitatus? The MPs helped with traffic control and (maybe) with securing the crime scenes from contamination ... BFD. Unlike some places where the military and civilian communities are at loggerheads, around here the military and community actually cooperate pretty well. When a tornado hit Enterprise, AL two years ago, didn't see any stupid retards complaining about the Flatiron medevac flights that Ft Rucker flew ... or the soldiers that helped clear the rubble of the two schools flattened by the tornado that killed eight students ... or the other Flatiron medevacs routinely flown by Rucker for victims of car accidents and other incidents. There's always some irrational twit that will take a \"good deed\" and try and paint it as evil. Perhaps that's why there are so few good deeds these days. Since a good number of kids in that flattened High School were sons and daughters of Ft Rucker personnel... there was no way the Post could have stopped the soldiers assisting. They would have had a mutiny on their hands. Is Ft Rucker part of the Mutual Aid response teams for the surrounding counties? If so… there will be no problems after the investigation. I know from my stay in the 80s… there is mutual aid for fire suppression assets as well as MPs for site control. The Post also can supply soldiers for firefighting purposes as well.", 
        "intTime": 20090320, 
        "postID": 11, 
        "quote": "Originally posted by I_M_Qwerty: quote: I never said conspiracy, but it is curious how this was reported in GB well before it was here. Well now ... maybe, just maybe, that's because in this neck of the woods, it was perceived as a \"good news\" story and we all know our media doesn't like to report anything positive. The folks down here are grateful for the MPs responding (under control of the Provost Marshal no less) to the little 5-man Sampson LE call for help from adjacent communities. You think maybe the PM went to ensure that the MPs stayed within the constraints of Posse Comitatus? The MPs helped with traffic control and (maybe) with securing the crime scenes from contamination ... BFD. Unlike some places where the military and civilian communities are at loggerheads, around here the military and community actually cooperate pretty well. When a tornado hit Enterprise, AL two years ago, didn't see any stupid retards complaining about the Flatiron medevac flights that Ft Rucker flew ... or the soldiers that helped clear the rubble of the two schools flattened by the tornado that killed eight students ... or the other Flatiron medevacs routinely flown by Rucker for victims of car accidents and other incidents. There's always some irrational twit that will take a \"good deed\" and try and paint it as evil. Perhaps that's why there are so few good deeds these days.", 
        "reply": " Since a good number of kids in that flattened High School were sons and daughters of Ft Rucker personnel... there was no way the Post could have stopped the soldiers assisting. They would have had a mutiny on their hands. Is Ft Rucker part of the Mutual Aid response teams for the surrounding counties? If so… there will be no problems after the investigation. I know from my stay in the 80s… there is mutual aid for fire suppression assets as well as MPs for site control. The Post also can supply soldiers for firefighting purposes as well.", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-20 09:11:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: Funny how the 'conspiracy' theorists got it wrong. Fort Rucker doesn't host the 3ID. They're at Fort Benning - three hours away at least. Rucker only has its MP company. Sullivan013 C Co, 509th Inf (Pathfinder) was there in the 1970s and 80s", 
        "intTime": 20090320, 
        "postID": 12, 
        "quote": "Originally posted by sullivan013: Funny how the 'conspiracy' theorists got it wrong. Fort Rucker doesn't host the 3ID. They're at Fort Benning - three hours away at least. Rucker only has its MP company. Sullivan013", 
        "reply": " C Co, 509th Inf (Pathfinder) was there in the 1970s and 80s", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-20 09:13:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: I wonder if Bush had of put federal troops in a small town for domestic reasons would you be so cavalier. Strike that, I'm not wondering at all. Bush, actually did have the laws changed in order to make it easier for him to do so in the wake of Hurricane Katrina. But Congress changed the law back in 2008. They Felt the President Should not have that kind of power", 
        "intTime": 20090321, 
        "postID": 13, 
        "quote": "Originally posted by EngrOpsNCO: I wonder if Bush had of put federal troops in a small town for domestic reasons would you be so cavalier. Strike that, I'm not wondering at all.", 
        "reply": " Bush, actually did have the laws changed in order to make it easier for him to do so in the wake of Hurricane Katrina. But Congress changed the law back in 2008. They Felt the President Should not have that kind of power", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-21 10:58:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "Just a matter of time before that becomes the norm.....", 
        "intTime": 20090324, 
        "postID": 14, 
        "quote": "", 
        "reply": "Just a matter of time before that becomes the norm.....", 
        "threadID": "409192893_7480063812001", 
        "time": "2009-03-24 19:02:00", 
        "title": "violation of the Posse Comitatus Act", 
        "userID": "crackerjacks61"
    }
]