[
    {
        "content": "WHY is there NO NEWS about anyone being prosecuted, or at LEAST persecuted, for their roles in this economic debacle? CEO's collecting what they do in pay and compensation (AND BONUS's), and having the audacity to ask for 'bailouts'? They HAD to know business was failing and failed to do anything responsible, or reasonable, to short-circuit their demise - isn't THAT what they got/get paid the big bucks for? Banks that utilize the bailouts to buy other smaller lending institutions, invest in CHINA (of all things), and help out other countries's 'divisions' with US TAXPAYER funds? If I was to make a mistake in overextending MY finances, not paying for what I received, screwing people out of money, I'd go to jail - DO NOT PASS GO, DO NOT COLLECT $200.00!!!!!. How do THEY manage to get off scot free, and get a bonus to boot?? How do you make a 'mistake' of not paying your taxes, and for SEVERAL YEARS, and not only get off, but get a Government Administrational Job, to boot?? Am I just not seeing the BIG Picture??", 
        "intTime": 20090317, 
        "postID": 1, 
        "quote": "", 
        "reply": "WHY is there NO NEWS about anyone being prosecuted, or at LEAST persecuted, for their roles in this economic debacle? CEO's collecting what they do in pay and compensation (AND BONUS's), and having the audacity to ask for 'bailouts'? They HAD to know business was failing and failed to do anything responsible, or reasonable, to short-circuit their demise - isn't THAT what they got/get paid the big bucks for? Banks that utilize the bailouts to buy other smaller lending institutions, invest in CHINA (of all things), and help out other countries's 'divisions' with US TAXPAYER funds? If I was to make a mistake in overextending MY finances, not paying for what I received, screwing people out of money, I'd go to jail - DO NOT PASS GO, DO NOT COLLECT $200.00!!!!!. How do THEY manage to get off scot free, and get a bonus to boot?? How do you make a 'mistake' of not paying your taxes, and for SEVERAL YEARS, and not only get off, but get a Government Administrational Job, to boot?? Am I just not seeing the BIG Picture??", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-17 21:48:00", 
        "title": "WHY?", 
        "userID": "Smitty"
    }, 
    {
        "content": "Ben Bernanke said that we should put the fire out first before changing the fire code, and prosecuting those responsible for the inferno. I think its OUTRAGEOUS any Board of any bank or firm that has required government intervention is still on the job... What the hell kind of sense does that make? General Motors for example, the CEO demands government help to fix crippling problems that festered under his watch but refuses to step down?? If the Politicians feel the pressure, they will shift it onto wall street....so keeping calling, writing, *****ing, moaning, ****ing...whatever it takes, keep the pressure on D.C. and they will do what it takes to \"relieve\" it.", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "Ben Bernanke said that we should put the fire out first before changing the fire code, and prosecuting those responsible for the inferno. I think its OUTRAGEOUS any Board of any bank or firm that has required government intervention is still on the job... What the hell kind of sense does that make? General Motors for example, the CEO demands government help to fix crippling problems that festered under his watch but refuses to step down?? If the Politicians feel the pressure, they will shift it onto wall street....so keeping calling, writing, *****ing, moaning, ****ing...whatever it takes, keep the pressure on D.C. and they will do what it takes to \"relieve\" it.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-17 21:57:00", 
        "title": "WHY?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "You're not supposed to care about that, Smitty, you're supposed to hate the rich and implicitly trust the Fed Gubmint to run every aspect of your entire life. What's wrong with you?! Don't you believe every word that The One, (hallowed be \"H\"is name), says, like a good little comrade? I believe you need some \"reeducation\"... don't resist when the nice men in the black van come to pick you up.", 
        "intTime": 20090317, 
        "postID": 3, 
        "quote": "", 
        "reply": "You're not supposed to care about that, Smitty, you're supposed to hate the rich and implicitly trust the Fed Gubmint to run every aspect of your entire life. What's wrong with you?! Don't you believe every word that The One, (hallowed be \"H\"is name), says, like a good little comrade? I believe you need some \"reeducation\"... don't resist when the nice men in the black van come to pick you up.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-17 22:02:00", 
        "title": "WHY?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Ben Bernanke said that we should put the fire out first before changing the fire code, and prosecuting those responsible for the inferno. I think its OUTRAGEOUS any Board of any bank or firm that has required government intervention is still on the job... What the hell kind of sense does that make? General Motors for example, the CEO demands government help to fix crippling problems that festered under his watch but refuses to step down?? If the Politicians feel the pressure, they will shift it onto wall street....so keeping calling, writing, *****ing, moaning, ****ing...whatever it takes, keep the pressure on D.C. and they will do what it takes to \"relieve\" it. I'll support your call for corporate CEOs to resign just as soon as Barney Facking Frank, Chris Dodd, and the rest of the scurrilous scumbag politicians who are largely responsible for the subprime mortgage meltdown resign. Strike that.. resignation is not really good enough, they should be prosecuted, as what they've done is truly criminal.", 
        "intTime": 20090317, 
        "postID": 4, 
        "quote": "Originally posted by Irwin_R_Schyster: Ben Bernanke said that we should put the fire out first before changing the fire code, and prosecuting those responsible for the inferno. I think its OUTRAGEOUS any Board of any bank or firm that has required government intervention is still on the job... What the hell kind of sense does that make? General Motors for example, the CEO demands government help to fix crippling problems that festered under his watch but refuses to step down?? If the Politicians feel the pressure, they will shift it onto wall street....so keeping calling, writing, *****ing, moaning, ****ing...whatever it takes, keep the pressure on D.C. and they will do what it takes to \"relieve\" it.", 
        "reply": " I'll support your call for corporate CEOs to resign just as soon as Barney Facking Frank, Chris Dodd, and the rest of the scurrilous scumbag politicians who are largely responsible for the subprime mortgage meltdown resign. Strike that.. resignation is not really good enough, they should be prosecuted, as what they've done is truly criminal.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-17 22:04:00", 
        "title": "WHY?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: You're not supposed to care about that, Smitty, you're supposed to hate the rich and implicitly trust the Fed Gubmint to run every aspect of your entire life. What's wrong with you?! Don't you believe every word that The One, (hallowed be \"H\"is name), says, like a good little comrade? I believe you need some \"reeducation\"... don't resist when the nice men in the black van come to pick you up. Oh my God, What was wrong with my thinking? Halleleuhah! Amen! for, as one poster very nicely put it in his tag line, Our Big A$$ Mistake, America! And I can add: Bullchit Amid Rhetoric And Corruption, Komrads...", 
        "intTime": 20090317, 
        "postID": 5, 
        "quote": "Originally posted by shades_of_grey: You're not supposed to care about that, Smitty, you're supposed to hate the rich and implicitly trust the Fed Gubmint to run every aspect of your entire life. What's wrong with you?! Don't you believe every word that The One, (hallowed be \"H\"is name), says, like a good little comrade? I believe you need some \"reeducation\"... don't resist when the nice men in the black van come to pick you up.", 
        "reply": " Oh my God, What was wrong with my thinking? Halleleuhah! Amen! for, as one poster very nicely put it in his tag line, Our Big A$$ Mistake, America! And I can add: Bullchit Amid Rhetoric And Corruption, Komrads...", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-17 22:19:00", 
        "title": "WHY?", 
        "userID": "Smitty"
    }, 
    {
        "content": "Persecute, prosecute the AIG bonus babes. Not going to happen. They have Rush Limbaugh on their side. CALLER: Mr. Limbaugh, thank you for taking my call. RUSH: Thank you. CALLER: You're a real role model to me. I've been listening to you for 19 years, and you've really impacted my life greatly. But that's not why I called. And I know you hate to hear those kind of comments so I'll just make my point. I get so aggravated when I'm listening to these congressmen raise a fit about these bonuses, when they had complete control over whether or not they would be given out when they wrote the bill, and when you listen to the administration talk about how the earmarks in this Porkulus bill were such a small percentage of the total spending. But yet you look at the percentage of these million dollars in bonuses, you would think that it's half the money that they were given. RUSH: That's an excellent point and I want to expand on this point because these bonuses are less than one-tenth of 1% of the actual bailout money AIG got. You could look at these bonuses as the equivalent of earmarks. Essentially they're earmarks, and of course Congress defends their earmarks on the same basis, \"It's such a small percentage of the whole budget, the omnibus, such a small percentage, it doesn't really matter, we gotta pay respects to our constituents,\" blah, blah, blah. These people, what's good for them is not good for you, not going to have the kind of freedom and leeway they have. Now, what is a retention bonus? The best way to explain a retention bonus is to say that a retention bonus is offered to an employee who is being laid off down the road in order to keep the employee, in order to retain the employee. When a company announces layoffs for whatever reason, they still need cooperation from the employees who are going to eventually lose their jobs. There is often a transition period to change the business practice, and AIG is like any other of these companies being bailed out. They're going to have to downsize, and they knew they were going to have to downsize. All these people getting bonuses are going to be laid off. All these people getting bonuses are being fired down the road, and everybody's known it for a year. Everybody knew the payout date of the bonuses and yet there's Barney Frank acting like he didn't know a thing about the details until he got a letter from Andrew Cuomo this morning. These people are lying through their teeth to you. Members of Congress, the media, the president, they're lying. They're lying through their teeth. They knew of the payout schedule. They knew about the retention bonuses. They knew how much and they knew the payout date, and they sit around, they act like innocent bystanders, surprised and shocked, just this past weekend, as though they are learning about this for the first time. During this transition period, the company needs these employees to assist. They just... You can't do work without employees. For example, if the employee were told that they had six months left in the job, their immediate focus would be finding a new job. To hell with their current work, they're getting laid off. What the hell does it matter? The only thing that will keep them there, the only thing that will keep them working until their termination date is a retention bonus. Some employees forgo the retention bonus, because they get a hiring bonus from their new employer. So when you hear that these people who are getting the bonus ought to be fired? They have been! They've been told they're being sent packing. These retention bonuses are to keep them there to keep the company running, which is, I thought, the purpose of the bailout: to keep the company running. I never listen to Rush so when I heard he was saying that these guys should get to keep their 'retention bonus' I just had to go check the transcripts. Sure enough, it seems Rush doesn't really have a problem with them getting what they, according to him, are due. But then Rush may be good Buds with these million dollar babes and feels obligated to stick up for them. I mean he sure doesn't rub elbows with the average working guy.", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "", 
        "reply": "Persecute, prosecute the AIG bonus babes. Not going to happen. They have Rush Limbaugh on their side. CALLER: Mr. Limbaugh, thank you for taking my call. RUSH: Thank you. CALLER: You're a real role model to me. I've been listening to you for 19 years, and you've really impacted my life greatly. But that's not why I called. And I know you hate to hear those kind of comments so I'll just make my point. I get so aggravated when I'm listening to these congressmen raise a fit about these bonuses, when they had complete control over whether or not they would be given out when they wrote the bill, and when you listen to the administration talk about how the earmarks in this Porkulus bill were such a small percentage of the total spending. But yet you look at the percentage of these million dollars in bonuses, you would think that it's half the money that they were given. RUSH: That's an excellent point and I want to expand on this point because these bonuses are less than one-tenth of 1% of the actual bailout money AIG got. You could look at these bonuses as the equivalent of earmarks. Essentially they're earmarks, and of course Congress defends their earmarks on the same basis, \"It's such a small percentage of the whole budget, the omnibus, such a small percentage, it doesn't really matter, we gotta pay respects to our constituents,\" blah, blah, blah. These people, what's good for them is not good for you, not going to have the kind of freedom and leeway they have. Now, what is a retention bonus? The best way to explain a retention bonus is to say that a retention bonus is offered to an employee who is being laid off down the road in order to keep the employee, in order to retain the employee. When a company announces layoffs for whatever reason, they still need cooperation from the employees who are going to eventually lose their jobs. There is often a transition period to change the business practice, and AIG is like any other of these companies being bailed out. They're going to have to downsize, and they knew they were going to have to downsize. All these people getting bonuses are going to be laid off. All these people getting bonuses are being fired down the road, and everybody's known it for a year. Everybody knew the payout date of the bonuses and yet there's Barney Frank acting like he didn't know a thing about the details until he got a letter from Andrew Cuomo this morning. These people are lying through their teeth to you. Members of Congress, the media, the president, they're lying. They're lying through their teeth. They knew of the payout schedule. They knew about the retention bonuses. They knew how much and they knew the payout date, and they sit around, they act like innocent bystanders, surprised and shocked, just this past weekend, as though they are learning about this for the first time. During this transition period, the company needs these employees to assist. They just... You can't do work without employees. For example, if the employee were told that they had six months left in the job, their immediate focus would be finding a new job. To hell with their current work, they're getting laid off. What the hell does it matter? The only thing that will keep them there, the only thing that will keep them working until their termination date is a retention bonus. Some employees forgo the retention bonus, because they get a hiring bonus from their new employer. So when you hear that these people who are getting the bonus ought to be fired? They have been! They've been told they're being sent packing. These retention bonuses are to keep them there to keep the company running, which is, I thought, the purpose of the bailout: to keep the company running. I never listen to Rush so when I heard he was saying that these guys should get to keep their 'retention bonus' I just had to go check the transcripts. Sure enough, it seems Rush doesn't really have a problem with them getting what they, according to him, are due. But then Rush may be good Buds with these million dollar babes and feels obligated to stick up for them. I mean he sure doesn't rub elbows with the average working guy.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-18 02:06:00", 
        "title": "WHY?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: You're not supposed to care about that, Smitty, you're supposed to hate the rich and implicitly trust the Fed Gubmint to run every aspect of your entire life. Really? I thought we were supposed to hate the poor, fellate the rich, and blame the government(well congress...from 2007 on that is)?", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "You're not supposed to care about that, Smitty, you're supposed to hate the rich and implicitly trust the Fed Gubmint to run every aspect of your entire life.", 
        "reply": " Really? I thought we were supposed to hate the poor, fellate the rich, and blame the government(well congress...from 2007 on that is)?", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-18 02:19:00", 
        "title": "WHY?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "A tidal wave of public outrage over bonus payments swamped American International Group yesterday. Hired guards stood watch outside the suburban Connecticut offices of AIG Financial Products, the division whose exotic derivatives brought the insurance giant to the brink of collapse last year. Inside, death threats and angry letters flooded e-mail inboxes. Irate callers lit up the phone lines. Senior managers submitted their resignations. Some employees didn't show up at all. \"It's a mob effect,\" one senior executive said. \"It's putting people's lives in danger.\" Politicians and the public spent yesterday demanding that AIG rescind payouts that they said rewarded recklessness and greed at a company being bailed out with $170 billion in taxpayer funds. But company officials contend that the uproar is scaring away the very employees who understand AIG Financial Products' complex trades and who are trying to dismantle the division before it further endangers the world's economy. \"It's going to blow up,\" said a senior Financial Products manager, who spoke on condition of anonymity because he was not authorized to speak for the company. \"I have a horrible, horrible, horrible feeling that this is going to end badly.\" President Obama yesterday vowed to \"pursue every legal avenue to block these bonuses.\" But that pledge might have come too late. About $165 million in retention payments started to go out Friday to employees at Financial Products, after numerous discussions with the Treasury Department and the Federal Reserve. Attorneys working for the Fed had been examining the matter for months and determined that the retention payments couldn't be touched because AIG would face costly lawsuits and be subject to penalties from states and foreign governments. Administration officials said over the weekend that they agreed with that assessment. Oh but Obama just found out about the bonuses this week AIG disclosed its retention-payment program more than a year ago, and the amount of the bonuses -- more than $400 million for Financial Products alone -- had been widely reported. But as the payments were coming due in recent days, the White House began to express its indignation. Pressure on the 370-person Financial Products unit, based primarily in Connecticut and London, grew even more intense yesterday when New York Attorney General Andrew M. Cuomo threatened to issue subpoenas if the company failed to provide details about recipients of the retention payments. The payments represent only the most contentious of a larger group of bonuses being paid throughout AIG. The company's top seven officials, including chief executive Edward M. Liddy, agreed in November to forgo bonuses through this year. After a Wednesday call between Liddy and Treasury Secretary Timothy F. Geithner, AIG agreed to restructure payments for the next 43 highest-ranking officers at the company, who are to receive half of their bonuses -- which total $9.6 million -- immediately, one-quarter July 15 and the rest Sept. 15. The last two payments would depend on whether the company makes progress in restructuring its business and paying back taxpayers. In addition, the company is set to pay another $600 million in retention awards to about 4,700 people throughout its global insurance units. But each dollar remains in question after the president's reprimand yesterday and the deluge of rage from legislators and the American public. Government leaders already say they plan to recoup some of the bonus and retention pay while restructuring the company. In addition, administration officials said that the Treasury is planning to try to recover some of the bonus money by adding provisions to the additional $30 billion it gave AIG access to earlier this month. The payment plan had been no secret. The way Obama and Congress has acted, you would not think so Beginning in the first quarter of 2008, AIG disclosed the plan to offer retention awards at Financial Products. The unit had already begun to hemorrhage money, a problem that would later grow exponentially. The unit's executives, fearing they might lose valuable employees in the tumultuous months to come, successfully negotiated more than $400 million for their workers, to be paid this month and again next year. At the Federal Reserve Bank of New York, which has directly overseen AIG since its federal takeover in September, officials have studied the possibility of rescinding or delaying the bonuses. They even brought in outside lawyers for advice. The conclusion: If the bonuses weren't paid, the AIG staffers would be able to sue the company and probably would win, not just what they were owed but also punitive damages that would make the ultimate cost perhaps two to three times as high as the bonuses themselves. Moreover, Fed officials also hope to keep current employees with the company. The senior executives whose decisions caused the company's collapse are long gone. Most of those left behind are trying to unwind complicated derivative contracts. Completing that process correctly is essential to preserving as much value as possible for taxpayers, officials at both the government and AIG have argued. If it is mishandled, it could expose taxpayers to billions of dollars in additional losses. Law professors agreed with the Fed's assessment but said AIG employees could still agree to reduce their own bonuses. And the outrage expressed by the president and lawmakers was designed to put pressure on these officers to do just that, the legal experts said. Jonathan Macey, a professor at Yale Law School, said it was unlikely that any AIG employees would end up suing the company for changing compensation contracts, mainly because their names would be revealed publicly in a lawsuit and they would then be excoriated. Macey added that the government is caught in a difficult position, squeezed between public outrage over the bonuses and the need to keep AIG Financial Products going so the company can restructure and the government can recoup some of its money. \"What's good for AIG is definitely not good for the country,\" Macey said. \"But now that the government is invested, it may have to do what's good for AIG.\" Liddy is scheduled to appear tomorrow in front of a House financial services subcommittee. Obama and Congress have known about this all along and their acting indignant about it is play acting at its best. Good try though, to try and cover up what they knew, but alas, NO JOY", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "", 
        "reply": "A tidal wave of public outrage over bonus payments swamped American International Group yesterday. Hired guards stood watch outside the suburban Connecticut offices of AIG Financial Products, the division whose exotic derivatives brought the insurance giant to the brink of collapse last year. Inside, death threats and angry letters flooded e-mail inboxes. Irate callers lit up the phone lines. Senior managers submitted their resignations. Some employees didn't show up at all. \"It's a mob effect,\" one senior executive said. \"It's putting people's lives in danger.\" Politicians and the public spent yesterday demanding that AIG rescind payouts that they said rewarded recklessness and greed at a company being bailed out with $170 billion in taxpayer funds. But company officials contend that the uproar is scaring away the very employees who understand AIG Financial Products' complex trades and who are trying to dismantle the division before it further endangers the world's economy. \"It's going to blow up,\" said a senior Financial Products manager, who spoke on condition of anonymity because he was not authorized to speak for the company. \"I have a horrible, horrible, horrible feeling that this is going to end badly.\" President Obama yesterday vowed to \"pursue every legal avenue to block these bonuses.\" But that pledge might have come too late. About $165 million in retention payments started to go out Friday to employees at Financial Products, after numerous discussions with the Treasury Department and the Federal Reserve. Attorneys working for the Fed had been examining the matter for months and determined that the retention payments couldn't be touched because AIG would face costly lawsuits and be subject to penalties from states and foreign governments. Administration officials said over the weekend that they agreed with that assessment. Oh but Obama just found out about the bonuses this week AIG disclosed its retention-payment program more than a year ago, and the amount of the bonuses -- more than $400 million for Financial Products alone -- had been widely reported. But as the payments were coming due in recent days, the White House began to express its indignation. Pressure on the 370-person Financial Products unit, based primarily in Connecticut and London, grew even more intense yesterday when New York Attorney General Andrew M. Cuomo threatened to issue subpoenas if the company failed to provide details about recipients of the retention payments. The payments represent only the most contentious of a larger group of bonuses being paid throughout AIG. The company's top seven officials, including chief executive Edward M. Liddy, agreed in November to forgo bonuses through this year. After a Wednesday call between Liddy and Treasury Secretary Timothy F. Geithner, AIG agreed to restructure payments for the next 43 highest-ranking officers at the company, who are to receive half of their bonuses -- which total $9.6 million -- immediately, one-quarter July 15 and the rest Sept. 15. The last two payments would depend on whether the company makes progress in restructuring its business and paying back taxpayers. In addition, the company is set to pay another $600 million in retention awards to about 4,700 people throughout its global insurance units. But each dollar remains in question after the president's reprimand yesterday and the deluge of rage from legislators and the American public. Government leaders already say they plan to recoup some of the bonus and retention pay while restructuring the company. In addition, administration officials said that the Treasury is planning to try to recover some of the bonus money by adding provisions to the additional $30 billion it gave AIG access to earlier this month. The payment plan had been no secret. The way Obama and Congress has acted, you would not think so Beginning in the first quarter of 2008, AIG disclosed the plan to offer retention awards at Financial Products. The unit had already begun to hemorrhage money, a problem that would later grow exponentially. The unit's executives, fearing they might lose valuable employees in the tumultuous months to come, successfully negotiated more than $400 million for their workers, to be paid this month and again next year. At the Federal Reserve Bank of New York, which has directly overseen AIG since its federal takeover in September, officials have studied the possibility of rescinding or delaying the bonuses. They even brought in outside lawyers for advice. The conclusion: If the bonuses weren't paid, the AIG staffers would be able to sue the company and probably would win, not just what they were owed but also punitive damages that would make the ultimate cost perhaps two to three times as high as the bonuses themselves. Moreover, Fed officials also hope to keep current employees with the company. The senior executives whose decisions caused the company's collapse are long gone. Most of those left behind are trying to unwind complicated derivative contracts. Completing that process correctly is essential to preserving as much value as possible for taxpayers, officials at both the government and AIG have argued. If it is mishandled, it could expose taxpayers to billions of dollars in additional losses. Law professors agreed with the Fed's assessment but said AIG employees could still agree to reduce their own bonuses. And the outrage expressed by the president and lawmakers was designed to put pressure on these officers to do just that, the legal experts said. Jonathan Macey, a professor at Yale Law School, said it was unlikely that any AIG employees would end up suing the company for changing compensation contracts, mainly because their names would be revealed publicly in a lawsuit and they would then be excoriated. Macey added that the government is caught in a difficult position, squeezed between public outrage over the bonuses and the need to keep AIG Financial Products going so the company can restructure and the government can recoup some of its money. \"What's good for AIG is definitely not good for the country,\" Macey said. \"But now that the government is invested, it may have to do what's good for AIG.\" Liddy is scheduled to appear tomorrow in front of a House financial services subcommittee. Obama and Congress have known about this all along and their acting indignant about it is play acting at its best. Good try though, to try and cover up what they knew, but alas, NO JOY", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-18 02:48:00", 
        "title": "WHY?", 
        "userID": "dhd123"
    }, 
    {
        "content": "I guess its really not a bad deal.... AIG ONLY paid out $165M in bonuses to people who helped it gain $173BILLION!! 'Bama says 'No one in this administration had anything to do with the bonuses' - Guess Geithner don't count. Further says \"The buck stops here\"...before it goes to the bailout pot...", 
        "intTime": 20090318, 
        "postID": 9, 
        "quote": "", 
        "reply": "I guess its really not a bad deal.... AIG ONLY paid out $165M in bonuses to people who helped it gain $173BILLION!! 'Bama says 'No one in this administration had anything to do with the bonuses' - Guess Geithner don't count. Further says \"The buck stops here\"...before it goes to the bailout pot...", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-18 20:20:00", 
        "title": "WHY?", 
        "userID": "Smitty"
    }, 
    {
        "content": "The financial institutions own america and the politicians know it. The banking system goes, so goes the dollar. So goes the dollar, so goes the government. So goes the government, so goes utter anarchy.", 
        "intTime": 20090318, 
        "postID": 10, 
        "quote": "", 
        "reply": "The financial institutions own america and the politicians know it. The banking system goes, so goes the dollar. So goes the dollar, so goes the government. So goes the government, so goes utter anarchy.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-18 20:27:00", 
        "title": "WHY?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Persecute, prosecute the AIG bonus babes. Not going to happen. They have Rush Limbaugh on their side. Why do Democrats love Rush? Because they can use him as a distracton from REAL issues like the economy, unemployment, WOT, and the AIG fiasco.", 
        "intTime": 20090318, 
        "postID": 11, 
        "quote": "Persecute, prosecute the AIG bonus babes. Not going to happen. They have Rush Limbaugh on their side.", 
        "reply": " Why do Democrats love Rush? Because they can use him as a distracton from REAL issues like the economy, unemployment, WOT, and the AIG fiasco.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-18 20:37:00", 
        "title": "WHY?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "The Antichrist The Antichrist!--also described in the Bible as the \"son of perdition\" & the \"beast\"! Like Hitler, who was one of history's antichrist archetypes, he will have great charisma & speaking ability, \"a mouth speaking great things\". The Antichrist will rise to power on a wave of world euphoria, as he temporarily saves the world from its desperate economic, military & political problems, with a brilliant 7-year plan for world peace, economic stability & religious freedom. So far, we're off to a good start...", 
        "intTime": 20090318, 
        "postID": 12, 
        "quote": "", 
        "reply": "The Antichrist The Antichrist!--also described in the Bible as the \"son of perdition\" & the \"beast\"! Like Hitler, who was one of history's antichrist archetypes, he will have great charisma & speaking ability, \"a mouth speaking great things\". The Antichrist will rise to power on a wave of world euphoria, as he temporarily saves the world from its desperate economic, military & political problems, with a brilliant 7-year plan for world peace, economic stability & religious freedom. So far, we're off to a good start...", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-18 20:44:00", 
        "title": "WHY?", 
        "userID": "Smitty"
    }, 
    {
        "content": "quote: The Antichrist will rise to power on a wave of world euphoria, as he temporarily saves the world from its desperate economic, military & political problems, with a brilliant 7-year plan for world peace, economic stability & religious freedom. So Regan was the Antichrist?", 
        "intTime": 20090318, 
        "postID": 13, 
        "quote": "The Antichrist will rise to power on a wave of world euphoria, as he temporarily saves the world from its desperate economic, military & political problems, with a brilliant 7-year plan for world peace, economic stability & religious freedom.", 
        "reply": " So Regan was the Antichrist?", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-18 23:31:00", 
        "title": "WHY?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: Persecute, prosecute the AIG bonus babes. Not going to happen. They have Rush Limbaugh on their side. CALLER: Mr. Limbaugh, thank you for taking my call. RUSH: Thank you. CALLER: You're a real role model to me. I've been listening to you for 19 years, and you've really impacted my life greatly. But that's not why I called. And I know you hate to hear those kind of comments so I'll just make my point. I get so aggravated when I'm listening to these congressmen raise a fit about these bonuses, when they had complete control over whether or not they would be given out when they wrote the bill, and when you listen to the administration talk about how the earmarks in this Porkulus bill were such a small percentage of the total spending. But yet you look at the percentage of these million dollars in bonuses, you would think that it's half the money that they were given. RUSH: That's an excellent point and I want to expand on this point because these bonuses are less than one-tenth of 1% of the actual bailout money AIG got. You could look at these bonuses as the equivalent of earmarks. Essentially they're earmarks, and of course Congress defends their earmarks on the same basis, \"It's such a small percentage of the whole budget, the omnibus, such a small percentage, it doesn't really matter, we gotta pay respects to our constituents,\" blah, blah, blah. These people, what's good for them is not good for you, not going to have the kind of freedom and leeway they have. Now, what is a retention bonus? The best way to explain a retention bonus is to say that a retention bonus is offered to an employee who is being laid off down the road in order to keep the employee, in order to retain the employee. When a company announces layoffs for whatever reason, they still need cooperation from the employees who are going to eventually lose their jobs. There is often a transition period to change the business practice, and AIG is like any other of these companies being bailed out. They're going to have to downsize, and they knew they were going to have to downsize. All these people getting bonuses are going to be laid off. All these people getting bonuses are being fired down the road, and everybody's known it for a year. Everybody knew the payout date of the bonuses and yet there's Barney Frank acting like he didn't know a thing about the details until he got a letter from Andrew Cuomo this morning. These people are lying through their teeth to you. Members of Congress, the media, the president, they're lying. They're lying through their teeth. They knew of the payout schedule. They knew about the retention bonuses. They knew how much and they knew the payout date, and they sit around, they act like innocent bystanders, surprised and shocked, just this past weekend, as though they are learning about this for the first time. During this transition period, the company needs these employees to assist. They just... You can't do work without employees. For example, if the employee were told that they had six months left in the job, their immediate focus would be finding a new job. To hell with their current work, they're getting laid off. What the hell does it matter? The only thing that will keep them there, the only thing that will keep them working until their termination date is a retention bonus. Some employees forgo the retention bonus, because they get a hiring bonus from their new employer. So when you hear that these people who are getting the bonus ought to be fired? They have been! They've been told they're being sent packing. These retention bonuses are to keep them there to keep the company running, which is, I thought, the purpose of the bailout: to keep the company running. I never listen to Rush so when I heard he was saying that these guys should get to keep their 'retention bonus' I just had to go check the transcripts. Sure enough, it seems Rush doesn't really have a problem with them getting what they, according to him, are due. But then Rush may be good Buds with these million dollar babes and feels obligated to stick up for them. I mean he sure doesn't rub elbows with the average working guy. God! Now it's Rush's fault. I hope they keep their bonuses for one reason. There's no Constitutional authority for the goverment to cancel or interfere with a legal, private contract. The only guys on AIGs side was Sen. Dodd, who wrote the language to honor contracts, thus allowing them to stay in force, and Sec. Geithner, who somehow missed it, when he was the pointman on the bills passage. Retention bonuses are normally a good idea in a cut throat business world. Only money will keep high level employees from abandoning ship. Loyalty is hard to find.", 
        "intTime": 20090319, 
        "postID": 14, 
        "quote": "Originally posted by jdksfcret: Persecute, prosecute the AIG bonus babes. Not going to happen. They have Rush Limbaugh on their side. CALLER: Mr. Limbaugh, thank you for taking my call. RUSH: Thank you. CALLER: You're a real role model to me. I've been listening to you for 19 years, and you've really impacted my life greatly. But that's not why I called. And I know you hate to hear those kind of comments so I'll just make my point. I get so aggravated when I'm listening to these congressmen raise a fit about these bonuses, when they had complete control over whether or not they would be given out when they wrote the bill, and when you listen to the administration talk about how the earmarks in this Porkulus bill were such a small percentage of the total spending. But yet you look at the percentage of these million dollars in bonuses, you would think that it's half the money that they were given. RUSH: That's an excellent point and I want to expand on this point because these bonuses are less than one-tenth of 1% of the actual bailout money AIG got. You could look at these bonuses as the equivalent of earmarks. Essentially they're earmarks, and of course Congress defends their earmarks on the same basis, \"It's such a small percentage of the whole budget, the omnibus, such a small percentage, it doesn't really matter, we gotta pay respects to our constituents,\" blah, blah, blah. These people, what's good for them is not good for you, not going to have the kind of freedom and leeway they have. Now, what is a retention bonus? The best way to explain a retention bonus is to say that a retention bonus is offered to an employee who is being laid off down the road in order to keep the employee, in order to retain the employee. When a company announces layoffs for whatever reason, they still need cooperation from the employees who are going to eventually lose their jobs. There is often a transition period to change the business practice, and AIG is like any other of these companies being bailed out. They're going to have to downsize, and they knew they were going to have to downsize. All these people getting bonuses are going to be laid off. All these people getting bonuses are being fired down the road, and everybody's known it for a year. Everybody knew the payout date of the bonuses and yet there's Barney Frank acting like he didn't know a thing about the details until he got a letter from Andrew Cuomo this morning. These people are lying through their teeth to you. Members of Congress, the media, the president, they're lying. They're lying through their teeth. They knew of the payout schedule. They knew about the retention bonuses. They knew how much and they knew the payout date, and they sit around, they act like innocent bystanders, surprised and shocked, just this past weekend, as though they are learning about this for the first time. During this transition period, the company needs these employees to assist. They just... You can't do work without employees. For example, if the employee were told that they had six months left in the job, their immediate focus would be finding a new job. To hell with their current work, they're getting laid off. What the hell does it matter? The only thing that will keep them there, the only thing that will keep them working until their termination date is a retention bonus. Some employees forgo the retention bonus, because they get a hiring bonus from their new employer. So when you hear that these people who are getting the bonus ought to be fired? They have been! They've been told they're being sent packing. These retention bonuses are to keep them there to keep the company running, which is, I thought, the purpose of the bailout: to keep the company running. I never listen to Rush so when I heard he was saying that these guys should get to keep their 'retention bonus' I just had to go check the transcripts. Sure enough, it seems Rush doesn't really have a problem with them getting what they, according to him, are due. But then Rush may be good Buds with these million dollar babes and feels obligated to stick up for them. I mean he sure doesn't rub elbows with the average working guy.", 
        "reply": " God! Now it's Rush's fault. I hope they keep their bonuses for one reason. There's no Constitutional authority for the goverment to cancel or interfere with a legal, private contract. The only guys on AIGs side was Sen. Dodd, who wrote the language to honor contracts, thus allowing them to stay in force, and Sec. Geithner, who somehow missed it, when he was the pointman on the bills passage. Retention bonuses are normally a good idea in a cut throat business world. Only money will keep high level employees from abandoning ship. Loyalty is hard to find.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-19 00:04:00", 
        "title": "WHY?", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by herd173: quote: Originally posted by jdksfcret: Persecute, prosecute the AIG bonus babes. Not going to happen. They have Rush Limbaugh on their side. CALLER: Mr. Limbaugh, thank you for taking my call. RUSH: Thank you. CALLER: You're a real role model to me. I've been listening to you for 19 years, and you've really impacted my life greatly. But that's not why I called. And I know you hate to hear those kind of comments so I'll just make my point. I get so aggravated when I'm listening to these congressmen raise a fit about these bonuses, when they had complete control over whether or not they would be given out when they wrote the bill, and when you listen to the administration talk about how the earmarks in this Porkulus bill were such a small percentage of the total spending. But yet you look at the percentage of these million dollars in bonuses, you would think that it's half the money that they were given. RUSH: That's an excellent point and I want to expand on this point because these bonuses are less than one-tenth of 1% of the actual bailout money AIG got. You could look at these bonuses as the equivalent of earmarks. Essentially they're earmarks, and of course Congress defends their earmarks on the same basis, \"It's such a small percentage of the whole budget, the omnibus, such a small percentage, it doesn't really matter, we gotta pay respects to our constituents,\" blah, blah, blah. These people, what's good for them is not good for you, not going to have the kind of freedom and leeway they have. Now, what is a retention bonus? The best way to explain a retention bonus is to say that a retention bonus is offered to an employee who is being laid off down the road in order to keep the employee, in order to retain the employee. When a company announces layoffs for whatever reason, they still need cooperation from the employees who are going to eventually lose their jobs. There is often a transition period to change the business practice, and AIG is like any other of these companies being bailed out. They're going to have to downsize, and they knew they were going to have to downsize. All these people getting bonuses are going to be laid off. All these people getting bonuses are being fired down the road, and everybody's known it for a year. Everybody knew the payout date of the bonuses and yet there's Barney Frank acting like he didn't know a thing about the details until he got a letter from Andrew Cuomo this morning. These people are lying through their teeth to you. Members of Congress, the media, the president, they're lying. They're lying through their teeth. They knew of the payout schedule. They knew about the retention bonuses. They knew how much and they knew the payout date, and they sit around, they act like innocent bystanders, surprised and shocked, just this past weekend, as though they are learning about this for the first time. During this transition period, the company needs these employees to assist. They just... You can't do work without employees. For example, if the employee were told that they had six months left in the job, their immediate focus would be finding a new job. To hell with their current work, they're getting laid off. What the hell does it matter? The only thing that will keep them there, the only thing that will keep them working until their termination date is a retention bonus. Some employees forgo the retention bonus, because they get a hiring bonus from their new employer. So when you hear that these people who are getting the bonus ought to be fired? They have been! They've been told they're being sent packing. These retention bonuses are to keep them there to keep the company running, which is, I thought, the purpose of the bailout: to keep the company running. I never listen to Rush so when I heard he was saying that these guys should get to keep their 'retention bonus' I just had to go check the transcripts. Sure enough, it seems Rush doesn't really have a problem with them getting what they, according to him, are due. But then Rush may be good Buds with these million dollar babes and feels obligated to stick up for them. I mean he sure doesn't rub elbows with the average working guy. God! Now it's Rush's fault. I hope they keep their bonuses for one reason. There's no Constitutional authority for the goverment to cancel or interfere with a legal, private contract. The only guys on AIGs side was Sen. Dodd, who wrote the language to honor contracts, thus allowing them to stay in force, and Sec. Geithner, who somehow missed it, when he was the pointman on the bills passage. Retention bonuses are normally a good idea in a cut throat business world. Only money will keep high level employees from abandoning ship. Loyalty is hard to find. Then again, he may have buddies there. I doubt he got huge campaign donations like Dodd, Frank, and a reported 100,000+ dollars as Obama did from AIG. At least Limbaugh was an average working guy at one time, unlike the 3 mentioned above.", 
        "intTime": 20090319, 
        "postID": 15, 
        "quote": "Originally posted by herd173: quote: Originally posted by jdksfcret: Persecute, prosecute the AIG bonus babes. Not going to happen. They have Rush Limbaugh on their side. CALLER: Mr. Limbaugh, thank you for taking my call. RUSH: Thank you. CALLER: You're a real role model to me. I've been listening to you for 19 years, and you've really impacted my life greatly. But that's not why I called. And I know you hate to hear those kind of comments so I'll just make my point. I get so aggravated when I'm listening to these congressmen raise a fit about these bonuses, when they had complete control over whether or not they would be given out when they wrote the bill, and when you listen to the administration talk about how the earmarks in this Porkulus bill were such a small percentage of the total spending. But yet you look at the percentage of these million dollars in bonuses, you would think that it's half the money that they were given. RUSH: That's an excellent point and I want to expand on this point because these bonuses are less than one-tenth of 1% of the actual bailout money AIG got. You could look at these bonuses as the equivalent of earmarks. Essentially they're earmarks, and of course Congress defends their earmarks on the same basis, \"It's such a small percentage of the whole budget, the omnibus, such a small percentage, it doesn't really matter, we gotta pay respects to our constituents,\" blah, blah, blah. These people, what's good for them is not good for you, not going to have the kind of freedom and leeway they have. Now, what is a retention bonus? The best way to explain a retention bonus is to say that a retention bonus is offered to an employee who is being laid off down the road in order to keep the employee, in order to retain the employee. When a company announces layoffs for whatever reason, they still need cooperation from the employees who are going to eventually lose their jobs. There is often a transition period to change the business practice, and AIG is like any other of these companies being bailed out. They're going to have to downsize, and they knew they were going to have to downsize. All these people getting bonuses are going to be laid off. All these people getting bonuses are being fired down the road, and everybody's known it for a year. Everybody knew the payout date of the bonuses and yet there's Barney Frank acting like he didn't know a thing about the details until he got a letter from Andrew Cuomo this morning. These people are lying through their teeth to you. Members of Congress, the media, the president, they're lying. They're lying through their teeth. They knew of the payout schedule. They knew about the retention bonuses. They knew how much and they knew the payout date, and they sit around, they act like innocent bystanders, surprised and shocked, just this past weekend, as though they are learning about this for the first time. During this transition period, the company needs these employees to assist. They just... You can't do work without employees. For example, if the employee were told that they had six months left in the job, their immediate focus would be finding a new job. To hell with their current work, they're getting laid off. What the hell does it matter? The only thing that will keep them there, the only thing that will keep them working until their termination date is a retention bonus. Some employees forgo the retention bonus, because they get a hiring bonus from their new employer. So when you hear that these people who are getting the bonus ought to be fired? They have been! They've been told they're being sent packing. These retention bonuses are to keep them there to keep the company running, which is, I thought, the purpose of the bailout: to keep the company running. I never listen to Rush so when I heard he was saying that these guys should get to keep their 'retention bonus' I just had to go check the transcripts. Sure enough, it seems Rush doesn't really have a problem with them getting what they, according to him, are due. But then Rush may be good Buds with these million dollar babes and feels obligated to stick up for them. I mean he sure doesn't rub elbows with the average working guy. God! Now it's Rush's fault. I hope they keep their bonuses for one reason. There's no Constitutional authority for the goverment to cancel or interfere with a legal, private contract. The only guys on AIGs side was Sen. Dodd, who wrote the language to honor contracts, thus allowing them to stay in force, and Sec. Geithner, who somehow missed it, when he was the pointman on the bills passage. Retention bonuses are normally a good idea in a cut throat business world. Only money will keep high level employees from abandoning ship. Loyalty is hard to find.", 
        "reply": " Then again, he may have buddies there. I doubt he got huge campaign donations like Dodd, Frank, and a reported 100,000+ dollars as Obama did from AIG. At least Limbaugh was an average working guy at one time, unlike the 3 mentioned above.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-19 00:09:00", 
        "title": "WHY?", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Retention bonuses are normally a good idea in a cut throat business world. except for when the people you are trying to retain are the ones who helped put the country into a recession and required the business to request federal bail out money.", 
        "intTime": 20090319, 
        "postID": 16, 
        "quote": "Retention bonuses are normally a good idea in a cut throat business world.", 
        "reply": " except for when the people you are trying to retain are the ones who helped put the country into a recession and required the business to request federal bail out money.", 
        "threadID": "409192893_2960061812001", 
        "time": "2009-03-19 00:13:00", 
        "title": "WHY?", 
        "userID": "karlhungusjr"
    }
]