[
    {
        "content": "Go BLUE!!!! [http://news.yahoo.com/s/politico/20090429/pl_politico/21875", 
        "intTime": 20090429, 
        "postID": 1, 
        "quote": "", 
        "reply": "Go BLUE!!!! [http://news.yahoo.com/s/politico/20090429/pl_politico/21875", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-29 17:34:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "\"Pay as you go\" is a wonderful idea - sadly, it won't happen. The present-day Republicans believe in \"credit card\" government finance - cut taxes, get the government goodies now, and let someone else's children pay for it later.", 
        "intTime": 20090429, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"Pay as you go\" is a wonderful idea - sadly, it won't happen. The present-day Republicans believe in \"credit card\" government finance - cut taxes, get the government goodies now, and let someone else's children pay for it later.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-29 17:56:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"Pay as you go\" is a wonderful idea - sadly, it won't happen. The present-day Republicans believe in \"credit card\" government finance - cut taxes, get the government goodies now, and let someone else's children pay for it later. PBHO pulled a Spectre and changed parties??", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "Originally posted by Fightdirector: \"Pay as you go\" is a wonderful idea - sadly, it won't happen. The present-day Republicans believe in \"credit card\" government finance - cut taxes, get the government goodies now, and let someone else's children pay for it later.", 
        "reply": " PBHO pulled a Spectre and changed parties??", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:32:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "transport1"
    }, 
    {
        "content": "Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline.", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "", 
        "reply": "Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:36:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline. You can't look to either party for that.", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "Originally posted by FrJohn1123: Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline.", 
        "reply": " You can't look to either party for that.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:39:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline. Government in general be it republican controlled, democrat controlled, fed, state, or city. They are all pathetic when it comes to balanced budgets.", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "Originally posted by FrJohn1123: Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline.", 
        "reply": " Government in general be it republican controlled, democrat controlled, fed, state, or city. They are all pathetic when it comes to balanced budgets.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:41:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "floersh"
    }, 
    {
        "content": "If Clinton and the republican congress could do it, it could be done again.", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "", 
        "reply": "If Clinton and the republican congress could do it, it could be done again.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:45:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Good idea, in theory. However it says govt. spending would have to be paid for? How? Budget cuts or heavy tax hikes? Give you 3.5 trillion guesses ....", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "", 
        "reply": "Good idea, in theory. However it says govt. spending would have to be paid for? How? Budget cuts or heavy tax hikes? Give you 3.5 trillion guesses ....", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 14:16:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: If Clinton and the republican congress could do it, it could be done again. I disagree. And here is why. We have been promised far too much over the past decade and we all know that it is impossible for government to ever CUT programs it has already begun. Medicare D and SCHIP to name but a few. And we are being promised Universal Health Care. But more so then that there are two other much larger problems. #1 The portion of the budget dedicated to paying interest just went up massively. The money has been borrowed. Short of stiffing the lenders we wont be getting that rather large chunk of our revenue back any time soon. And the enxt couple of budgets are already projecting trillion dollar deficits. #2 Under Clinton/Repub congress a good portion of the budget was funded from surplus social security revenue. That too is shrinking as time goes by. The further into the baby boom retirement we go the less of that there will be. We will need to raise taxes just to continue spending at the rates we are today as a larger and larger percentage of the FICA revenue stream actually goes to social security and medicare.", 
        "intTime": 20090501, 
        "postID": 9, 
        "quote": "Originally posted by FrJohn1123: If Clinton and the republican congress could do it, it could be done again.", 
        "reply": " I disagree. And here is why. We have been promised far too much over the past decade and we all know that it is impossible for government to ever CUT programs it has already begun. Medicare D and SCHIP to name but a few. And we are being promised Universal Health Care. But more so then that there are two other much larger problems. #1 The portion of the budget dedicated to paying interest just went up massively. The money has been borrowed. Short of stiffing the lenders we wont be getting that rather large chunk of our revenue back any time soon. And the enxt couple of budgets are already projecting trillion dollar deficits. #2 Under Clinton/Repub congress a good portion of the budget was funded from surplus social security revenue. That too is shrinking as time goes by. The further into the baby boom retirement we go the less of that there will be. We will need to raise taxes just to continue spending at the rates we are today as a larger and larger percentage of the FICA revenue stream actually goes to social security and medicare.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 05:42:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: I disagree. And here is why. we managed to do it after the depression and WWII. and(acounting for inflation) we borrowed and spent much more than we are now. and that was also after the new deal and many many more government programs in place. i believe we can and will. To me the only question is \"how long will it take\".", 
        "intTime": 20090501, 
        "postID": 10, 
        "quote": "I disagree. And here is why.", 
        "reply": " we managed to do it after the depression and WWII. and(acounting for inflation) we borrowed and spent much more than we are now. and that was also after the new deal and many many more government programs in place. i believe we can and will. To me the only question is \"how long will it take\".", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 05:52:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business.", 
        "intTime": 20090501, 
        "postID": 11, 
        "quote": "", 
        "reply": "There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:17:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: i believe we can and will. To me the only question is \"how long will it take\". Even with the federal reserve? Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given.", 
        "intTime": 20090501, 
        "postID": 12, 
        "quote": "i believe we can and will. To me the only question is \"how long will it take\".", 
        "reply": " Even with the federal reserve? Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:24:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: i believe we can and will. To me the only question is \"how long will it take\". Even with the federal reserve? Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. Bologna. Too many none \"enumerated\" rights, obligations and responsibilities.", 
        "intTime": 20090501, 
        "postID": 13, 
        "quote": "Originally posted by soscorpio: quote: i believe we can and will. To me the only question is \"how long will it take\". Even with the federal reserve? Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given.", 
        "reply": " Bologna. Too many none \"enumerated\" rights, obligations and responsibilities.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:28:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Even with the federal reserve? why not? quote: Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. Overall maybe, but not in the economic problem we have right now. quote: No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. I agree in principal, but thats not always practical. think of the FCC. It's not mentioned either. But without it we'd have evey HAM radio operator trying to use military freq. and any kid with the time, the money and the know how jamming commerical TV nd radio broadcasts.", 
        "intTime": 20090501, 
        "postID": 14, 
        "quote": "Even with the federal reserve?", 
        "reply": " why not? quote: Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. Overall maybe, but not in the economic problem we have right now. quote: No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. I agree in principal, but thats not always practical. think of the FCC. It's not mentioned either. But without it we'd have evey HAM radio operator trying to use military freq. and any kid with the time, the money and the know how jamming commerical TV nd radio broadcasts.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:30:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: quote: Even with the federal reserve? why not? History proves centralized banking is a financial coup. quote: Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. Overall maybe, but not in the economic problem we have right now. It's exactly the reason for today's headlines. quote: No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. I agree in principal, but thats not always practical. BS think of the FCC. It's not mentioned either. Why does gov't create agencies? hint: power! But without it we'd have evey HAM radio operator trying to use military freq. Frequencies aren't accessible to those without knowledge and crystals.and any kid with the time, the money and the know how jamming commerical TV nd radio broadcasts. Capitalism solves all these problems.", 
        "intTime": 20090501, 
        "postID": 15, 
        "quote": "quote: Even with the federal reserve? why not? History proves centralized banking is a financial coup. quote: Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. Overall maybe, but not in the economic problem we have right now. It's exactly the reason for today's headlines. quote: No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. I agree in principal, but thats not always practical. BS think of the FCC. It's not mentioned either. Why does gov't create agencies? hint: power! But without it we'd have evey HAM radio operator trying to use military freq. Frequencies aren't accessible to those without knowledge and crystals.and any kid with the time, the money and the know how jamming commerical TV nd radio broadcasts. Capitalism solves all these problems.", 
        "reply": "", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:54:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: I agree in principal Even Hamilton had a problem with that kind of thinking. See the debate over the 9th Amendment. quote: In Federalist 84, Alexander Hamilton asked, \"Why declare that things shall not be done which there is no power to do?\" Good question Alex.", 
        "intTime": 20090501, 
        "postID": 16, 
        "quote": "I agree in principal", 
        "reply": " Even Hamilton had a problem with that kind of thinking. See the debate over the 9th Amendment. quote: In Federalist 84, Alexander Hamilton asked, \"Why declare that things shall not be done which there is no power to do?\" Good question Alex.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:55:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: History proves centralized banking is a financial coup. you mean the nearly 100 years of the federal reserve? quote: It's exactly the reason for today's headlines.. how so? I'd say todays headlines are over mortage speculation and subprime loans being sold as \"investments\". But I'm more than willing to get schooled on the subject. quote: Why does gov't create agencies? hint: power! and to regulate things that a private entity is unable to....like the public airwaves. quote: Frequencies aren't accessible to those without knowledge and crystals. what does this even mean? quote: Capitalism solves all these problems. how does Capitalism prevent technology from being abused?", 
        "intTime": 20090501, 
        "postID": 17, 
        "quote": "History proves centralized banking is a financial coup.", 
        "reply": " you mean the nearly 100 years of the federal reserve? quote: It's exactly the reason for today's headlines.. how so? I'd say todays headlines are over mortage speculation and subprime loans being sold as \"investments\". But I'm more than willing to get schooled on the subject. quote: Why does gov't create agencies? hint: power! and to regulate things that a private entity is unable to....like the public airwaves. quote: Frequencies aren't accessible to those without knowledge and crystals. what does this even mean? quote: Capitalism solves all these problems. how does Capitalism prevent technology from being abused?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:09:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Why does gov't create agencies? hint: power!", 
        "intTime": 20090501, 
        "postID": 18, 
        "quote": "Why does gov't create agencies? hint: power!", 
        "reply": "", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:10:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: od question Alex. very good question indeed.", 
        "intTime": 20090501, 
        "postID": 19, 
        "quote": "od question Alex.", 
        "reply": " very good question indeed.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:15:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by FrJohn1123: There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business. And when we get a business man in the Whitehouse and not a professional politician then we might indeed move forward. Businessman to run the WH? You got to be kidding.", 
        "intTime": 20090501, 
        "postID": 20, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by FrJohn1123: There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business. And when we get a business man in the Whitehouse and not a professional politician then we might indeed move forward.", 
        "reply": " Businessman to run the WH? You got to be kidding.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:19:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed?", 
        "intTime": 20090501, 
        "postID": 21, 
        "quote": "a business man in the Whitehouse", 
        "reply": " like someone from AIG? GM? The CEO of my local bank that failed?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:22:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by FrJohn1123: There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business. And when we get a business man in the Whitehouse and not a professional politician then we might indeed move forward. Hopefully, you were just being sarcastic...", 
        "intTime": 20090501, 
        "postID": 22, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by FrJohn1123: There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business. And when we get a business man in the Whitehouse and not a professional politician then we might indeed move forward.", 
        "reply": " Hopefully, you were just being sarcastic...", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:26:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron", 
        "intTime": 20090501, 
        "postID": 23, 
        "quote": "Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed?", 
        "reply": " enron", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:27:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron OR some like Bill Gates or Lee Iaocca?", 
        "intTime": 20090501, 
        "postID": 24, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron", 
        "reply": " OR some like Bill Gates or Lee Iaocca?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:43:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "navy8086"
    }, 
    {
        "content": "I feel sorry for the cat in the tin hat!", 
        "intTime": 20090501, 
        "postID": 25, 
        "quote": "", 
        "reply": "I feel sorry for the cat in the tin hat!", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:47:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: OR some like Bill Gates or Lee Iaocca? there's more Failed CEO's than there are Bill Gates in this world. and a WHOLE lot more that are just riding things out until retirment.", 
        "intTime": 20090501, 
        "postID": 26, 
        "quote": "OR some like Bill Gates or Lee Iaocca?", 
        "reply": " there's more Failed CEO's than there are Bill Gates in this world. and a WHOLE lot more that are just riding things out until retirment.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:50:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron OR some like Bill Gates or Lee Iaocca? You are serious too?", 
        "intTime": 20090501, 
        "postID": 27, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron OR some like Bill Gates or Lee Iaocca?", 
        "reply": " You are serious too?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:50:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: I disagree. And here is why. we managed to do it after the depression and WWII. and(acounting for inflation) we borrowed and spent much more than we are now. and that was also after the new deal and many many more government programs in place. i believe we can and will. To me the only question is \"how long will it take\". There are a number of significant differences between the United States of the 30s and 40s and today. The most obvious is that we have a population that is significantly larger yet the same number or less of nearly every resource this land can provide. Example #1. In the 40s the United States was the world's largest exporter of OIL. Today we are the largest importer. We are a significantly older society today then we were in the 30s & 40s. The average age of our citizens has increased significantly. And that is important when we consider programs like social security and medicare which by the way have been expanded significantly since the 30s and 40s. Needless to say we are sharing the same size pie with a much larger number of people. Not only a larger american citizenry but also a world full of people that are beginning to pull themselves out of their aguarian base and into a modern industrial society. The world is a very different place. its population is beginning to butt up with the natural limits of its resources. Scarcity of all sorts will be the name of the game moving forward. Example #2 was global warming a major concern in the 40s?", 
        "intTime": 20090501, 
        "postID": 28, 
        "quote": "Originally posted by karlhungusjr: quote: I disagree. And here is why. we managed to do it after the depression and WWII. and(acounting for inflation) we borrowed and spent much more than we are now. and that was also after the new deal and many many more government programs in place. i believe we can and will. To me the only question is \"how long will it take\".", 
        "reply": " There are a number of significant differences between the United States of the 30s and 40s and today. The most obvious is that we have a population that is significantly larger yet the same number or less of nearly every resource this land can provide. Example #1. In the 40s the United States was the world's largest exporter of OIL. Today we are the largest importer. We are a significantly older society today then we were in the 30s & 40s. The average age of our citizens has increased significantly. And that is important when we consider programs like social security and medicare which by the way have been expanded significantly since the 30s and 40s. Needless to say we are sharing the same size pie with a much larger number of people. Not only a larger american citizenry but also a world full of people that are beginning to pull themselves out of their aguarian base and into a modern industrial society. The world is a very different place. its population is beginning to butt up with the natural limits of its resources. Scarcity of all sorts will be the name of the game moving forward. Example #2 was global warming a major concern in the 40s?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:51:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "floersh"
    }, 
    {
        "content": "Go BLUE!!!! [http://news.yahoo.com/s/politico/20090429/pl_politico/21875", 
        "intTime": 20090429, 
        "postID": 29, 
        "quote": "", 
        "reply": "Go BLUE!!!! [http://news.yahoo.com/s/politico/20090429/pl_politico/21875", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-29 17:34:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "\"Pay as you go\" is a wonderful idea - sadly, it won't happen. The present-day Republicans believe in \"credit card\" government finance - cut taxes, get the government goodies now, and let someone else's children pay for it later.", 
        "intTime": 20090429, 
        "postID": 30, 
        "quote": "", 
        "reply": "\"Pay as you go\" is a wonderful idea - sadly, it won't happen. The present-day Republicans believe in \"credit card\" government finance - cut taxes, get the government goodies now, and let someone else's children pay for it later.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-29 17:56:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"Pay as you go\" is a wonderful idea - sadly, it won't happen. The present-day Republicans believe in \"credit card\" government finance - cut taxes, get the government goodies now, and let someone else's children pay for it later. PBHO pulled a Spectre and changed parties??", 
        "intTime": 20090430, 
        "postID": 31, 
        "quote": "Originally posted by Fightdirector: \"Pay as you go\" is a wonderful idea - sadly, it won't happen. The present-day Republicans believe in \"credit card\" government finance - cut taxes, get the government goodies now, and let someone else's children pay for it later.", 
        "reply": " PBHO pulled a Spectre and changed parties??", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:32:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "transport1"
    }, 
    {
        "content": "Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline.", 
        "intTime": 20090430, 
        "postID": 32, 
        "quote": "", 
        "reply": "Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:36:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline. You can't look to either party for that.", 
        "intTime": 20090430, 
        "postID": 33, 
        "quote": "Originally posted by FrJohn1123: Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline.", 
        "reply": " You can't look to either party for that.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:39:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline. Government in general be it republican controlled, democrat controlled, fed, state, or city. They are all pathetic when it comes to balanced budgets.", 
        "intTime": 20090430, 
        "postID": 34, 
        "quote": "Originally posted by FrJohn1123: Bush and the republicans let it go. Sad day for anyone that believes in fiscal discipline.", 
        "reply": " Government in general be it republican controlled, democrat controlled, fed, state, or city. They are all pathetic when it comes to balanced budgets.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:41:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "floersh"
    }, 
    {
        "content": "If Clinton and the republican congress could do it, it could be done again.", 
        "intTime": 20090430, 
        "postID": 35, 
        "quote": "", 
        "reply": "If Clinton and the republican congress could do it, it could be done again.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 13:45:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Good idea, in theory. However it says govt. spending would have to be paid for? How? Budget cuts or heavy tax hikes? Give you 3.5 trillion guesses ....", 
        "intTime": 20090430, 
        "postID": 36, 
        "quote": "", 
        "reply": "Good idea, in theory. However it says govt. spending would have to be paid for? How? Budget cuts or heavy tax hikes? Give you 3.5 trillion guesses ....", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-04-30 14:16:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: If Clinton and the republican congress could do it, it could be done again. I disagree. And here is why. We have been promised far too much over the past decade and we all know that it is impossible for government to ever CUT programs it has already begun. Medicare D and SCHIP to name but a few. And we are being promised Universal Health Care. But more so then that there are two other much larger problems. #1 The portion of the budget dedicated to paying interest just went up massively. The money has been borrowed. Short of stiffing the lenders we wont be getting that rather large chunk of our revenue back any time soon. And the enxt couple of budgets are already projecting trillion dollar deficits. #2 Under Clinton/Repub congress a good portion of the budget was funded from surplus social security revenue. That too is shrinking as time goes by. The further into the baby boom retirement we go the less of that there will be. We will need to raise taxes just to continue spending at the rates we are today as a larger and larger percentage of the FICA revenue stream actually goes to social security and medicare.", 
        "intTime": 20090501, 
        "postID": 37, 
        "quote": "Originally posted by FrJohn1123: If Clinton and the republican congress could do it, it could be done again.", 
        "reply": " I disagree. And here is why. We have been promised far too much over the past decade and we all know that it is impossible for government to ever CUT programs it has already begun. Medicare D and SCHIP to name but a few. And we are being promised Universal Health Care. But more so then that there are two other much larger problems. #1 The portion of the budget dedicated to paying interest just went up massively. The money has been borrowed. Short of stiffing the lenders we wont be getting that rather large chunk of our revenue back any time soon. And the enxt couple of budgets are already projecting trillion dollar deficits. #2 Under Clinton/Repub congress a good portion of the budget was funded from surplus social security revenue. That too is shrinking as time goes by. The further into the baby boom retirement we go the less of that there will be. We will need to raise taxes just to continue spending at the rates we are today as a larger and larger percentage of the FICA revenue stream actually goes to social security and medicare.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 05:42:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: I disagree. And here is why. we managed to do it after the depression and WWII. and(acounting for inflation) we borrowed and spent much more than we are now. and that was also after the new deal and many many more government programs in place. i believe we can and will. To me the only question is \"how long will it take\".", 
        "intTime": 20090501, 
        "postID": 38, 
        "quote": "I disagree. And here is why.", 
        "reply": " we managed to do it after the depression and WWII. and(acounting for inflation) we borrowed and spent much more than we are now. and that was also after the new deal and many many more government programs in place. i believe we can and will. To me the only question is \"how long will it take\".", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 05:52:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business.", 
        "intTime": 20090501, 
        "postID": 39, 
        "quote": "", 
        "reply": "There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:17:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: i believe we can and will. To me the only question is \"how long will it take\". Even with the federal reserve? Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given.", 
        "intTime": 20090501, 
        "postID": 40, 
        "quote": "i believe we can and will. To me the only question is \"how long will it take\".", 
        "reply": " Even with the federal reserve? Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:24:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: i believe we can and will. To me the only question is \"how long will it take\". Even with the federal reserve? Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. Bologna. Too many none \"enumerated\" rights, obligations and responsibilities.", 
        "intTime": 20090501, 
        "postID": 41, 
        "quote": "Originally posted by soscorpio: quote: i believe we can and will. To me the only question is \"how long will it take\". Even with the federal reserve? Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given.", 
        "reply": " Bologna. Too many none \"enumerated\" rights, obligations and responsibilities.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:28:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Even with the federal reserve? why not? quote: Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. Overall maybe, but not in the economic problem we have right now. quote: No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. I agree in principal, but thats not always practical. think of the FCC. It's not mentioned either. But without it we'd have evey HAM radio operator trying to use military freq. and any kid with the time, the money and the know how jamming commerical TV nd radio broadcasts.", 
        "intTime": 20090501, 
        "postID": 42, 
        "quote": "Even with the federal reserve?", 
        "reply": " why not? quote: Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. Overall maybe, but not in the economic problem we have right now. quote: No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. I agree in principal, but thats not always practical. think of the FCC. It's not mentioned either. But without it we'd have evey HAM radio operator trying to use military freq. and any kid with the time, the money and the know how jamming commerical TV nd radio broadcasts.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:30:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: quote: Even with the federal reserve? why not? History proves centralized banking is a financial coup. quote: Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. Overall maybe, but not in the economic problem we have right now. It's exactly the reason for today's headlines. quote: No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. I agree in principal, but thats not always practical. BS think of the FCC. It's not mentioned either. Why does gov't create agencies? hint: power! But without it we'd have evey HAM radio operator trying to use military freq. Frequencies aren't accessible to those without knowledge and crystals.and any kid with the time, the money and the know how jamming commerical TV nd radio broadcasts. Capitalism solves all these problems.", 
        "intTime": 20090501, 
        "postID": 43, 
        "quote": "quote: Even with the federal reserve? why not? History proves centralized banking is a financial coup. quote: Our deviation from the constitution directly correlates with our woes. Re-instill the constitution, and prosperity will return. Overall maybe, but not in the economic problem we have right now. It's exactly the reason for today's headlines. quote: No law should be passed by congress, no action by the president should go forward without referencing where in the constitution that power is given. I agree in principal, but thats not always practical. BS think of the FCC. It's not mentioned either. Why does gov't create agencies? hint: power! But without it we'd have evey HAM radio operator trying to use military freq. Frequencies aren't accessible to those without knowledge and crystals.and any kid with the time, the money and the know how jamming commerical TV nd radio broadcasts. Capitalism solves all these problems.", 
        "reply": "", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:54:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: I agree in principal Even Hamilton had a problem with that kind of thinking. See the debate over the 9th Amendment. quote: In Federalist 84, Alexander Hamilton asked, \"Why declare that things shall not be done which there is no power to do?\" Good question Alex.", 
        "intTime": 20090501, 
        "postID": 44, 
        "quote": "I agree in principal", 
        "reply": " Even Hamilton had a problem with that kind of thinking. See the debate over the 9th Amendment. quote: In Federalist 84, Alexander Hamilton asked, \"Why declare that things shall not be done which there is no power to do?\" Good question Alex.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 06:55:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: History proves centralized banking is a financial coup. you mean the nearly 100 years of the federal reserve? quote: It's exactly the reason for today's headlines.. how so? I'd say todays headlines are over mortage speculation and subprime loans being sold as \"investments\". But I'm more than willing to get schooled on the subject. quote: Why does gov't create agencies? hint: power! and to regulate things that a private entity is unable to....like the public airwaves. quote: Frequencies aren't accessible to those without knowledge and crystals. what does this even mean? quote: Capitalism solves all these problems. how does Capitalism prevent technology from being abused?", 
        "intTime": 20090501, 
        "postID": 45, 
        "quote": "History proves centralized banking is a financial coup.", 
        "reply": " you mean the nearly 100 years of the federal reserve? quote: It's exactly the reason for today's headlines.. how so? I'd say todays headlines are over mortage speculation and subprime loans being sold as \"investments\". But I'm more than willing to get schooled on the subject. quote: Why does gov't create agencies? hint: power! and to regulate things that a private entity is unable to....like the public airwaves. quote: Frequencies aren't accessible to those without knowledge and crystals. what does this even mean? quote: Capitalism solves all these problems. how does Capitalism prevent technology from being abused?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:09:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Why does gov't create agencies? hint: power!", 
        "intTime": 20090501, 
        "postID": 46, 
        "quote": "Why does gov't create agencies? hint: power!", 
        "reply": "", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:10:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: od question Alex. very good question indeed.", 
        "intTime": 20090501, 
        "postID": 47, 
        "quote": "od question Alex.", 
        "reply": " very good question indeed.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:15:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by FrJohn1123: There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business. And when we get a business man in the Whitehouse and not a professional politician then we might indeed move forward. Businessman to run the WH? You got to be kidding.", 
        "intTime": 20090501, 
        "postID": 48, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by FrJohn1123: There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business. And when we get a business man in the Whitehouse and not a professional politician then we might indeed move forward.", 
        "reply": " Businessman to run the WH? You got to be kidding.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:19:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed?", 
        "intTime": 20090501, 
        "postID": 49, 
        "quote": "a business man in the Whitehouse", 
        "reply": " like someone from AIG? GM? The CEO of my local bank that failed?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:22:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by FrJohn1123: There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business. And when we get a business man in the Whitehouse and not a professional politician then we might indeed move forward. Hopefully, you were just being sarcastic...", 
        "intTime": 20090501, 
        "postID": 50, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by FrJohn1123: There are several missing possibilities from this discussion, most notably is the possiblity that there could be major increases in our national productivity that could be a game changer. Another almost certainty which would be the delay of many retirement eligible baby boomers. Obama is correct, we need hope and a new way of doing business. And when we get a business man in the Whitehouse and not a professional politician then we might indeed move forward.", 
        "reply": " Hopefully, you were just being sarcastic...", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:26:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron", 
        "intTime": 20090501, 
        "postID": 51, 
        "quote": "Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed?", 
        "reply": " enron", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:27:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron OR some like Bill Gates or Lee Iaocca?", 
        "intTime": 20090501, 
        "postID": 52, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron", 
        "reply": " OR some like Bill Gates or Lee Iaocca?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:43:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "navy8086"
    }, 
    {
        "content": "I feel sorry for the cat in the tin hat!", 
        "intTime": 20090501, 
        "postID": 53, 
        "quote": "", 
        "reply": "I feel sorry for the cat in the tin hat!", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:47:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: OR some like Bill Gates or Lee Iaocca? there's more Failed CEO's than there are Bill Gates in this world. and a WHOLE lot more that are just riding things out until retirment.", 
        "intTime": 20090501, 
        "postID": 54, 
        "quote": "OR some like Bill Gates or Lee Iaocca?", 
        "reply": " there's more Failed CEO's than there are Bill Gates in this world. and a WHOLE lot more that are just riding things out until retirment.", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:50:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron OR some like Bill Gates or Lee Iaocca? You are serious too?", 
        "intTime": 20090501, 
        "postID": 55, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: quote: Originally posted by karlhungusjr: quote: a business man in the Whitehouse like someone from AIG? GM? The CEO of my local bank that failed? enron OR some like Bill Gates or Lee Iaocca?", 
        "reply": " You are serious too?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:50:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: I disagree. And here is why. we managed to do it after the depression and WWII. and(acounting for inflation) we borrowed and spent much more than we are now. and that was also after the new deal and many many more government programs in place. i believe we can and will. To me the only question is \"how long will it take\". There are a number of significant differences between the United States of the 30s and 40s and today. The most obvious is that we have a population that is significantly larger yet the same number or less of nearly every resource this land can provide. Example #1. In the 40s the United States was the world's largest exporter of OIL. Today we are the largest importer. We are a significantly older society today then we were in the 30s & 40s. The average age of our citizens has increased significantly. And that is important when we consider programs like social security and medicare which by the way have been expanded significantly since the 30s and 40s. Needless to say we are sharing the same size pie with a much larger number of people. Not only a larger american citizenry but also a world full of people that are beginning to pull themselves out of their aguarian base and into a modern industrial society. The world is a very different place. its population is beginning to butt up with the natural limits of its resources. Scarcity of all sorts will be the name of the game moving forward. Example #2 was global warming a major concern in the 40s?", 
        "intTime": 20090501, 
        "postID": 56, 
        "quote": "Originally posted by karlhungusjr: quote: I disagree. And here is why. we managed to do it after the depression and WWII. and(acounting for inflation) we borrowed and spent much more than we are now. and that was also after the new deal and many many more government programs in place. i believe we can and will. To me the only question is \"how long will it take\".", 
        "reply": " There are a number of significant differences between the United States of the 30s and 40s and today. The most obvious is that we have a population that is significantly larger yet the same number or less of nearly every resource this land can provide. Example #1. In the 40s the United States was the world's largest exporter of OIL. Today we are the largest importer. We are a significantly older society today then we were in the 30s & 40s. The average age of our citizens has increased significantly. And that is important when we consider programs like social security and medicare which by the way have been expanded significantly since the 30s and 40s. Needless to say we are sharing the same size pie with a much larger number of people. Not only a larger american citizenry but also a world full of people that are beginning to pull themselves out of their aguarian base and into a modern industrial society. The world is a very different place. its population is beginning to butt up with the natural limits of its resources. Scarcity of all sorts will be the name of the game moving forward. Example #2 was global warming a major concern in the 40s?", 
        "threadID": "409192893_5780001222001", 
        "time": "2009-05-01 07:51:00", 
        "title": "Blue dogs introduce paygo bill", 
        "userID": "floersh"
    }
]