[
    {
        "content": "As I was standing there in the Lincoln Memorial reading the engravings and quotes below, and after a day of visiting the Washington Memorial, WWII, WWI, Korean, and Vietnam Memorial, I started to reflect on God and Country. It has taken me a while to formulate this thought but with a lot of additional reading, thinking, research and more thinking I pose this question. If God was not meant to be a part of this countries governing...would we still have slavery? My reasoning: A. President Lincoln would not have been able to continue the civil war with the huge loss of human life because of the determination factor. This thought process seems to come from Lincoln himself in several speeches including his second inaugural address. B. Because the clause “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” would not have existed.", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "", 
        "reply": "As I was standing there in the Lincoln Memorial reading the engravings and quotes below, and after a day of visiting the Washington Memorial, WWII, WWI, Korean, and Vietnam Memorial, I started to reflect on God and Country. It has taken me a while to formulate this thought but with a lot of additional reading, thinking, research and more thinking I pose this question. If God was not meant to be a part of this countries governing...would we still have slavery? My reasoning: A. President Lincoln would not have been able to continue the civil war with the huge loss of human life because of the determination factor. This thought process seems to come from Lincoln himself in several speeches including his second inaugural address. B. Because the clause “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” would not have existed.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 11:55:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: If God was not meant to be a part of this countries governing...would we still have slavery? Let me play \"Devil's Advocate\": In the period immediately preceding the American Civil War (and during that War), a segment of American society read, from the King James translation of the Bible, Genesis, Chapter 9, verses 18-27: quote: [18] And the sons of Noah, that went forth of the ark, were Shem, and Ham, and Japheth: and Ham is the father of Canaan. [19] These are the three sons of Noah: and of them was the whole earth overspread. [20] And Noah began to be an husbandman, and he planted a vineyard: [21] And he drank of the wine, and was drunken; and he was uncovered within his tent. [22] And Ham, the father of Canaan, saw the nakedness of his father, and told his two brethren without. [23] And Shem and Japheth took a garment, and laid it upon both their shoulders, and went backward, and covered the nakedness of their father; and their faces were backward, and they saw not their father's nakedness. [24] And Noah awoke from his wine, and knew what his younger son had done unto him. [25] And he said, Cursed be Canaan; a servant of servants shall he be unto his brethren. [26] And he said, Blessed be the LORD God of Shem; and Canaan shall be his servant. [27] God shall enlarge Japheth, and he shall dwell in the tents of Shem; and Canaan shall be his servant. Various Godly, Christian ministers whose churchmembers came from this segment of society, residing primarily in the Southern States, interpreted and taught from their pulpits that Blacks were the decendants of Ham and Canaan and therefore their slavery to Whites (the decendants of Japeth and Shem) was sanctioned by God. These ministers and their churches split from their fellow Baptists and became the Southern Baptist Convention. So, some Godly, Christian people will take the position that God abandoned the United States when it ended Black slavery, in defiance of what they believe is God's will. In my opinion as a Christian and as an American, I believe God has no greater concern or lesser concern about the government of the United States than God has about the governments of Kenya, Bolivia, Uzbekistan or the Grand Duchy of Luxembourg. In His eyes, everyone born on this Earth is equal, regardless of which nation they were accidentaly born into.", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "Originally posted by ACR26: If God was not meant to be a part of this countries governing...would we still have slavery?", 
        "reply": " Let me play \"Devil's Advocate\": In the period immediately preceding the American Civil War (and during that War), a segment of American society read, from the King James translation of the Bible, Genesis, Chapter 9, verses 18-27: quote: [18] And the sons of Noah, that went forth of the ark, were Shem, and Ham, and Japheth: and Ham is the father of Canaan. [19] These are the three sons of Noah: and of them was the whole earth overspread. [20] And Noah began to be an husbandman, and he planted a vineyard: [21] And he drank of the wine, and was drunken; and he was uncovered within his tent. [22] And Ham, the father of Canaan, saw the nakedness of his father, and told his two brethren without. [23] And Shem and Japheth took a garment, and laid it upon both their shoulders, and went backward, and covered the nakedness of their father; and their faces were backward, and they saw not their father's nakedness. [24] And Noah awoke from his wine, and knew what his younger son had done unto him. [25] And he said, Cursed be Canaan; a servant of servants shall he be unto his brethren. [26] And he said, Blessed be the LORD God of Shem; and Canaan shall be his servant. [27] God shall enlarge Japheth, and he shall dwell in the tents of Shem; and Canaan shall be his servant. Various Godly, Christian ministers whose churchmembers came from this segment of society, residing primarily in the Southern States, interpreted and taught from their pulpits that Blacks were the decendants of Ham and Canaan and therefore their slavery to Whites (the decendants of Japeth and Shem) was sanctioned by God. These ministers and their churches split from their fellow Baptists and became the Southern Baptist Convention. So, some Godly, Christian people will take the position that God abandoned the United States when it ended Black slavery, in defiance of what they believe is God's will. In my opinion as a Christian and as an American, I believe God has no greater concern or lesser concern about the government of the United States than God has about the governments of Kenya, Bolivia, Uzbekistan or the Grand Duchy of Luxembourg. In His eyes, everyone born on this Earth is equal, regardless of which nation they were accidentaly born into.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 12:18:00", 
        "title": "God and Country", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I venture to say that if God were NOT part of this countries beginnings we would NOT have this country. And the move today to remove God from the halls of this country is causing us to lose what we hold so dear. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "", 
        "reply": "I venture to say that if God were NOT part of this countries beginnings we would NOT have this country. And the move today to remove God from the halls of this country is causing us to lose what we hold so dear. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 13:40:00", 
        "title": "God and Country", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do.", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "part of this countries beginnings", 
        "reply": " I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 13:55:00", 
        "title": "God and Country", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "“We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness”", 
        "reply": " Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 14:07:00", 
        "title": "God and Country", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. Why would you believe that God would not bless other nations just because they do not share a Christian perspective? If it is God that blesses, and since almost every religion shares the basic tenets of His rules against killing and stealing and such, why must we limit Him to one theistic doctrine? See, I have accepted Christ as my savior. But I also believe that God the Father is way too big to assume that He only blesses people that believe a certain way. Putting limitations on God is an infantile idea, often espoused by the most narcissistic among us. So, as a Christian, I agree with you that other nations can and do have God's blessing. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "Originally posted by foxred03: quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do.", 
        "reply": " Why would you believe that God would not bless other nations just because they do not share a Christian perspective? If it is God that blesses, and since almost every religion shares the basic tenets of His rules against killing and stealing and such, why must we limit Him to one theistic doctrine? See, I have accepted Christ as my savior. But I also believe that God the Father is way too big to assume that He only blesses people that believe a certain way. Putting limitations on God is an infantile idea, often espoused by the most narcissistic among us. So, as a Christian, I agree with you that other nations can and do have God's blessing. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 14:19:00", 
        "title": "God and Country", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power.", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell.", 
        "reply": " The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 14:22:00", 
        "title": "God and Country", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power. Normally I would put aside such paranoid talk, but it is becomming evident that this line of thinking is true. Creator help us all Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by soscorpio: quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power.", 
        "reply": " Normally I would put aside such paranoid talk, but it is becomming evident that this line of thinking is true. Creator help us all Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 14:44:00", 
        "title": "God and Country", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Various Godly, Christian ministers whose churchmembers came from this segment of society, residing primarily in the Southern States, interpreted and taught from their pulpits that Blacks were the decendants of Ham and Canaan and therefore their slavery to Whites (the decendants of Japeth and Shem) was sanctioned by God. These ministers and their churches split from their fellow Baptists and became the Southern Baptist Convention. So, some Godly, Christian people will take the position that God abandoned the United States when it ended Black slavery, in defiance of what they believe is God's will. In my opinion as a Christian and as an American, I believe God has no greater concern or lesser concern about the government of the United States than God has about the governments of Kenya, Bolivia, Uzbekistan or the Grand Duchy of Luxembourg. In His eyes, everyone born on this Earth is equal, regardless of which nation they were accidentaly born into. This I think is slightly off of my thought process. I know what the bible says and I know that slavery is defended/evil in the bible. My thinking mainly stems from Pres Lincoln. He basically was the one who caused a civil war over the thinking that slavery is evil. He did not start the war for this I understand but his thinking was always aligned that way so it seems from what I can read about him (reading HIS words). He then took refuge in his heart that God would be on the Unions side to see us through to victory. Meanwhile many many members in congress were speaking of entering into talks with the South along with sections of the media. So Lincoln kept his strength in conviction because of God. The Creator being used in the Declaration is using what the term meant in 1776. The Creator was God to the vast majority of Congressmen who wrote/signed that document and the constitution. So. If no belief in God in Government, Abe would very possibly not been able to pursue the war as determinedly as he did.", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "Various Godly, Christian ministers whose churchmembers came from this segment of society, residing primarily in the Southern States, interpreted and taught from their pulpits that Blacks were the decendants of Ham and Canaan and therefore their slavery to Whites (the decendants of Japeth and Shem) was sanctioned by God. These ministers and their churches split from their fellow Baptists and became the Southern Baptist Convention. So, some Godly, Christian people will take the position that God abandoned the United States when it ended Black slavery, in defiance of what they believe is God's will. In my opinion as a Christian and as an American, I believe God has no greater concern or lesser concern about the government of the United States than God has about the governments of Kenya, Bolivia, Uzbekistan or the Grand Duchy of Luxembourg. In His eyes, everyone born on this Earth is equal, regardless of which nation they were accidentaly born into.", 
        "reply": " This I think is slightly off of my thought process. I know what the bible says and I know that slavery is defended/evil in the bible. My thinking mainly stems from Pres Lincoln. He basically was the one who caused a civil war over the thinking that slavery is evil. He did not start the war for this I understand but his thinking was always aligned that way so it seems from what I can read about him (reading HIS words). He then took refuge in his heart that God would be on the Unions side to see us through to victory. Meanwhile many many members in congress were speaking of entering into talks with the South along with sections of the media. So Lincoln kept his strength in conviction because of God. The Creator being used in the Declaration is using what the term meant in 1776. The Creator was God to the vast majority of Congressmen who wrote/signed that document and the constitution. So. If no belief in God in Government, Abe would very possibly not been able to pursue the war as determinedly as he did.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 15:24:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer.", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do.", 
        "reply": " This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 15:36:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by foxred03: quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. Why would you believe that God would not bless other nations just because they do not share a Christian perspective? If it is God that blesses, and since almost every religion shares the basic tenets of His rules against killing and stealing and such, why must we limit Him to one theistic doctrine? See, I have accepted Christ as my savior. But I also believe that God the Father is way too big to assume that He only blesses people that believe a certain way. Putting limitations on God is an infantile idea, often espoused by the most narcissistic among us. So, as a Christian, I agree with you that other nations can and do have God's blessing. I don't, but that is often the claim made by some of the religious fundementalists in our country. Thanks for explaining your ideas, it's nice to hear a deeper context to this.", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by foxred03: quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. Why would you believe that God would not bless other nations just because they do not share a Christian perspective? If it is God that blesses, and since almost every religion shares the basic tenets of His rules against killing and stealing and such, why must we limit Him to one theistic doctrine? See, I have accepted Christ as my savior. But I also believe that God the Father is way too big to assume that He only blesses people that believe a certain way. Putting limitations on God is an infantile idea, often espoused by the most narcissistic among us. So, as a Christian, I agree with you that other nations can and do have God's blessing.", 
        "reply": " I don't, but that is often the claim made by some of the religious fundementalists in our country. Thanks for explaining your ideas, it's nice to hear a deeper context to this.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 22:11:00", 
        "title": "God and Country", 
        "userID": "foxred03"
    }, 
    {
        "content": "It's vague. You'd think with such \"godly\" men writing it all down for us they would have been a little clearer or specific about us being a \"Godly\" nation or even Christian. It's the fact that they don't expand on that vague \"Creator\" talk that is interesting. What they don't say leave lots of room for \"creating\" a better nation from many non-religious sources rather than that which had more or less failed in Europe (Christiandom) They borrowed heavily from the free thinkers of the times: Kant, Mills, Bentham, etc more so than any religious ideas in a book. Matter of fact, several of the key players of \"Creator\" did not think a god was active in the lives of humans like the Bible portrays it... they didn't even believe the bible. (Some did, however.) So, as much as the \"Creator\" idea gets translated to a God idea.... our real creators were our parents.", 
        "intTime": 20090506, 
        "postID": 12, 
        "quote": "", 
        "reply": "It's vague. You'd think with such \"godly\" men writing it all down for us they would have been a little clearer or specific about us being a \"Godly\" nation or even Christian. It's the fact that they don't expand on that vague \"Creator\" talk that is interesting. What they don't say leave lots of room for \"creating\" a better nation from many non-religious sources rather than that which had more or less failed in Europe (Christiandom) They borrowed heavily from the free thinkers of the times: Kant, Mills, Bentham, etc more so than any religious ideas in a book. Matter of fact, several of the key players of \"Creator\" did not think a god was active in the lives of humans like the Bible portrays it... they didn't even believe the bible. (Some did, however.) So, as much as the \"Creator\" idea gets translated to a God idea.... our real creators were our parents.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 22:34:00", 
        "title": "God and Country", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by soscorpio: quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power. Normally I would put aside such paranoid talk, but it is becomming evident that this line of thinking is true. Creator help us all I agree at the direction we are headed. As an agnostic(the closest 'group' I can identify with), I'll leave the involvement of God, or lack of, to those with more insight than I have.", 
        "intTime": 20090507, 
        "postID": 13, 
        "quote": "Originally posted by L0A1: quote: Originally posted by soscorpio: quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power. Normally I would put aside such paranoid talk, but it is becomming evident that this line of thinking is true. Creator help us all", 
        "reply": " I agree at the direction we are headed. As an agnostic(the closest 'group' I can identify with), I'll leave the involvement of God, or lack of, to those with more insight than I have.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 01:39:00", 
        "title": "God and Country", 
        "userID": "carl.spackler"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation.", 
        "intTime": 20090507, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell.", 
        "reply": " Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 03:30:00", 
        "title": "God and Country", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 15, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation.", 
        "reply": " Here's to the Enlightenment Thinkers!...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 05:23:00", 
        "title": "God and Country", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France?? Wandering and Wondering", 
        "intTime": 20090507, 
        "postID": 16, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!......", 
        "reply": " Aren't they the ones that brought the Terror to France?? Wandering and Wondering", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 06:26:00", 
        "title": "God and Country", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: My thinking mainly stems from Pres Lincoln. He basically was the one who caused a civil war over the thinking that slavery is evil. He did not start the war for this I understand but his thinking was always aligned that way so it seems from what I can read about him (reading HIS words). He then took refuge in his heart that God would be on the Unions side to see us through to victory. Meanwhile many many members in congress were speaking of entering into talks with the South along with sections of the media. So Lincoln kept his strength in conviction because of God. This is false. You fail to realize that Lincoln was scrupulous in keeping his private feelings from what he saw as his official duty. He said as much in a famous letter in answer to an editorial by Horace Greeley. Lincoln propagated the war for one singular purpose: to preserve the Union he served. quote: I would save the Union. I would save it the shortest way under the Constitution. The sooner the national authority can be restored; the nearer the Union will be \"the Union as it was.\" If there be those who would not save the Union, unless they could at the same time save slavery, I do not agree with them. If there be those who would not save the Union unless they could at the same time destroy slavery, I do not agree with them. My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union. I shall do less whenever I shall believe what I am doing hurts the cause, and I shall do more whenever I shall believe doing more will help the cause. I shall try to correct errors when shown to be errors; and I shall adopt new views so fast as they shall appear to be true views. I have here stated my purpose according to my view of official duty; and I intend no modification of my oft-expressed personal wish that all men everywhere could be free. Abraham Lincoln August 2, 1862 Sullivan013", 
        "intTime": 20090507, 
        "postID": 17, 
        "quote": "My thinking mainly stems from Pres Lincoln. He basically was the one who caused a civil war over the thinking that slavery is evil. He did not start the war for this I understand but his thinking was always aligned that way so it seems from what I can read about him (reading HIS words). He then took refuge in his heart that God would be on the Unions side to see us through to victory. Meanwhile many many members in congress were speaking of entering into talks with the South along with sections of the media. So Lincoln kept his strength in conviction because of God.", 
        "reply": " This is false. You fail to realize that Lincoln was scrupulous in keeping his private feelings from what he saw as his official duty. He said as much in a famous letter in answer to an editorial by Horace Greeley. Lincoln propagated the war for one singular purpose: to preserve the Union he served. quote: I would save the Union. I would save it the shortest way under the Constitution. The sooner the national authority can be restored; the nearer the Union will be \"the Union as it was.\" If there be those who would not save the Union, unless they could at the same time save slavery, I do not agree with them. If there be those who would not save the Union unless they could at the same time destroy slavery, I do not agree with them. My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union. I shall do less whenever I shall believe what I am doing hurts the cause, and I shall do more whenever I shall believe doing more will help the cause. I shall try to correct errors when shown to be errors; and I shall adopt new views so fast as they shall appear to be true views. I have here stated my purpose according to my view of official duty; and I intend no modification of my oft-expressed personal wish that all men everywhere could be free. Abraham Lincoln August 2, 1862 Sullivan013", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 07:59:00", 
        "title": "God and Country", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France?? Some were, there were certainly a number of them involved in the revolution however many of them also bought it in the terror as the extremists for whom the \"good of the state\" was more important than individual liberty took over.", 
        "intTime": 20090507, 
        "postID": 18, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France??", 
        "reply": " Some were, there were certainly a number of them involved in the revolution however many of them also bought it in the terror as the extremists for whom the \"good of the state\" was more important than individual liberty took over.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 08:01:00", 
        "title": "God and Country", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France?? No the terror in France came because of the LONG term hate of the priviledged classes by those they had mistreated and the self serving people who took advantage of that hate to get power.", 
        "intTime": 20090507, 
        "postID": 19, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France??", 
        "reply": " No the terror in France came because of the LONG term hate of the priviledged classes by those they had mistreated and the self serving people who took advantage of that hate to get power.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 08:22:00", 
        "title": "God and Country", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: This is false. You fail to realize that Lincoln was scrupulous in keeping his private feelings from what he saw as his official duty. He said as much in a famous letter in answer to an editorial by Horace Greeley. Lincoln propagated the war for one singular purpose: to preserve the Union he served. quote: I would save the Union. I would save it the shortest way under the Constitution. The sooner the national authority can be restored; the nearer the Union will be \"the Union as it was.\" If there be those who would not save the Union, unless they could at the same time save slavery, I do not agree with them. If there be those who would not save the Union unless they could at the same time destroy slavery, I do not agree with them. My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union. I shall do less whenever I shall believe what I am doing hurts the cause, and I shall do more whenever I shall believe doing more will help the cause. I shall try to correct errors when shown to be errors; and I shall adopt new views so fast as they shall appear to be true views. I have here stated my purpose according to my view of official duty; and I intend no modification of my oft-expressed personal wish that all men everywhere could be free. Abraham Lincoln August 2, 1862 How could my thought process be false? I read the exact same quote in the memorial down below which was flanked and opposed by several other quotes where he had an evolution of thought. That is the context. One quote does not compete with several IMO. And again, the Creator is supported by a ton of additional info that it meant God to Abe, and the majority of the founders. I am not saying Christian specifically, but I am not saying space aliens arbitrarily. I take it that to some slavery would have ended on its own cognizance in the amount of time that it did?", 
        "intTime": 20090507, 
        "postID": 20, 
        "quote": "This is false. You fail to realize that Lincoln was scrupulous in keeping his private feelings from what he saw as his official duty. He said as much in a famous letter in answer to an editorial by Horace Greeley. Lincoln propagated the war for one singular purpose: to preserve the Union he served. quote: I would save the Union. I would save it the shortest way under the Constitution. The sooner the national authority can be restored; the nearer the Union will be \"the Union as it was.\" If there be those who would not save the Union, unless they could at the same time save slavery, I do not agree with them. If there be those who would not save the Union unless they could at the same time destroy slavery, I do not agree with them. My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union. I shall do less whenever I shall believe what I am doing hurts the cause, and I shall do more whenever I shall believe doing more will help the cause. I shall try to correct errors when shown to be errors; and I shall adopt new views so fast as they shall appear to be true views. I have here stated my purpose according to my view of official duty; and I intend no modification of my oft-expressed personal wish that all men everywhere could be free. Abraham Lincoln August 2, 1862", 
        "reply": " How could my thought process be false? I read the exact same quote in the memorial down below which was flanked and opposed by several other quotes where he had an evolution of thought. That is the context. One quote does not compete with several IMO. And again, the Creator is supported by a ton of additional info that it meant God to Abe, and the majority of the founders. I am not saying Christian specifically, but I am not saying space aliens arbitrarily. I take it that to some slavery would have ended on its own cognizance in the amount of time that it did?", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 11:34:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer. The Romans threw off their opressors and chose their own form of government. They were pretty successful. So successful that we modeled our government after their republic.", 
        "intTime": 20090507, 
        "postID": 21, 
        "quote": "Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer.", 
        "reply": " The Romans threw off their opressors and chose their own form of government. They were pretty successful. So successful that we modeled our government after their republic.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 13:05:00", 
        "title": "God and Country", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France?? No, the Terror was brought about by bureaucrats. Nobody thought Robespierre was an Enlightened thinker.", 
        "intTime": 20090507, 
        "postID": 22, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France??", 
        "reply": " No, the Terror was brought about by bureaucrats. Nobody thought Robespierre was an Enlightened thinker.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 13:08:00", 
        "title": "God and Country", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer. You need to get some more education about things outside the US. Here are a few examples * in 930AD in Iceland a constitution creating a form of democracy was created. The Icelandic Althing is the world's oldest practicing legislative assembly. Last I checked 930AD was BEFORE the US was established * Then there were governments such as that of the Iroquois league (est. before 1600AD) which was a MAJOR source for how the US government was organized. * If you take into account how the vote was originally restricted in the US then Athens is also an example of elected representative government and it was a few years before the US was established as well.", 
        "intTime": 20090507, 
        "postID": 23, 
        "quote": "Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer.", 
        "reply": " You need to get some more education about things outside the US. Here are a few examples * in 930AD in Iceland a constitution creating a form of democracy was created. The Icelandic Althing is the world's oldest practicing legislative assembly. Last I checked 930AD was BEFORE the US was established * Then there were governments such as that of the Iroquois league (est. before 1600AD) which was a MAJOR source for how the US government was organized. * If you take into account how the vote was originally restricted in the US then Athens is also an example of elected representative government and it was a few years before the US was established as well.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 14:30:00", 
        "title": "God and Country", 
        "userID": "rayld2"
    }, 
    {
        "content": "Many of the posts here clearly demonstrates why religion, any religion when comingled with a government/political system taints the process. For the most part, our Founders were not overly religious individuals. One need only read their letters, their writings to ascertain this simple fact. They were intelligent enough to realize invoking a belief in a deity was required under the conditions that existed at the time of our Founding. Regardless of whether they did, or not was not the guiding principle that led to our Revolution. The Revolution would have happened regardless of any belief in any religious doctrine...the Revolution came about due to the British and their treatment of the Colonies. Amazingly, we are critical of other nations that envoke religious doctrine as part of their political process. We denounce many countries for allowing religion to influence their destiny, and in fact, we feel obligated to change such a system simply because we are arrogant enough to believe our religious doctrine, the Christian doctrine is somehow dominant to other religious doctrine. History is littered with failed nations that relied on religious doctrine as their political guiding principles. America is no different, and the majority of American's are questioning the wisdom of allowing religious doctrine, no matter the religion to dictate political realities. S/F Gordon", 
        "intTime": 20090507, 
        "postID": 24, 
        "quote": "", 
        "reply": "Many of the posts here clearly demonstrates why religion, any religion when comingled with a government/political system taints the process. For the most part, our Founders were not overly religious individuals. One need only read their letters, their writings to ascertain this simple fact. They were intelligent enough to realize invoking a belief in a deity was required under the conditions that existed at the time of our Founding. Regardless of whether they did, or not was not the guiding principle that led to our Revolution. The Revolution would have happened regardless of any belief in any religious doctrine...the Revolution came about due to the British and their treatment of the Colonies. Amazingly, we are critical of other nations that envoke religious doctrine as part of their political process. We denounce many countries for allowing religion to influence their destiny, and in fact, we feel obligated to change such a system simply because we are arrogant enough to believe our religious doctrine, the Christian doctrine is somehow dominant to other religious doctrine. History is littered with failed nations that relied on religious doctrine as their political guiding principles. America is no different, and the majority of American's are questioning the wisdom of allowing religious doctrine, no matter the religion to dictate political realities. S/F Gordon", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 15:13:00", 
        "title": "God and Country", 
        "userID": "uh34d"
    }, 
    {
        "content": "Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant.", 
        "intTime": 20090507, 
        "postID": 25, 
        "quote": "", 
        "reply": "Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 15:22:00", 
        "title": "God and Country", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant. ......{hsssst}....RT; He's a Jarhead! S/F is shorthand for \"Semper fi\"...... It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090507, 
        "postID": 26, 
        "quote": "Originally posted by reducetension: Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant.", 
        "reply": " ......{hsssst}....RT; He's a Jarhead! S/F is shorthand for \"Semper fi\"...... It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 16:32:00", 
        "title": "God and Country", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer. You need to get some more education about things outside the US. Here are a few examples * in 930AD in Iceland a constitution creating a form of democracy was created. The Icelandic Althing is the world's oldest practicing legislative assembly. Last I checked 930AD was BEFORE the US was established * Then there were governments such as that of the Iroquois league (est. before 1600AD) which was a MAJOR source for how the US government was organized. * If you take into account how the vote was originally restricted in the US then Athens is also an example of elected representative government and it was a few years before the US was established as well. I'd dispute that Athens was a representative government in the modern sense, they only really elected officials (and even then all but the strategoi (generals) were elected by lot) and a sort of simple executive (also a lottery). Policy decisions were for the most part made by the citizenry as a whole at regular meetings - they pretty much had referenda on everything.", 
        "intTime": 20090507, 
        "postID": 27, 
        "quote": "Originally posted by rayld2: quote: Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer. You need to get some more education about things outside the US. Here are a few examples * in 930AD in Iceland a constitution creating a form of democracy was created. The Icelandic Althing is the world's oldest practicing legislative assembly. Last I checked 930AD was BEFORE the US was established * Then there were governments such as that of the Iroquois league (est. before 1600AD) which was a MAJOR source for how the US government was organized. * If you take into account how the vote was originally restricted in the US then Athens is also an example of elected representative government and it was a few years before the US was established as well.", 
        "reply": " I'd dispute that Athens was a representative government in the modern sense, they only really elected officials (and even then all but the strategoi (generals) were elected by lot) and a sort of simple executive (also a lottery). Policy decisions were for the most part made by the citizenry as a whole at regular meetings - they pretty much had referenda on everything.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 16:41:00", 
        "title": "God and Country", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "At the time of Plato and Aristotle, Athens only had about 30-50,000 voting age males. It just wasn't that big of a place... Maybe 150,000 people total at its height. Democracy can work under those conditions because every citizen was REQUIRED to be involved both in politics and the military. Failure to be involved, or being a troublesome person, meant immediate trial, imprisonment, execution, or exile. Socrates is the best known example of that - - Wandering and Wondering", 
        "intTime": 20090507, 
        "postID": 28, 
        "quote": "", 
        "reply": "At the time of Plato and Aristotle, Athens only had about 30-50,000 voting age males. It just wasn't that big of a place... Maybe 150,000 people total at its height. Democracy can work under those conditions because every citizen was REQUIRED to be involved both in politics and the military. Failure to be involved, or being a troublesome person, meant immediate trial, imprisonment, execution, or exile. Socrates is the best known example of that - - Wandering and Wondering", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 17:40:00", 
        "title": "God and Country", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: How could my thought process be false? Excellent. That's your first step in the true study of history. Question what you know, always. It opens whole new vistas of understanding. Re: Context. The problem with reading Lincoln's quotes on the memorial is that words in marble tend to blur the thought behind them. You must see the context in which those words were formed, the circumstances surrounding their authorship and even to whom they were conveyed. Lincoln was a complex man, perhaps one of the more complex who ever served in the office of President. A brilliant mind, but poorly read. A truely gifted speaker, but extraorinarily brief in his delivery (at a time when length of oratory was highly prized). A compassionate and deeply devout man, who did not attend nor join any church. Willing to approve some of the most drastic measures in curtailing civil rights, but freed the slaves by decree. Incredibly adept at managing his cabinet and the Congress, but completely inept as Commander in Chief. Sullivan013", 
        "intTime": 20090508, 
        "postID": 29, 
        "quote": "How could my thought process be false?", 
        "reply": " Excellent. That's your first step in the true study of history. Question what you know, always. It opens whole new vistas of understanding. Re: Context. The problem with reading Lincoln's quotes on the memorial is that words in marble tend to blur the thought behind them. You must see the context in which those words were formed, the circumstances surrounding their authorship and even to whom they were conveyed. Lincoln was a complex man, perhaps one of the more complex who ever served in the office of President. A brilliant mind, but poorly read. A truely gifted speaker, but extraorinarily brief in his delivery (at a time when length of oratory was highly prized). A compassionate and deeply devout man, who did not attend nor join any church. Willing to approve some of the most drastic measures in curtailing civil rights, but freed the slaves by decree. Incredibly adept at managing his cabinet and the Congress, but completely inept as Commander in Chief. Sullivan013", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-08 05:02:00", 
        "title": "God and Country", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Hide Post Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant. That was not the original question. I am asking would we still have slavery here in this country if not for God being referred to (Creator) in the Declaration, and in Abe Lincolns own beliefs.", 
        "intTime": 20090508, 
        "postID": 30, 
        "quote": "Hide Post Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant.", 
        "reply": " That was not the original question. I am asking would we still have slavery here in this country if not for God being referred to (Creator) in the Declaration, and in Abe Lincolns own beliefs.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-08 13:49:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "As I was standing there in the Lincoln Memorial reading the engravings and quotes below, and after a day of visiting the Washington Memorial, WWII, WWI, Korean, and Vietnam Memorial, I started to reflect on God and Country. It has taken me a while to formulate this thought but with a lot of additional reading, thinking, research and more thinking I pose this question. If God was not meant to be a part of this countries governing...would we still have slavery? My reasoning: A. President Lincoln would not have been able to continue the civil war with the huge loss of human life because of the determination factor. This thought process seems to come from Lincoln himself in several speeches including his second inaugural address. B. Because the clause “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” would not have existed.", 
        "intTime": 20090506, 
        "postID": 31, 
        "quote": "", 
        "reply": "As I was standing there in the Lincoln Memorial reading the engravings and quotes below, and after a day of visiting the Washington Memorial, WWII, WWI, Korean, and Vietnam Memorial, I started to reflect on God and Country. It has taken me a while to formulate this thought but with a lot of additional reading, thinking, research and more thinking I pose this question. If God was not meant to be a part of this countries governing...would we still have slavery? My reasoning: A. President Lincoln would not have been able to continue the civil war with the huge loss of human life because of the determination factor. This thought process seems to come from Lincoln himself in several speeches including his second inaugural address. B. Because the clause “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” would not have existed.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 11:55:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: If God was not meant to be a part of this countries governing...would we still have slavery? Let me play \"Devil's Advocate\": In the period immediately preceding the American Civil War (and during that War), a segment of American society read, from the King James translation of the Bible, Genesis, Chapter 9, verses 18-27: quote: [18] And the sons of Noah, that went forth of the ark, were Shem, and Ham, and Japheth: and Ham is the father of Canaan. [19] These are the three sons of Noah: and of them was the whole earth overspread. [20] And Noah began to be an husbandman, and he planted a vineyard: [21] And he drank of the wine, and was drunken; and he was uncovered within his tent. [22] And Ham, the father of Canaan, saw the nakedness of his father, and told his two brethren without. [23] And Shem and Japheth took a garment, and laid it upon both their shoulders, and went backward, and covered the nakedness of their father; and their faces were backward, and they saw not their father's nakedness. [24] And Noah awoke from his wine, and knew what his younger son had done unto him. [25] And he said, Cursed be Canaan; a servant of servants shall he be unto his brethren. [26] And he said, Blessed be the LORD God of Shem; and Canaan shall be his servant. [27] God shall enlarge Japheth, and he shall dwell in the tents of Shem; and Canaan shall be his servant. Various Godly, Christian ministers whose churchmembers came from this segment of society, residing primarily in the Southern States, interpreted and taught from their pulpits that Blacks were the decendants of Ham and Canaan and therefore their slavery to Whites (the decendants of Japeth and Shem) was sanctioned by God. These ministers and their churches split from their fellow Baptists and became the Southern Baptist Convention. So, some Godly, Christian people will take the position that God abandoned the United States when it ended Black slavery, in defiance of what they believe is God's will. In my opinion as a Christian and as an American, I believe God has no greater concern or lesser concern about the government of the United States than God has about the governments of Kenya, Bolivia, Uzbekistan or the Grand Duchy of Luxembourg. In His eyes, everyone born on this Earth is equal, regardless of which nation they were accidentaly born into.", 
        "intTime": 20090506, 
        "postID": 32, 
        "quote": "Originally posted by ACR26: If God was not meant to be a part of this countries governing...would we still have slavery?", 
        "reply": " Let me play \"Devil's Advocate\": In the period immediately preceding the American Civil War (and during that War), a segment of American society read, from the King James translation of the Bible, Genesis, Chapter 9, verses 18-27: quote: [18] And the sons of Noah, that went forth of the ark, were Shem, and Ham, and Japheth: and Ham is the father of Canaan. [19] These are the three sons of Noah: and of them was the whole earth overspread. [20] And Noah began to be an husbandman, and he planted a vineyard: [21] And he drank of the wine, and was drunken; and he was uncovered within his tent. [22] And Ham, the father of Canaan, saw the nakedness of his father, and told his two brethren without. [23] And Shem and Japheth took a garment, and laid it upon both their shoulders, and went backward, and covered the nakedness of their father; and their faces were backward, and they saw not their father's nakedness. [24] And Noah awoke from his wine, and knew what his younger son had done unto him. [25] And he said, Cursed be Canaan; a servant of servants shall he be unto his brethren. [26] And he said, Blessed be the LORD God of Shem; and Canaan shall be his servant. [27] God shall enlarge Japheth, and he shall dwell in the tents of Shem; and Canaan shall be his servant. Various Godly, Christian ministers whose churchmembers came from this segment of society, residing primarily in the Southern States, interpreted and taught from their pulpits that Blacks were the decendants of Ham and Canaan and therefore their slavery to Whites (the decendants of Japeth and Shem) was sanctioned by God. These ministers and their churches split from their fellow Baptists and became the Southern Baptist Convention. So, some Godly, Christian people will take the position that God abandoned the United States when it ended Black slavery, in defiance of what they believe is God's will. In my opinion as a Christian and as an American, I believe God has no greater concern or lesser concern about the government of the United States than God has about the governments of Kenya, Bolivia, Uzbekistan or the Grand Duchy of Luxembourg. In His eyes, everyone born on this Earth is equal, regardless of which nation they were accidentaly born into.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 12:18:00", 
        "title": "God and Country", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I venture to say that if God were NOT part of this countries beginnings we would NOT have this country. And the move today to remove God from the halls of this country is causing us to lose what we hold so dear. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090506, 
        "postID": 33, 
        "quote": "", 
        "reply": "I venture to say that if God were NOT part of this countries beginnings we would NOT have this country. And the move today to remove God from the halls of this country is causing us to lose what we hold so dear. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 13:40:00", 
        "title": "God and Country", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do.", 
        "intTime": 20090506, 
        "postID": 34, 
        "quote": "part of this countries beginnings", 
        "reply": " I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 13:55:00", 
        "title": "God and Country", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 35, 
        "quote": "“We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness”", 
        "reply": " Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 14:07:00", 
        "title": "God and Country", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. Why would you believe that God would not bless other nations just because they do not share a Christian perspective? If it is God that blesses, and since almost every religion shares the basic tenets of His rules against killing and stealing and such, why must we limit Him to one theistic doctrine? See, I have accepted Christ as my savior. But I also believe that God the Father is way too big to assume that He only blesses people that believe a certain way. Putting limitations on God is an infantile idea, often espoused by the most narcissistic among us. So, as a Christian, I agree with you that other nations can and do have God's blessing. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090506, 
        "postID": 36, 
        "quote": "Originally posted by foxred03: quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do.", 
        "reply": " Why would you believe that God would not bless other nations just because they do not share a Christian perspective? If it is God that blesses, and since almost every religion shares the basic tenets of His rules against killing and stealing and such, why must we limit Him to one theistic doctrine? See, I have accepted Christ as my savior. But I also believe that God the Father is way too big to assume that He only blesses people that believe a certain way. Putting limitations on God is an infantile idea, often espoused by the most narcissistic among us. So, as a Christian, I agree with you that other nations can and do have God's blessing. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 14:19:00", 
        "title": "God and Country", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power.", 
        "intTime": 20090506, 
        "postID": 37, 
        "quote": "Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell.", 
        "reply": " The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 14:22:00", 
        "title": "God and Country", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power. Normally I would put aside such paranoid talk, but it is becomming evident that this line of thinking is true. Creator help us all Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 38, 
        "quote": "Originally posted by soscorpio: quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power.", 
        "reply": " Normally I would put aside such paranoid talk, but it is becomming evident that this line of thinking is true. Creator help us all Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 14:44:00", 
        "title": "God and Country", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Various Godly, Christian ministers whose churchmembers came from this segment of society, residing primarily in the Southern States, interpreted and taught from their pulpits that Blacks were the decendants of Ham and Canaan and therefore their slavery to Whites (the decendants of Japeth and Shem) was sanctioned by God. These ministers and their churches split from their fellow Baptists and became the Southern Baptist Convention. So, some Godly, Christian people will take the position that God abandoned the United States when it ended Black slavery, in defiance of what they believe is God's will. In my opinion as a Christian and as an American, I believe God has no greater concern or lesser concern about the government of the United States than God has about the governments of Kenya, Bolivia, Uzbekistan or the Grand Duchy of Luxembourg. In His eyes, everyone born on this Earth is equal, regardless of which nation they were accidentaly born into. This I think is slightly off of my thought process. I know what the bible says and I know that slavery is defended/evil in the bible. My thinking mainly stems from Pres Lincoln. He basically was the one who caused a civil war over the thinking that slavery is evil. He did not start the war for this I understand but his thinking was always aligned that way so it seems from what I can read about him (reading HIS words). He then took refuge in his heart that God would be on the Unions side to see us through to victory. Meanwhile many many members in congress were speaking of entering into talks with the South along with sections of the media. So Lincoln kept his strength in conviction because of God. The Creator being used in the Declaration is using what the term meant in 1776. The Creator was God to the vast majority of Congressmen who wrote/signed that document and the constitution. So. If no belief in God in Government, Abe would very possibly not been able to pursue the war as determinedly as he did.", 
        "intTime": 20090506, 
        "postID": 39, 
        "quote": "Various Godly, Christian ministers whose churchmembers came from this segment of society, residing primarily in the Southern States, interpreted and taught from their pulpits that Blacks were the decendants of Ham and Canaan and therefore their slavery to Whites (the decendants of Japeth and Shem) was sanctioned by God. These ministers and their churches split from their fellow Baptists and became the Southern Baptist Convention. So, some Godly, Christian people will take the position that God abandoned the United States when it ended Black slavery, in defiance of what they believe is God's will. In my opinion as a Christian and as an American, I believe God has no greater concern or lesser concern about the government of the United States than God has about the governments of Kenya, Bolivia, Uzbekistan or the Grand Duchy of Luxembourg. In His eyes, everyone born on this Earth is equal, regardless of which nation they were accidentaly born into.", 
        "reply": " This I think is slightly off of my thought process. I know what the bible says and I know that slavery is defended/evil in the bible. My thinking mainly stems from Pres Lincoln. He basically was the one who caused a civil war over the thinking that slavery is evil. He did not start the war for this I understand but his thinking was always aligned that way so it seems from what I can read about him (reading HIS words). He then took refuge in his heart that God would be on the Unions side to see us through to victory. Meanwhile many many members in congress were speaking of entering into talks with the South along with sections of the media. So Lincoln kept his strength in conviction because of God. The Creator being used in the Declaration is using what the term meant in 1776. The Creator was God to the vast majority of Congressmen who wrote/signed that document and the constitution. So. If no belief in God in Government, Abe would very possibly not been able to pursue the war as determinedly as he did.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 15:24:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer.", 
        "intTime": 20090506, 
        "postID": 40, 
        "quote": "I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do.", 
        "reply": " This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 15:36:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by foxred03: quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. Why would you believe that God would not bless other nations just because they do not share a Christian perspective? If it is God that blesses, and since almost every religion shares the basic tenets of His rules against killing and stealing and such, why must we limit Him to one theistic doctrine? See, I have accepted Christ as my savior. But I also believe that God the Father is way too big to assume that He only blesses people that believe a certain way. Putting limitations on God is an infantile idea, often espoused by the most narcissistic among us. So, as a Christian, I agree with you that other nations can and do have God's blessing. I don't, but that is often the claim made by some of the religious fundementalists in our country. Thanks for explaining your ideas, it's nice to hear a deeper context to this.", 
        "intTime": 20090506, 
        "postID": 41, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by foxred03: quote: part of this countries beginnings I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. Why would you believe that God would not bless other nations just because they do not share a Christian perspective? If it is God that blesses, and since almost every religion shares the basic tenets of His rules against killing and stealing and such, why must we limit Him to one theistic doctrine? See, I have accepted Christ as my savior. But I also believe that God the Father is way too big to assume that He only blesses people that believe a certain way. Putting limitations on God is an infantile idea, often espoused by the most narcissistic among us. So, as a Christian, I agree with you that other nations can and do have God's blessing.", 
        "reply": " I don't, but that is often the claim made by some of the religious fundementalists in our country. Thanks for explaining your ideas, it's nice to hear a deeper context to this.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 22:11:00", 
        "title": "God and Country", 
        "userID": "foxred03"
    }, 
    {
        "content": "It's vague. You'd think with such \"godly\" men writing it all down for us they would have been a little clearer or specific about us being a \"Godly\" nation or even Christian. It's the fact that they don't expand on that vague \"Creator\" talk that is interesting. What they don't say leave lots of room for \"creating\" a better nation from many non-religious sources rather than that which had more or less failed in Europe (Christiandom) They borrowed heavily from the free thinkers of the times: Kant, Mills, Bentham, etc more so than any religious ideas in a book. Matter of fact, several of the key players of \"Creator\" did not think a god was active in the lives of humans like the Bible portrays it... they didn't even believe the bible. (Some did, however.) So, as much as the \"Creator\" idea gets translated to a God idea.... our real creators were our parents.", 
        "intTime": 20090506, 
        "postID": 42, 
        "quote": "", 
        "reply": "It's vague. You'd think with such \"godly\" men writing it all down for us they would have been a little clearer or specific about us being a \"Godly\" nation or even Christian. It's the fact that they don't expand on that vague \"Creator\" talk that is interesting. What they don't say leave lots of room for \"creating\" a better nation from many non-religious sources rather than that which had more or less failed in Europe (Christiandom) They borrowed heavily from the free thinkers of the times: Kant, Mills, Bentham, etc more so than any religious ideas in a book. Matter of fact, several of the key players of \"Creator\" did not think a god was active in the lives of humans like the Bible portrays it... they didn't even believe the bible. (Some did, however.) So, as much as the \"Creator\" idea gets translated to a God idea.... our real creators were our parents.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-06 22:34:00", 
        "title": "God and Country", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by soscorpio: quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power. Normally I would put aside such paranoid talk, but it is becomming evident that this line of thinking is true. Creator help us all I agree at the direction we are headed. As an agnostic(the closest 'group' I can identify with), I'll leave the involvement of God, or lack of, to those with more insight than I have.", 
        "intTime": 20090507, 
        "postID": 43, 
        "quote": "Originally posted by L0A1: quote: Originally posted by soscorpio: quote: Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. The young minds especially need to know this wisdom that Lincoln spoke about. Obama is in a perfect situation to lead people to these truths.....The Creator. But let's face it, gov't has a different agenda, and since all the institutions, are in their control, or in the control of those that finance the election campaigns of those in the up-most echelons of our gov't (academia, the the think-tanks, the media, well-financed propaganda groups, etc) we the people will continue to become slaves. Which ultimately secures the status quo ... those in power. Normally I would put aside such paranoid talk, but it is becomming evident that this line of thinking is true. Creator help us all", 
        "reply": " I agree at the direction we are headed. As an agnostic(the closest 'group' I can identify with), I'll leave the involvement of God, or lack of, to those with more insight than I have.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 01:39:00", 
        "title": "God and Country", 
        "userID": "carl.spackler"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation.", 
        "intTime": 20090507, 
        "postID": 44, 
        "quote": "Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell.", 
        "reply": " Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 03:30:00", 
        "title": "God and Country", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090507, 
        "postID": 45, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation.", 
        "reply": " Here's to the Enlightenment Thinkers!...... No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 05:23:00", 
        "title": "God and Country", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France?? Wandering and Wondering", 
        "intTime": 20090507, 
        "postID": 46, 
        "quote": "Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!......", 
        "reply": " Aren't they the ones that brought the Terror to France?? Wandering and Wondering", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 06:26:00", 
        "title": "God and Country", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: My thinking mainly stems from Pres Lincoln. He basically was the one who caused a civil war over the thinking that slavery is evil. He did not start the war for this I understand but his thinking was always aligned that way so it seems from what I can read about him (reading HIS words). He then took refuge in his heart that God would be on the Unions side to see us through to victory. Meanwhile many many members in congress were speaking of entering into talks with the South along with sections of the media. So Lincoln kept his strength in conviction because of God. This is false. You fail to realize that Lincoln was scrupulous in keeping his private feelings from what he saw as his official duty. He said as much in a famous letter in answer to an editorial by Horace Greeley. Lincoln propagated the war for one singular purpose: to preserve the Union he served. quote: I would save the Union. I would save it the shortest way under the Constitution. The sooner the national authority can be restored; the nearer the Union will be \"the Union as it was.\" If there be those who would not save the Union, unless they could at the same time save slavery, I do not agree with them. If there be those who would not save the Union unless they could at the same time destroy slavery, I do not agree with them. My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union. I shall do less whenever I shall believe what I am doing hurts the cause, and I shall do more whenever I shall believe doing more will help the cause. I shall try to correct errors when shown to be errors; and I shall adopt new views so fast as they shall appear to be true views. I have here stated my purpose according to my view of official duty; and I intend no modification of my oft-expressed personal wish that all men everywhere could be free. Abraham Lincoln August 2, 1862 Sullivan013", 
        "intTime": 20090507, 
        "postID": 47, 
        "quote": "My thinking mainly stems from Pres Lincoln. He basically was the one who caused a civil war over the thinking that slavery is evil. He did not start the war for this I understand but his thinking was always aligned that way so it seems from what I can read about him (reading HIS words). He then took refuge in his heart that God would be on the Unions side to see us through to victory. Meanwhile many many members in congress were speaking of entering into talks with the South along with sections of the media. So Lincoln kept his strength in conviction because of God.", 
        "reply": " This is false. You fail to realize that Lincoln was scrupulous in keeping his private feelings from what he saw as his official duty. He said as much in a famous letter in answer to an editorial by Horace Greeley. Lincoln propagated the war for one singular purpose: to preserve the Union he served. quote: I would save the Union. I would save it the shortest way under the Constitution. The sooner the national authority can be restored; the nearer the Union will be \"the Union as it was.\" If there be those who would not save the Union, unless they could at the same time save slavery, I do not agree with them. If there be those who would not save the Union unless they could at the same time destroy slavery, I do not agree with them. My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union. I shall do less whenever I shall believe what I am doing hurts the cause, and I shall do more whenever I shall believe doing more will help the cause. I shall try to correct errors when shown to be errors; and I shall adopt new views so fast as they shall appear to be true views. I have here stated my purpose according to my view of official duty; and I intend no modification of my oft-expressed personal wish that all men everywhere could be free. Abraham Lincoln August 2, 1862 Sullivan013", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 07:59:00", 
        "title": "God and Country", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France?? Some were, there were certainly a number of them involved in the revolution however many of them also bought it in the terror as the extremists for whom the \"good of the state\" was more important than individual liberty took over.", 
        "intTime": 20090507, 
        "postID": 48, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France??", 
        "reply": " Some were, there were certainly a number of them involved in the revolution however many of them also bought it in the terror as the extremists for whom the \"good of the state\" was more important than individual liberty took over.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 08:01:00", 
        "title": "God and Country", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France?? No the terror in France came because of the LONG term hate of the priviledged classes by those they had mistreated and the self serving people who took advantage of that hate to get power.", 
        "intTime": 20090507, 
        "postID": 49, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France??", 
        "reply": " No the terror in France came because of the LONG term hate of the priviledged classes by those they had mistreated and the self serving people who took advantage of that hate to get power.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 08:22:00", 
        "title": "God and Country", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: This is false. You fail to realize that Lincoln was scrupulous in keeping his private feelings from what he saw as his official duty. He said as much in a famous letter in answer to an editorial by Horace Greeley. Lincoln propagated the war for one singular purpose: to preserve the Union he served. quote: I would save the Union. I would save it the shortest way under the Constitution. The sooner the national authority can be restored; the nearer the Union will be \"the Union as it was.\" If there be those who would not save the Union, unless they could at the same time save slavery, I do not agree with them. If there be those who would not save the Union unless they could at the same time destroy slavery, I do not agree with them. My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union. I shall do less whenever I shall believe what I am doing hurts the cause, and I shall do more whenever I shall believe doing more will help the cause. I shall try to correct errors when shown to be errors; and I shall adopt new views so fast as they shall appear to be true views. I have here stated my purpose according to my view of official duty; and I intend no modification of my oft-expressed personal wish that all men everywhere could be free. Abraham Lincoln August 2, 1862 How could my thought process be false? I read the exact same quote in the memorial down below which was flanked and opposed by several other quotes where he had an evolution of thought. That is the context. One quote does not compete with several IMO. And again, the Creator is supported by a ton of additional info that it meant God to Abe, and the majority of the founders. I am not saying Christian specifically, but I am not saying space aliens arbitrarily. I take it that to some slavery would have ended on its own cognizance in the amount of time that it did?", 
        "intTime": 20090507, 
        "postID": 50, 
        "quote": "This is false. You fail to realize that Lincoln was scrupulous in keeping his private feelings from what he saw as his official duty. He said as much in a famous letter in answer to an editorial by Horace Greeley. Lincoln propagated the war for one singular purpose: to preserve the Union he served. quote: I would save the Union. I would save it the shortest way under the Constitution. The sooner the national authority can be restored; the nearer the Union will be \"the Union as it was.\" If there be those who would not save the Union, unless they could at the same time save slavery, I do not agree with them. If there be those who would not save the Union unless they could at the same time destroy slavery, I do not agree with them. My paramount object in this struggle is to save the Union, and is not either to save or to destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union; and what I forbear, I forbear because I do not believe it would help to save the Union. I shall do less whenever I shall believe what I am doing hurts the cause, and I shall do more whenever I shall believe doing more will help the cause. I shall try to correct errors when shown to be errors; and I shall adopt new views so fast as they shall appear to be true views. I have here stated my purpose according to my view of official duty; and I intend no modification of my oft-expressed personal wish that all men everywhere could be free. Abraham Lincoln August 2, 1862", 
        "reply": " How could my thought process be false? I read the exact same quote in the memorial down below which was flanked and opposed by several other quotes where he had an evolution of thought. That is the context. One quote does not compete with several IMO. And again, the Creator is supported by a ton of additional info that it meant God to Abe, and the majority of the founders. I am not saying Christian specifically, but I am not saying space aliens arbitrarily. I take it that to some slavery would have ended on its own cognizance in the amount of time that it did?", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 11:34:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer. The Romans threw off their opressors and chose their own form of government. They were pretty successful. So successful that we modeled our government after their republic.", 
        "intTime": 20090507, 
        "postID": 51, 
        "quote": "Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer.", 
        "reply": " The Romans threw off their opressors and chose their own form of government. They were pretty successful. So successful that we modeled our government after their republic.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 13:05:00", 
        "title": "God and Country", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France?? No, the Terror was brought about by bureaucrats. Nobody thought Robespierre was an Enlightened thinker.", 
        "intTime": 20090507, 
        "postID": 52, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by ProgMod: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness” Notice it does not say God. It's says \"Their creator\" which would depend on the persons belief. Some believe their creator is a sci fi book writer, others believe it's God still others believe it's the Universe. Do tell. Don't forget that for many enlightenment thinkers like many of your founding fathers \"creator\" was a non-religious description. In the absence of any other hypothesis they assumed that there must have been some creating agency but many thinkers saw absolutely no evidence that this agency knew or cared anything about what happened in said creation. Here's to the Enlightenment Thinkers!...... Aren't they the ones that brought the Terror to France??", 
        "reply": " No, the Terror was brought about by bureaucrats. Nobody thought Robespierre was an Enlightened thinker.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 13:08:00", 
        "title": "God and Country", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer. You need to get some more education about things outside the US. Here are a few examples * in 930AD in Iceland a constitution creating a form of democracy was created. The Icelandic Althing is the world's oldest practicing legislative assembly. Last I checked 930AD was BEFORE the US was established * Then there were governments such as that of the Iroquois league (est. before 1600AD) which was a MAJOR source for how the US government was organized. * If you take into account how the vote was originally restricted in the US then Athens is also an example of elected representative government and it was a few years before the US was established as well.", 
        "intTime": 20090507, 
        "postID": 53, 
        "quote": "Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer.", 
        "reply": " You need to get some more education about things outside the US. Here are a few examples * in 930AD in Iceland a constitution creating a form of democracy was created. The Icelandic Althing is the world's oldest practicing legislative assembly. Last I checked 930AD was BEFORE the US was established * Then there were governments such as that of the Iroquois league (est. before 1600AD) which was a MAJOR source for how the US government was organized. * If you take into account how the vote was originally restricted in the US then Athens is also an example of elected representative government and it was a few years before the US was established as well.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 14:30:00", 
        "title": "God and Country", 
        "userID": "rayld2"
    }, 
    {
        "content": "Many of the posts here clearly demonstrates why religion, any religion when comingled with a government/political system taints the process. For the most part, our Founders were not overly religious individuals. One need only read their letters, their writings to ascertain this simple fact. They were intelligent enough to realize invoking a belief in a deity was required under the conditions that existed at the time of our Founding. Regardless of whether they did, or not was not the guiding principle that led to our Revolution. The Revolution would have happened regardless of any belief in any religious doctrine...the Revolution came about due to the British and their treatment of the Colonies. Amazingly, we are critical of other nations that envoke religious doctrine as part of their political process. We denounce many countries for allowing religion to influence their destiny, and in fact, we feel obligated to change such a system simply because we are arrogant enough to believe our religious doctrine, the Christian doctrine is somehow dominant to other religious doctrine. History is littered with failed nations that relied on religious doctrine as their political guiding principles. America is no different, and the majority of American's are questioning the wisdom of allowing religious doctrine, no matter the religion to dictate political realities. S/F Gordon", 
        "intTime": 20090507, 
        "postID": 54, 
        "quote": "", 
        "reply": "Many of the posts here clearly demonstrates why religion, any religion when comingled with a government/political system taints the process. For the most part, our Founders were not overly religious individuals. One need only read their letters, their writings to ascertain this simple fact. They were intelligent enough to realize invoking a belief in a deity was required under the conditions that existed at the time of our Founding. Regardless of whether they did, or not was not the guiding principle that led to our Revolution. The Revolution would have happened regardless of any belief in any religious doctrine...the Revolution came about due to the British and their treatment of the Colonies. Amazingly, we are critical of other nations that envoke religious doctrine as part of their political process. We denounce many countries for allowing religion to influence their destiny, and in fact, we feel obligated to change such a system simply because we are arrogant enough to believe our religious doctrine, the Christian doctrine is somehow dominant to other religious doctrine. History is littered with failed nations that relied on religious doctrine as their political guiding principles. America is no different, and the majority of American's are questioning the wisdom of allowing religious doctrine, no matter the religion to dictate political realities. S/F Gordon", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 15:13:00", 
        "title": "God and Country", 
        "userID": "uh34d"
    }, 
    {
        "content": "Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant.", 
        "intTime": 20090507, 
        "postID": 55, 
        "quote": "", 
        "reply": "Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 15:22:00", 
        "title": "God and Country", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant. ......{hsssst}....RT; He's a Jarhead! S/F is shorthand for \"Semper fi\"...... It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090507, 
        "postID": 56, 
        "quote": "Originally posted by reducetension: Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant.", 
        "reply": " ......{hsssst}....RT; He's a Jarhead! S/F is shorthand for \"Semper fi\"...... It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 16:32:00", 
        "title": "God and Country", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer. You need to get some more education about things outside the US. Here are a few examples * in 930AD in Iceland a constitution creating a form of democracy was created. The Icelandic Althing is the world's oldest practicing legislative assembly. Last I checked 930AD was BEFORE the US was established * Then there were governments such as that of the Iroquois league (est. before 1600AD) which was a MAJOR source for how the US government was organized. * If you take into account how the vote was originally restricted in the US then Athens is also an example of elected representative government and it was a few years before the US was established as well. I'd dispute that Athens was a representative government in the modern sense, they only really elected officials (and even then all but the strategoi (generals) were elected by lot) and a sort of simple executive (also a lottery). Policy decisions were for the most part made by the citizenry as a whole at regular meetings - they pretty much had referenda on everything.", 
        "intTime": 20090507, 
        "postID": 57, 
        "quote": "Originally posted by rayld2: quote: Originally posted by ACR26: quote: I wonder what that actually means. Does it mean that the Founding Fathers asked God for wisdom, or that God truly did bless America, or does it mean something else? My own thought is that there are dozens of societies and countries which have existed for a much longer time than America, many have prospered too. Often times the majority of the people in these countries are not Christian or don't have the same level of religious fervor as we do. This is the first successful country started where mankind chose his own rule of government. Other countries as you call successful have been ruled by soooo many types of government from dictators, kings, warlords, to peaceful benefactors who have the ultimate say on and on. They were/are successful in their own right but this country is ruled by the people (republic). We do not have a dictator cutting off our heads if we dis-agree. We do not have kids turning in parents on a mass scale to the government. We are people who vote our office holders in or out. We are successful because of our type of government AND its' people. Our Government was formed from existing laws from many countries and religion. So I just reflect on the circumstances Lincoln had to face without God in the mix. I cannot see us getting rid of slavery without it. Not saying it couldn’t happen but it would take a lot longer. You need to get some more education about things outside the US. Here are a few examples * in 930AD in Iceland a constitution creating a form of democracy was created. The Icelandic Althing is the world's oldest practicing legislative assembly. Last I checked 930AD was BEFORE the US was established * Then there were governments such as that of the Iroquois league (est. before 1600AD) which was a MAJOR source for how the US government was organized. * If you take into account how the vote was originally restricted in the US then Athens is also an example of elected representative government and it was a few years before the US was established as well.", 
        "reply": " I'd dispute that Athens was a representative government in the modern sense, they only really elected officials (and even then all but the strategoi (generals) were elected by lot) and a sort of simple executive (also a lottery). Policy decisions were for the most part made by the citizenry as a whole at regular meetings - they pretty much had referenda on everything.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 16:41:00", 
        "title": "God and Country", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "At the time of Plato and Aristotle, Athens only had about 30-50,000 voting age males. It just wasn't that big of a place... Maybe 150,000 people total at its height. Democracy can work under those conditions because every citizen was REQUIRED to be involved both in politics and the military. Failure to be involved, or being a troublesome person, meant immediate trial, imprisonment, execution, or exile. Socrates is the best known example of that - - Wandering and Wondering", 
        "intTime": 20090507, 
        "postID": 58, 
        "quote": "", 
        "reply": "At the time of Plato and Aristotle, Athens only had about 30-50,000 voting age males. It just wasn't that big of a place... Maybe 150,000 people total at its height. Democracy can work under those conditions because every citizen was REQUIRED to be involved both in politics and the military. Failure to be involved, or being a troublesome person, meant immediate trial, imprisonment, execution, or exile. Socrates is the best known example of that - - Wandering and Wondering", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-07 17:40:00", 
        "title": "God and Country", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: How could my thought process be false? Excellent. That's your first step in the true study of history. Question what you know, always. It opens whole new vistas of understanding. Re: Context. The problem with reading Lincoln's quotes on the memorial is that words in marble tend to blur the thought behind them. You must see the context in which those words were formed, the circumstances surrounding their authorship and even to whom they were conveyed. Lincoln was a complex man, perhaps one of the more complex who ever served in the office of President. A brilliant mind, but poorly read. A truely gifted speaker, but extraorinarily brief in his delivery (at a time when length of oratory was highly prized). A compassionate and deeply devout man, who did not attend nor join any church. Willing to approve some of the most drastic measures in curtailing civil rights, but freed the slaves by decree. Incredibly adept at managing his cabinet and the Congress, but completely inept as Commander in Chief. Sullivan013", 
        "intTime": 20090508, 
        "postID": 59, 
        "quote": "How could my thought process be false?", 
        "reply": " Excellent. That's your first step in the true study of history. Question what you know, always. It opens whole new vistas of understanding. Re: Context. The problem with reading Lincoln's quotes on the memorial is that words in marble tend to blur the thought behind them. You must see the context in which those words were formed, the circumstances surrounding their authorship and even to whom they were conveyed. Lincoln was a complex man, perhaps one of the more complex who ever served in the office of President. A brilliant mind, but poorly read. A truely gifted speaker, but extraorinarily brief in his delivery (at a time when length of oratory was highly prized). A compassionate and deeply devout man, who did not attend nor join any church. Willing to approve some of the most drastic measures in curtailing civil rights, but freed the slaves by decree. Incredibly adept at managing his cabinet and the Congress, but completely inept as Commander in Chief. Sullivan013", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-08 05:02:00", 
        "title": "God and Country", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Hide Post Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant. That was not the original question. I am asking would we still have slavery here in this country if not for God being referred to (Creator) in the Declaration, and in Abe Lincolns own beliefs.", 
        "intTime": 20090508, 
        "postID": 60, 
        "quote": "Hide Post Very good, S/F Gordon! When has more of God made things better? You just have people fighting over which God and who speaks for that God. Getting the God filter off the scene was brilliant.", 
        "reply": " That was not the original question. I am asking would we still have slavery here in this country if not for God being referred to (Creator) in the Declaration, and in Abe Lincolns own beliefs.", 
        "threadID": "409192893_9360046222001", 
        "time": "2009-05-08 13:49:00", 
        "title": "God and Country", 
        "userID": "ACR26"
    }
]