[
    {
        "content": "how is this a photoshop job??? maybe its a guy and his duaghter..??? i really dont think it is a ps job maybe you can point it out.... i am sure you can find the real pic if it is a fake one...", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": "how is this a photoshop job??? maybe its a guy and his duaghter..??? i really dont think it is a ps job maybe you can point it out.... i am sure you can find the real pic if it is a fake one...", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 08:19:00", 
        "title": "photoshop pics..", 
        "userID": "outlaws93"
    }, 
    {
        "content": "p.s. it doesn't looked shopped at all", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "", 
        "reply": "p.s. it doesn't looked shopped at all", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 08:33:00", 
        "title": "photoshop pics..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "AMEN!!!! TEA party supporter.", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "AMEN!!!! TEA party supporter.", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 08:56:00", 
        "title": "photoshop pics..", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "i sure hope it is photoshopped. because that is one scary woman, scary message, and one ludicrus poster.", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "", 
        "reply": "i sure hope it is photoshopped. because that is one scary woman, scary message, and one ludicrus poster.", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 09:09:00", 
        "title": "photoshop pics..", 
        "userID": "Elesso"
    }, 
    {
        "content": "she has a military stuff on her hat too... i seriously doubt that is photoshopped... the shadow on the guy is from the sign...", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "", 
        "reply": "she has a military stuff on her hat too... i seriously doubt that is photoshopped... the shadow on the guy is from the sign...", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 09:33:00", 
        "title": "photoshop pics..", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Check out her right hand. And the book cover projecting from under her sign. The shadow on the guys cheek is not from the sign, wrong place for the way the sun is shining. The shadow on the grund, where is the beret. What's up with the shop rag under the book under the sign. Yeah, it's no photoshop. Dp a search for the picture.", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "", 
        "reply": "Check out her right hand. And the book cover projecting from under her sign. The shadow on the guys cheek is not from the sign, wrong place for the way the sun is shining. The shadow on the grund, where is the beret. What's up with the shop rag under the book under the sign. Yeah, it's no photoshop. Dp a search for the picture.", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 09:48:00", 
        "title": "photoshop pics..", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: she has a military stuff on her hat too... i seriously doubt that is photoshopped... the shadow on the guy is from the sign... It is photoshopped, look at the REAL sign behind it, you can see the bottom right of the cardboard barcode. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "Originally posted by outlaws93: she has a military stuff on her hat too... i seriously doubt that is photoshopped... the shadow on the guy is from the sign...", 
        "reply": " It is photoshopped, look at the REAL sign behind it, you can see the bottom right of the cardboard barcode. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 09:54:00", 
        "title": "photoshop pics..", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by transport1: Check out her right hand. And the book cover projecting from under her sign. The shadow on the guys cheek is not from the sign, wrong place for the way the sun is shining. The shadow on the grund, where is the beret. What's up with the shop rag under the book under the sign. Yeah, it's no photoshop. Dp a search for the picture. I noticed the same things. It's photoshopped. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "Originally posted by transport1: Check out her right hand. And the book cover projecting from under her sign. The shadow on the guys cheek is not from the sign, wrong place for the way the sun is shining. The shadow on the grund, where is the beret. What's up with the shop rag under the book under the sign. Yeah, it's no photoshop. Dp a search for the picture.", 
        "reply": " I noticed the same things. It's photoshopped. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 09:55:00", 
        "title": "photoshop pics..", 
        "userID": "L0A1"
    }, 
    {
        "content": "oh ok i see the sign is photoshopped???", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "", 
        "reply": "oh ok i see the sign is photoshopped???", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 09:55:00", 
        "title": "photoshop pics..", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: oh ok i see the sign is photoshopped??? No the WHOLE sign was layered into another photo. As a matter of fact, my photoshop identified 3 layers so far. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "Originally posted by outlaws93: oh ok i see the sign is photoshopped???", 
        "reply": " No the WHOLE sign was layered into another photo. As a matter of fact, my photoshop identified 3 layers so far. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 09:57:00", 
        "title": "photoshop pics..", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by outlaws93: oh ok i see the sign is photoshopped??? No the WHOLE sign was layered into another photo. As a matter of fact, my photoshop identified 3 layers so far. now i need to get that program...", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "Originally posted by L0A1: quote: Originally posted by outlaws93: oh ok i see the sign is photoshopped??? No the WHOLE sign was layered into another photo. As a matter of fact, my photoshop identified 3 layers so far.", 
        "reply": " now i need to get that program...", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 10:01:00", 
        "title": "photoshop pics..", 
        "userID": "outlaws93"
    }, 
    {
        "content": "well the spec ops community is really a small one does anyone knows this guy???", 
        "intTime": 20090417, 
        "postID": 12, 
        "quote": "", 
        "reply": "well the spec ops community is really a small one does anyone knows this guy???", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 10:06:00", 
        "title": "photoshop pics..", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Huffpo strikes again!", 
        "intTime": 20090417, 
        "postID": 13, 
        "quote": "", 
        "reply": "Huffpo strikes again!", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 10:40:00", 
        "title": "photoshop pics..", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: The shadow on his face could be from the bill of her cap. that is what I was thinking. Definately a photoshop, and not a very good one.", 
        "intTime": 20090417, 
        "postID": 14, 
        "quote": "Originally posted by SSgtRobertMorris: The shadow on his face could be from the bill of her cap.", 
        "reply": " that is what I was thinking. Definately a photoshop, and not a very good one.", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 10:59:00", 
        "title": "photoshop pics..", 
        "userID": "sw614"
    }, 
    {
        "content": "I can tell you that the color was definitely adjusted, saturation levels tweaked, but it's hard to say whether the sign was pasted in there or not... Comparing the shadows and the 4 seperate angles that the light is coming from, if it wasn't photoshopped in then there were some HUGE photography lights to be throwing shadows like that. Looking at the shadow on the ground though, it doesn't match up with her angle, hand position or the wooden post on the sign... the sign was hand written, but it's bending the wrong way in the wind (look at her hair) So professional opinion is that the photo is an original as in the couple and the place, but the sign was added in.", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "", 
        "reply": "I can tell you that the color was definitely adjusted, saturation levels tweaked, but it's hard to say whether the sign was pasted in there or not... Comparing the shadows and the 4 seperate angles that the light is coming from, if it wasn't photoshopped in then there were some HUGE photography lights to be throwing shadows like that. Looking at the shadow on the ground though, it doesn't match up with her angle, hand position or the wooden post on the sign... the sign was hand written, but it's bending the wrong way in the wind (look at her hair) So professional opinion is that the photo is an original as in the couple and the place, but the sign was added in.", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 12:27:00", 
        "title": "photoshop pics..", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: I can tell you that the color was definitely adjusted, saturation levels tweaked, but it's hard to say whether the sign was pasted in there or not... Comparing the shadows and the 4 seperate angles that the light is coming from, if it wasn't photoshopped in then there were some HUGE photography lights to be throwing shadows like that. Looking at the shadow on the ground though, it doesn't match up with her angle, hand position or the wooden post on the sign... the sign was hand written, but it's bending the wrong way in the wind (look at her hair) So professional opinion is that the photo is an original as in the couple and the place, but the sign was added in. If you have photoshop, you can dvide layers and see that the sign is super imposed (layered) into the photo Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 16, 
        "quote": "Originally posted by armywifefigueroa: I can tell you that the color was definitely adjusted, saturation levels tweaked, but it's hard to say whether the sign was pasted in there or not... Comparing the shadows and the 4 seperate angles that the light is coming from, if it wasn't photoshopped in then there were some HUGE photography lights to be throwing shadows like that. Looking at the shadow on the ground though, it doesn't match up with her angle, hand position or the wooden post on the sign... the sign was hand written, but it's bending the wrong way in the wind (look at her hair) So professional opinion is that the photo is an original as in the couple and the place, but the sign was added in.", 
        "reply": " If you have photoshop, you can dvide layers and see that the sign is super imposed (layered) into the photo Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 12:32:00", 
        "title": "photoshop pics..", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well the spec ops community is really a small one does anyone knows this guy??? It would be hard to recognise someone you weren't close with at his age. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "Originally posted by outlaws93: well the spec ops community is really a small one does anyone knows this guy???", 
        "reply": " It would be hard to recognise someone you weren't close with at his age. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 12:35:00", 
        "title": "photoshop pics..", 
        "userID": "L0A1"
    }, 
    {
        "content": "Can you reference this discussion i.e. what is the context of this thread? Was this pic taken then altered and used to show the tea party in a negative light?", 
        "intTime": 20090417, 
        "postID": 18, 
        "quote": "", 
        "reply": "Can you reference this discussion i.e. what is the context of this thread? Was this pic taken then altered and used to show the tea party in a negative light?", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 12:41:00", 
        "title": "photoshop pics..", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by armywifefigueroa: I can tell you that the color was definitely adjusted, saturation levels tweaked, but it's hard to say whether the sign was pasted in there or not... Comparing the shadows and the 4 seperate angles that the light is coming from, if it wasn't photoshopped in then there were some HUGE photography lights to be throwing shadows like that. Looking at the shadow on the ground though, it doesn't match up with her angle, hand position or the wooden post on the sign... the sign was hand written, but it's bending the wrong way in the wind (look at her hair) So professional opinion is that the photo is an original as in the couple and the place, but the sign was added in. If you have photoshop, you can dvide layers and see that the sign is super imposed (layered) into the photo In photoshop, once a photo has been flattened, you can't redefine the layers unless you manually do it... at least not to my knowledge.", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "Originally posted by L0A1: quote: Originally posted by armywifefigueroa: I can tell you that the color was definitely adjusted, saturation levels tweaked, but it's hard to say whether the sign was pasted in there or not... Comparing the shadows and the 4 seperate angles that the light is coming from, if it wasn't photoshopped in then there were some HUGE photography lights to be throwing shadows like that. Looking at the shadow on the ground though, it doesn't match up with her angle, hand position or the wooden post on the sign... the sign was hand written, but it's bending the wrong way in the wind (look at her hair) So professional opinion is that the photo is an original as in the couple and the place, but the sign was added in. If you have photoshop, you can dvide layers and see that the sign is super imposed (layered) into the photo", 
        "reply": " In photoshop, once a photo has been flattened, you can't redefine the layers unless you manually do it... at least not to my knowledge.", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 12:51:00", 
        "title": "photoshop pics..", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: quote: Originally posted by L0A1: quote: Originally posted by armywifefigueroa: I can tell you that the color was definitely adjusted, saturation levels tweaked, but it's hard to say whether the sign was pasted in there or not... Comparing the shadows and the 4 seperate angles that the light is coming from, if it wasn't photoshopped in then there were some HUGE photography lights to be throwing shadows like that. Looking at the shadow on the ground though, it doesn't match up with her angle, hand position or the wooden post on the sign... the sign was hand written, but it's bending the wrong way in the wind (look at her hair) So professional opinion is that the photo is an original as in the couple and the place, but the sign was added in. If you have photoshop, you can dvide layers and see that the sign is super imposed (layered) into the photo In photoshop, once a photo has been flattened, you can't redefine the layers unless you manually do it... at least not to my knowledge. I was wondering about the same thing. I was just focused on the shadow that goes right and the light coming from the right. (And still it would need a closer look, since nature often doesn't look natural.)", 
        "intTime": 20090417, 
        "postID": 20, 
        "quote": "Originally posted by armywifefigueroa: quote: Originally posted by L0A1: quote: Originally posted by armywifefigueroa: I can tell you that the color was definitely adjusted, saturation levels tweaked, but it's hard to say whether the sign was pasted in there or not... Comparing the shadows and the 4 seperate angles that the light is coming from, if it wasn't photoshopped in then there were some HUGE photography lights to be throwing shadows like that. Looking at the shadow on the ground though, it doesn't match up with her angle, hand position or the wooden post on the sign... the sign was hand written, but it's bending the wrong way in the wind (look at her hair) So professional opinion is that the photo is an original as in the couple and the place, but the sign was added in. If you have photoshop, you can dvide layers and see that the sign is super imposed (layered) into the photo In photoshop, once a photo has been flattened, you can't redefine the layers unless you manually do it... at least not to my knowledge.", 
        "reply": " I was wondering about the same thing. I was just focused on the shadow that goes right and the light coming from the right. (And still it would need a closer look, since nature often doesn't look natural.)", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 13:34:00", 
        "title": "photoshop pics..", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "The biggest concern that I have is the 4 different light sources... the only explanation would be that this was taken by a news photographer that had lights set up specifically for it... other than that, I'd need a high res. file to be able to look closely enough at it to tell...", 
        "intTime": 20090417, 
        "postID": 21, 
        "quote": "", 
        "reply": "The biggest concern that I have is the 4 different light sources... the only explanation would be that this was taken by a news photographer that had lights set up specifically for it... other than that, I'd need a high res. file to be able to look closely enough at it to tell...", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 14:04:00", 
        "title": "photoshop pics..", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: The biggest concern that I have is the 4 different light sources... the only explanation would be that this was taken by a news photographer that had lights set up specifically for it... other than that, I'd need a high res. file to be able to look closely enough at it to tell... This is starting to get fun, just looking at it without comparing any packaging marks (not bored enough to do that even though I'm sick, and it would require that they didn't use higher resolution images for the composition). The curvature of the lens might also give a clue (see the difference between the first two characters and the people on the background - the people on the background should be smaller, unless the man is tilting to his left to be seen over the sign - either way, the sign seems to be coming from someone outside the photo). And the shadows don't seem to match up even with flashes (and I'd say the man's shadow is too strong for such a strong light coming from the right) - see the man's shirt and his shadow, compared to the sign. (or maybe the light on the right doesn't hit the shadow on the ground...)", 
        "intTime": 20090417, 
        "postID": 22, 
        "quote": "Originally posted by armywifefigueroa: The biggest concern that I have is the 4 different light sources... the only explanation would be that this was taken by a news photographer that had lights set up specifically for it... other than that, I'd need a high res. file to be able to look closely enough at it to tell...", 
        "reply": " This is starting to get fun, just looking at it without comparing any packaging marks (not bored enough to do that even though I'm sick, and it would require that they didn't use higher resolution images for the composition). The curvature of the lens might also give a clue (see the difference between the first two characters and the people on the background - the people on the background should be smaller, unless the man is tilting to his left to be seen over the sign - either way, the sign seems to be coming from someone outside the photo). And the shadows don't seem to match up even with flashes (and I'd say the man's shadow is too strong for such a strong light coming from the right) - see the man's shirt and his shadow, compared to the sign. (or maybe the light on the right doesn't hit the shadow on the ground...)", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 14:39:00", 
        "title": "photoshop pics..", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: how is this a photoshop job??? maybe its a guy and his duaghter..??? i really dont think it is a ps job maybe you can point it out.... i am sure you can find the real pic if it is a fake one... Who is holding that sign ? If the woman behind is holding it it is a very uncomfortable grip she is using. Look at the shadow to the right, you can recognize the shadow from the woman and sign. But if that shadow is true, then then man just behind her should also show a large shadow from the sign. He does not. instead it looks like the sun is shining at him from the opposite side as it shines on her. So I conclude that the image is mixed together in 3 parts. the man have been added slightly behind the woman, and a sign have been added in front of her (drawn in I think, notice how the edges of the plachard have no depth). A do not recognize either of these people, but I assume their identities (and political affiliation) is important. If you know, please tell me. regards JakobA \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090417, 
        "postID": 23, 
        "quote": "Originally posted by outlaws93: how is this a photoshop job??? maybe its a guy and his duaghter..??? i really dont think it is a ps job maybe you can point it out.... i am sure you can find the real pic if it is a fake one...", 
        "reply": " Who is holding that sign ? If the woman behind is holding it it is a very uncomfortable grip she is using. Look at the shadow to the right, you can recognize the shadow from the woman and sign. But if that shadow is true, then then man just behind her should also show a large shadow from the sign. He does not. instead it looks like the sun is shining at him from the opposite side as it shines on her. So I conclude that the image is mixed together in 3 parts. the man have been added slightly behind the woman, and a sign have been added in front of her (drawn in I think, notice how the edges of the plachard have no depth). A do not recognize either of these people, but I assume their identities (and political affiliation) is important. If you know, please tell me. regards JakobA \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 15:18:00", 
        "title": "photoshop pics..", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "quote: Originally posted by JakobA_DK: quote: Originally posted by outlaws93: how is this a photoshop job??? maybe its a guy and his duaghter..??? i really dont think it is a ps job maybe you can point it out.... i am sure you can find the real pic if it is a fake one... Who is holding that sign ? If the woman behind is holding it it is a very uncomfortable grip she is using. Look at the shadow to the right, you can recognize the shadow from the woman and sign. But if that shadow is true, then then man just behind her should also show a large shadow from the sign. He does not. instead it looks like the sun is shining at him from the opposite side as it shines on her. So I conclude that the image is mixed together in 3 parts. the man have been added slightly behind the woman, and a sign have been added in front of her (drawn in I think, notice how the edges of the plachard have no depth). A do not recognize either of these people, but I assume their identities (and political affiliation) is important. If you know, please tell me. regards JakobA I'm too drunk to disagree with anything else, so I'll just disagree in that the hard light cannot be sunlight because it's not warm enough. Sunlight goes through many layers of the atmosphere, and ends up looking more red-tinted (3200K? or was it 2300K? can't really say but caol ila is still a nice color). Oh right, and there's three lights (not four, I think?), and the man and woman on the front are from the same picture.", 
        "intTime": 20090417, 
        "postID": 24, 
        "quote": "Originally posted by JakobA_DK: quote: Originally posted by outlaws93: how is this a photoshop job??? maybe its a guy and his duaghter..??? i really dont think it is a ps job maybe you can point it out.... i am sure you can find the real pic if it is a fake one... Who is holding that sign ? If the woman behind is holding it it is a very uncomfortable grip she is using. Look at the shadow to the right, you can recognize the shadow from the woman and sign. But if that shadow is true, then then man just behind her should also show a large shadow from the sign. He does not. instead it looks like the sun is shining at him from the opposite side as it shines on her. So I conclude that the image is mixed together in 3 parts. the man have been added slightly behind the woman, and a sign have been added in front of her (drawn in I think, notice how the edges of the plachard have no depth). A do not recognize either of these people, but I assume their identities (and political affiliation) is important. If you know, please tell me. regards JakobA", 
        "reply": " I'm too drunk to disagree with anything else, so I'll just disagree in that the hard light cannot be sunlight because it's not warm enough. Sunlight goes through many layers of the atmosphere, and ends up looking more red-tinted (3200K? or was it 2300K? can't really say but caol ila is still a nice color). Oh right, and there's three lights (not four, I think?), and the man and woman on the front are from the same picture.", 
        "threadID": "409192893_5880010122001", 
        "time": "2009-04-17 20:40:00", 
        "title": "photoshop pics..", 
        "userID": "2nd_freedomfighter"
    }
]