[
    {
        "content": "I am not very religious but wtf? Most people wouldnt know what IHS was anyway. Besides that inscription was several feet above his head so the flag excuse is lame and smoke and mirrors. Sorry WH and PrezBo we are a Christian nation no matter how you try to cover it up quote: 'http://www.foxnews.com/politics/first100days/2009/04/16/georgetown-university-hid-religious-symbols-white-house-request/' The monogram IHS, whose letters spell out the name of Jesus, and which normally perches above the stage in Gaston Hall where the president spoke, was covered over with what appeared to be black wood during the address… “Decisions made about the backdrop for the speech were made to have a consistent background of American flags, which is standard for many presidential events,” said White House spokesman Shin Inouye in a statement released Thursday… Bill Donohue, president of the Catholic League, accused the university of “cowardice” for acceding to the White House, and criticized Obama’s team for asking a religious school to “neuter itself” before the president made his address. The offending IHS inscription. The black plywood cover for that offensive inscription. With the flag excuse.", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "'http://www.foxnews.com/politics/first100days/2009/04/16/georgetown-university-hid-religious-symbols-white-house-request/' The monogram IHS, whose letters spell out the name of Jesus, and which normally perches above the stage in Gaston Hall where the president spoke, was covered over with what appeared to be black wood during the address… “Decisions made about the backdrop for the speech were made to have a consistent background of American flags, which is standard for many presidential events,” said White House spokesman Shin Inouye in a statement released Thursday… Bill Donohue, president of the Catholic League, accused the university of “cowardice” for acceding to the White House, and criticized Obama’s team for asking a religious school to “neuter itself” before the president made his address.", 
        "reply": "I am not very religious but wtf? Most people wouldnt know what IHS was anyway. Besides that inscription was several feet above his head so the flag excuse is lame and smoke and mirrors. Sorry WH and PrezBo we are a Christian nation no matter how you try to cover it up  The offending IHS inscription. The black plywood cover for that offensive inscription. With the flag excuse.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 06:36:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "That was extremely RUDE", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "", 
        "reply": "That was extremely RUDE", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 06:38:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "stormer73"
    }, 
    {
        "content": "Wonder if the University would consider thier act as denying the Christ in front of the world.", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "Wonder if the University would consider thier act as denying the Christ in front of the world.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 06:40:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "transport1"
    }, 
    {
        "content": "The President was making an address to the nation, not leading a prayer service. He was asked to speak from that location, which is fine, but we don't need the mixed imagery of our elected officials and religion, as if one was endorsing the other. Personally, I would have preferred that they simply pick a secular location for the speech, but seeing as they didn't, I see no problem with redecorating a podium and backdrop to make it appropriate for a secular political speech. And Gunny, you can scream and cry all you want that this is a \"Christian nation,\" and it's true that the majority of Americans come from one of several Christian backgrounds (although not all of those are particularly religious), but our government is NOT affiliated with any religion, and it shouldn't be. Our government, and our nation as a political (not cultural) entity, is secular. Likewise, as a comparative example, Turkey is a culturally Muslim nation, but has an absolutely secular government, and the people of Turkey are quite proud of that. Once upon a time, Americans used to be proud of our secular government and freedom of religion. This move to shove religion into politics comes in waves throughout our history, and it's always irritating when it does. Good for our current President, not shoving religion down the throats of Americans.", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "", 
        "reply": "The President was making an address to the nation, not leading a prayer service. He was asked to speak from that location, which is fine, but we don't need the mixed imagery of our elected officials and religion, as if one was endorsing the other. Personally, I would have preferred that they simply pick a secular location for the speech, but seeing as they didn't, I see no problem with redecorating a podium and backdrop to make it appropriate for a secular political speech. And Gunny, you can scream and cry all you want that this is a \"Christian nation,\" and it's true that the majority of Americans come from one of several Christian backgrounds (although not all of those are particularly religious), but our government is NOT affiliated with any religion, and it shouldn't be. Our government, and our nation as a political (not cultural) entity, is secular. Likewise, as a comparative example, Turkey is a culturally Muslim nation, but has an absolutely secular government, and the people of Turkey are quite proud of that. Once upon a time, Americans used to be proud of our secular government and freedom of religion. This move to shove religion into politics comes in waves throughout our history, and it's always irritating when it does. Good for our current President, not shoving religion down the throats of Americans.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 07:18:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue.", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "Good for our current President, not shoving religion down the throats of Americans.", 
        "reply": " As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 07:35:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue. He wouldn't dare give up an opertunity to campain, it's what he does best. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue.", 
        "reply": " He wouldn't dare give up an opertunity to campain, it's what he does best. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 07:39:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "L0A1"
    }, 
    {
        "content": "yea them dems sure do have excuses for everything..", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "", 
        "reply": "yea them dems sure do have excuses for everything..", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 07:57:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue. What part of \"not demonstrating endorsement of a SPECIFIC religion\" has anything to do with atheism? Being secular does not mean atheist. Here's an analogy for you: Every other Tuesday, I run a safety training orientation for new employees here. I don't have any need to preface the training session with a religious invocation, or display a religious symbol in conjunction with the class, in order to do my job. That doesn't make me an atheist - it means that I don't need to shove religion into every little thing I do. Even more strictly, as an elected American official, President Obama has an OBLIGATION to remain officially non-biased towards or against any religion. When he speaks, he's addressing ALL Americans, not just the Christian ones. For that matter, when he speaks, he can be seen as addressing the whole world. What's so wrong with ensuring that the venue and discussions stay focused on the practical, functional, political issues as opposed to presenting a speech in front of a clear symbol of Christian theology? The only people who take issue with that are the people who are obsessed with pushing the false notion that our nation is a Christian nation.", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue.", 
        "reply": " What part of \"not demonstrating endorsement of a SPECIFIC religion\" has anything to do with atheism? Being secular does not mean atheist. Here's an analogy for you: Every other Tuesday, I run a safety training orientation for new employees here. I don't have any need to preface the training session with a religious invocation, or display a religious symbol in conjunction with the class, in order to do my job. That doesn't make me an atheist - it means that I don't need to shove religion into every little thing I do. Even more strictly, as an elected American official, President Obama has an OBLIGATION to remain officially non-biased towards or against any religion. When he speaks, he's addressing ALL Americans, not just the Christian ones. For that matter, when he speaks, he can be seen as addressing the whole world. What's so wrong with ensuring that the venue and discussions stay focused on the practical, functional, political issues as opposed to presenting a speech in front of a clear symbol of Christian theology? The only people who take issue with that are the people who are obsessed with pushing the false notion that our nation is a Christian nation.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 08:28:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "So, if he was speaking at a masonic lodge, you wouldn't have any problem with him covering the shriner badges to avoid promoting masonic membership. Or, if he was speaking at a Citibank location, he should cover citi's logo to avoid promoting them over wells fargo?", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "", 
        "reply": "So, if he was speaking at a masonic lodge, you wouldn't have any problem with him covering the shriner badges to avoid promoting masonic membership. Or, if he was speaking at a Citibank location, he should cover citi's logo to avoid promoting them over wells fargo?", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 08:55:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "transport1"
    }, 
    {
        "content": "Georgetown is a CATHOLIC school.. no ammount of symbol hiding is going to stop that. anyone with half an ounce of intelligence knows this.", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "", 
        "reply": "Georgetown is a CATHOLIC school.. no ammount of symbol hiding is going to stop that. anyone with half an ounce of intelligence knows this.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 09:05:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by transport1: Or, if he was speaking at a Citibank location, he should cover citi's logo to avoid promoting them over wells fargo? That would be dependent on who was the bigger donor!", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "Originally posted by transport1: Or, if he was speaking at a Citibank location, he should cover citi's logo to avoid promoting them over wells fargo?", 
        "reply": " That would be dependent on who was the bigger donor!", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 09:09:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue. What part of \"not demonstrating endorsement of a SPECIFIC religion\" has anything to do with atheism? Being secular does not mean atheist. Here's an analogy for you: Every other Tuesday, I run a safety training orientation for new employees here. I don't have any need to preface the training session with a religious invocation, or display a religious symbol in conjunction with the class, in order to do my job. That doesn't make me an atheist - it means that I don't need to shove religion into every little thing I do.If your job has nothing to do with religion why would you have any type of religous invocation? Even more strictly, as an elected American official, President Obama has an OBLIGATION to remain officially non-biased towards or against any religion. When he speaks, he's addressing ALL Americans, not just the Christian ones. For that matter, when he speaks, he can be seen as addressing the whole world. What's so wrong with ensuring that the venue and discussions stay focused on the practical, functional, political issues as opposed to presenting a speech in front of a clear symbol of Christian theology? The only people who take issue with that are the people who are obsessed with pushing the false notion that our nation is a Christian nation. If he is overly concerned about not promoting any one religion or belief or lack there of just go to a place without any religous affiliation or connotation.", 
        "intTime": 20090417, 
        "postID": 12, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue. What part of \"not demonstrating endorsement of a SPECIFIC religion\" has anything to do with atheism? Being secular does not mean atheist. Here's an analogy for you: Every other Tuesday, I run a safety training orientation for new employees here. I don't have any need to preface the training session with a religious invocation, or display a religious symbol in conjunction with the class, in order to do my job. That doesn't make me an atheist - it means that I don't need to shove religion into every little thing I do.If your job has nothing to do with religion why would you have any type of religous invocation? Even more strictly, as an elected American official, President Obama has an OBLIGATION to remain officially non-biased towards or against any religion. When he speaks, he's addressing ALL Americans, not just the Christian ones. For that matter, when he speaks, he can be seen as addressing the whole world. What's so wrong with ensuring that the venue and discussions stay focused on the practical, functional, political issues as opposed to presenting a speech in front of a clear symbol of Christian theology? The only people who take issue with that are the people who are obsessed with pushing the false notion that our nation is a Christian nation.", 
        "reply": " If he is overly concerned about not promoting any one religion or belief or lack there of just go to a place without any religous affiliation or connotation.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 09:14:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: Good for our current President, not shoving religion down the throats of Americans. If he was that concerned he would go to secular location. He's not, he's just another politician trying maximize his exposure.", 
        "intTime": 20090417, 
        "postID": 13, 
        "quote": "Originally posted by Whirled_Peas: Good for our current President, not shoving religion down the throats of Americans.", 
        "reply": " If he was that concerned he would go to secular location. He's not, he's just another politician trying maximize his exposure.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 09:19:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue. What part of \"not demonstrating endorsement of a SPECIFIC religion\" has anything to do with atheism? Being secular does not mean atheist. Here's an analogy for you: Every other Tuesday, I run a safety training orientation for new employees here. I don't have any need to preface the training session with a religious invocation, or display a religious symbol in conjunction with the class, in order to do my job. That doesn't make me an atheist - it means that I don't need to shove religion into every little thing I do. Even more strictly, as an elected American official, President Obama has an OBLIGATION to remain officially non-biased towards or against any religion. When he speaks, he's addressing ALL Americans, not just the Christian ones. For that matter, when he speaks, he can be seen as addressing the whole world. What's so wrong with ensuring that the venue and discussions stay focused on the practical, functional, political issues as opposed to presenting a speech in front of a clear symbol of Christian theology? The only people who take issue with that are the people who are obsessed with pushing the false notion that our nation is a Christian nation. Do you train tbe new hires in a church? If you did, would you insist they cover up thier symbols?", 
        "intTime": 20090417, 
        "postID": 14, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue. What part of \"not demonstrating endorsement of a SPECIFIC religion\" has anything to do with atheism? Being secular does not mean atheist. Here's an analogy for you: Every other Tuesday, I run a safety training orientation for new employees here. I don't have any need to preface the training session with a religious invocation, or display a religious symbol in conjunction with the class, in order to do my job. That doesn't make me an atheist - it means that I don't need to shove religion into every little thing I do. Even more strictly, as an elected American official, President Obama has an OBLIGATION to remain officially non-biased towards or against any religion. When he speaks, he's addressing ALL Americans, not just the Christian ones. For that matter, when he speaks, he can be seen as addressing the whole world. What's so wrong with ensuring that the venue and discussions stay focused on the practical, functional, political issues as opposed to presenting a speech in front of a clear symbol of Christian theology? The only people who take issue with that are the people who are obsessed with pushing the false notion that our nation is a Christian nation.", 
        "reply": " Do you train tbe new hires in a church? If you did, would you insist they cover up thier symbols?", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 09:46:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by Whirled_Peas: quote: Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue. What part of \"not demonstrating endorsement of a SPECIFIC religion\" has anything to do with atheism? Being secular does not mean atheist. Here's an analogy for you: Every other Tuesday, I run a safety training orientation for new employees here. I don't have any need to preface the training session with a religious invocation, or display a religious symbol in conjunction with the class, in order to do my job. That doesn't make me an atheist - it means that I don't need to shove religion into every little thing I do. Even more strictly, as an elected American official, President Obama has an OBLIGATION to remain officially non-biased towards or against any religion. When he speaks, he's addressing ALL Americans, not just the Christian ones. For that matter, when he speaks, he can be seen as addressing the whole world. What's so wrong with ensuring that the venue and discussions stay focused on the practical, functional, political issues as opposed to presenting a speech in front of a clear symbol of Christian theology? The only people who take issue with that are the people who are obsessed with pushing the false notion that our nation is a Christian nation. Do you train tbe new hires in a church? If you did, would you insist they cover up thier symbols? Last time WP and I spoke about religion she said she was pagan or wicken or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "Originally posted by navy8086: quote: Originally posted by Whirled_Peas: quote: Originally posted by navy8086: quote: Good for our current President, not shoving religion down the throats of Americans. As opposed to trying to rip it from our hearts and minds? Just more pandering to the aethist left. If the symbol was \"offensive\" maybe he should have AVOIDED that venue. What part of \"not demonstrating endorsement of a SPECIFIC religion\" has anything to do with atheism? Being secular does not mean atheist. Here's an analogy for you: Every other Tuesday, I run a safety training orientation for new employees here. I don't have any need to preface the training session with a religious invocation, or display a religious symbol in conjunction with the class, in order to do my job. That doesn't make me an atheist - it means that I don't need to shove religion into every little thing I do. Even more strictly, as an elected American official, President Obama has an OBLIGATION to remain officially non-biased towards or against any religion. When he speaks, he's addressing ALL Americans, not just the Christian ones. For that matter, when he speaks, he can be seen as addressing the whole world. What's so wrong with ensuring that the venue and discussions stay focused on the practical, functional, political issues as opposed to presenting a speech in front of a clear symbol of Christian theology? The only people who take issue with that are the people who are obsessed with pushing the false notion that our nation is a Christian nation. Do you train tbe new hires in a church? If you did, would you insist they cover up thier symbols?", 
        "reply": " Last time WP and I spoke about religion she said she was pagan or wicken or something. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 09:49:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Last time WP and I spoke about religion she said she was pagan or wicken or something. For starters, I do not subscribe to the notion this is a CHRISTIASN NATION, historically people as far back as the pilgrims came here to practise religion (OR NOT) as they pleased. However in this case, the message is that of religious intolerance. GWU IS a Catholic Univerty, I think it's slap in the face to them having to hide that fact. IF Obama and / or his team were concerened about \"endorsing\" a religion, then he should have spoken in a more secular setting.", 
        "intTime": 20090417, 
        "postID": 16, 
        "quote": "Last time WP and I spoke about religion she said she was pagan or wicken or something.", 
        "reply": " For starters, I do not subscribe to the notion this is a CHRISTIASN NATION, historically people as far back as the pilgrims came here to practise religion (OR NOT) as they pleased. However in this case, the message is that of religious intolerance. GWU IS a Catholic Univerty, I think it's slap in the face to them having to hide that fact. IF Obama and / or his team were concerened about \"endorsing\" a religion, then he should have spoken in a more secular setting.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 10:02:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: However in this case, the message is that of religious intolerance. GWU IS a Catholic Univerty, I think it's slap in the face to them having to hide that fact. IF Obama and / or his team were concerened about \"endorsing\" a religion, then he should have spoken in a more secular setting. Maybe if the school hadn't decided to cover up the monogram, then the speech would have been moved to a more secular location. The real culprit here is the school. They decided that having the President give a speech using their location was more important than their religious convictions.", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "However in this case, the message is that of religious intolerance. GWU IS a Catholic Univerty, I think it's slap in the face to them having to hide that fact. IF Obama and / or his team were concerened about \"endorsing\" a religion, then he should have spoken in a more secular setting.", 
        "reply": " Maybe if the school hadn't decided to cover up the monogram, then the speech would have been moved to a more secular location. The real culprit here is the school. They decided that having the President give a speech using their location was more important than their religious convictions.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 10:23:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "PSimon572"
    }, 
    {
        "content": "Just another example of PC foolishness running amok in the new administration. I seriously doubt had the speech been made in a mosque that any its religious elements would have been hidden.", 
        "intTime": 20090417, 
        "postID": 18, 
        "quote": "", 
        "reply": "Just another example of PC foolishness running amok in the new administration. I seriously doubt had the speech been made in a mosque that any its religious elements would have been hidden.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 10:29:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Of course there is another interpretation - yon President chappie didn't want pictures of him standing pontificating (pun intended - sorry) with the legend IHS emblazoned above and just behind his head. One can just imagine the sort of \"fun\" that bloggers could have with that - cue lots of \"ooh look he really does think he's the Messiah\" bollocks from the more excitable right wingers.", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "", 
        "reply": "Of course there is another interpretation - yon President chappie didn't want pictures of him standing pontificating (pun intended - sorry) with the legend IHS emblazoned above and just behind his head. One can just imagine the sort of \"fun\" that bloggers could have with that - cue lots of \"ooh look he really does think he's the Messiah\" bollocks from the more excitable right wingers.", 
        "threadID": "409192893_1160000122001", 
        "time": "2009-04-17 16:42:00", 
        "title": "Georgetown University Hid Religious Symbols at White House Request", 
        "userID": "Bladensburg"
    }
]