[
    {
        "content": "The AIG scandal has made it apparent that we are ruled by a government of men, not laws. By David Sirota Mar. 21, 2009 | United Steelworkers president Leo Gerard likes to say that Washington policymakers \"treat the people who take a shower after work much differently than they treat the people who shower before they go to work.\" In the 21st century Gilded Age, the blue-collar shower-after-work crowd is given the tough, while the white-collar shower-before-work gang gets the love, and never before this week was that doctrine made so clear. Following news that government-owned American International Group devoted $165 million of its $170 billion taxpayer bailout to employee bonuses, the White House insisted nothing could be done to halt the robbery. On ABC's Sunday chat show, Obama advisor Larry Summers couched his passive-aggressive defense of AIG's thieves in the saccharine argot of jurisprudence. \"We are a country of law -- there are contracts (and) the government cannot just abrogate contracts,\" he said. The rhetoric echoed John Adams' two-century-old fairy tale about an impartial \"government of laws, and not of men.\" Only now, the reassuring platitudes can't hide the uncomfortable truth. Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished. According to New York Attorney General Andrew Cuomo, these allegedly inviolate AIG agreements promised bonus money the company didn't have and were crafted by executives who knew the firm was collapsing, meaning there is a decent chance these pacts could be invalidated under \"fraudulent conveyance\" statutes. They also might be canceled via \"force majeure\" clauses allowing one party to rescind a pact in the event of extraordinary circumstances -- like, perhaps, the collapse of the world economy. (Note: BusinessWeek reports that corporations are already citing the recession as reason to invoke such clauses and nix their business-to-business contracts.) But, then, those legal cases require a government that treats AIG's shower-before-work employees with the same firmness that it treats the auto industry's shower-after-work employees, not the government we currently have -- the one that believes \"the supreme sanctity of employment contracts applies only to some types of employees but not others,\" as Salon.com's Glenn Greenwald says. Mind you, this double standard works the other way, too. Congressional Republicans have long supported the laws letting bankruptcy courts annul mortgage contracts for vacation homes. Those statutes help the shower-before-work clique at least retain their beachside villas, no matter how many of their speculative Ponzi schemes go bad. But for those who shower after work, it's Adams-esque bromides against \"absolving borrowers of their personal responsibility,\" as the GOP announced it will oppose legislation permitting bankruptcy judges to revise mortgage contracts for primary residences. Certainly, for all the connotations of fairness inherent in American politics' \"country of law\" catchphrases, most of us know that the selective application of legal principles is as old as the Republic. However, lots of us are only now discovering that inequality is so pronounced that the time of day we bathe determines the enforcement and reliability (or lack thereof) of even the most basic contracts. We are just realizing that for all the parroting of America's second president, we are ruled by a government of men, and not of laws. >>>>http://www.salon.com/opinion/feature/2009/03/21/sirota/print.html Question: Are we still a country of laws? Choices: YES NO It depends on when you take your shower.  ", 
        "intTime": 20090321, 
        "postID": 1, 
        "quote": "", 
        "reply": "The AIG scandal has made it apparent that we are ruled by a government of men, not laws. By David Sirota Mar. 21, 2009 | United Steelworkers president Leo Gerard likes to say that Washington policymakers \"treat the people who take a shower after work much differently than they treat the people who shower before they go to work.\" In the 21st century Gilded Age, the blue-collar shower-after-work crowd is given the tough, while the white-collar shower-before-work gang gets the love, and never before this week was that doctrine made so clear. Following news that government-owned American International Group devoted $165 million of its $170 billion taxpayer bailout to employee bonuses, the White House insisted nothing could be done to halt the robbery. On ABC's Sunday chat show, Obama advisor Larry Summers couched his passive-aggressive defense of AIG's thieves in the saccharine argot of jurisprudence. \"We are a country of law -- there are contracts (and) the government cannot just abrogate contracts,\" he said. The rhetoric echoed John Adams' two-century-old fairy tale about an impartial \"government of laws, and not of men.\" Only now, the reassuring platitudes can't hide the uncomfortable truth. Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished. According to New York Attorney General Andrew Cuomo, these allegedly inviolate AIG agreements promised bonus money the company didn't have and were crafted by executives who knew the firm was collapsing, meaning there is a decent chance these pacts could be invalidated under \"fraudulent conveyance\" statutes. They also might be canceled via \"force majeure\" clauses allowing one party to rescind a pact in the event of extraordinary circumstances -- like, perhaps, the collapse of the world economy. (Note: BusinessWeek reports that corporations are already citing the recession as reason to invoke such clauses and nix their business-to-business contracts.) But, then, those legal cases require a government that treats AIG's shower-before-work employees with the same firmness that it treats the auto industry's shower-after-work employees, not the government we currently have -- the one that believes \"the supreme sanctity of employment contracts applies only to some types of employees but not others,\" as Salon.com's Glenn Greenwald says. Mind you, this double standard works the other way, too. Congressional Republicans have long supported the laws letting bankruptcy courts annul mortgage contracts for vacation homes. Those statutes help the shower-before-work clique at least retain their beachside villas, no matter how many of their speculative Ponzi schemes go bad. But for those who shower after work, it's Adams-esque bromides against \"absolving borrowers of their personal responsibility,\" as the GOP announced it will oppose legislation permitting bankruptcy judges to revise mortgage contracts for primary residences. Certainly, for all the connotations of fairness inherent in American politics' \"country of law\" catchphrases, most of us know that the selective application of legal principles is as old as the Republic. However, lots of us are only now discovering that inequality is so pronounced that the time of day we bathe determines the enforcement and reliability (or lack thereof) of even the most basic contracts. We are just realizing that for all the parroting of America's second president, we are ruled by a government of men, and not of laws. >>>>http://www.salon.com/opinion/feature/2009/03/21/sirota/print.html Question: Are we still a country of laws? Choices: YES NO It depends on when you take your shower.  ", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 20:00:00", 
        "title": "Welcome to double-standard America", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "People need to stop damn whinning....The lights are on, jack in the box is still open...etc..etc Some children are eating out of a land fill right now...", 
        "intTime": 20090321, 
        "postID": 2, 
        "quote": "", 
        "reply": "People need to stop damn whinning....The lights are on, jack in the box is still open...etc..etc Some children are eating out of a land fill right now...", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 21:28:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished. Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\"", 
        "intTime": 20090321, 
        "postID": 3, 
        "quote": "Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished.", 
        "reply": " Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\"", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 22:03:00", 
        "title": "Welcome to double-standard America", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing!", 
        "intTime": 20090321, 
        "postID": 4, 
        "quote": "", 
        "reply": "I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing!", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 22:30:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "and then consider that the auto execs were told to come back with a detailed plan before any money could be lent, while the bankers were given carte blanche. the way I see it, banking is (or should be) pretty straightforward; you lend money, you charge interest, and then, depending on your overhead and your salaries, you make a profit. if someone's lending at 4%, the 4% available from somewhere else (japan or korea) ain't that different. On the other hand, building an automobile, and getting it to market in time to meet consumer trends IS very complicated. and vehicles with nearly identical specs can bring in hugely disparate prices. and yet it's the auto industry that being asked to provide the detailed business plan. This country has a vital industrial/manufacturing base that's disappearing right before our eyes. the two resurgent industries here in Pittsburgh, Coal and Nuclear, are stuck with an aging workforce that has been allowed to atrophy since no one has been added in the last 10-15 years. and I'm not talking about the blue collar end. the average age of the engineers at Westinhouse Nuclear and Consol Coal company is over 50, and there aren't enough coming into the field to feed the projected growth in those areas. But look how many kids today want to be accoutants, business majors and lawyers. we are screwed. and the irony is we did it to ourselves.", 
        "intTime": 20090321, 
        "postID": 5, 
        "quote": "", 
        "reply": "and then consider that the auto execs were told to come back with a detailed plan before any money could be lent, while the bankers were given carte blanche. the way I see it, banking is (or should be) pretty straightforward; you lend money, you charge interest, and then, depending on your overhead and your salaries, you make a profit. if someone's lending at 4%, the 4% available from somewhere else (japan or korea) ain't that different. On the other hand, building an automobile, and getting it to market in time to meet consumer trends IS very complicated. and vehicles with nearly identical specs can bring in hugely disparate prices. and yet it's the auto industry that being asked to provide the detailed business plan. This country has a vital industrial/manufacturing base that's disappearing right before our eyes. the two resurgent industries here in Pittsburgh, Coal and Nuclear, are stuck with an aging workforce that has been allowed to atrophy since no one has been added in the last 10-15 years. and I'm not talking about the blue collar end. the average age of the engineers at Westinhouse Nuclear and Consol Coal company is over 50, and there aren't enough coming into the field to feed the projected growth in those areas. But look how many kids today want to be accoutants, business majors and lawyers. we are screwed. and the irony is we did it to ourselves.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 22:43:00", 
        "title": "Welcome to double-standard America", 
        "userID": "rd350"
    }, 
    {
        "content": "quote: we are screwed. and the irony is we did it to ourselves. Well, in our defense, their propaganda was relentless, and their phony currency was accepted everywhere. So, they created the establishment, we didn't make the decisions, we followed their lead, even though the founders gave us plenty of warning, but now we're back to the strength of the propaganda. Welcome back Jesus and you'll be fine.", 
        "intTime": 20090321, 
        "postID": 6, 
        "quote": "we are screwed. and the irony is we did it to ourselves.", 
        "reply": " Well, in our defense, their propaganda was relentless, and their phony currency was accepted everywhere. So, they created the establishment, we didn't make the decisions, we followed their lead, even though the founders gave us plenty of warning, but now we're back to the strength of the propaganda. Welcome back Jesus and you'll be fine.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 22:50:00", 
        "title": "Welcome to double-standard America", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing! Why didn't you save enough money during the glorious years of \"Trickle down economics\"??", 
        "intTime": 20090321, 
        "postID": 7, 
        "quote": "Originally posted by Drmwvr: I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing!", 
        "reply": " Why didn't you save enough money during the glorious years of \"Trickle down economics\"??", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 23:57:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Why didn't you save enough money during the glorious years of \"Trickle down economics\"?? You obviously dont know your azz from 3rd base about the trucking industry. Oh by the way, I had 1 truck not a fleet. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090322, 
        "postID": 8, 
        "quote": "Originally posted by Irwin_R_Schyster: Why didn't you save enough money during the glorious years of \"Trickle down economics\"??", 
        "reply": " You obviously dont know your azz from 3rd base about the trucking industry. Oh by the way, I had 1 truck not a fleet. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 09:33:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: [QUOTE]Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished. quote: Ive said this a couple of times. Repetition does not improve it. quote: The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I've seen few defend the bonuses. I've seen many attack the stupidity of vindictive and diverting tax legislation to deal with something that Congress, ICW the administration, badly screwed up. quote: I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" They don't ... which shows your ignorance on the topic.", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by karlhungusjr: [QUOTE]Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished.", 
        "reply": " quote: Ive said this a couple of times. Repetition does not improve it. quote: The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I've seen few defend the bonuses. I've seen many attack the stupidity of vindictive and diverting tax legislation to deal with something that Congress, ICW the administration, badly screwed up. quote: I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" They don't ... which shows your ignorance on the topic.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 09:48:00", 
        "title": "Welcome to double-standard America", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: I've seen few defend the bonuses. your lack of experience is not a compelling argument. If you've only seen \"few\" defend them then you're not looking or your head is in the sand. that is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. quote: They don't ... . they don't what? who's \"they\"? they the auto industry didn't get a loan? they as in AIG didn't get cash nearly string free? don't claim someone is ignorant when you don't even have an argument.", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "I've seen few defend the bonuses.", 
        "reply": " your lack of experience is not a compelling argument. If you've only seen \"few\" defend them then you're not looking or your head is in the sand. that is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. quote: They don't ... . they don't what? who's \"they\"? they the auto industry didn't get a loan? they as in AIG didn't get cash nearly string free? don't claim someone is ignorant when you don't even have an argument.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:02:00", 
        "title": "Welcome to double-standard America", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: That is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. Nope ... but that sure looks like what Dodd (the liar from CT) and the administration were hedging against when they inserted the pre-Feb 11, 2009 exception into the stimulus bill behind closed doors. Regardless, my argument is not based on the legality of the contracts ... though that is certainly a valid argument unless one believes that our body of contract law is subject to the whims of mass hysteria ... but on the pandora's box that is further opened by Congress attempting to enact legislation that is based on emotion and that targets a demographic that has not violated the law. It is vindictive at best ... and a diversion from the fundamental issues that Congress should be addressing ... but isn't.", 
        "intTime": 20090322, 
        "postID": 11, 
        "quote": "That is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses.", 
        "reply": " Nope ... but that sure looks like what Dodd (the liar from CT) and the administration were hedging against when they inserted the pre-Feb 11, 2009 exception into the stimulus bill behind closed doors. Regardless, my argument is not based on the legality of the contracts ... though that is certainly a valid argument unless one believes that our body of contract law is subject to the whims of mass hysteria ... but on the pandora's box that is further opened by Congress attempting to enact legislation that is based on emotion and that targets a demographic that has not violated the law. It is vindictive at best ... and a diversion from the fundamental issues that Congress should be addressing ... but isn't.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:11:00", 
        "title": "Welcome to double-standard America", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: they don't what? who's \"they\"? they the auto industry didn't get a loan? they as in AIG didn't get cash nearly string free? Actually, your words were: quote: basically get a \"gift\" of free cash ... and that is flat wrong. The government got nearly 80% ownership of AIG ... and AIG is paying interest on the money the government \"loaned\". That is a far cry from \"free\" ... and a hell of a lot more than Chrysler and GM have put on the table for their bailouts.", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "they don't what? who's \"they\"? they the auto industry didn't get a loan? they as in AIG didn't get cash nearly string free?", 
        "reply": " Actually, your words were: quote: basically get a \"gift\" of free cash ... and that is flat wrong. The government got nearly 80% ownership of AIG ... and AIG is paying interest on the money the government \"loaned\". That is a far cry from \"free\" ... and a hell of a lot more than Chrysler and GM have put on the table for their bailouts.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:14:00", 
        "title": "Welcome to double-standard America", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more.", 
        "intTime": 20090322, 
        "postID": 13, 
        "quote": "Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\"", 
        "reply": " Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:29:00", 
        "title": "Welcome to double-standard America", 
        "userID": "shuman14"
    }, 
    {
        "content": "Here's a simple question.... When did AIG become \"too\" big to fail...? Who knew - why wasn't something done about it...? Presidents come & go - Congress has created a lifetime dynasty and has been ROYALY screwing the American people for the past several decades. Blaming Presidents is \"EXACTLY\" what congress has learned the art of doing… Instead of picketing those who received bonuses, they should be calling for the resignation of those in congress who were responsible this mess in the first place. The people who received bonuses had contracts in place long before AIG was given any money. Some were even paid long before AIG was given any money. Put it this way – these were legally binding contracts so “if” AIG refused to pay them according to their contract – they would be suing them right now for breach of contract. The lawsuits would be much more expensive than their bonuses… I’m not defending them – just keeping the situation in context…. Another thought is – AIG has 100s of different departments – so it is very possible these folks actually “earned” their bonuses. If you were hired and had a contract with specific predetermined goals marked to equate specific rewards, such as bonuses, would you except the bonuses if you did the work? And if your co-workers did not achieve their goals and were way below standard – should YOU be penalized because they didn’t perform…? How many people have gone to Circuit City since they’ve declared bankruptcy and told them – you want to pay RETAIL – to help out – you don’t want the discount…? Why is that different?", 
        "intTime": 20090322, 
        "postID": 14, 
        "quote": "", 
        "reply": "Here's a simple question.... When did AIG become \"too\" big to fail...? Who knew - why wasn't something done about it...? Presidents come & go - Congress has created a lifetime dynasty and has been ROYALY screwing the American people for the past several decades. Blaming Presidents is \"EXACTLY\" what congress has learned the art of doing… Instead of picketing those who received bonuses, they should be calling for the resignation of those in congress who were responsible this mess in the first place. The people who received bonuses had contracts in place long before AIG was given any money. Some were even paid long before AIG was given any money. Put it this way – these were legally binding contracts so “if” AIG refused to pay them according to their contract – they would be suing them right now for breach of contract. The lawsuits would be much more expensive than their bonuses… I’m not defending them – just keeping the situation in context…. Another thought is – AIG has 100s of different departments – so it is very possible these folks actually “earned” their bonuses. If you were hired and had a contract with specific predetermined goals marked to equate specific rewards, such as bonuses, would you except the bonuses if you did the work? And if your co-workers did not achieve their goals and were way below standard – should YOU be penalized because they didn’t perform…? How many people have gone to Circuit City since they’ve declared bankruptcy and told them – you want to pay RETAIL – to help out – you don’t want the discount…? Why is that different?", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:59:00", 
        "title": "Welcome to double-standard America", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "intTime": 20090322, 
        "postID": 15, 
        "quote": "", 
        "reply": "None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:16:00", 
        "title": "Welcome to double-standard America", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more. I can tell you exactly what happened when the state of MA mandated that all of our employees received health care. Every single hourly employee lost that years raise. Every single hourly employee saw less money in his or her paycheck. College students and retired people barely able to pay for food and rent had to find ways to make do with less.. And in return? They received the worse health care plan I've ever seen. It covered next to nothing. The co-pays where out of sight. You think my company could go back to our clients ( some of whom where CONTRACTED to service levels that required us to provide 100's of people for them...) and re-coup any of that? Not a chance. You walk into some CEO's office and tell him you need to increase your fee by 15-20% and in return you're going to provide the SAME service...try spinning that. Why shouldn't a 23 or 24 year old person have the freedom of choice to decide to have a little more money in his cheek every week and for go HC? I guess liberals only support choice when it comes to killing babies.", 
        "intTime": 20090322, 
        "postID": 16, 
        "quote": "Originally posted by shuman14: quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more.", 
        "reply": " I can tell you exactly what happened when the state of MA mandated that all of our employees received health care. Every single hourly employee lost that years raise. Every single hourly employee saw less money in his or her paycheck. College students and retired people barely able to pay for food and rent had to find ways to make do with less.. And in return? They received the worse health care plan I've ever seen. It covered next to nothing. The co-pays where out of sight. You think my company could go back to our clients ( some of whom where CONTRACTED to service levels that required us to provide 100's of people for them...) and re-coup any of that? Not a chance. You walk into some CEO's office and tell him you need to increase your fee by 15-20% and in return you're going to provide the SAME service...try spinning that. Why shouldn't a 23 or 24 year old person have the freedom of choice to decide to have a little more money in his cheek every week and for go HC? I guess liberals only support choice when it comes to killing babies.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:20:00", 
        "title": "Welcome to double-standard America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades. Here here, I'll drink to that!", 
        "intTime": 20090322, 
        "postID": 17, 
        "quote": "Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "reply": " Here here, I'll drink to that!", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:20:00", 
        "title": "Welcome to double-standard America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Drmwvr: I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing! Why didn't you save enough money during the glorious years of \"Trickle down economics\"?? Some of us did. But, running a small business is extremely hard. For most, their employees make more than the owner and the owner works double the hours. Running your own business, even a successful one, is a lot harder than being an employee. You usually give yourself a small salary, just enough to pay your personal bills, so that your business has a little more in the budget. Any profit that your business makes goes right back into the business in the form of equipment, healthcare plans, HR/accounting services, leases, repairs, bonuses/raises for employees, etc. The profit is never saved because a business's requirements for future growth always outweigh whatever profits the business makes. So, the owner never gets his hand on any of those profits and the profits are always a couple years behind. Like I said, many business owners have a salary that is less than their employees. I paid my employees roughly the same salary that I made. While that salary was substantial for a time it has gone down roughly 85%. I kept my employees at the same salary for as long as I could because I could not stay competitive in my industry by lowering them. I eventually had to cut my staff in half and now I am my business's only employee. My business is just staying afloat in today's current crisis. But, if it gets worse, I will have to shut her down. Getting rid of my employees was the hardest thing out of all of this because I had finally found some really good, honest and hardworking people. And, to see their hard work be rewarded with a pink slip just made me nothing more than heartbroken. I never wish that feeling on anybody. I know that I will be alright because I have invested my money wisely, but not everybody does that. I found that out when some of my employees would call and beg for their job back, would tell me that they are being foreclosed, that their spouse is leaving them or that they are days away from being on the street. I would get a little misty afterward. But, there was nothing I could do for them. My operating budget was gone and my business could no longer sustain ANY employees. I wish people did save when they are making good money. But, it seems that people today just do not live within their means. Even when somebody is making a few hundred thousand a year, they spend it all and in some cases consume even more than they make. So, don't be so ignorant with your little quips. You have no idea what it takes or what you encounter in the running of a business.", 
        "intTime": 20090322, 
        "postID": 18, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Drmwvr: I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing! Why didn't you save enough money during the glorious years of \"Trickle down economics\"??", 
        "reply": " Some of us did. But, running a small business is extremely hard. For most, their employees make more than the owner and the owner works double the hours. Running your own business, even a successful one, is a lot harder than being an employee. You usually give yourself a small salary, just enough to pay your personal bills, so that your business has a little more in the budget. Any profit that your business makes goes right back into the business in the form of equipment, healthcare plans, HR/accounting services, leases, repairs, bonuses/raises for employees, etc. The profit is never saved because a business's requirements for future growth always outweigh whatever profits the business makes. So, the owner never gets his hand on any of those profits and the profits are always a couple years behind. Like I said, many business owners have a salary that is less than their employees. I paid my employees roughly the same salary that I made. While that salary was substantial for a time it has gone down roughly 85%. I kept my employees at the same salary for as long as I could because I could not stay competitive in my industry by lowering them. I eventually had to cut my staff in half and now I am my business's only employee. My business is just staying afloat in today's current crisis. But, if it gets worse, I will have to shut her down. Getting rid of my employees was the hardest thing out of all of this because I had finally found some really good, honest and hardworking people. And, to see their hard work be rewarded with a pink slip just made me nothing more than heartbroken. I never wish that feeling on anybody. I know that I will be alright because I have invested my money wisely, but not everybody does that. I found that out when some of my employees would call and beg for their job back, would tell me that they are being foreclosed, that their spouse is leaving them or that they are days away from being on the street. I would get a little misty afterward. But, there was nothing I could do for them. My operating budget was gone and my business could no longer sustain ANY employees. I wish people did save when they are making good money. But, it seems that people today just do not live within their means. Even when somebody is making a few hundred thousand a year, they spend it all and in some cases consume even more than they make. So, don't be so ignorant with your little quips. You have no idea what it takes or what you encounter in the running of a business.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:31:00", 
        "title": "Welcome to double-standard America", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades. I agree to a point - but what should be happening is this - a full and complete investigation should be done. Then all those who KNEW or \"should\" have known - ALL should be held accountable and prosecuted with LIFE SENTENCES - INCLUDING ALL SENATORS who were on the SENATE OVERSIGHT COMMITTE - no-matter which party they belonged - THEY ARE THE GUILTY ONES who KNEW or SHOULD HAVE KNOWN and THEY were supposed to be PROTECTING THE AMERICAN PEOPLE by making sure THIS DID NOT HAPPEN! Chris Dodd & Barack Obama received the LARGEST campaign donations from AIG than any other condidate - PERIOD. So, I wonder why that isn't being talked about in the media...?", 
        "intTime": 20090322, 
        "postID": 19, 
        "quote": "Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "reply": " I agree to a point - but what should be happening is this - a full and complete investigation should be done. Then all those who KNEW or \"should\" have known - ALL should be held accountable and prosecuted with LIFE SENTENCES - INCLUDING ALL SENATORS who were on the SENATE OVERSIGHT COMMITTE - no-matter which party they belonged - THEY ARE THE GUILTY ONES who KNEW or SHOULD HAVE KNOWN and THEY were supposed to be PROTECTING THE AMERICAN PEOPLE by making sure THIS DID NOT HAPPEN! Chris Dodd & Barack Obama received the LARGEST campaign donations from AIG than any other condidate - PERIOD. So, I wonder why that isn't being talked about in the media...?", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:33:00", 
        "title": "Welcome to double-standard America", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "I have an idea that will solve ALL of these little problems. Quit giving away the tax payers money for ANY reason. Let them all fail.. Assets both human and other will find new work/ownership and we can fix the mess and move on. What we are doing now is only enriching the moronic and dragging this mess out. And its not like ANY of this is constitutional anyway. It would be nice to go back to at least pretending the constitution means anything.", 
        "intTime": 20090322, 
        "postID": 20, 
        "quote": "", 
        "reply": "I have an idea that will solve ALL of these little problems. Quit giving away the tax payers money for ANY reason. Let them all fail.. Assets both human and other will find new work/ownership and we can fix the mess and move on. What we are doing now is only enriching the moronic and dragging this mess out. And its not like ANY of this is constitutional anyway. It would be nice to go back to at least pretending the constitution means anything.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:57:00", 
        "title": "Welcome to double-standard America", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by shuman14: quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more. I can tell you exactly what happened when the state of MA mandated that all of our employees received health care. Every single hourly employee lost that years raise. Every single hourly employee saw less money in his or her paycheck. College students and retired people barely able to pay for food and rent had to find ways to make do with less.. And in return? They received the worse health care plan I've ever seen. It covered next to nothing. The co-pays where out of sight. You think my company could go back to our clients ( some of whom where CONTRACTED to service levels that required us to provide 100's of people for them...) and re-coup any of that? Not a chance. You walk into some CEO's office and tell him you need to increase your fee by 15-20% and in return you're going to provide the SAME service...try spinning that. Why shouldn't a 23 or 24 year old person have the freedom of choice to decide to have a little more money in his cheek every week and for go HC? I guess liberals only support choice when it comes to killing babies. I guess liberals only support choice when it comes to killing babies. Would one of those MA liberals happen to look like this? quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\"", 
        "intTime": 20090322, 
        "postID": 21, 
        "quote": "Originally posted by threerings: quote: Originally posted by shuman14: quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more. I can tell you exactly what happened when the state of MA mandated that all of our employees received health care. Every single hourly employee lost that years raise. Every single hourly employee saw less money in his or her paycheck. College students and retired people barely able to pay for food and rent had to find ways to make do with less.. And in return? They received the worse health care plan I've ever seen. It covered next to nothing. The co-pays where out of sight. You think my company could go back to our clients ( some of whom where CONTRACTED to service levels that required us to provide 100's of people for them...) and re-coup any of that? Not a chance. You walk into some CEO's office and tell him you need to increase your fee by 15-20% and in return you're going to provide the SAME service...try spinning that. Why shouldn't a 23 or 24 year old person have the freedom of choice to decide to have a little more money in his cheek every week and for go HC? I guess liberals only support choice when it comes to killing babies.", 
        "reply": " I guess liberals only support choice when it comes to killing babies. Would one of those MA liberals happen to look like this? quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\"", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 13:27:00", 
        "title": "Welcome to double-standard America", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\" Yep ... and it was that rather stupid stretch of an analogy that cost him my support in the primaries.", 
        "intTime": 20090322, 
        "postID": 22, 
        "quote": "\"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\"", 
        "reply": " Yep ... and it was that rather stupid stretch of an analogy that cost him my support in the primaries.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 13:59:00", 
        "title": "Welcome to double-standard America", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades. EXACTLY!!! If the government hadn't intervened the economy right itself. FDR's tactics, now imitated by Barry, kept the depression lingering a decade longer than it would have. People need to be writing, calling and emailing their Congress Critters to stop this mess now before we are stolen completely blind by this Administration.", 
        "intTime": 20090322, 
        "postID": 23, 
        "quote": "Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "reply": " EXACTLY!!! If the government hadn't intervened the economy right itself. FDR's tactics, now imitated by Barry, kept the depression lingering a decade longer than it would have. People need to be writing, calling and emailing their Congress Critters to stop this mess now before we are stolen completely blind by this Administration.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 16:36:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: But, running a small business is extremely hard. For most, their employees make more than the owner and the owner works double the hours. Running your own business, even a successful one, is a lot harder than being an employee. You usually give yourself a small salary, just enough to pay your personal bills, so that your business has a little more in the budget. Any profit that your business makes goes right back into the business in the form of equipment, healthcare plans, HR/accounting services, leases, repairs, bonuses/raises for employees, etc. The profit is never saved because a business's requirements for future growth always outweigh whatever profits the business makes. So, the owner never gets his hand on any of those profits and the profits are always a couple years behind. Boy, howdy! Sing it Brother! Inventory can kill ya! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090322, 
        "postID": 24, 
        "quote": "Originally posted by 10tenths: But, running a small business is extremely hard. For most, their employees make more than the owner and the owner works double the hours. Running your own business, even a successful one, is a lot harder than being an employee. You usually give yourself a small salary, just enough to pay your personal bills, so that your business has a little more in the budget. Any profit that your business makes goes right back into the business in the form of equipment, healthcare plans, HR/accounting services, leases, repairs, bonuses/raises for employees, etc. The profit is never saved because a business's requirements for future growth always outweigh whatever profits the business makes. So, the owner never gets his hand on any of those profits and the profits are always a couple years behind.", 
        "reply": " Boy, howdy! Sing it Brother! Inventory can kill ya! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 18:48:00", 
        "title": "Welcome to double-standard America", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by rd350: But look how many kids today want to be accoutants, business majors and lawyers. Too bad there were not more competent business majors at the US auto makers, or we'd not see such lousy business performance from them. Let's see what the former \"big three\" auto makers forecast for years ahead. If they forecast future actions anticipating more than about 12% of the market, then they are still padding the books (worse than the obamanation and their absurd understatement of projected deficits). Business majors worth a damn will not overstate projected sales. As far as executive bonuses are concerned, they are a drop in the bucket compared to the gross unfunded health and retirement benefits exacted by the unions--and agreed by myopic managers.", 
        "intTime": 20090322, 
        "postID": 25, 
        "quote": "Originally posted by rd350: But look how many kids today want to be accoutants, business majors and lawyers.", 
        "reply": " Too bad there were not more competent business majors at the US auto makers, or we'd not see such lousy business performance from them. Let's see what the former \"big three\" auto makers forecast for years ahead. If they forecast future actions anticipating more than about 12% of the market, then they are still padding the books (worse than the obamanation and their absurd understatement of projected deficits). Business majors worth a damn will not overstate projected sales. As far as executive bonuses are concerned, they are a drop in the bucket compared to the gross unfunded health and retirement benefits exacted by the unions--and agreed by myopic managers.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 19:15:00", 
        "title": "Welcome to double-standard America", 
        "userID": "RRR52"
    }, 
    {
        "content": "Double standard hypocrisy runs rampant amongst the jackasses. In the midst of such economic troubles as we've had since last summer, the AIG executives were foolish to seek $165 billion for bonuses. Hells bells, they almost approached the spendthrift waste of Obama's $170 million bill for his coronation.", 
        "intTime": 20090322, 
        "postID": 26, 
        "quote": "", 
        "reply": "Double standard hypocrisy runs rampant amongst the jackasses. In the midst of such economic troubles as we've had since last summer, the AIG executives were foolish to seek $165 billion for bonuses. Hells bells, they almost approached the spendthrift waste of Obama's $170 million bill for his coronation.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 19:17:00", 
        "title": "Welcome to double-standard America", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\" Yep ... and it was that rather stupid stretch of an analogy that cost him my support in the primaries. If good healthcare insurance cost us only as much as auto insurance, almost everybody who wants it would have it. Agreed, a dumb analogy.", 
        "intTime": 20090322, 
        "postID": 27, 
        "quote": "Originally posted by I_M_Qwerty: quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\" Yep ... and it was that rather stupid stretch of an analogy that cost him my support in the primaries.", 
        "reply": " If good healthcare insurance cost us only as much as auto insurance, almost everybody who wants it would have it. Agreed, a dumb analogy.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 19:21:00", 
        "title": "Welcome to double-standard America", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: That is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. Nope ... but that sure looks like what Dodd (the liar from CT) and the administration were hedging against when they inserted the pre-Feb 11, 2009 exception into the stimulus bill behind closed doors. Regardless, my argument is not based on the legality of the contracts ... though that is certainly a valid argument unless one believes that our body of contract law is subject to the whims of mass hysteria ... but on the pandora's box that is further opened by Congress attempting to enact legislation that is based on emotion and that targets a demographic that has not violated the law. It is vindictive at best ... and a diversion from the fundamental issues that Congress should be addressing ... but isn't. See where that kind of Legislative can go. \"Congressman Barney (Sylvester) Frank announced today the introduction of legislation calling for a 90% tax on all income in excess of $500,000 paid to any person who foments political dissention on the public's airwaves.\" Most of the protest at AIG's exec homes were organized by Acorn and Unions, go figure. Bottomline: This Adm and Congress fug'd this while thing up. THEY DID NOT READ THE BILL. If this is the type of Gov't people here want, then that is a sad state of affairs for this country. Yeh I didnt get outraged at the bonuses, it was a wtf moment but I was pizzed at congress, I they are still to blame for mnost of this crappy economy. And there will be more shiite sammiches served co'z those idiots didnt read the bill(s).", 
        "intTime": 20090323, 
        "postID": 28, 
        "quote": "Originally posted by I_M_Qwerty: quote: That is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. Nope ... but that sure looks like what Dodd (the liar from CT) and the administration were hedging against when they inserted the pre-Feb 11, 2009 exception into the stimulus bill behind closed doors. Regardless, my argument is not based on the legality of the contracts ... though that is certainly a valid argument unless one believes that our body of contract law is subject to the whims of mass hysteria ... but on the pandora's box that is further opened by Congress attempting to enact legislation that is based on emotion and that targets a demographic that has not violated the law. It is vindictive at best ... and a diversion from the fundamental issues that Congress should be addressing ... but isn't.", 
        "reply": " See where that kind of Legislative can go. \"Congressman Barney (Sylvester) Frank announced today the introduction of legislation calling for a 90% tax on all income in excess of $500,000 paid to any person who foments political dissention on the public's airwaves.\" Most of the protest at AIG's exec homes were organized by Acorn and Unions, go figure. Bottomline: This Adm and Congress fug'd this while thing up. THEY DID NOT READ THE BILL. If this is the type of Gov't people here want, then that is a sad state of affairs for this country. Yeh I didnt get outraged at the bonuses, it was a wtf moment but I was pizzed at congress, I they are still to blame for mnost of this crappy economy. And there will be more shiite sammiches served co'z those idiots didnt read the bill(s).", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-23 06:23:00", 
        "title": "Welcome to double-standard America", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: Here's a simple question.... When did AIG become \"too\" big to fail...? Who knew - why wasn't something done about it...? Presidents come & go - Congress has created a lifetime dynasty and has been ROYALY screwing the American people for the past several decades. Blaming Presidents is \"EXACTLY\" what congress has learned the art of doing… Instead of picketing those who received bonuses, they should be calling for the resignation of those in congress who were responsible this mess in the first place. The people who received bonuses had contracts in place long before AIG was given any money. Some were even paid long before AIG was given any money. Put it this way – these were legally binding contracts so “if” AIG refused to pay them according to their contract – they would be suing them right now for breach of contract. The lawsuits would be much more expensive than their bonuses… I’m not defending them – just keeping the situation in context…. Another thought is – AIG has 100s of different departments – so it is very possible these folks actually “earned” their bonuses. If you were hired and had a contract with specific predetermined goals marked to equate specific rewards, such as bonuses, would you except the bonuses if you did the work? And if your co-workers did not achieve their goals and were way below standard – should YOU be penalized because they didn’t perform…? How many people have gone to Circuit City since they’ve declared bankruptcy and told them – you want to pay RETAIL – to help out – you don’t want the discount…? Why is that different? I can see it now, you're a 50k a yr secretary and got a 5k bonus and now wont get it because some hair lipped congressturd demagogue'd a screwup they created.", 
        "intTime": 20090323, 
        "postID": 29, 
        "quote": "Originally posted by GlassOnion: Here's a simple question.... When did AIG become \"too\" big to fail...? Who knew - why wasn't something done about it...? Presidents come & go - Congress has created a lifetime dynasty and has been ROYALY screwing the American people for the past several decades. Blaming Presidents is \"EXACTLY\" what congress has learned the art of doing… Instead of picketing those who received bonuses, they should be calling for the resignation of those in congress who were responsible this mess in the first place. The people who received bonuses had contracts in place long before AIG was given any money. Some were even paid long before AIG was given any money. Put it this way – these were legally binding contracts so “if” AIG refused to pay them according to their contract – they would be suing them right now for breach of contract. The lawsuits would be much more expensive than their bonuses… I’m not defending them – just keeping the situation in context…. Another thought is – AIG has 100s of different departments – so it is very possible these folks actually “earned” their bonuses. If you were hired and had a contract with specific predetermined goals marked to equate specific rewards, such as bonuses, would you except the bonuses if you did the work? And if your co-workers did not achieve their goals and were way below standard – should YOU be penalized because they didn’t perform…? How many people have gone to Circuit City since they’ve declared bankruptcy and told them – you want to pay RETAIL – to help out – you don’t want the discount…? Why is that different?", 
        "reply": " I can see it now, you're a 50k a yr secretary and got a 5k bonus and now wont get it because some hair lipped congressturd demagogue'd a screwup they created.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-23 06:29:00", 
        "title": "Welcome to double-standard America", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I sent my Congressman a note saying AIG should be placed in recievership and the executives prosecuted for fraud. Unfortunatly my rep is a Republican so he can't do much while the lib/socialists control government.", 
        "intTime": 20090323, 
        "postID": 30, 
        "quote": "", 
        "reply": "I sent my Congressman a note saying AIG should be placed in recievership and the executives prosecuted for fraud. Unfortunatly my rep is a Republican so he can't do much while the lib/socialists control government.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-23 06:31:00", 
        "title": "Welcome to double-standard America", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "The AIG scandal has made it apparent that we are ruled by a government of men, not laws. By David Sirota Mar. 21, 2009 | United Steelworkers president Leo Gerard likes to say that Washington policymakers \"treat the people who take a shower after work much differently than they treat the people who shower before they go to work.\" In the 21st century Gilded Age, the blue-collar shower-after-work crowd is given the tough, while the white-collar shower-before-work gang gets the love, and never before this week was that doctrine made so clear. Following news that government-owned American International Group devoted $165 million of its $170 billion taxpayer bailout to employee bonuses, the White House insisted nothing could be done to halt the robbery. On ABC's Sunday chat show, Obama advisor Larry Summers couched his passive-aggressive defense of AIG's thieves in the saccharine argot of jurisprudence. \"We are a country of law -- there are contracts (and) the government cannot just abrogate contracts,\" he said. The rhetoric echoed John Adams' two-century-old fairy tale about an impartial \"government of laws, and not of men.\" Only now, the reassuring platitudes can't hide the uncomfortable truth. Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished. According to New York Attorney General Andrew Cuomo, these allegedly inviolate AIG agreements promised bonus money the company didn't have and were crafted by executives who knew the firm was collapsing, meaning there is a decent chance these pacts could be invalidated under \"fraudulent conveyance\" statutes. They also might be canceled via \"force majeure\" clauses allowing one party to rescind a pact in the event of extraordinary circumstances -- like, perhaps, the collapse of the world economy. (Note: BusinessWeek reports that corporations are already citing the recession as reason to invoke such clauses and nix their business-to-business contracts.) But, then, those legal cases require a government that treats AIG's shower-before-work employees with the same firmness that it treats the auto industry's shower-after-work employees, not the government we currently have -- the one that believes \"the supreme sanctity of employment contracts applies only to some types of employees but not others,\" as Salon.com's Glenn Greenwald says. Mind you, this double standard works the other way, too. Congressional Republicans have long supported the laws letting bankruptcy courts annul mortgage contracts for vacation homes. Those statutes help the shower-before-work clique at least retain their beachside villas, no matter how many of their speculative Ponzi schemes go bad. But for those who shower after work, it's Adams-esque bromides against \"absolving borrowers of their personal responsibility,\" as the GOP announced it will oppose legislation permitting bankruptcy judges to revise mortgage contracts for primary residences. Certainly, for all the connotations of fairness inherent in American politics' \"country of law\" catchphrases, most of us know that the selective application of legal principles is as old as the Republic. However, lots of us are only now discovering that inequality is so pronounced that the time of day we bathe determines the enforcement and reliability (or lack thereof) of even the most basic contracts. We are just realizing that for all the parroting of America's second president, we are ruled by a government of men, and not of laws. >>>>http://www.salon.com/opinion/feature/2009/03/21/sirota/print.html Question: Are we still a country of laws? Choices: YES NO It depends on when you take your shower.  ", 
        "intTime": 20090321, 
        "postID": 31, 
        "quote": "", 
        "reply": "The AIG scandal has made it apparent that we are ruled by a government of men, not laws. By David Sirota Mar. 21, 2009 | United Steelworkers president Leo Gerard likes to say that Washington policymakers \"treat the people who take a shower after work much differently than they treat the people who shower before they go to work.\" In the 21st century Gilded Age, the blue-collar shower-after-work crowd is given the tough, while the white-collar shower-before-work gang gets the love, and never before this week was that doctrine made so clear. Following news that government-owned American International Group devoted $165 million of its $170 billion taxpayer bailout to employee bonuses, the White House insisted nothing could be done to halt the robbery. On ABC's Sunday chat show, Obama advisor Larry Summers couched his passive-aggressive defense of AIG's thieves in the saccharine argot of jurisprudence. \"We are a country of law -- there are contracts (and) the government cannot just abrogate contracts,\" he said. The rhetoric echoed John Adams' two-century-old fairy tale about an impartial \"government of laws, and not of men.\" Only now, the reassuring platitudes can't hide the uncomfortable truth. Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished. According to New York Attorney General Andrew Cuomo, these allegedly inviolate AIG agreements promised bonus money the company didn't have and were crafted by executives who knew the firm was collapsing, meaning there is a decent chance these pacts could be invalidated under \"fraudulent conveyance\" statutes. They also might be canceled via \"force majeure\" clauses allowing one party to rescind a pact in the event of extraordinary circumstances -- like, perhaps, the collapse of the world economy. (Note: BusinessWeek reports that corporations are already citing the recession as reason to invoke such clauses and nix their business-to-business contracts.) But, then, those legal cases require a government that treats AIG's shower-before-work employees with the same firmness that it treats the auto industry's shower-after-work employees, not the government we currently have -- the one that believes \"the supreme sanctity of employment contracts applies only to some types of employees but not others,\" as Salon.com's Glenn Greenwald says. Mind you, this double standard works the other way, too. Congressional Republicans have long supported the laws letting bankruptcy courts annul mortgage contracts for vacation homes. Those statutes help the shower-before-work clique at least retain their beachside villas, no matter how many of their speculative Ponzi schemes go bad. But for those who shower after work, it's Adams-esque bromides against \"absolving borrowers of their personal responsibility,\" as the GOP announced it will oppose legislation permitting bankruptcy judges to revise mortgage contracts for primary residences. Certainly, for all the connotations of fairness inherent in American politics' \"country of law\" catchphrases, most of us know that the selective application of legal principles is as old as the Republic. However, lots of us are only now discovering that inequality is so pronounced that the time of day we bathe determines the enforcement and reliability (or lack thereof) of even the most basic contracts. We are just realizing that for all the parroting of America's second president, we are ruled by a government of men, and not of laws. >>>>http://www.salon.com/opinion/feature/2009/03/21/sirota/print.html Question: Are we still a country of laws? Choices: YES NO It depends on when you take your shower.  ", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 20:00:00", 
        "title": "Welcome to double-standard America", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "People need to stop damn whinning....The lights are on, jack in the box is still open...etc..etc Some children are eating out of a land fill right now...", 
        "intTime": 20090321, 
        "postID": 32, 
        "quote": "", 
        "reply": "People need to stop damn whinning....The lights are on, jack in the box is still open...etc..etc Some children are eating out of a land fill right now...", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 21:28:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished. Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\"", 
        "intTime": 20090321, 
        "postID": 33, 
        "quote": "Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished.", 
        "reply": " Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\"", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 22:03:00", 
        "title": "Welcome to double-standard America", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing!", 
        "intTime": 20090321, 
        "postID": 34, 
        "quote": "", 
        "reply": "I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing!", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 22:30:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "and then consider that the auto execs were told to come back with a detailed plan before any money could be lent, while the bankers were given carte blanche. the way I see it, banking is (or should be) pretty straightforward; you lend money, you charge interest, and then, depending on your overhead and your salaries, you make a profit. if someone's lending at 4%, the 4% available from somewhere else (japan or korea) ain't that different. On the other hand, building an automobile, and getting it to market in time to meet consumer trends IS very complicated. and vehicles with nearly identical specs can bring in hugely disparate prices. and yet it's the auto industry that being asked to provide the detailed business plan. This country has a vital industrial/manufacturing base that's disappearing right before our eyes. the two resurgent industries here in Pittsburgh, Coal and Nuclear, are stuck with an aging workforce that has been allowed to atrophy since no one has been added in the last 10-15 years. and I'm not talking about the blue collar end. the average age of the engineers at Westinhouse Nuclear and Consol Coal company is over 50, and there aren't enough coming into the field to feed the projected growth in those areas. But look how many kids today want to be accoutants, business majors and lawyers. we are screwed. and the irony is we did it to ourselves.", 
        "intTime": 20090321, 
        "postID": 35, 
        "quote": "", 
        "reply": "and then consider that the auto execs were told to come back with a detailed plan before any money could be lent, while the bankers were given carte blanche. the way I see it, banking is (or should be) pretty straightforward; you lend money, you charge interest, and then, depending on your overhead and your salaries, you make a profit. if someone's lending at 4%, the 4% available from somewhere else (japan or korea) ain't that different. On the other hand, building an automobile, and getting it to market in time to meet consumer trends IS very complicated. and vehicles with nearly identical specs can bring in hugely disparate prices. and yet it's the auto industry that being asked to provide the detailed business plan. This country has a vital industrial/manufacturing base that's disappearing right before our eyes. the two resurgent industries here in Pittsburgh, Coal and Nuclear, are stuck with an aging workforce that has been allowed to atrophy since no one has been added in the last 10-15 years. and I'm not talking about the blue collar end. the average age of the engineers at Westinhouse Nuclear and Consol Coal company is over 50, and there aren't enough coming into the field to feed the projected growth in those areas. But look how many kids today want to be accoutants, business majors and lawyers. we are screwed. and the irony is we did it to ourselves.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 22:43:00", 
        "title": "Welcome to double-standard America", 
        "userID": "rd350"
    }, 
    {
        "content": "quote: we are screwed. and the irony is we did it to ourselves. Well, in our defense, their propaganda was relentless, and their phony currency was accepted everywhere. So, they created the establishment, we didn't make the decisions, we followed their lead, even though the founders gave us plenty of warning, but now we're back to the strength of the propaganda. Welcome back Jesus and you'll be fine.", 
        "intTime": 20090321, 
        "postID": 36, 
        "quote": "we are screwed. and the irony is we did it to ourselves.", 
        "reply": " Well, in our defense, their propaganda was relentless, and their phony currency was accepted everywhere. So, they created the establishment, we didn't make the decisions, we followed their lead, even though the founders gave us plenty of warning, but now we're back to the strength of the propaganda. Welcome back Jesus and you'll be fine.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 22:50:00", 
        "title": "Welcome to double-standard America", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing! Why didn't you save enough money during the glorious years of \"Trickle down economics\"??", 
        "intTime": 20090321, 
        "postID": 37, 
        "quote": "Originally posted by Drmwvr: I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing!", 
        "reply": " Why didn't you save enough money during the glorious years of \"Trickle down economics\"??", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-21 23:57:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Why didn't you save enough money during the glorious years of \"Trickle down economics\"?? You obviously dont know your azz from 3rd base about the trucking industry. Oh by the way, I had 1 truck not a fleet. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090322, 
        "postID": 38, 
        "quote": "Originally posted by Irwin_R_Schyster: Why didn't you save enough money during the glorious years of \"Trickle down economics\"??", 
        "reply": " You obviously dont know your azz from 3rd base about the trucking industry. Oh by the way, I had 1 truck not a fleet. \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 09:33:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: [QUOTE]Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished. quote: Ive said this a couple of times. Repetition does not improve it. quote: The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I've seen few defend the bonuses. I've seen many attack the stupidity of vindictive and diverting tax legislation to deal with something that Congress, ICW the administration, badly screwed up. quote: I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" They don't ... which shows your ignorance on the topic.", 
        "intTime": 20090322, 
        "postID": 39, 
        "quote": "Originally posted by karlhungusjr: [QUOTE]Last month, the same government that says it \"cannot just abrogate\" executives' bonus contracts used its leverage to cancel unions' wage contracts. As the Wall Street Journal reported, federal loans to G.M. and Chrysler were made contingent on those manufacturers shredding their existing labor pacts and \"extract[ing] financial concessions from workers.\" In other words, our government asks us to believe that it possesses total authority to adjust contracts at car companies it lends to, and yet has zero power to modify contracts at financial firms it owns. This, even though the latter set of covenants might be easily abolished.", 
        "reply": " quote: Ive said this a couple of times. Repetition does not improve it. quote: The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I've seen few defend the bonuses. I've seen many attack the stupidity of vindictive and diverting tax legislation to deal with something that Congress, ICW the administration, badly screwed up. quote: I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" They don't ... which shows your ignorance on the topic.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 09:48:00", 
        "title": "Welcome to double-standard America", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: I've seen few defend the bonuses. your lack of experience is not a compelling argument. If you've only seen \"few\" defend them then you're not looking or your head is in the sand. that is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. quote: They don't ... . they don't what? who's \"they\"? they the auto industry didn't get a loan? they as in AIG didn't get cash nearly string free? don't claim someone is ignorant when you don't even have an argument.", 
        "intTime": 20090322, 
        "postID": 40, 
        "quote": "I've seen few defend the bonuses.", 
        "reply": " your lack of experience is not a compelling argument. If you've only seen \"few\" defend them then you're not looking or your head is in the sand. that is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. quote: They don't ... . they don't what? who's \"they\"? they the auto industry didn't get a loan? they as in AIG didn't get cash nearly string free? don't claim someone is ignorant when you don't even have an argument.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:02:00", 
        "title": "Welcome to double-standard America", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: That is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. Nope ... but that sure looks like what Dodd (the liar from CT) and the administration were hedging against when they inserted the pre-Feb 11, 2009 exception into the stimulus bill behind closed doors. Regardless, my argument is not based on the legality of the contracts ... though that is certainly a valid argument unless one believes that our body of contract law is subject to the whims of mass hysteria ... but on the pandora's box that is further opened by Congress attempting to enact legislation that is based on emotion and that targets a demographic that has not violated the law. It is vindictive at best ... and a diversion from the fundamental issues that Congress should be addressing ... but isn't.", 
        "intTime": 20090322, 
        "postID": 41, 
        "quote": "That is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses.", 
        "reply": " Nope ... but that sure looks like what Dodd (the liar from CT) and the administration were hedging against when they inserted the pre-Feb 11, 2009 exception into the stimulus bill behind closed doors. Regardless, my argument is not based on the legality of the contracts ... though that is certainly a valid argument unless one believes that our body of contract law is subject to the whims of mass hysteria ... but on the pandora's box that is further opened by Congress attempting to enact legislation that is based on emotion and that targets a demographic that has not violated the law. It is vindictive at best ... and a diversion from the fundamental issues that Congress should be addressing ... but isn't.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:11:00", 
        "title": "Welcome to double-standard America", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: they don't what? who's \"they\"? they the auto industry didn't get a loan? they as in AIG didn't get cash nearly string free? Actually, your words were: quote: basically get a \"gift\" of free cash ... and that is flat wrong. The government got nearly 80% ownership of AIG ... and AIG is paying interest on the money the government \"loaned\". That is a far cry from \"free\" ... and a hell of a lot more than Chrysler and GM have put on the table for their bailouts.", 
        "intTime": 20090322, 
        "postID": 42, 
        "quote": "they don't what? who's \"they\"? they the auto industry didn't get a loan? they as in AIG didn't get cash nearly string free?", 
        "reply": " Actually, your words were: quote: basically get a \"gift\" of free cash ... and that is flat wrong. The government got nearly 80% ownership of AIG ... and AIG is paying interest on the money the government \"loaned\". That is a far cry from \"free\" ... and a hell of a lot more than Chrysler and GM have put on the table for their bailouts.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:14:00", 
        "title": "Welcome to double-standard America", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more.", 
        "intTime": 20090322, 
        "postID": 43, 
        "quote": "Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\"", 
        "reply": " Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:29:00", 
        "title": "Welcome to double-standard America", 
        "userID": "shuman14"
    }, 
    {
        "content": "Here's a simple question.... When did AIG become \"too\" big to fail...? Who knew - why wasn't something done about it...? Presidents come & go - Congress has created a lifetime dynasty and has been ROYALY screwing the American people for the past several decades. Blaming Presidents is \"EXACTLY\" what congress has learned the art of doing… Instead of picketing those who received bonuses, they should be calling for the resignation of those in congress who were responsible this mess in the first place. The people who received bonuses had contracts in place long before AIG was given any money. Some were even paid long before AIG was given any money. Put it this way – these were legally binding contracts so “if” AIG refused to pay them according to their contract – they would be suing them right now for breach of contract. The lawsuits would be much more expensive than their bonuses… I’m not defending them – just keeping the situation in context…. Another thought is – AIG has 100s of different departments – so it is very possible these folks actually “earned” their bonuses. If you were hired and had a contract with specific predetermined goals marked to equate specific rewards, such as bonuses, would you except the bonuses if you did the work? And if your co-workers did not achieve their goals and were way below standard – should YOU be penalized because they didn’t perform…? How many people have gone to Circuit City since they’ve declared bankruptcy and told them – you want to pay RETAIL – to help out – you don’t want the discount…? Why is that different?", 
        "intTime": 20090322, 
        "postID": 44, 
        "quote": "", 
        "reply": "Here's a simple question.... When did AIG become \"too\" big to fail...? Who knew - why wasn't something done about it...? Presidents come & go - Congress has created a lifetime dynasty and has been ROYALY screwing the American people for the past several decades. Blaming Presidents is \"EXACTLY\" what congress has learned the art of doing… Instead of picketing those who received bonuses, they should be calling for the resignation of those in congress who were responsible this mess in the first place. The people who received bonuses had contracts in place long before AIG was given any money. Some were even paid long before AIG was given any money. Put it this way – these were legally binding contracts so “if” AIG refused to pay them according to their contract – they would be suing them right now for breach of contract. The lawsuits would be much more expensive than their bonuses… I’m not defending them – just keeping the situation in context…. Another thought is – AIG has 100s of different departments – so it is very possible these folks actually “earned” their bonuses. If you were hired and had a contract with specific predetermined goals marked to equate specific rewards, such as bonuses, would you except the bonuses if you did the work? And if your co-workers did not achieve their goals and were way below standard – should YOU be penalized because they didn’t perform…? How many people have gone to Circuit City since they’ve declared bankruptcy and told them – you want to pay RETAIL – to help out – you don’t want the discount…? Why is that different?", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 10:59:00", 
        "title": "Welcome to double-standard America", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "intTime": 20090322, 
        "postID": 45, 
        "quote": "", 
        "reply": "None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:16:00", 
        "title": "Welcome to double-standard America", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more. I can tell you exactly what happened when the state of MA mandated that all of our employees received health care. Every single hourly employee lost that years raise. Every single hourly employee saw less money in his or her paycheck. College students and retired people barely able to pay for food and rent had to find ways to make do with less.. And in return? They received the worse health care plan I've ever seen. It covered next to nothing. The co-pays where out of sight. You think my company could go back to our clients ( some of whom where CONTRACTED to service levels that required us to provide 100's of people for them...) and re-coup any of that? Not a chance. You walk into some CEO's office and tell him you need to increase your fee by 15-20% and in return you're going to provide the SAME service...try spinning that. Why shouldn't a 23 or 24 year old person have the freedom of choice to decide to have a little more money in his cheek every week and for go HC? I guess liberals only support choice when it comes to killing babies.", 
        "intTime": 20090322, 
        "postID": 46, 
        "quote": "Originally posted by shuman14: quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more.", 
        "reply": " I can tell you exactly what happened when the state of MA mandated that all of our employees received health care. Every single hourly employee lost that years raise. Every single hourly employee saw less money in his or her paycheck. College students and retired people barely able to pay for food and rent had to find ways to make do with less.. And in return? They received the worse health care plan I've ever seen. It covered next to nothing. The co-pays where out of sight. You think my company could go back to our clients ( some of whom where CONTRACTED to service levels that required us to provide 100's of people for them...) and re-coup any of that? Not a chance. You walk into some CEO's office and tell him you need to increase your fee by 15-20% and in return you're going to provide the SAME service...try spinning that. Why shouldn't a 23 or 24 year old person have the freedom of choice to decide to have a little more money in his cheek every week and for go HC? I guess liberals only support choice when it comes to killing babies.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:20:00", 
        "title": "Welcome to double-standard America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades. Here here, I'll drink to that!", 
        "intTime": 20090322, 
        "postID": 47, 
        "quote": "Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "reply": " Here here, I'll drink to that!", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:20:00", 
        "title": "Welcome to double-standard America", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Drmwvr: I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing! Why didn't you save enough money during the glorious years of \"Trickle down economics\"?? Some of us did. But, running a small business is extremely hard. For most, their employees make more than the owner and the owner works double the hours. Running your own business, even a successful one, is a lot harder than being an employee. You usually give yourself a small salary, just enough to pay your personal bills, so that your business has a little more in the budget. Any profit that your business makes goes right back into the business in the form of equipment, healthcare plans, HR/accounting services, leases, repairs, bonuses/raises for employees, etc. The profit is never saved because a business's requirements for future growth always outweigh whatever profits the business makes. So, the owner never gets his hand on any of those profits and the profits are always a couple years behind. Like I said, many business owners have a salary that is less than their employees. I paid my employees roughly the same salary that I made. While that salary was substantial for a time it has gone down roughly 85%. I kept my employees at the same salary for as long as I could because I could not stay competitive in my industry by lowering them. I eventually had to cut my staff in half and now I am my business's only employee. My business is just staying afloat in today's current crisis. But, if it gets worse, I will have to shut her down. Getting rid of my employees was the hardest thing out of all of this because I had finally found some really good, honest and hardworking people. And, to see their hard work be rewarded with a pink slip just made me nothing more than heartbroken. I never wish that feeling on anybody. I know that I will be alright because I have invested my money wisely, but not everybody does that. I found that out when some of my employees would call and beg for their job back, would tell me that they are being foreclosed, that their spouse is leaving them or that they are days away from being on the street. I would get a little misty afterward. But, there was nothing I could do for them. My operating budget was gone and my business could no longer sustain ANY employees. I wish people did save when they are making good money. But, it seems that people today just do not live within their means. Even when somebody is making a few hundred thousand a year, they spend it all and in some cases consume even more than they make. So, don't be so ignorant with your little quips. You have no idea what it takes or what you encounter in the running of a business.", 
        "intTime": 20090322, 
        "postID": 48, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Drmwvr: I just want to know why the hell any of them got a dime! I just lost my business in August (couldnt survive the price of fuel...$32,000 per month dont leave a lot of take home)and nobody offered me a damn thing! Why didn't you save enough money during the glorious years of \"Trickle down economics\"??", 
        "reply": " Some of us did. But, running a small business is extremely hard. For most, their employees make more than the owner and the owner works double the hours. Running your own business, even a successful one, is a lot harder than being an employee. You usually give yourself a small salary, just enough to pay your personal bills, so that your business has a little more in the budget. Any profit that your business makes goes right back into the business in the form of equipment, healthcare plans, HR/accounting services, leases, repairs, bonuses/raises for employees, etc. The profit is never saved because a business's requirements for future growth always outweigh whatever profits the business makes. So, the owner never gets his hand on any of those profits and the profits are always a couple years behind. Like I said, many business owners have a salary that is less than their employees. I paid my employees roughly the same salary that I made. While that salary was substantial for a time it has gone down roughly 85%. I kept my employees at the same salary for as long as I could because I could not stay competitive in my industry by lowering them. I eventually had to cut my staff in half and now I am my business's only employee. My business is just staying afloat in today's current crisis. But, if it gets worse, I will have to shut her down. Getting rid of my employees was the hardest thing out of all of this because I had finally found some really good, honest and hardworking people. And, to see their hard work be rewarded with a pink slip just made me nothing more than heartbroken. I never wish that feeling on anybody. I know that I will be alright because I have invested my money wisely, but not everybody does that. I found that out when some of my employees would call and beg for their job back, would tell me that they are being foreclosed, that their spouse is leaving them or that they are days away from being on the street. I would get a little misty afterward. But, there was nothing I could do for them. My operating budget was gone and my business could no longer sustain ANY employees. I wish people did save when they are making good money. But, it seems that people today just do not live within their means. Even when somebody is making a few hundred thousand a year, they spend it all and in some cases consume even more than they make. So, don't be so ignorant with your little quips. You have no idea what it takes or what you encounter in the running of a business.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:31:00", 
        "title": "Welcome to double-standard America", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades. I agree to a point - but what should be happening is this - a full and complete investigation should be done. Then all those who KNEW or \"should\" have known - ALL should be held accountable and prosecuted with LIFE SENTENCES - INCLUDING ALL SENATORS who were on the SENATE OVERSIGHT COMMITTE - no-matter which party they belonged - THEY ARE THE GUILTY ONES who KNEW or SHOULD HAVE KNOWN and THEY were supposed to be PROTECTING THE AMERICAN PEOPLE by making sure THIS DID NOT HAPPEN! Chris Dodd & Barack Obama received the LARGEST campaign donations from AIG than any other condidate - PERIOD. So, I wonder why that isn't being talked about in the media...?", 
        "intTime": 20090322, 
        "postID": 49, 
        "quote": "Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "reply": " I agree to a point - but what should be happening is this - a full and complete investigation should be done. Then all those who KNEW or \"should\" have known - ALL should be held accountable and prosecuted with LIFE SENTENCES - INCLUDING ALL SENATORS who were on the SENATE OVERSIGHT COMMITTE - no-matter which party they belonged - THEY ARE THE GUILTY ONES who KNEW or SHOULD HAVE KNOWN and THEY were supposed to be PROTECTING THE AMERICAN PEOPLE by making sure THIS DID NOT HAPPEN! Chris Dodd & Barack Obama received the LARGEST campaign donations from AIG than any other condidate - PERIOD. So, I wonder why that isn't being talked about in the media...?", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:33:00", 
        "title": "Welcome to double-standard America", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "I have an idea that will solve ALL of these little problems. Quit giving away the tax payers money for ANY reason. Let them all fail.. Assets both human and other will find new work/ownership and we can fix the mess and move on. What we are doing now is only enriching the moronic and dragging this mess out. And its not like ANY of this is constitutional anyway. It would be nice to go back to at least pretending the constitution means anything.", 
        "intTime": 20090322, 
        "postID": 50, 
        "quote": "", 
        "reply": "I have an idea that will solve ALL of these little problems. Quit giving away the tax payers money for ANY reason. Let them all fail.. Assets both human and other will find new work/ownership and we can fix the mess and move on. What we are doing now is only enriching the moronic and dragging this mess out. And its not like ANY of this is constitutional anyway. It would be nice to go back to at least pretending the constitution means anything.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 11:57:00", 
        "title": "Welcome to double-standard America", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by shuman14: quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more. I can tell you exactly what happened when the state of MA mandated that all of our employees received health care. Every single hourly employee lost that years raise. Every single hourly employee saw less money in his or her paycheck. College students and retired people barely able to pay for food and rent had to find ways to make do with less.. And in return? They received the worse health care plan I've ever seen. It covered next to nothing. The co-pays where out of sight. You think my company could go back to our clients ( some of whom where CONTRACTED to service levels that required us to provide 100's of people for them...) and re-coup any of that? Not a chance. You walk into some CEO's office and tell him you need to increase your fee by 15-20% and in return you're going to provide the SAME service...try spinning that. Why shouldn't a 23 or 24 year old person have the freedom of choice to decide to have a little more money in his cheek every week and for go HC? I guess liberals only support choice when it comes to killing babies. I guess liberals only support choice when it comes to killing babies. Would one of those MA liberals happen to look like this? quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\"", 
        "intTime": 20090322, 
        "postID": 51, 
        "quote": "Originally posted by threerings: quote: Originally posted by shuman14: quote: Ive said this a couple of times. The same people who defend AIG's bonuses are usually the same people *****ing about UAW's making too much money. I'd also like to know why AIG and others basically get a \"gift\" of free cash while the auto industry gets a \"loan\" Do I think it's right for these AIG execs to take these bonuses? H6LL no! I'm actually quite pizzed off about it. But I don't think it's right to come up with a retro active bill to seize another American's property either. If there was a \"criminal\" act commited by these execs then I can see them paying a \"fine\", but most simply had a contract in place already prior to receiving the bailout money. I don't think it's the Government's place to dictate what a persons' wages should be. It's bad enough we have a minimum wage, do you want a maximum wage too? Who gets to decide that? I'll put in terms you might understand. In IL the state minimum wage is $7.75 and hour. A security guard in IL is required to have 20 hrs of training to work unarmed and 40 hrs of training to work armed. This is entry level training. Most entry level security guards start at the 8-10 dollar an hour rate unarmed, 10-12 armed. Those that actually want a career in the security feild go get training, education and certifications to make them better guards. Higher the level of training, normally an increase in pay comes with it. Also the higher the risk the higher the pay. The unarmed doorman at an officer building makes less than an armed bank guard, who makes less than the armored car guard, who makes less than the special response (strike) teams, who make less than the nuclear power plant guards, who make less than the high level Executive Protection operatives, and so on. I know highly trained, certified, EP specialists that make $100.00 dollars an hour plus expenses. Dangerous work that comes with good pay. What if the stated mandated maximum wage in the security at $15.00 an hour? Is that fair? is that right? Do you think a lot of quality people are going risk their lives for that much money? Now apply this maximum wage concept to other jobs. Policemen, firemen, construction works, etc. Why should some hack in the Statehouse or Washington who has no clue on what takes be a [insert job here] decide how much that job should pay? Too much government control already, they don't need more. I can tell you exactly what happened when the state of MA mandated that all of our employees received health care. Every single hourly employee lost that years raise. Every single hourly employee saw less money in his or her paycheck. College students and retired people barely able to pay for food and rent had to find ways to make do with less.. And in return? They received the worse health care plan I've ever seen. It covered next to nothing. The co-pays where out of sight. You think my company could go back to our clients ( some of whom where CONTRACTED to service levels that required us to provide 100's of people for them...) and re-coup any of that? Not a chance. You walk into some CEO's office and tell him you need to increase your fee by 15-20% and in return you're going to provide the SAME service...try spinning that. Why shouldn't a 23 or 24 year old person have the freedom of choice to decide to have a little more money in his cheek every week and for go HC? I guess liberals only support choice when it comes to killing babies.", 
        "reply": " I guess liberals only support choice when it comes to killing babies. Would one of those MA liberals happen to look like this? quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\"", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 13:27:00", 
        "title": "Welcome to double-standard America", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\" Yep ... and it was that rather stupid stretch of an analogy that cost him my support in the primaries.", 
        "intTime": 20090322, 
        "postID": 52, 
        "quote": "\"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\"", 
        "reply": " Yep ... and it was that rather stupid stretch of an analogy that cost him my support in the primaries.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 13:59:00", 
        "title": "Welcome to double-standard America", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades. EXACTLY!!! If the government hadn't intervened the economy right itself. FDR's tactics, now imitated by Barry, kept the depression lingering a decade longer than it would have. People need to be writing, calling and emailing their Congress Critters to stop this mess now before we are stolen completely blind by this Administration.", 
        "intTime": 20090322, 
        "postID": 53, 
        "quote": "Originally posted by MSGCAVALRY: None of them deserve a damn penny. Let them fail. Get it over with quickly. Sure, we will all suffer, but at least it will not drag on for decades.", 
        "reply": " EXACTLY!!! If the government hadn't intervened the economy right itself. FDR's tactics, now imitated by Barry, kept the depression lingering a decade longer than it would have. People need to be writing, calling and emailing their Congress Critters to stop this mess now before we are stolen completely blind by this Administration.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 16:36:00", 
        "title": "Welcome to double-standard America", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: But, running a small business is extremely hard. For most, their employees make more than the owner and the owner works double the hours. Running your own business, even a successful one, is a lot harder than being an employee. You usually give yourself a small salary, just enough to pay your personal bills, so that your business has a little more in the budget. Any profit that your business makes goes right back into the business in the form of equipment, healthcare plans, HR/accounting services, leases, repairs, bonuses/raises for employees, etc. The profit is never saved because a business's requirements for future growth always outweigh whatever profits the business makes. So, the owner never gets his hand on any of those profits and the profits are always a couple years behind. Boy, howdy! Sing it Brother! Inventory can kill ya! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090322, 
        "postID": 54, 
        "quote": "Originally posted by 10tenths: But, running a small business is extremely hard. For most, their employees make more than the owner and the owner works double the hours. Running your own business, even a successful one, is a lot harder than being an employee. You usually give yourself a small salary, just enough to pay your personal bills, so that your business has a little more in the budget. Any profit that your business makes goes right back into the business in the form of equipment, healthcare plans, HR/accounting services, leases, repairs, bonuses/raises for employees, etc. The profit is never saved because a business's requirements for future growth always outweigh whatever profits the business makes. So, the owner never gets his hand on any of those profits and the profits are always a couple years behind.", 
        "reply": " Boy, howdy! Sing it Brother! Inventory can kill ya! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 18:48:00", 
        "title": "Welcome to double-standard America", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by rd350: But look how many kids today want to be accoutants, business majors and lawyers. Too bad there were not more competent business majors at the US auto makers, or we'd not see such lousy business performance from them. Let's see what the former \"big three\" auto makers forecast for years ahead. If they forecast future actions anticipating more than about 12% of the market, then they are still padding the books (worse than the obamanation and their absurd understatement of projected deficits). Business majors worth a damn will not overstate projected sales. As far as executive bonuses are concerned, they are a drop in the bucket compared to the gross unfunded health and retirement benefits exacted by the unions--and agreed by myopic managers.", 
        "intTime": 20090322, 
        "postID": 55, 
        "quote": "Originally posted by rd350: But look how many kids today want to be accoutants, business majors and lawyers.", 
        "reply": " Too bad there were not more competent business majors at the US auto makers, or we'd not see such lousy business performance from them. Let's see what the former \"big three\" auto makers forecast for years ahead. If they forecast future actions anticipating more than about 12% of the market, then they are still padding the books (worse than the obamanation and their absurd understatement of projected deficits). Business majors worth a damn will not overstate projected sales. As far as executive bonuses are concerned, they are a drop in the bucket compared to the gross unfunded health and retirement benefits exacted by the unions--and agreed by myopic managers.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 19:15:00", 
        "title": "Welcome to double-standard America", 
        "userID": "RRR52"
    }, 
    {
        "content": "Double standard hypocrisy runs rampant amongst the jackasses. In the midst of such economic troubles as we've had since last summer, the AIG executives were foolish to seek $165 billion for bonuses. Hells bells, they almost approached the spendthrift waste of Obama's $170 million bill for his coronation.", 
        "intTime": 20090322, 
        "postID": 56, 
        "quote": "", 
        "reply": "Double standard hypocrisy runs rampant amongst the jackasses. In the midst of such economic troubles as we've had since last summer, the AIG executives were foolish to seek $165 billion for bonuses. Hells bells, they almost approached the spendthrift waste of Obama's $170 million bill for his coronation.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 19:17:00", 
        "title": "Welcome to double-standard America", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\" Yep ... and it was that rather stupid stretch of an analogy that cost him my support in the primaries. If good healthcare insurance cost us only as much as auto insurance, almost everybody who wants it would have it. Agreed, a dumb analogy.", 
        "intTime": 20090322, 
        "postID": 57, 
        "quote": "Originally posted by I_M_Qwerty: quote: \"We insist that everybody who drives a car has insurance,\" Gov. Mitt Romney (R) said regarding the health insurance bill. \"And cars are a lot less expensive than people.\" Yep ... and it was that rather stupid stretch of an analogy that cost him my support in the primaries.", 
        "reply": " If good healthcare insurance cost us only as much as auto insurance, almost everybody who wants it would have it. Agreed, a dumb analogy.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-22 19:21:00", 
        "title": "Welcome to double-standard America", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: That is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. Nope ... but that sure looks like what Dodd (the liar from CT) and the administration were hedging against when they inserted the pre-Feb 11, 2009 exception into the stimulus bill behind closed doors. Regardless, my argument is not based on the legality of the contracts ... though that is certainly a valid argument unless one believes that our body of contract law is subject to the whims of mass hysteria ... but on the pandora's box that is further opened by Congress attempting to enact legislation that is based on emotion and that targets a demographic that has not violated the law. It is vindictive at best ... and a diversion from the fundamental issues that Congress should be addressing ... but isn't. See where that kind of Legislative can go. \"Congressman Barney (Sylvester) Frank announced today the introduction of legislation calling for a 90% tax on all income in excess of $500,000 paid to any person who foments political dissention on the public's airwaves.\" Most of the protest at AIG's exec homes were organized by Acorn and Unions, go figure. Bottomline: This Adm and Congress fug'd this while thing up. THEY DID NOT READ THE BILL. If this is the type of Gov't people here want, then that is a sad state of affairs for this country. Yeh I didnt get outraged at the bonuses, it was a wtf moment but I was pizzed at congress, I they are still to blame for mnost of this crappy economy. And there will be more shiite sammiches served co'z those idiots didnt read the bill(s).", 
        "intTime": 20090323, 
        "postID": 58, 
        "quote": "Originally posted by I_M_Qwerty: quote: That is, unless your trying to claim that \"But they have a contract!\" is somehow not a defense of the bonuses. Nope ... but that sure looks like what Dodd (the liar from CT) and the administration were hedging against when they inserted the pre-Feb 11, 2009 exception into the stimulus bill behind closed doors. Regardless, my argument is not based on the legality of the contracts ... though that is certainly a valid argument unless one believes that our body of contract law is subject to the whims of mass hysteria ... but on the pandora's box that is further opened by Congress attempting to enact legislation that is based on emotion and that targets a demographic that has not violated the law. It is vindictive at best ... and a diversion from the fundamental issues that Congress should be addressing ... but isn't.", 
        "reply": " See where that kind of Legislative can go. \"Congressman Barney (Sylvester) Frank announced today the introduction of legislation calling for a 90% tax on all income in excess of $500,000 paid to any person who foments political dissention on the public's airwaves.\" Most of the protest at AIG's exec homes were organized by Acorn and Unions, go figure. Bottomline: This Adm and Congress fug'd this while thing up. THEY DID NOT READ THE BILL. If this is the type of Gov't people here want, then that is a sad state of affairs for this country. Yeh I didnt get outraged at the bonuses, it was a wtf moment but I was pizzed at congress, I they are still to blame for mnost of this crappy economy. And there will be more shiite sammiches served co'z those idiots didnt read the bill(s).", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-23 06:23:00", 
        "title": "Welcome to double-standard America", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: Here's a simple question.... When did AIG become \"too\" big to fail...? Who knew - why wasn't something done about it...? Presidents come & go - Congress has created a lifetime dynasty and has been ROYALY screwing the American people for the past several decades. Blaming Presidents is \"EXACTLY\" what congress has learned the art of doing… Instead of picketing those who received bonuses, they should be calling for the resignation of those in congress who were responsible this mess in the first place. The people who received bonuses had contracts in place long before AIG was given any money. Some were even paid long before AIG was given any money. Put it this way – these were legally binding contracts so “if” AIG refused to pay them according to their contract – they would be suing them right now for breach of contract. The lawsuits would be much more expensive than their bonuses… I’m not defending them – just keeping the situation in context…. Another thought is – AIG has 100s of different departments – so it is very possible these folks actually “earned” their bonuses. If you were hired and had a contract with specific predetermined goals marked to equate specific rewards, such as bonuses, would you except the bonuses if you did the work? And if your co-workers did not achieve their goals and were way below standard – should YOU be penalized because they didn’t perform…? How many people have gone to Circuit City since they’ve declared bankruptcy and told them – you want to pay RETAIL – to help out – you don’t want the discount…? Why is that different? I can see it now, you're a 50k a yr secretary and got a 5k bonus and now wont get it because some hair lipped congressturd demagogue'd a screwup they created.", 
        "intTime": 20090323, 
        "postID": 59, 
        "quote": "Originally posted by GlassOnion: Here's a simple question.... When did AIG become \"too\" big to fail...? Who knew - why wasn't something done about it...? Presidents come & go - Congress has created a lifetime dynasty and has been ROYALY screwing the American people for the past several decades. Blaming Presidents is \"EXACTLY\" what congress has learned the art of doing… Instead of picketing those who received bonuses, they should be calling for the resignation of those in congress who were responsible this mess in the first place. The people who received bonuses had contracts in place long before AIG was given any money. Some were even paid long before AIG was given any money. Put it this way – these were legally binding contracts so “if” AIG refused to pay them according to their contract – they would be suing them right now for breach of contract. The lawsuits would be much more expensive than their bonuses… I’m not defending them – just keeping the situation in context…. Another thought is – AIG has 100s of different departments – so it is very possible these folks actually “earned” their bonuses. If you were hired and had a contract with specific predetermined goals marked to equate specific rewards, such as bonuses, would you except the bonuses if you did the work? And if your co-workers did not achieve their goals and were way below standard – should YOU be penalized because they didn’t perform…? How many people have gone to Circuit City since they’ve declared bankruptcy and told them – you want to pay RETAIL – to help out – you don’t want the discount…? Why is that different?", 
        "reply": " I can see it now, you're a 50k a yr secretary and got a 5k bonus and now wont get it because some hair lipped congressturd demagogue'd a screwup they created.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-23 06:29:00", 
        "title": "Welcome to double-standard America", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I sent my Congressman a note saying AIG should be placed in recievership and the executives prosecuted for fraud. Unfortunatly my rep is a Republican so he can't do much while the lib/socialists control government.", 
        "intTime": 20090323, 
        "postID": 60, 
        "quote": "", 
        "reply": "I sent my Congressman a note saying AIG should be placed in recievership and the executives prosecuted for fraud. Unfortunatly my rep is a Republican so he can't do much while the lib/socialists control government.", 
        "threadID": "409192893_7910045812001", 
        "time": "2009-03-23 06:31:00", 
        "title": "Welcome to double-standard America", 
        "userID": "bill_kananen"
    }
]