[
    {
        "content": "Seems the real heros know what the deal is. >http://www.thebostonchannel.com/cnn-news/19273935/detail.html Shane Murphy, second-in-command aboard the ship seized by Somali pirates this month, is happy to be home. But he's not happy to be sharing turf with land-lubber Rush Limbaugh, who politicized the pirate affair by referring to the pirates as \"black teenagers.\" \"It feels great to be home,\" said Murphy in an interview with WCBV in Boston. \"It feels like everyone around here has my back, with the exception of Rush Limbaugh, who is trying to make this into a race issue...that's disgusting.\" In another article Chairman Rush suggested that's why President Obama was at church. \"He was worried about the order he had given to wipe out three teenagers on the high seas. Black Muslim teenagers\", said Chairman Rush. It's no wonder the Repubs are in the crapper.", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "Seems the real heros know what the deal is. >http://www.thebostonchannel.com/cnn-news/19273935/detail.html Shane Murphy, second-in-command aboard the ship seized by Somali pirates this month, is happy to be home. But he's not happy to be sharing turf with land-lubber Rush Limbaugh, who politicized the pirate affair by referring to the pirates as \"black teenagers.\" \"It feels great to be home,\" said Murphy in an interview with WCBV in Boston. \"It feels like everyone around here has my back, with the exception of Rush Limbaugh, who is trying to make this into a race issue...that's disgusting.\" In another article Chairman Rush suggested that's why President Obama was at church. \"He was worried about the order he had given to wipe out three teenagers on the high seas. Black Muslim teenagers\", said Chairman Rush. It's no wonder the Repubs are in the crapper.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 12:35:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "\"Thud\" just like your post... \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"Thud\" just like your post... \"The World's Finest\"", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 12:56:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: \"Thud\" just like your post... Of course.", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "Originally posted by Kegler300: \"Thud\" just like your post...", 
        "reply": " Of course.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:01:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:01:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm No, Shane Murphy pointed it out but I'm happy to bring it to your attention.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " No, Shane Murphy pointed it out but I'm happy to bring it to your attention.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:06:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "", 
        "reply": "Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:07:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " The talk show puss gut dope fiend that won't run for office...just chirp", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:23:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "It is not \"Chairman Rush\". That would be Michael Steele, RNC Chairman. No further comment as I do not wish to further this agenda. I find it it quite a waste of time to point-counterpoint with those with deeply entrenched ideology. I feel nothing will change your mind and/or retract your \"spin\". I learned long ago..do not bite when it is slanted. IMHO. Thank you....Signed Agent 99.", 
        "intTime": 20090425, 
        "postID": 8, 
        "quote": "", 
        "reply": "It is not \"Chairman Rush\". That would be Michael Steele, RNC Chairman. No further comment as I do not wish to further this agenda. I find it it quite a waste of time to point-counterpoint with those with deeply entrenched ideology. I feel nothing will change your mind and/or retract your \"spin\". I learned long ago..do not bite when it is slanted. IMHO. Thank you....Signed Agent 99.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:26:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING. Finally, we agree. Race had nothing to do with this.", 
        "intTime": 20090425, 
        "postID": 9, 
        "quote": "Originally posted by Irwin_R_Schyster: Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "reply": " Finally, we agree. Race had nothing to do with this.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:27:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp He doesn't need to run for office, he's heard by a larger audience right where he is. Right. Especially since he's assumed his rightful place as Chairman of the GOP. And his audience is even bigger only must of the new listeners just tune in to laugh at him.", 
        "intTime": 20090425, 
        "postID": 10, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp He doesn't need to run for office, he's heard by a larger audience right where he is.", 
        "reply": " Right. Especially since he's assumed his rightful place as Chairman of the GOP. And his audience is even bigger only must of the new listeners just tune in to laugh at him.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:41:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "MOD HAT OFF quote: Originally posted by samh32: Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "intTime": 20090425, 
        "postID": 11, 
        "quote": "Originally posted by samh32:", 
        "reply": "MOD HAT OFF  Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:43:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "USNVet940"
    }, 
    {
        "content": "quote: Originally posted by USNVet940: MOD HAT OFF Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? [/QUOTE] I said it once, and I'll say it a thousand times...Moderators Moderate!!", 
        "intTime": 20090425, 
        "postID": 12, 
        "quote": "Originally posted by USNVet940: MOD HAT OFF", 
        "reply": " Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? [/QUOTE] I said it once, and I'll say it a thousand times...Moderators Moderate!!", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:57:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm Rush is free to register & join the discussions here anytime he wants to. I didn't see anything in the TOS barring chickenhawks from posting.", 
        "intTime": 20090425, 
        "postID": 13, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " Rush is free to register & join the discussions here anytime he wants to. I didn't see anything in the TOS barring chickenhawks from posting.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "intTime": 20090425, 
        "postID": 14, 
        "quote": "", 
        "reply": "How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "intTime": 20090425, 
        "postID": 15, 
        "quote": "Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "reply": " Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:45:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "intTime": 20090425, 
        "postID": 16, 
        "quote": "Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "reply": " The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:51:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 17, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp", 
        "reply": " Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:51:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "intTime": 20090425, 
        "postID": 18, 
        "quote": "Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "reply": " I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:58:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist. Is Rush Limbaugh being a racist in THIS particular incident? probably not...but his comments sure as hell will incite racist thoughts in some people... \"That darkie took long to act because those were his people...\" That is what he is inciting...", 
        "intTime": 20090425, 
        "postID": 19, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "reply": " Is Rush Limbaugh being a racist in THIS particular incident? probably not...but his comments sure as hell will incite racist thoughts in some people... \"That darkie took long to act because those were his people...\" That is what he is inciting...", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:59:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh Am I missing something here, but what in the hell does that have to do with the successful Navy SEAL operation that led the rescue of an American, and the death of three pirates?? What young American is going to buy that crap? This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "intTime": 20090425, 
        "postID": 20, 
        "quote": "\"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh", 
        "reply": " Am I missing something here, but what in the hell does that have to do with the successful Navy SEAL operation that led the rescue of an American, and the death of three pirates?? What young American is going to buy that crap? This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:11:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 bottom fishing again and I get a twinkie", 
        "intTime": 20090425, 
        "postID": 21, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "reply": " bottom fishing again and I get a twinkie", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:48:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: This man must be a liberal in disguse or something sabotaging the future of the GOP.. Now that's a thought. Rush has been part of a vast Left Wing Conspiracy for 20 some years to bring down the GOP. Glad to see that it's finally coming to fruition.", 
        "intTime": 20090425, 
        "postID": 22, 
        "quote": "This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "reply": " Now that's a thought. Rush has been part of a vast Left Wing Conspiracy for 20 some years to bring down the GOP. Glad to see that it's finally coming to fruition.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:58:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "--- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "intTime": 20090425, 
        "postID": 23, 
        "quote": "", 
        "reply": "--- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:18:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb.. This is important!!!...I'll contact Newt,Mitt,Fred and the whole gang...Now Obama is one tough political hombre...but Bob Dole is OUR ace in the hole....trust me on this one", 
        "intTime": 20090425, 
        "postID": 24, 
        "quote": "Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "reply": " This is important!!!...I'll contact Newt,Mitt,Fred and the whole gang...Now Obama is one tough political hombre...but Bob Dole is OUR ace in the hole....trust me on this one", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:23:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb.. Eat enough and you might get there.", 
        "intTime": 20090425, 
        "postID": 25, 
        "quote": "Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "reply": " Eat enough and you might get there.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:25:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him. Yes, stating they were Black teenagers is merely a fact. It's how he connected the dots that made Shane throw down on him. The germaine fact is that they were friggin PIRATES. Racism still exists but this is not a racist nation. Far from it. Black people cannot elect a Black President all by themselves.", 
        "intTime": 20090425, 
        "postID": 26, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "reply": " Yes, stating they were Black teenagers is merely a fact. It's how he connected the dots that made Shane throw down on him. The germaine fact is that they were friggin PIRATES. Racism still exists but this is not a racist nation. Far from it. Black people cannot elect a Black President all by themselves.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:34:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Seems the real heros know what the deal is. >http://www.thebostonchannel.com/cnn-news/19273935/detail.html Shane Murphy, second-in-command aboard the ship seized by Somali pirates this month, is happy to be home. But he's not happy to be sharing turf with land-lubber Rush Limbaugh, who politicized the pirate affair by referring to the pirates as \"black teenagers.\" \"It feels great to be home,\" said Murphy in an interview with WCBV in Boston. \"It feels like everyone around here has my back, with the exception of Rush Limbaugh, who is trying to make this into a race issue...that's disgusting.\" In another article Chairman Rush suggested that's why President Obama was at church. \"He was worried about the order he had given to wipe out three teenagers on the high seas. Black Muslim teenagers\", said Chairman Rush. It's no wonder the Repubs are in the crapper.", 
        "intTime": 20090425, 
        "postID": 27, 
        "quote": "", 
        "reply": "Seems the real heros know what the deal is. >http://www.thebostonchannel.com/cnn-news/19273935/detail.html Shane Murphy, second-in-command aboard the ship seized by Somali pirates this month, is happy to be home. But he's not happy to be sharing turf with land-lubber Rush Limbaugh, who politicized the pirate affair by referring to the pirates as \"black teenagers.\" \"It feels great to be home,\" said Murphy in an interview with WCBV in Boston. \"It feels like everyone around here has my back, with the exception of Rush Limbaugh, who is trying to make this into a race issue...that's disgusting.\" In another article Chairman Rush suggested that's why President Obama was at church. \"He was worried about the order he had given to wipe out three teenagers on the high seas. Black Muslim teenagers\", said Chairman Rush. It's no wonder the Repubs are in the crapper.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 12:35:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "\"Thud\" just like your post... \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 28, 
        "quote": "", 
        "reply": "\"Thud\" just like your post... \"The World's Finest\"", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 12:56:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: \"Thud\" just like your post... Of course.", 
        "intTime": 20090425, 
        "postID": 29, 
        "quote": "Originally posted by Kegler300: \"Thud\" just like your post...", 
        "reply": " Of course.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:01:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "", 
        "intTime": 20090425, 
        "postID": 30, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:01:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm No, Shane Murphy pointed it out but I'm happy to bring it to your attention.", 
        "intTime": 20090425, 
        "postID": 31, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " No, Shane Murphy pointed it out but I'm happy to bring it to your attention.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:06:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "intTime": 20090425, 
        "postID": 32, 
        "quote": "", 
        "reply": "Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:07:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp", 
        "intTime": 20090425, 
        "postID": 33, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " The talk show puss gut dope fiend that won't run for office...just chirp", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:23:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "It is not \"Chairman Rush\". That would be Michael Steele, RNC Chairman. No further comment as I do not wish to further this agenda. I find it it quite a waste of time to point-counterpoint with those with deeply entrenched ideology. I feel nothing will change your mind and/or retract your \"spin\". I learned long ago..do not bite when it is slanted. IMHO. Thank you....Signed Agent 99.", 
        "intTime": 20090425, 
        "postID": 34, 
        "quote": "", 
        "reply": "It is not \"Chairman Rush\". That would be Michael Steele, RNC Chairman. No further comment as I do not wish to further this agenda. I find it it quite a waste of time to point-counterpoint with those with deeply entrenched ideology. I feel nothing will change your mind and/or retract your \"spin\". I learned long ago..do not bite when it is slanted. IMHO. Thank you....Signed Agent 99.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:26:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING. Finally, we agree. Race had nothing to do with this.", 
        "intTime": 20090425, 
        "postID": 35, 
        "quote": "Originally posted by Irwin_R_Schyster: Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "reply": " Finally, we agree. Race had nothing to do with this.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:27:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp He doesn't need to run for office, he's heard by a larger audience right where he is. Right. Especially since he's assumed his rightful place as Chairman of the GOP. And his audience is even bigger only must of the new listeners just tune in to laugh at him.", 
        "intTime": 20090425, 
        "postID": 36, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp He doesn't need to run for office, he's heard by a larger audience right where he is.", 
        "reply": " Right. Especially since he's assumed his rightful place as Chairman of the GOP. And his audience is even bigger only must of the new listeners just tune in to laugh at him.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:41:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "MOD HAT OFF quote: Originally posted by samh32: Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "intTime": 20090425, 
        "postID": 37, 
        "quote": "Originally posted by samh32:", 
        "reply": "MOD HAT OFF  Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:43:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "USNVet940"
    }, 
    {
        "content": "quote: Originally posted by USNVet940: MOD HAT OFF Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? [/QUOTE] I said it once, and I'll say it a thousand times...Moderators Moderate!!", 
        "intTime": 20090425, 
        "postID": 38, 
        "quote": "Originally posted by USNVet940: MOD HAT OFF", 
        "reply": " Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? [/QUOTE] I said it once, and I'll say it a thousand times...Moderators Moderate!!", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:57:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm Rush is free to register & join the discussions here anytime he wants to. I didn't see anything in the TOS barring chickenhawks from posting.", 
        "intTime": 20090425, 
        "postID": 39, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " Rush is free to register & join the discussions here anytime he wants to. I didn't see anything in the TOS barring chickenhawks from posting.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "intTime": 20090425, 
        "postID": 40, 
        "quote": "", 
        "reply": "How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "intTime": 20090425, 
        "postID": 41, 
        "quote": "Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "reply": " Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:45:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "intTime": 20090425, 
        "postID": 42, 
        "quote": "Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "reply": " The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:51:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 43, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp", 
        "reply": " Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:51:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "intTime": 20090425, 
        "postID": 44, 
        "quote": "Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "reply": " I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:58:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist. Is Rush Limbaugh being a racist in THIS particular incident? probably not...but his comments sure as hell will incite racist thoughts in some people... \"That darkie took long to act because those were his people...\" That is what he is inciting...", 
        "intTime": 20090425, 
        "postID": 45, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "reply": " Is Rush Limbaugh being a racist in THIS particular incident? probably not...but his comments sure as hell will incite racist thoughts in some people... \"That darkie took long to act because those were his people...\" That is what he is inciting...", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:59:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh Am I missing something here, but what in the hell does that have to do with the successful Navy SEAL operation that led the rescue of an American, and the death of three pirates?? What young American is going to buy that crap? This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "intTime": 20090425, 
        "postID": 46, 
        "quote": "\"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh", 
        "reply": " Am I missing something here, but what in the hell does that have to do with the successful Navy SEAL operation that led the rescue of an American, and the death of three pirates?? What young American is going to buy that crap? This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:11:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 bottom fishing again and I get a twinkie", 
        "intTime": 20090425, 
        "postID": 47, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "reply": " bottom fishing again and I get a twinkie", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:48:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: This man must be a liberal in disguse or something sabotaging the future of the GOP.. Now that's a thought. Rush has been part of a vast Left Wing Conspiracy for 20 some years to bring down the GOP. Glad to see that it's finally coming to fruition.", 
        "intTime": 20090425, 
        "postID": 48, 
        "quote": "This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "reply": " Now that's a thought. Rush has been part of a vast Left Wing Conspiracy for 20 some years to bring down the GOP. Glad to see that it's finally coming to fruition.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:58:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "--- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "intTime": 20090425, 
        "postID": 49, 
        "quote": "", 
        "reply": "--- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:18:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb.. This is important!!!...I'll contact Newt,Mitt,Fred and the whole gang...Now Obama is one tough political hombre...but Bob Dole is OUR ace in the hole....trust me on this one", 
        "intTime": 20090425, 
        "postID": 50, 
        "quote": "Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "reply": " This is important!!!...I'll contact Newt,Mitt,Fred and the whole gang...Now Obama is one tough political hombre...but Bob Dole is OUR ace in the hole....trust me on this one", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:23:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb.. Eat enough and you might get there.", 
        "intTime": 20090425, 
        "postID": 51, 
        "quote": "Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "reply": " Eat enough and you might get there.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:25:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him. Yes, stating they were Black teenagers is merely a fact. It's how he connected the dots that made Shane throw down on him. The germaine fact is that they were friggin PIRATES. Racism still exists but this is not a racist nation. Far from it. Black people cannot elect a Black President all by themselves.", 
        "intTime": 20090425, 
        "postID": 52, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "reply": " Yes, stating they were Black teenagers is merely a fact. It's how he connected the dots that made Shane throw down on him. The germaine fact is that they were friggin PIRATES. Racism still exists but this is not a racist nation. Far from it. Black people cannot elect a Black President all by themselves.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:34:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Seems the real heros know what the deal is. >http://www.thebostonchannel.com/cnn-news/19273935/detail.html Shane Murphy, second-in-command aboard the ship seized by Somali pirates this month, is happy to be home. But he's not happy to be sharing turf with land-lubber Rush Limbaugh, who politicized the pirate affair by referring to the pirates as \"black teenagers.\" \"It feels great to be home,\" said Murphy in an interview with WCBV in Boston. \"It feels like everyone around here has my back, with the exception of Rush Limbaugh, who is trying to make this into a race issue...that's disgusting.\" In another article Chairman Rush suggested that's why President Obama was at church. \"He was worried about the order he had given to wipe out three teenagers on the high seas. Black Muslim teenagers\", said Chairman Rush. It's no wonder the Repubs are in the crapper.", 
        "intTime": 20090425, 
        "postID": 53, 
        "quote": "", 
        "reply": "Seems the real heros know what the deal is. >http://www.thebostonchannel.com/cnn-news/19273935/detail.html Shane Murphy, second-in-command aboard the ship seized by Somali pirates this month, is happy to be home. But he's not happy to be sharing turf with land-lubber Rush Limbaugh, who politicized the pirate affair by referring to the pirates as \"black teenagers.\" \"It feels great to be home,\" said Murphy in an interview with WCBV in Boston. \"It feels like everyone around here has my back, with the exception of Rush Limbaugh, who is trying to make this into a race issue...that's disgusting.\" In another article Chairman Rush suggested that's why President Obama was at church. \"He was worried about the order he had given to wipe out three teenagers on the high seas. Black Muslim teenagers\", said Chairman Rush. It's no wonder the Repubs are in the crapper.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 12:35:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "\"Thud\" just like your post... \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 54, 
        "quote": "", 
        "reply": "\"Thud\" just like your post... \"The World's Finest\"", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 12:56:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: \"Thud\" just like your post... Of course.", 
        "intTime": 20090425, 
        "postID": 55, 
        "quote": "Originally posted by Kegler300: \"Thud\" just like your post...", 
        "reply": " Of course.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:01:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "", 
        "intTime": 20090425, 
        "postID": 56, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:01:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm No, Shane Murphy pointed it out but I'm happy to bring it to your attention.", 
        "intTime": 20090425, 
        "postID": 57, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " No, Shane Murphy pointed it out but I'm happy to bring it to your attention.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:06:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "intTime": 20090425, 
        "postID": 58, 
        "quote": "", 
        "reply": "Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:07:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp", 
        "intTime": 20090425, 
        "postID": 59, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " The talk show puss gut dope fiend that won't run for office...just chirp", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:23:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "It is not \"Chairman Rush\". That would be Michael Steele, RNC Chairman. No further comment as I do not wish to further this agenda. I find it it quite a waste of time to point-counterpoint with those with deeply entrenched ideology. I feel nothing will change your mind and/or retract your \"spin\". I learned long ago..do not bite when it is slanted. IMHO. Thank you....Signed Agent 99.", 
        "intTime": 20090425, 
        "postID": 60, 
        "quote": "", 
        "reply": "It is not \"Chairman Rush\". That would be Michael Steele, RNC Chairman. No further comment as I do not wish to further this agenda. I find it it quite a waste of time to point-counterpoint with those with deeply entrenched ideology. I feel nothing will change your mind and/or retract your \"spin\". I learned long ago..do not bite when it is slanted. IMHO. Thank you....Signed Agent 99.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:26:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING. Finally, we agree. Race had nothing to do with this.", 
        "intTime": 20090425, 
        "postID": 61, 
        "quote": "Originally posted by Irwin_R_Schyster: Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "reply": " Finally, we agree. Race had nothing to do with this.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:27:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp He doesn't need to run for office, he's heard by a larger audience right where he is. Right. Especially since he's assumed his rightful place as Chairman of the GOP. And his audience is even bigger only must of the new listeners just tune in to laugh at him.", 
        "intTime": 20090425, 
        "postID": 62, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp He doesn't need to run for office, he's heard by a larger audience right where he is.", 
        "reply": " Right. Especially since he's assumed his rightful place as Chairman of the GOP. And his audience is even bigger only must of the new listeners just tune in to laugh at him.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:41:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "MOD HAT OFF quote: Originally posted by samh32: Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "intTime": 20090425, 
        "postID": 63, 
        "quote": "Originally posted by samh32:", 
        "reply": "MOD HAT OFF  Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:43:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "USNVet940"
    }, 
    {
        "content": "quote: Originally posted by USNVet940: MOD HAT OFF Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? [/QUOTE] I said it once, and I'll say it a thousand times...Moderators Moderate!!", 
        "intTime": 20090425, 
        "postID": 64, 
        "quote": "Originally posted by USNVet940: MOD HAT OFF", 
        "reply": " Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? [/QUOTE] I said it once, and I'll say it a thousand times...Moderators Moderate!!", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:57:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm Rush is free to register & join the discussions here anytime he wants to. I didn't see anything in the TOS barring chickenhawks from posting.", 
        "intTime": 20090425, 
        "postID": 65, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " Rush is free to register & join the discussions here anytime he wants to. I didn't see anything in the TOS barring chickenhawks from posting.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "intTime": 20090425, 
        "postID": 66, 
        "quote": "", 
        "reply": "How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "intTime": 20090425, 
        "postID": 67, 
        "quote": "Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "reply": " Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:45:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "intTime": 20090425, 
        "postID": 68, 
        "quote": "Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "reply": " The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:51:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 69, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp", 
        "reply": " Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:51:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "intTime": 20090425, 
        "postID": 70, 
        "quote": "Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "reply": " I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:58:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist. Is Rush Limbaugh being a racist in THIS particular incident? probably not...but his comments sure as hell will incite racist thoughts in some people... \"That darkie took long to act because those were his people...\" That is what he is inciting...", 
        "intTime": 20090425, 
        "postID": 71, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "reply": " Is Rush Limbaugh being a racist in THIS particular incident? probably not...but his comments sure as hell will incite racist thoughts in some people... \"That darkie took long to act because those were his people...\" That is what he is inciting...", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:59:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh Am I missing something here, but what in the hell does that have to do with the successful Navy SEAL operation that led the rescue of an American, and the death of three pirates?? What young American is going to buy that crap? This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "intTime": 20090425, 
        "postID": 72, 
        "quote": "\"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh", 
        "reply": " Am I missing something here, but what in the hell does that have to do with the successful Navy SEAL operation that led the rescue of an American, and the death of three pirates?? What young American is going to buy that crap? This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:11:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 bottom fishing again and I get a twinkie", 
        "intTime": 20090425, 
        "postID": 73, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "reply": " bottom fishing again and I get a twinkie", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:48:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: This man must be a liberal in disguse or something sabotaging the future of the GOP.. Now that's a thought. Rush has been part of a vast Left Wing Conspiracy for 20 some years to bring down the GOP. Glad to see that it's finally coming to fruition.", 
        "intTime": 20090425, 
        "postID": 74, 
        "quote": "This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "reply": " Now that's a thought. Rush has been part of a vast Left Wing Conspiracy for 20 some years to bring down the GOP. Glad to see that it's finally coming to fruition.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:58:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "--- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "intTime": 20090425, 
        "postID": 75, 
        "quote": "", 
        "reply": "--- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:18:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb.. This is important!!!...I'll contact Newt,Mitt,Fred and the whole gang...Now Obama is one tough political hombre...but Bob Dole is OUR ace in the hole....trust me on this one", 
        "intTime": 20090425, 
        "postID": 76, 
        "quote": "Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "reply": " This is important!!!...I'll contact Newt,Mitt,Fred and the whole gang...Now Obama is one tough political hombre...but Bob Dole is OUR ace in the hole....trust me on this one", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:23:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb.. Eat enough and you might get there.", 
        "intTime": 20090425, 
        "postID": 77, 
        "quote": "Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "reply": " Eat enough and you might get there.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:25:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him. Yes, stating they were Black teenagers is merely a fact. It's how he connected the dots that made Shane throw down on him. The germaine fact is that they were friggin PIRATES. Racism still exists but this is not a racist nation. Far from it. Black people cannot elect a Black President all by themselves.", 
        "intTime": 20090425, 
        "postID": 78, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "reply": " Yes, stating they were Black teenagers is merely a fact. It's how he connected the dots that made Shane throw down on him. The germaine fact is that they were friggin PIRATES. Racism still exists but this is not a racist nation. Far from it. Black people cannot elect a Black President all by themselves.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:34:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Seems the real heros know what the deal is. >http://www.thebostonchannel.com/cnn-news/19273935/detail.html Shane Murphy, second-in-command aboard the ship seized by Somali pirates this month, is happy to be home. But he's not happy to be sharing turf with land-lubber Rush Limbaugh, who politicized the pirate affair by referring to the pirates as \"black teenagers.\" \"It feels great to be home,\" said Murphy in an interview with WCBV in Boston. \"It feels like everyone around here has my back, with the exception of Rush Limbaugh, who is trying to make this into a race issue...that's disgusting.\" In another article Chairman Rush suggested that's why President Obama was at church. \"He was worried about the order he had given to wipe out three teenagers on the high seas. Black Muslim teenagers\", said Chairman Rush. It's no wonder the Repubs are in the crapper.", 
        "intTime": 20090425, 
        "postID": 79, 
        "quote": "", 
        "reply": "Seems the real heros know what the deal is. >http://www.thebostonchannel.com/cnn-news/19273935/detail.html Shane Murphy, second-in-command aboard the ship seized by Somali pirates this month, is happy to be home. But he's not happy to be sharing turf with land-lubber Rush Limbaugh, who politicized the pirate affair by referring to the pirates as \"black teenagers.\" \"It feels great to be home,\" said Murphy in an interview with WCBV in Boston. \"It feels like everyone around here has my back, with the exception of Rush Limbaugh, who is trying to make this into a race issue...that's disgusting.\" In another article Chairman Rush suggested that's why President Obama was at church. \"He was worried about the order he had given to wipe out three teenagers on the high seas. Black Muslim teenagers\", said Chairman Rush. It's no wonder the Repubs are in the crapper.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 12:35:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "\"Thud\" just like your post... \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 80, 
        "quote": "", 
        "reply": "\"Thud\" just like your post... \"The World's Finest\"", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 12:56:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: \"Thud\" just like your post... Of course.", 
        "intTime": 20090425, 
        "postID": 81, 
        "quote": "Originally posted by Kegler300: \"Thud\" just like your post...", 
        "reply": " Of course.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:01:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "", 
        "intTime": 20090425, 
        "postID": 82, 
        "quote": "", 
        "reply": "", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:01:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm No, Shane Murphy pointed it out but I'm happy to bring it to your attention.", 
        "intTime": 20090425, 
        "postID": 83, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " No, Shane Murphy pointed it out but I'm happy to bring it to your attention.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:06:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "intTime": 20090425, 
        "postID": 84, 
        "quote": "", 
        "reply": "Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:07:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp", 
        "intTime": 20090425, 
        "postID": 85, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " The talk show puss gut dope fiend that won't run for office...just chirp", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:23:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "It is not \"Chairman Rush\". That would be Michael Steele, RNC Chairman. No further comment as I do not wish to further this agenda. I find it it quite a waste of time to point-counterpoint with those with deeply entrenched ideology. I feel nothing will change your mind and/or retract your \"spin\". I learned long ago..do not bite when it is slanted. IMHO. Thank you....Signed Agent 99.", 
        "intTime": 20090425, 
        "postID": 86, 
        "quote": "", 
        "reply": "It is not \"Chairman Rush\". That would be Michael Steele, RNC Chairman. No further comment as I do not wish to further this agenda. I find it it quite a waste of time to point-counterpoint with those with deeply entrenched ideology. I feel nothing will change your mind and/or retract your \"spin\". I learned long ago..do not bite when it is slanted. IMHO. Thank you....Signed Agent 99.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:26:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING. Finally, we agree. Race had nothing to do with this.", 
        "intTime": 20090425, 
        "postID": 87, 
        "quote": "Originally posted by Irwin_R_Schyster: Come on, why even mention \"Black teenagers?\" WTF Does this have to do with a PIRATE, HOSTAGE SITUATION?? \"If a white president ordered them shot there would be hell to pay\" He said something to that effect, and the message was loud and clear. RACE BAITING.", 
        "reply": " Finally, we agree. Race had nothing to do with this.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:27:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp He doesn't need to run for office, he's heard by a larger audience right where he is. Right. Especially since he's assumed his rightful place as Chairman of the GOP. And his audience is even bigger only must of the new listeners just tune in to laugh at him.", 
        "intTime": 20090425, 
        "postID": 88, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp He doesn't need to run for office, he's heard by a larger audience right where he is.", 
        "reply": " Right. Especially since he's assumed his rightful place as Chairman of the GOP. And his audience is even bigger only must of the new listeners just tune in to laugh at him.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:41:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "MOD HAT OFF quote: Originally posted by samh32: Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "intTime": 20090425, 
        "postID": 89, 
        "quote": "Originally posted by samh32:", 
        "reply": "MOD HAT OFF  Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? \"I've a good mind to join a club and beat you over the head with it.\"--Groucho Marx", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:43:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "USNVet940"
    }, 
    {
        "content": "quote: Originally posted by USNVet940: MOD HAT OFF Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? [/QUOTE] I said it once, and I'll say it a thousand times...Moderators Moderate!!", 
        "intTime": 20090425, 
        "postID": 90, 
        "quote": "Originally posted by USNVet940: MOD HAT OFF", 
        "reply": " Well, I always knew that FrankenSmallminded was just so much dried worm excrement but what kind of \"observations\" can a moron make with his head up his azz 24/7? [/QUOTE] I said it once, and I'll say it a thousand times...Moderators Moderate!!", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 13:57:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm Rush is free to register & join the discussions here anytime he wants to. I didn't see anything in the TOS barring chickenhawks from posting.", 
        "intTime": 20090425, 
        "postID": 91, 
        "quote": "Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm", 
        "reply": " Rush is free to register & join the discussions here anytime he wants to. I didn't see anything in the TOS barring chickenhawks from posting.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "intTime": 20090425, 
        "postID": 92, 
        "quote": "", 
        "reply": "How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:40:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "intTime": 20090425, 
        "postID": 93, 
        "quote": "Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "reply": " Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:45:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "intTime": 20090425, 
        "postID": 94, 
        "quote": "Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither.", 
        "reply": " The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:51:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090425, 
        "postID": 95, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp", 
        "reply": " Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:51:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "intTime": 20090425, 
        "postID": 96, 
        "quote": "Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that?", 
        "reply": " I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:58:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist. Is Rush Limbaugh being a racist in THIS particular incident? probably not...but his comments sure as hell will incite racist thoughts in some people... \"That darkie took long to act because those were his people...\" That is what he is inciting...", 
        "intTime": 20090425, 
        "postID": 97, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by Bleah: How is it racist to say that three black teenagers are three black teenagers? How does that express a belief in the inherent superiority of one race over another? It doesn't. If his statement is racist, it is ageist as well - but it is neither. The pirates were from a region of Africa where nearly everyone knows the indigenous population is black, so I'm not sure why he felt the need to specify that they were \"black teenagers\". The distinction was kind of pointless, but it's a bit of a stretch to call it racist.", 
        "reply": " Is Rush Limbaugh being a racist in THIS particular incident? probably not...but his comments sure as hell will incite racist thoughts in some people... \"That darkie took long to act because those were his people...\" That is what he is inciting...", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 14:59:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh Am I missing something here, but what in the hell does that have to do with the successful Navy SEAL operation that led the rescue of an American, and the death of three pirates?? What young American is going to buy that crap? This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "intTime": 20090425, 
        "postID": 98, 
        "quote": "\"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh", 
        "reply": " Am I missing something here, but what in the hell does that have to do with the successful Navy SEAL operation that led the rescue of an American, and the death of three pirates?? What young American is going to buy that crap? This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:11:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 bottom fishing again and I get a twinkie", 
        "intTime": 20090425, 
        "postID": 99, 
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by scottrj50: quote: Originally posted by klassylady25: Rush isn't here to defend and you're the one pointing out a \"race\" thing. Hmmmm The talk show puss gut dope fiend that won't run for office...just chirp Kind of like you..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "reply": " bottom fishing again and I get a twinkie", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:48:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: This man must be a liberal in disguse or something sabotaging the future of the GOP.. Now that's a thought. Rush has been part of a vast Left Wing Conspiracy for 20 some years to bring down the GOP. Glad to see that it's finally coming to fruition.", 
        "intTime": 20090425, 
        "postID": 100, 
        "quote": "This man must be a liberal in disguse or something sabotaging the future of the GOP..", 
        "reply": " Now that's a thought. Rush has been part of a vast Left Wing Conspiracy for 20 some years to bring down the GOP. Glad to see that it's finally coming to fruition.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 15:58:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "--- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "intTime": 20090425, 
        "postID": 101, 
        "quote": "", 
        "reply": "--- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:18:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb.. This is important!!!...I'll contact Newt,Mitt,Fred and the whole gang...Now Obama is one tough political hombre...but Bob Dole is OUR ace in the hole....trust me on this one", 
        "intTime": 20090425, 
        "postID": 102, 
        "quote": "Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "reply": " This is important!!!...I'll contact Newt,Mitt,Fred and the whole gang...Now Obama is one tough political hombre...but Bob Dole is OUR ace in the hole....trust me on this one", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:23:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb.. Eat enough and you might get there.", 
        "intTime": 20090425, 
        "postID": 103, 
        "quote": "Originally posted by LuckySoFar: --- A caller to Sean Hannity`s show suggested that Hussane was guilty of (black-on-black) crime knowing the pirates were black, & giving the \"GO\".. The ultra left has had a deep 20 year hatred of Rush giving countless millions to liberal type causes & charities..They just can`t freaking stand it..gripes their doughnuts to no end.. Not just the 4.2 million for \"dim-bulb, Sen. Reid`s letter\", but for last weeks (yearly) $400k+ to his M.S. call-a-thon deal..the list is 20 years long..//.all they have is, \"Rush is fat\"...that`s all they have../ P.S. ,, Fatso has lost 30+ lbs. lately,,his words..-- but of course he`s still fat, rich, evil, greedy and running the G.O.P.- yea, right..I should be so fat & dumb..", 
        "reply": " Eat enough and you might get there.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:25:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him. Yes, stating they were Black teenagers is merely a fact. It's how he connected the dots that made Shane throw down on him. The germaine fact is that they were friggin PIRATES. Racism still exists but this is not a racist nation. Far from it. Black people cannot elect a Black President all by themselves.", 
        "intTime": 20090425, 
        "postID": 104, 
        "quote": "Originally posted by BPCR45_90: quote: Originally posted by Thud357L: Rush implied that the Black President was deeply troubled by having to act against the pirates just because they were Black. That if a White President had done the exact same thing there would be a huge uproar. You couldn't see that? I didn't hear the broadcast in question. The \"black teenagers\" quote taken by itself doesn't sound racist...just kind of stupid. But if it was used in the context you stated above it does sound like Rush was accusing Obama of being racist. That is a disgusting use of the race card on Rush's part, which seems perfectly in character for him.", 
        "reply": " Yes, stating they were Black teenagers is merely a fact. It's how he connected the dots that made Shane throw down on him. The germaine fact is that they were friggin PIRATES. Racism still exists but this is not a racist nation. Far from it. Black people cannot elect a Black President all by themselves.", 
        "threadID": "409192893_2880057122001", 
        "time": "2009-04-25 16:34:00", 
        "title": "Shane Murphy Blasts Limbaugh as racist", 
        "userID": "Thud357L"
    }
]