[
    {
        "content": "PinocchiObama, who likes to compare himself to President Lincoln, apparently cannot read. quote: \"You cannot bring about prosperity by discouraging thrift. You cannot strengthen the weak by weakening the strong. You cannot help the wage earner by pulling down the wage payer. You cannot further the brotherhood of man by encouraging class hatred. You cannot help the poor by destroying the rich. You cannot keep out of trouble by spending more than you earn. You cannot build character and courage by taking away man's initiative and independence. You cannot help men permanently by doing for them what they could and should do for themselves.\" — Abraham Lincoln \"The World's Finest\"", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "\"You cannot bring about prosperity by discouraging thrift. You cannot strengthen the weak by weakening the strong. You cannot help the wage earner by pulling down the wage payer. You cannot further the brotherhood of man by encouraging class hatred. You cannot help the poor by destroying the rich. You cannot keep out of trouble by spending more than you earn. You cannot build character and courage by taking away man's initiative and independence. You cannot help men permanently by doing for them what they could and should do for themselves.\" — Abraham Lincoln", 
        "reply": "PinocchiObama, who likes to compare himself to President Lincoln, apparently cannot read.  \"The World's Finest\"", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 15:51:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "Kegler300"
    }, 
    {
        "content": "There's a significant difference between CITING Lincoln and using him as an EXEMPLAR and stating \"I am just like Lincoln.\" Which are you claiming that Obama has done? Obama has made no secret of his admiration for Lincoln and openly used him as inspiration for much of his inaugural address. So your beef is ... ???", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "There's a significant difference between CITING Lincoln and using him as an EXEMPLAR and stating \"I am just like Lincoln.\" Which are you claiming that Obama has done? Obama has made no secret of his admiration for Lincoln and openly used him as inspiration for much of his inaugural address. So your beef is ... ???", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 15:56:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: So your beef is ... ??? He will speak evil of the president as often as he can over the next eight years. That you can depend on.", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "So your beef is ... ???", 
        "reply": " He will speak evil of the president as often as he can over the next eight years. That you can depend on.", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 17:04:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: So your beef is ... ??? He will speak evil of the president as often as he can over the next eight years. That you can depend on. That is an awfully bold projection that he will even be in office by the end of this four years. He keeps ticking off more and more Americans, the midterms next year could seal his fate.", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "Originally posted by FrJohn1123: quote: So your beef is ... ??? He will speak evil of the president as often as he can over the next eight years. That you can depend on.", 
        "reply": " That is an awfully bold projection that he will even be in office by the end of this four years. He keeps ticking off more and more Americans, the midterms next year could seal his fate.", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 17:08:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: PinocchiObama, who likes to compare himself to President Lincoln, apparently cannot read. quote: \"You cannot bring about prosperity by discouraging thrift. You cannot strengthen the weak by weakening the strong. You cannot help the wage earner by pulling down the wage payer. You cannot further the brotherhood of man by encouraging class hatred. You cannot help the poor by destroying the rich. You cannot keep out of trouble by spending more than you earn. You cannot build character and courage by taking away man's initiative and independence. You cannot help men permanently by doing for them what they could and should do for themselves.\" — Abraham Lincoln another rerun thread title Lincoln/OBama.....Cut n' Paste", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "Originally posted by Kegler300: PinocchiObama, who likes to compare himself to President Lincoln, apparently cannot read. quote: \"You cannot bring about prosperity by discouraging thrift. You cannot strengthen the weak by weakening the strong. You cannot help the wage earner by pulling down the wage payer. You cannot further the brotherhood of man by encouraging class hatred. You cannot help the poor by destroying the rich. You cannot keep out of trouble by spending more than you earn. You cannot build character and courage by taking away man's initiative and independence. You cannot help men permanently by doing for them what they could and should do for themselves.\" — Abraham Lincoln", 
        "reply": " another rerun thread title Lincoln/OBama.....Cut n' Paste", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 17:23:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by seaservicefan: quote: Originally posted by FrJohn1123: quote: So your beef is ... ??? He will speak evil of the president as often as he can over the next eight years. That you can depend on. That is an awfully bold projection that he will even be in office by the end of this four years. He keeps ticking off more and more Americans, the midterms next year could seal his fate. Ticking off? Yes he is ticking off those from the party of no. The last two elections have proven what the rest of us think of their politics. Good luck at the midterms....you will need a miracle.", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "Originally posted by seaservicefan: quote: Originally posted by FrJohn1123: quote: So your beef is ... ??? He will speak evil of the president as often as he can over the next eight years. That you can depend on. That is an awfully bold projection that he will even be in office by the end of this four years. He keeps ticking off more and more Americans, the midterms next year could seal his fate.", 
        "reply": " Ticking off? Yes he is ticking off those from the party of no. The last two elections have proven what the rest of us think of their politics. Good luck at the midterms....you will need a miracle.", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 17:30:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by seaservicefan: quote: Originally posted by FrJohn1123: quote: So your beef is ... ??? He will speak evil of the president as often as he can over the next eight years. That you can depend on. That is an awfully bold projection that he will even be in office by the end of this four years. He keeps ticking off more and more Americans, the midterms next year could seal his fate. Ticking off? Yes he is ticking off those from the party of no. The last two elections have proven what the rest of us think of their politics. Good luck at the midterms....you will need a miracle. So how insignificant do you see the terrified New Yorkers after his stunt this week? He is being viewed as either incompetent or a liar for his \"outrage\". There are many more who are pretty disappointed that he didn't deliver on his campaign promises (typical politician - make promises to get elected then don't deliver). And what about the payback by the taxpayers of their stimulus money next year? The midterms have no \"rock star\" on which to pin a straight-ticket vote next year. So I can see the majority going back to the Republicans next year.", 
        "intTime": 20090501, 
        "postID": 7, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by seaservicefan: quote: Originally posted by FrJohn1123: quote: So your beef is ... ??? He will speak evil of the president as often as he can over the next eight years. That you can depend on. That is an awfully bold projection that he will even be in office by the end of this four years. He keeps ticking off more and more Americans, the midterms next year could seal his fate. Ticking off? Yes he is ticking off those from the party of no. The last two elections have proven what the rest of us think of their politics. Good luck at the midterms....you will need a miracle.", 
        "reply": " So how insignificant do you see the terrified New Yorkers after his stunt this week? He is being viewed as either incompetent or a liar for his \"outrage\". There are many more who are pretty disappointed that he didn't deliver on his campaign promises (typical politician - make promises to get elected then don't deliver). And what about the payback by the taxpayers of their stimulus money next year? The midterms have no \"rock star\" on which to pin a straight-ticket vote next year. So I can see the majority going back to the Republicans next year.", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 18:10:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "quote: his stunt this week? His stunt? Thanks for proving my point: Wackos will stop at nothing.", 
        "intTime": 20090501, 
        "postID": 8, 
        "quote": "his stunt this week?", 
        "reply": " His stunt? Thanks for proving my point: Wackos will stop at nothing.", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 19:44:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: his stunt this week? His stunt? Thanks for proving my point: Wackos will stop at nothing. What point is that? That you Obammanites are so obsessed by your messiah that you will let any and everything he does go? So tell me, did he lie or is he incompetent?", 
        "intTime": 20090501, 
        "postID": 9, 
        "quote": "Originally posted by FrJohn1123: quote: his stunt this week? His stunt? Thanks for proving my point: Wackos will stop at nothing.", 
        "reply": " What point is that? That you Obammanites are so obsessed by your messiah that you will let any and everything he does go? So tell me, did he lie or is he incompetent?", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 20:09:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "seaservicefan"
    }, 
    {
        "content": "IN A PIGS EYES.. HE IS SO FULL ODF HIMSELF ITS NOT FNY. WHEN HE IS ON THE AIR. I MUTE OR CHANGE CHANNELS.", 
        "intTime": 20090501, 
        "postID": 10, 
        "quote": "", 
        "reply": "IN A PIGS EYES.. HE IS SO FULL ODF HIMSELF ITS NOT FNY. WHEN HE IS ON THE AIR. I MUTE OR CHANGE CHANNELS.", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-01 21:11:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by seaservicefan: quote: Originally posted by FrJohn1123: quote: his stunt this week? His stunt? Thanks for proving my point: Wackos will stop at nothing. What point is that? That you Obammanites are so obsessed by your messiah that you will let any and everything he does go? So tell me, did he lie or is he incompetent? That expensive, dangerous, completely unnecessary stunt over NYC was clearly GW Bush's fault. You're not dealing with rational people here, seaservicefan. B.O. could strangle a baby on live national TV and deranged Obamaphiles like FrJohn would still defend \"H\"im.", 
        "intTime": 20090502, 
        "postID": 11, 
        "quote": "Originally posted by seaservicefan: quote: Originally posted by FrJohn1123: quote: his stunt this week? His stunt? Thanks for proving my point: Wackos will stop at nothing. What point is that? That you Obammanites are so obsessed by your messiah that you will let any and everything he does go? So tell me, did he lie or is he incompetent?", 
        "reply": " That expensive, dangerous, completely unnecessary stunt over NYC was clearly GW Bush's fault. You're not dealing with rational people here, seaservicefan. B.O. could strangle a baby on live national TV and deranged Obamaphiles like FrJohn would still defend \"H\"im.", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-02 19:55:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Either Lincoln or Obama would probably go far concerning my last penny. One to return my last penny, the other to take it. This message has been edited. Last edited by: catahoulagill, Sun 03 May 2009 05:27 AM", 
        "intTime": 20090502, 
        "postID": 12, 
        "quote": "", 
        "reply": "Either Lincoln or Obama would probably go far concerning my last penny. One to return my last penny, the other to take it. This message has been edited. Last edited by: catahoulagill, Sun 03 May 2009 05:27 AM", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-02 20:06:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Obama uses Lincoln as a prop if and when it suits \"H\"im to do so. Clearly, \"H\"e does not believe in the principles that Lincoln espoused, else The One would govern accordingly. Were Lincoln alive today I suspect he'd challenge B.O. to a debate on the proper role of our government, (with no teleprompters allowed).. and B.O. would decline to participate.", 
        "intTime": 20090502, 
        "postID": 13, 
        "quote": "", 
        "reply": "Obama uses Lincoln as a prop if and when it suits \"H\"im to do so. Clearly, \"H\"e does not believe in the principles that Lincoln espoused, else The One would govern accordingly. Were Lincoln alive today I suspect he'd challenge B.O. to a debate on the proper role of our government, (with no teleprompters allowed).. and B.O. would decline to participate.", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-02 20:20:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: FrJohn1123: He will speak evil of the president as often as he can over the next eight years. That you can depend on. LOL... How can that be? No one spoke evil of President George W. Bush during his presidency. Why would anyone want to speak evil of Obama?", 
        "intTime": 20090502, 
        "postID": 14, 
        "quote": "FrJohn1123: He will speak evil of the president as often as he can over the next eight years. That you can depend on.", 
        "reply": " LOL... How can that be? No one spoke evil of President George W. Bush during his presidency. Why would anyone want to speak evil of Obama?", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-02 20:32:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "I wonder if he realized that he is nowhere near Lincoln when he did this comparison?", 
        "intTime": 20090503, 
        "postID": 15, 
        "quote": "", 
        "reply": "I wonder if he realized that he is nowhere near Lincoln when he did this comparison?", 
        "threadID": "409192893_4310082222001", 
        "time": "2009-05-03 05:18:00", 
        "title": "Obama compares himself to Lincoln", 
        "userID": "Woody_in_La"
    }
]