[
    {
        "content": "PHBO's first two months in office: Close GTMO with possibility of releasing enemy combatants into the USA. Drops the terms \"enemy combatants, terrorists, terrorism, war on terror, etc.,\" as not being politically correct enough. Offers to drop missile shield so that our EU position is greatly weakened, and Russia's is greatly strengthened. Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). Wants to talk and play nice with Iran's Imanutjob, the same guy who was a hostage taker in the Carter days. Raises debt more than all previous Presidents combined, and is only just getting warmed up. Lied about 5 day public viewing of Stimulus bill. Lied about no earmarks in Stimulus bill. Lied about it even being a \"Stimulus\" bill. Thanked himself in a speech. Is on record as wanting to create his own civilian armed forces. Paid ACORN 4 billion of taxpayer money for services rendered. Wants to demand by law \"voluntary\" service of all children. Wants to cap and trade and kill the energy industry. Wants to legitimize illegal aliens, thus ensuring Democrats rule for just about forever. Gives \"wrong region\" DVDS to England's PM. Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. Disses the Special Olympics on the Jay Leno show. Nominates tax cheat after tax cheat for cabinet positions. \"Didn't know\" about the AIG bonuses. Compared AIG to suicide bombers. Created the environment for the stock market plunge, and the destruction of small businesses. \"The World's Finest\"", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "", 
        "reply": "PHBO's first two months in office: Close GTMO with possibility of releasing enemy combatants into the USA. Drops the terms \"enemy combatants, terrorists, terrorism, war on terror, etc.,\" as not being politically correct enough. Offers to drop missile shield so that our EU position is greatly weakened, and Russia's is greatly strengthened. Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). Wants to talk and play nice with Iran's Imanutjob, the same guy who was a hostage taker in the Carter days. Raises debt more than all previous Presidents combined, and is only just getting warmed up. Lied about 5 day public viewing of Stimulus bill. Lied about no earmarks in Stimulus bill. Lied about it even being a \"Stimulus\" bill. Thanked himself in a speech. Is on record as wanting to create his own civilian armed forces. Paid ACORN 4 billion of taxpayer money for services rendered. Wants to demand by law \"voluntary\" service of all children. Wants to cap and trade and kill the energy industry. Wants to legitimize illegal aliens, thus ensuring Democrats rule for just about forever. Gives \"wrong region\" DVDS to England's PM. Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. Disses the Special Olympics on the Jay Leno show. Nominates tax cheat after tax cheat for cabinet positions. \"Didn't know\" about the AIG bonuses. Compared AIG to suicide bombers. Created the environment for the stock market plunge, and the destruction of small businesses. \"The World's Finest\"", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 04:57:00", 
        "title": "The First 60 Days", 
        "userID": "Kegler300"
    }, 
    {
        "content": "why are you so mean and cruel??", 
        "intTime": 20090320, 
        "postID": 2, 
        "quote": "", 
        "reply": "why are you so mean and cruel??", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 05:23:00", 
        "title": "The First 60 Days", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Change we can count on. Yes we can.", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "", 
        "reply": "Change we can count on. Yes we can.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 06:08:00", 
        "title": "The First 60 Days", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Lies? Why not just pick one item from the list, and refute it if you can? Teleprompter typos don't count. \"The World's Finest\"", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "", 
        "reply": "Lies? Why not just pick one item from the list, and refute it if you can? Teleprompter typos don't count. \"The World's Finest\"", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 06:40:00", 
        "title": "The First 60 Days", 
        "userID": "Kegler300"
    }, 
    {
        "content": "KEGLER; not to berate your very good effort....but you forgot his crowning as the NEW, Wizard of Uh's!!!!!!", 
        "intTime": 20090320, 
        "postID": 5, 
        "quote": "", 
        "reply": "KEGLER; not to berate your very good effort....but you forgot his crowning as the NEW, Wizard of Uh's!!!!!!", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:03:00", 
        "title": "The First 60 Days", 
        "userID": "tawodi"
    }, 
    {
        "content": "Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil?", 
        "intTime": 20090320, 
        "postID": 6, 
        "quote": "", 
        "reply": "Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil?", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:15:00", 
        "title": "The First 60 Days", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "Why is it when a republican make a gaff, like the pres. did on leno last night it is the end of civilization as we knew it!!! But when Hilary, the Pres. or any of this illustious crew, steps on their own cranks and falls into their own nether regions, it's, oh come on!! Can't we move on??!!?? Can't you just understand everybodies human!! We all make mistakes....and all the rest of the dismissive crap we're hearing RIGHT NOW!!!!", 
        "intTime": 20090320, 
        "postID": 7, 
        "quote": "", 
        "reply": "Why is it when a republican make a gaff, like the pres. did on leno last night it is the end of civilization as we knew it!!! But when Hilary, the Pres. or any of this illustious crew, steps on their own cranks and falls into their own nether regions, it's, oh come on!! Can't we move on??!!?? Can't you just understand everybodies human!! We all make mistakes....and all the rest of the dismissive crap we're hearing RIGHT NOW!!!!", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:16:00", 
        "title": "The First 60 Days", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. He sent Hillary to Russia with a reset button? No that is not how it went down. It was her idea and she relied on a staffer to translate \"reset\" and he/she got it wrong. BFD Hey in the imortal words of seawitch: If it happened on his watch, its his fault.", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "Originally posted by dmuhler: quote: Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. He sent Hillary to Russia with a reset button? No that is not how it went down. It was her idea and she relied on a staffer to translate \"reset\" and he/she got it wrong. BFD", 
        "reply": " Hey in the imortal words of seawitch: If it happened on his watch, its his fault.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:32:00", 
        "title": "The First 60 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\"", 
        "intTime": 20090320, 
        "postID": 9, 
        "quote": "Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil?", 
        "reply": " Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\"", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:35:00", 
        "title": "The First 60 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\" And you believe him, word for word here?", 
        "intTime": 20090320, 
        "postID": 10, 
        "quote": "Originally posted by threerings: quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\"", 
        "reply": " And you believe him, word for word here?", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 09:18:00", 
        "title": "The First 60 Days", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: PHBO's first two months in office: Close GTMO with possibility of releasing enemy combatants into the USA. Gee, the possibility? And your proof is that they're going to be released in this country? Drops the terms \"enemy combatants, terrorists, terrorism, war on terror, etc.,\" as not being politically correct enough. And your proof is? Offers to drop missile shield so that our EU position is greatly weakened, and Russia's is greatly strengthened. And your proof is? Remeber, we're not fighting Russia and the missile shield was again Iran and the shield isn't again a lot of missiles like Russia has, but again a country like Iran or Pakistan or India. or N.Korea who only have a few missiles and might be tempted to take a shot at our EU allies. Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). Money not being payed to Hamas (idiots would know this by reading the paper, not rightwing talking points.) Wants to talk and play nice with Iran's Imanutjob, the same guy who was a hostage taker in the Carter days. So not talking to him gets us what again? Raises debt more than all previous Presidents combined, and is only just getting warmed up. Gee, didn't hear much from you when Pres. Bush was going great guns Borrowing and spending... Lied about 5 day public viewing of Stimulus bill. So, I see 7 days in the House and 14 days in the Senate. I had no problem finding it By the way, this is from the \"Thomas\" web site. Let's you look at bills and such. Easy, not hard at all. American Recovery and Reinvestment Act of 2009 (stimulus bill) Comm. Vote House votes Comm. Vote Senate Votes H1 1/21/09 1/28/09 S336 1/27/09 2/10/09 <7 days> rc <14 days> 111-3 rc S.Amdt.570 Lied about no earmarks in Stimulus bill. Proof? Or just you interpretation? Lied about it even being a \"Stimulus\" bill. Proof? Or just you interpretation? Thanked himself in a speech. Is on record as wanting to create his own civilian armed forces. Proof? Or just you interpretation? Paid ACORN 4 billion of taxpayer money for services rendered. Proof? Or just you interpretation? Wants to demand by law \"voluntary\" service of all children. Proof? Or just you interpretation? Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Wants to legitimize illegal aliens, thus ensuring Democrats rule for just about forever. Proof? Or just you interpretation? Gives \"wrong region\" DVDS to England's PM. Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. Disses the Special Olympics on the Jay Leno show. Nominates tax cheat after tax cheat for cabinet positions. \"Didn't know\" about the AIG bonuses. Compared AIG to suicide bombers. Created the environment for the stock market plunge, and the destruction of small businesses. Proof? Or just you interpretation? Gads, is that all you can complain about, we librals had Pres. Bush going to war with the wrong people, spying on Americans, claiming phantom WMDs. dropping our approvel ratings with the rest of the world and our allies to a new, all time low. And the number of times both he and his crew of neo-con, couldn't remeber anythig when asked about it... too many to count.", 
        "intTime": 20090320, 
        "postID": 11, 
        "quote": "Originally posted by Kegler300: PHBO's first two months in office: Close GTMO with possibility of releasing enemy combatants into the USA. Gee, the possibility? And your proof is that they're going to be released in this country? Drops the terms \"enemy combatants, terrorists, terrorism, war on terror, etc.,\" as not being politically correct enough. And your proof is? Offers to drop missile shield so that our EU position is greatly weakened, and Russia's is greatly strengthened. And your proof is? Remeber, we're not fighting Russia and the missile shield was again Iran and the shield isn't again a lot of missiles like Russia has, but again a country like Iran or Pakistan or India. or N.Korea who only have a few missiles and might be tempted to take a shot at our EU allies. Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). Money not being payed to Hamas (idiots would know this by reading the paper, not rightwing talking points.) Wants to talk and play nice with Iran's Imanutjob, the same guy who was a hostage taker in the Carter days. So not talking to him gets us what again? Raises debt more than all previous Presidents combined, and is only just getting warmed up. Gee, didn't hear much from you when Pres. Bush was going great guns Borrowing and spending... Lied about 5 day public viewing of Stimulus bill. So, I see 7 days in the House and 14 days in the Senate. I had no problem finding it By the way, this is from the \"Thomas\" web site. Let's you look at bills and such. Easy, not hard at all. American Recovery and Reinvestment Act of 2009 (stimulus bill) Comm. Vote House votes Comm. Vote Senate Votes H1 1/21/09 1/28/09 S336 1/27/09 2/10/09 <7 days> rc <14 days> 111-3 rc S.Amdt.570 Lied about no earmarks in Stimulus bill. Proof? Or just you interpretation? Lied about it even being a \"Stimulus\" bill. Proof? Or just you interpretation? Thanked himself in a speech. Is on record as wanting to create his own civilian armed forces. Proof? Or just you interpretation? Paid ACORN 4 billion of taxpayer money for services rendered. Proof? Or just you interpretation? Wants to demand by law \"voluntary\" service of all children. Proof? Or just you interpretation? Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Wants to legitimize illegal aliens, thus ensuring Democrats rule for just about forever. Proof? Or just you interpretation? Gives \"wrong region\" DVDS to England's PM. Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. Disses the Special Olympics on the Jay Leno show. Nominates tax cheat after tax cheat for cabinet positions. \"Didn't know\" about the AIG bonuses. Compared AIG to suicide bombers. Created the environment for the stock market plunge, and the destruction of small businesses.", 
        "reply": " Proof? Or just you interpretation? Gads, is that all you can complain about, we librals had Pres. Bush going to war with the wrong people, spying on Americans, claiming phantom WMDs. dropping our approvel ratings with the rest of the world and our allies to a new, all time low. And the number of times both he and his crew of neo-con, couldn't remeber anythig when asked about it... too many to count.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 09:41:00", 
        "title": "The First 60 Days", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by threerings: quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\" And you believe him, word for word here? I've also heard Bill say he never had a chance to get Osama...who knows the truth? Oh, ya I do. Why? Because I've read just about every thing I can get my hands when it comes to OBL pre 9-11. That said: OBL attacked us several times before 9-11 and what did Clintons and the Dem's response amount to? A rock tossed in the ocean. So to blame Bush for the failure of 9-11 ( and to be fair, the falures are more failures of the way government works then any one person) is insane.", 
        "intTime": 20090320, 
        "postID": 12, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by threerings: quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\" And you believe him, word for word here?", 
        "reply": " I've also heard Bill say he never had a chance to get Osama...who knows the truth? Oh, ya I do. Why? Because I've read just about every thing I can get my hands when it comes to OBL pre 9-11. That said: OBL attacked us several times before 9-11 and what did Clintons and the Dem's response amount to? A rock tossed in the ocean. So to blame Bush for the failure of 9-11 ( and to be fair, the falures are more failures of the way government works then any one person) is insane.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 09:50:00", 
        "title": "The First 60 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Hey killswitch...you need to go open a newspaper or something.", 
        "intTime": 20090320, 
        "postID": 13, 
        "quote": "Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation?", 
        "reply": " Hey killswitch...you need to go open a newspaper or something.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 09:51:00", 
        "title": "The First 60 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Hey killswitch...you need to go open a newspaper or something. Hey threerings,Work on the reading comprehension That was me on the \"Proof? Or just you interpretation?\" And I already read newspaper, magazines and TV shows and I don't see any problem with the energy industry. Show your proof, list your stories or tv shows or something...", 
        "intTime": 20090320, 
        "postID": 14, 
        "quote": "Originally posted by threerings: quote: Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Hey killswitch...you need to go open a newspaper or something.", 
        "reply": " Hey threerings,Work on the reading comprehension That was me on the \"Proof? Or just you interpretation?\" And I already read newspaper, magazines and TV shows and I don't see any problem with the energy industry. Show your proof, list your stories or tv shows or something...", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 13:25:00", 
        "title": "The First 60 Days", 
        "userID": "Tangler"
    }, 
    {
        "content": "What keg said", 
        "intTime": 20090320, 
        "postID": 15, 
        "quote": "", 
        "reply": "What keg said", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 13:32:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). The money is going to the UN and other organizations to strengthen the Western-backed Palestinian Authority, not Hamas. ...yeah there is no corruption over there....it'll be like when we gave the Iraqis money to pay the IPs & ISF....the higher ups got the money, but it never made it to where it was supposed to go....we should have cut out the middle man & gave it straight to the Muj.", 
        "intTime": 20090320, 
        "postID": 16, 
        "quote": "Originally posted by dmuhler: quote: Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). The money is going to the UN and other organizations to strengthen the Western-backed Palestinian Authority, not Hamas.", 
        "reply": " ...yeah there is no corruption over there....it'll be like when we gave the Iraqis money to pay the IPs & ISF....the higher ups got the money, but it never made it to where it was supposed to go....we should have cut out the middle man & gave it straight to the Muj.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 13:35:00", 
        "title": "The First 60 Days", 
        "userID": "VDoP"
    }, 
    {
        "content": "quote: Originally posted by VDoP: quote: Originally posted by dmuhler: quote: Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). The money is going to the UN and other organizations to strengthen the Western-backed Palestinian Authority, not Hamas. ...yeah there is no corruption over there....it'll be like when we gave the Iraqis money to pay the IPs & ISF....the higher ups got the money, but it never made it to where it was supposed to go....we should have cut out the middle man & gave it straight to the Muj. You work with what your given, in this case, we're giving the money to people who have a big problem with Hamas and we hope they'll take it out on them and not others, but you can only hope.", 
        "intTime": 20090320, 
        "postID": 17, 
        "quote": "Originally posted by VDoP: quote: Originally posted by dmuhler: quote: Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). The money is going to the UN and other organizations to strengthen the Western-backed Palestinian Authority, not Hamas. ...yeah there is no corruption over there....it'll be like when we gave the Iraqis money to pay the IPs & ISF....the higher ups got the money, but it never made it to where it was supposed to go....we should have cut out the middle man & gave it straight to the Muj.", 
        "reply": " You work with what your given, in this case, we're giving the money to people who have a big problem with Hamas and we hope they'll take it out on them and not others, but you can only hope.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 13:41:00", 
        "title": "The First 60 Days", 
        "userID": "Tangler"
    }, 
    {
        "content": "Just think - if due diligence had been properly exercised by Congress and the Bush and Clinton Administrations over the past ten or so years, we wouldn't be here.", 
        "intTime": 20090320, 
        "postID": 18, 
        "quote": "", 
        "reply": "Just think - if due diligence had been properly exercised by Congress and the Bush and Clinton Administrations over the past ten or so years, we wouldn't be here.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 15:47:00", 
        "title": "The First 60 Days", 
        "userID": "mcgreer"
    }, 
    {
        "content": "The first 60 days are just like the next 60 days will be like. Same old BS.", 
        "intTime": 20090320, 
        "postID": 19, 
        "quote": "", 
        "reply": "The first 60 days are just like the next 60 days will be like. Same old BS.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:09:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "My \"hope\" is fading. Actually it faded out 60 days ago.", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "", 
        "reply": "My \"hope\" is fading. Actually it faded out 60 days ago.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:11:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "Guess you expected a magician...", 
        "intTime": 20090320, 
        "postID": 21, 
        "quote": "", 
        "reply": "Guess you expected a magician...", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:21:00", 
        "title": "The First 60 Days", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well, I did expect someone who could walk on water. Thats what I kept hearing. Maybe the trees in my yard will grow money leaves. I expect that will happen also. I do expect promises to be kept though.", 
        "intTime": 20090320, 
        "postID": 22, 
        "quote": "", 
        "reply": "Well, I did expect someone who could walk on water. Thats what I kept hearing. Maybe the trees in my yard will grow money leaves. I expect that will happen also. I do expect promises to be kept though.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:28:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "I \"hope\", \"expect\", the promises will happen in the next 60 days. But It's just hope.", 
        "intTime": 20090320, 
        "postID": 23, 
        "quote": "", 
        "reply": "I \"hope\", \"expect\", the promises will happen in the next 60 days. But It's just hope.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:30:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. He sent Hillary to Russia with a reset button? No that is not how it went down. It was her idea and she relied on a staffer to translate \"reset\" and he/she got it wrong. BFD Ok Dave, just for the heck of it let me play devil's advocate for a moment. Dave, why is it that you support an American version of The Union of Soviet Socialist Republics?........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090321, 
        "postID": 24, 
        "quote": "Originally posted by dmuhler: quote: Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. He sent Hillary to Russia with a reset button? No that is not how it went down. It was her idea and she relied on a staffer to translate \"reset\" and he/she got it wrong. BFD", 
        "reply": " Ok Dave, just for the heck of it let me play devil's advocate for a moment. Dave, why is it that you support an American version of The Union of Soviet Socialist Republics?........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-21 23:25:00", 
        "title": "The First 60 Days", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Well, I did expect someone who could walk on water. Thats what I kept hearing. The only people I heard that stuff from was teh republicans. \"The One\" \"The Messiah\" \"Jesus\" etc... You guys set up your straw man now your knocking it down.", 
        "intTime": 20090321, 
        "postID": 25, 
        "quote": "Well, I did expect someone who could walk on water. Thats what I kept hearing.", 
        "reply": " The only people I heard that stuff from was teh republicans. \"The One\" \"The Messiah\" \"Jesus\" etc... You guys set up your straw man now your knocking it down.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-21 23:46:00", 
        "title": "The First 60 Days", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "PHBO's first two months in office: Close GTMO with possibility of releasing enemy combatants into the USA. Drops the terms \"enemy combatants, terrorists, terrorism, war on terror, etc.,\" as not being politically correct enough. Offers to drop missile shield so that our EU position is greatly weakened, and Russia's is greatly strengthened. Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). Wants to talk and play nice with Iran's Imanutjob, the same guy who was a hostage taker in the Carter days. Raises debt more than all previous Presidents combined, and is only just getting warmed up. Lied about 5 day public viewing of Stimulus bill. Lied about no earmarks in Stimulus bill. Lied about it even being a \"Stimulus\" bill. Thanked himself in a speech. Is on record as wanting to create his own civilian armed forces. Paid ACORN 4 billion of taxpayer money for services rendered. Wants to demand by law \"voluntary\" service of all children. Wants to cap and trade and kill the energy industry. Wants to legitimize illegal aliens, thus ensuring Democrats rule for just about forever. Gives \"wrong region\" DVDS to England's PM. Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. Disses the Special Olympics on the Jay Leno show. Nominates tax cheat after tax cheat for cabinet positions. \"Didn't know\" about the AIG bonuses. Compared AIG to suicide bombers. Created the environment for the stock market plunge, and the destruction of small businesses. \"The World's Finest\"", 
        "intTime": 20090320, 
        "postID": 26, 
        "quote": "", 
        "reply": "PHBO's first two months in office: Close GTMO with possibility of releasing enemy combatants into the USA. Drops the terms \"enemy combatants, terrorists, terrorism, war on terror, etc.,\" as not being politically correct enough. Offers to drop missile shield so that our EU position is greatly weakened, and Russia's is greatly strengthened. Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). Wants to talk and play nice with Iran's Imanutjob, the same guy who was a hostage taker in the Carter days. Raises debt more than all previous Presidents combined, and is only just getting warmed up. Lied about 5 day public viewing of Stimulus bill. Lied about no earmarks in Stimulus bill. Lied about it even being a \"Stimulus\" bill. Thanked himself in a speech. Is on record as wanting to create his own civilian armed forces. Paid ACORN 4 billion of taxpayer money for services rendered. Wants to demand by law \"voluntary\" service of all children. Wants to cap and trade and kill the energy industry. Wants to legitimize illegal aliens, thus ensuring Democrats rule for just about forever. Gives \"wrong region\" DVDS to England's PM. Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. Disses the Special Olympics on the Jay Leno show. Nominates tax cheat after tax cheat for cabinet positions. \"Didn't know\" about the AIG bonuses. Compared AIG to suicide bombers. Created the environment for the stock market plunge, and the destruction of small businesses. \"The World's Finest\"", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 04:57:00", 
        "title": "The First 60 Days", 
        "userID": "Kegler300"
    }, 
    {
        "content": "why are you so mean and cruel??", 
        "intTime": 20090320, 
        "postID": 27, 
        "quote": "", 
        "reply": "why are you so mean and cruel??", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 05:23:00", 
        "title": "The First 60 Days", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Change we can count on. Yes we can.", 
        "intTime": 20090320, 
        "postID": 28, 
        "quote": "", 
        "reply": "Change we can count on. Yes we can.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 06:08:00", 
        "title": "The First 60 Days", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Lies? Why not just pick one item from the list, and refute it if you can? Teleprompter typos don't count. \"The World's Finest\"", 
        "intTime": 20090320, 
        "postID": 29, 
        "quote": "", 
        "reply": "Lies? Why not just pick one item from the list, and refute it if you can? Teleprompter typos don't count. \"The World's Finest\"", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 06:40:00", 
        "title": "The First 60 Days", 
        "userID": "Kegler300"
    }, 
    {
        "content": "KEGLER; not to berate your very good effort....but you forgot his crowning as the NEW, Wizard of Uh's!!!!!!", 
        "intTime": 20090320, 
        "postID": 30, 
        "quote": "", 
        "reply": "KEGLER; not to berate your very good effort....but you forgot his crowning as the NEW, Wizard of Uh's!!!!!!", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:03:00", 
        "title": "The First 60 Days", 
        "userID": "tawodi"
    }, 
    {
        "content": "Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil?", 
        "intTime": 20090320, 
        "postID": 31, 
        "quote": "", 
        "reply": "Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil?", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:15:00", 
        "title": "The First 60 Days", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "Why is it when a republican make a gaff, like the pres. did on leno last night it is the end of civilization as we knew it!!! But when Hilary, the Pres. or any of this illustious crew, steps on their own cranks and falls into their own nether regions, it's, oh come on!! Can't we move on??!!?? Can't you just understand everybodies human!! We all make mistakes....and all the rest of the dismissive crap we're hearing RIGHT NOW!!!!", 
        "intTime": 20090320, 
        "postID": 32, 
        "quote": "", 
        "reply": "Why is it when a republican make a gaff, like the pres. did on leno last night it is the end of civilization as we knew it!!! But when Hilary, the Pres. or any of this illustious crew, steps on their own cranks and falls into their own nether regions, it's, oh come on!! Can't we move on??!!?? Can't you just understand everybodies human!! We all make mistakes....and all the rest of the dismissive crap we're hearing RIGHT NOW!!!!", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:16:00", 
        "title": "The First 60 Days", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. He sent Hillary to Russia with a reset button? No that is not how it went down. It was her idea and she relied on a staffer to translate \"reset\" and he/she got it wrong. BFD Hey in the imortal words of seawitch: If it happened on his watch, its his fault.", 
        "intTime": 20090320, 
        "postID": 33, 
        "quote": "Originally posted by dmuhler: quote: Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. He sent Hillary to Russia with a reset button? No that is not how it went down. It was her idea and she relied on a staffer to translate \"reset\" and he/she got it wrong. BFD", 
        "reply": " Hey in the imortal words of seawitch: If it happened on his watch, its his fault.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:32:00", 
        "title": "The First 60 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\"", 
        "intTime": 20090320, 
        "postID": 34, 
        "quote": "Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil?", 
        "reply": " Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\"", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 07:35:00", 
        "title": "The First 60 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\" And you believe him, word for word here?", 
        "intTime": 20090320, 
        "postID": 35, 
        "quote": "Originally posted by threerings: quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\"", 
        "reply": " And you believe him, word for word here?", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 09:18:00", 
        "title": "The First 60 Days", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: PHBO's first two months in office: Close GTMO with possibility of releasing enemy combatants into the USA. Gee, the possibility? And your proof is that they're going to be released in this country? Drops the terms \"enemy combatants, terrorists, terrorism, war on terror, etc.,\" as not being politically correct enough. And your proof is? Offers to drop missile shield so that our EU position is greatly weakened, and Russia's is greatly strengthened. And your proof is? Remeber, we're not fighting Russia and the missile shield was again Iran and the shield isn't again a lot of missiles like Russia has, but again a country like Iran or Pakistan or India. or N.Korea who only have a few missiles and might be tempted to take a shot at our EU allies. Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). Money not being payed to Hamas (idiots would know this by reading the paper, not rightwing talking points.) Wants to talk and play nice with Iran's Imanutjob, the same guy who was a hostage taker in the Carter days. So not talking to him gets us what again? Raises debt more than all previous Presidents combined, and is only just getting warmed up. Gee, didn't hear much from you when Pres. Bush was going great guns Borrowing and spending... Lied about 5 day public viewing of Stimulus bill. So, I see 7 days in the House and 14 days in the Senate. I had no problem finding it By the way, this is from the \"Thomas\" web site. Let's you look at bills and such. Easy, not hard at all. American Recovery and Reinvestment Act of 2009 (stimulus bill) Comm. Vote House votes Comm. Vote Senate Votes H1 1/21/09 1/28/09 S336 1/27/09 2/10/09 <7 days> rc <14 days> 111-3 rc S.Amdt.570 Lied about no earmarks in Stimulus bill. Proof? Or just you interpretation? Lied about it even being a \"Stimulus\" bill. Proof? Or just you interpretation? Thanked himself in a speech. Is on record as wanting to create his own civilian armed forces. Proof? Or just you interpretation? Paid ACORN 4 billion of taxpayer money for services rendered. Proof? Or just you interpretation? Wants to demand by law \"voluntary\" service of all children. Proof? Or just you interpretation? Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Wants to legitimize illegal aliens, thus ensuring Democrats rule for just about forever. Proof? Or just you interpretation? Gives \"wrong region\" DVDS to England's PM. Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. Disses the Special Olympics on the Jay Leno show. Nominates tax cheat after tax cheat for cabinet positions. \"Didn't know\" about the AIG bonuses. Compared AIG to suicide bombers. Created the environment for the stock market plunge, and the destruction of small businesses. Proof? Or just you interpretation? Gads, is that all you can complain about, we librals had Pres. Bush going to war with the wrong people, spying on Americans, claiming phantom WMDs. dropping our approvel ratings with the rest of the world and our allies to a new, all time low. And the number of times both he and his crew of neo-con, couldn't remeber anythig when asked about it... too many to count.", 
        "intTime": 20090320, 
        "postID": 36, 
        "quote": "Originally posted by Kegler300: PHBO's first two months in office: Close GTMO with possibility of releasing enemy combatants into the USA. Gee, the possibility? And your proof is that they're going to be released in this country? Drops the terms \"enemy combatants, terrorists, terrorism, war on terror, etc.,\" as not being politically correct enough. And your proof is? Offers to drop missile shield so that our EU position is greatly weakened, and Russia's is greatly strengthened. And your proof is? Remeber, we're not fighting Russia and the missile shield was again Iran and the shield isn't again a lot of missiles like Russia has, but again a country like Iran or Pakistan or India. or N.Korea who only have a few missiles and might be tempted to take a shot at our EU allies. Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). Money not being payed to Hamas (idiots would know this by reading the paper, not rightwing talking points.) Wants to talk and play nice with Iran's Imanutjob, the same guy who was a hostage taker in the Carter days. So not talking to him gets us what again? Raises debt more than all previous Presidents combined, and is only just getting warmed up. Gee, didn't hear much from you when Pres. Bush was going great guns Borrowing and spending... Lied about 5 day public viewing of Stimulus bill. So, I see 7 days in the House and 14 days in the Senate. I had no problem finding it By the way, this is from the \"Thomas\" web site. Let's you look at bills and such. Easy, not hard at all. American Recovery and Reinvestment Act of 2009 (stimulus bill) Comm. Vote House votes Comm. Vote Senate Votes H1 1/21/09 1/28/09 S336 1/27/09 2/10/09 <7 days> rc <14 days> 111-3 rc S.Amdt.570 Lied about no earmarks in Stimulus bill. Proof? Or just you interpretation? Lied about it even being a \"Stimulus\" bill. Proof? Or just you interpretation? Thanked himself in a speech. Is on record as wanting to create his own civilian armed forces. Proof? Or just you interpretation? Paid ACORN 4 billion of taxpayer money for services rendered. Proof? Or just you interpretation? Wants to demand by law \"voluntary\" service of all children. Proof? Or just you interpretation? Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Wants to legitimize illegal aliens, thus ensuring Democrats rule for just about forever. Proof? Or just you interpretation? Gives \"wrong region\" DVDS to England's PM. Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. Disses the Special Olympics on the Jay Leno show. Nominates tax cheat after tax cheat for cabinet positions. \"Didn't know\" about the AIG bonuses. Compared AIG to suicide bombers. Created the environment for the stock market plunge, and the destruction of small businesses.", 
        "reply": " Proof? Or just you interpretation? Gads, is that all you can complain about, we librals had Pres. Bush going to war with the wrong people, spying on Americans, claiming phantom WMDs. dropping our approvel ratings with the rest of the world and our allies to a new, all time low. And the number of times both he and his crew of neo-con, couldn't remeber anythig when asked about it... too many to count.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 09:41:00", 
        "title": "The First 60 Days", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by threerings: quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\" And you believe him, word for word here? I've also heard Bill say he never had a chance to get Osama...who knows the truth? Oh, ya I do. Why? Because I've read just about every thing I can get my hands when it comes to OBL pre 9-11. That said: OBL attacked us several times before 9-11 and what did Clintons and the Dem's response amount to? A rock tossed in the ocean. So to blame Bush for the failure of 9-11 ( and to be fair, the falures are more failures of the way government works then any one person) is insane.", 
        "intTime": 20090320, 
        "postID": 37, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by threerings: quote: Originally posted by Killswitch_Engage: Ended Bush's backazzward policy on Stem Cell Research. How many more days does he have to go until he surpasses the number of days Bush was in Office before America was brutally attacked on our own soil? Bill Clinton: \"We could have had Osama any time we wanted. We didn't know what to do with him.\" And you believe him, word for word here?", 
        "reply": " I've also heard Bill say he never had a chance to get Osama...who knows the truth? Oh, ya I do. Why? Because I've read just about every thing I can get my hands when it comes to OBL pre 9-11. That said: OBL attacked us several times before 9-11 and what did Clintons and the Dem's response amount to? A rock tossed in the ocean. So to blame Bush for the failure of 9-11 ( and to be fair, the falures are more failures of the way government works then any one person) is insane.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 09:50:00", 
        "title": "The First 60 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Hey killswitch...you need to go open a newspaper or something.", 
        "intTime": 20090320, 
        "postID": 38, 
        "quote": "Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation?", 
        "reply": " Hey killswitch...you need to go open a newspaper or something.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 09:51:00", 
        "title": "The First 60 Days", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Hey killswitch...you need to go open a newspaper or something. Hey threerings,Work on the reading comprehension That was me on the \"Proof? Or just you interpretation?\" And I already read newspaper, magazines and TV shows and I don't see any problem with the energy industry. Show your proof, list your stories or tv shows or something...", 
        "intTime": 20090320, 
        "postID": 39, 
        "quote": "Originally posted by threerings: quote: Wants to cap and trade and kill the energy industry. Proof? Or just you interpretation? Hey killswitch...you need to go open a newspaper or something.", 
        "reply": " Hey threerings,Work on the reading comprehension That was me on the \"Proof? Or just you interpretation?\" And I already read newspaper, magazines and TV shows and I don't see any problem with the energy industry. Show your proof, list your stories or tv shows or something...", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 13:25:00", 
        "title": "The First 60 Days", 
        "userID": "Tangler"
    }, 
    {
        "content": "What keg said", 
        "intTime": 20090320, 
        "postID": 40, 
        "quote": "", 
        "reply": "What keg said", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 13:32:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). The money is going to the UN and other organizations to strengthen the Western-backed Palestinian Authority, not Hamas. ...yeah there is no corruption over there....it'll be like when we gave the Iraqis money to pay the IPs & ISF....the higher ups got the money, but it never made it to where it was supposed to go....we should have cut out the middle man & gave it straight to the Muj.", 
        "intTime": 20090320, 
        "postID": 41, 
        "quote": "Originally posted by dmuhler: quote: Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). The money is going to the UN and other organizations to strengthen the Western-backed Palestinian Authority, not Hamas.", 
        "reply": " ...yeah there is no corruption over there....it'll be like when we gave the Iraqis money to pay the IPs & ISF....the higher ups got the money, but it never made it to where it was supposed to go....we should have cut out the middle man & gave it straight to the Muj.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 13:35:00", 
        "title": "The First 60 Days", 
        "userID": "VDoP"
    }, 
    {
        "content": "quote: Originally posted by VDoP: quote: Originally posted by dmuhler: quote: Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). The money is going to the UN and other organizations to strengthen the Western-backed Palestinian Authority, not Hamas. ...yeah there is no corruption over there....it'll be like when we gave the Iraqis money to pay the IPs & ISF....the higher ups got the money, but it never made it to where it was supposed to go....we should have cut out the middle man & gave it straight to the Muj. You work with what your given, in this case, we're giving the money to people who have a big problem with Hamas and we hope they'll take it out on them and not others, but you can only hope.", 
        "intTime": 20090320, 
        "postID": 42, 
        "quote": "Originally posted by VDoP: quote: Originally posted by dmuhler: quote: Pays Hamas 900 million to keep killing Israelis (only an idiot would believe they will be spending the money on education). The money is going to the UN and other organizations to strengthen the Western-backed Palestinian Authority, not Hamas. ...yeah there is no corruption over there....it'll be like when we gave the Iraqis money to pay the IPs & ISF....the higher ups got the money, but it never made it to where it was supposed to go....we should have cut out the middle man & gave it straight to the Muj.", 
        "reply": " You work with what your given, in this case, we're giving the money to people who have a big problem with Hamas and we hope they'll take it out on them and not others, but you can only hope.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 13:41:00", 
        "title": "The First 60 Days", 
        "userID": "Tangler"
    }, 
    {
        "content": "Just think - if due diligence had been properly exercised by Congress and the Bush and Clinton Administrations over the past ten or so years, we wouldn't be here.", 
        "intTime": 20090320, 
        "postID": 43, 
        "quote": "", 
        "reply": "Just think - if due diligence had been properly exercised by Congress and the Bush and Clinton Administrations over the past ten or so years, we wouldn't be here.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 15:47:00", 
        "title": "The First 60 Days", 
        "userID": "mcgreer"
    }, 
    {
        "content": "The first 60 days are just like the next 60 days will be like. Same old BS.", 
        "intTime": 20090320, 
        "postID": 44, 
        "quote": "", 
        "reply": "The first 60 days are just like the next 60 days will be like. Same old BS.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:09:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "My \"hope\" is fading. Actually it faded out 60 days ago.", 
        "intTime": 20090320, 
        "postID": 45, 
        "quote": "", 
        "reply": "My \"hope\" is fading. Actually it faded out 60 days ago.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:11:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "Guess you expected a magician...", 
        "intTime": 20090320, 
        "postID": 46, 
        "quote": "", 
        "reply": "Guess you expected a magician...", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:21:00", 
        "title": "The First 60 Days", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well, I did expect someone who could walk on water. Thats what I kept hearing. Maybe the trees in my yard will grow money leaves. I expect that will happen also. I do expect promises to be kept though.", 
        "intTime": 20090320, 
        "postID": 47, 
        "quote": "", 
        "reply": "Well, I did expect someone who could walk on water. Thats what I kept hearing. Maybe the trees in my yard will grow money leaves. I expect that will happen also. I do expect promises to be kept though.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:28:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "I \"hope\", \"expect\", the promises will happen in the next 60 days. But It's just hope.", 
        "intTime": 20090320, 
        "postID": 48, 
        "quote": "", 
        "reply": "I \"hope\", \"expect\", the promises will happen in the next 60 days. But It's just hope.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-20 16:30:00", 
        "title": "The First 60 Days", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. He sent Hillary to Russia with a reset button? No that is not how it went down. It was her idea and she relied on a staffer to translate \"reset\" and he/she got it wrong. BFD Ok Dave, just for the heck of it let me play devil's advocate for a moment. Dave, why is it that you support an American version of The Union of Soviet Socialist Republics?........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090321, 
        "postID": 49, 
        "quote": "Originally posted by dmuhler: quote: Sent Hillary to Russia with a 'reset button' that really said overcharge in Russian. He sent Hillary to Russia with a reset button? No that is not how it went down. It was her idea and she relied on a staffer to translate \"reset\" and he/she got it wrong. BFD", 
        "reply": " Ok Dave, just for the heck of it let me play devil's advocate for a moment. Dave, why is it that you support an American version of The Union of Soviet Socialist Republics?........ No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-21 23:25:00", 
        "title": "The First 60 Days", 
        "userID": "ProgMod"
    }, 
    {
        "content": "quote: Well, I did expect someone who could walk on water. Thats what I kept hearing. The only people I heard that stuff from was teh republicans. \"The One\" \"The Messiah\" \"Jesus\" etc... You guys set up your straw man now your knocking it down.", 
        "intTime": 20090321, 
        "postID": 50, 
        "quote": "Well, I did expect someone who could walk on water. Thats what I kept hearing.", 
        "reply": " The only people I heard that stuff from was teh republicans. \"The One\" \"The Messiah\" \"Jesus\" etc... You guys set up your straw man now your knocking it down.", 
        "threadID": "409192893_8030093812001", 
        "time": "2009-03-21 23:46:00", 
        "title": "The First 60 Days", 
        "userID": "karlhungusjr"
    }
]