[
    {
        "content": "quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "intTime": 20090429, 
        "postID": 1, 
        "quote": "WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still.", 
        "reply": " Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "intTime": 20090429, 
        "postID": 2, 
        "quote": "", 
        "reply": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:34:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me. Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "reply": " Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs", 
        "reply": " Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:48:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" It has been said by idiots that are clueless.", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " It has been said by idiots that are clueless.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:54:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:32:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "", 
        "reply": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:37:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "", 
        "reply": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 09:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "intTime": 20090430, 
        "postID": 9, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 10:28:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "The 3.5 trillion is not added to the deficit.", 
        "intTime": 20090430, 
        "postID": 10, 
        "quote": "", 
        "reply": "The 3.5 trillion is not added to the deficit.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit.", 
        "reply": " Right, they'll just print up MORE money to cover it!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "intTime": 20090430, 
        "postID": 12, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "reply": " Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:19:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "intTime": 20090430, 
        "postID": 13, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:25:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "intTime": 20090430, 
        "postID": 14, 
        "quote": "", 
        "reply": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:26:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know. It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "intTime": 20090430, 
        "postID": 15, 
        "quote": "xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "reply": " It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:30:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "intTime": 20090430, 
        "postID": 16, 
        "quote": "FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:35:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "intTime": 20090430, 
        "postID": 17, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:45:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president? It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "intTime": 20090430, 
        "postID": 18, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "reply": " It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:52:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090430, 
        "postID": 19, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "intTime": 20090430, 
        "postID": 20, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:27:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "intTime": 20090430, 
        "postID": 21, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart.", 
        "reply": " Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:17:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future. Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "intTime": 20090430, 
        "postID": 22, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "reply": " Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: So, no Obama has not spent more then Bush Ok.", 
        "intTime": 20090430, 
        "postID": 23, 
        "quote": "So, no Obama has not spent more then Bush", 
        "reply": " Ok.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:29:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "intTime": 20090430, 
        "postID": 24, 
        "quote": "Our grandchildren are broke and in debt before they're born!", 
        "reply": "21194237;  Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:42:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb they won't be getting my daughter pregnant though.", 
        "intTime": 20090501, 
        "postID": 25, 
        "quote": "Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb", 
        "reply": " they won't be getting my daughter pregnant though.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 00:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090501, 
        "postID": 26, 
        "quote": "Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "reply": " The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:09:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "intTime": 20090501, 
        "postID": 27, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:56:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then. LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 28, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "reply": " LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 12:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 29, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me.", 
        "reply": " well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:11:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 30, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "reply": "", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:13:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "intTime": 20090429, 
        "postID": 31, 
        "quote": "WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still.", 
        "reply": " Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "intTime": 20090429, 
        "postID": 32, 
        "quote": "", 
        "reply": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:34:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me. Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "intTime": 20090430, 
        "postID": 33, 
        "quote": "Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "reply": " Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "intTime": 20090430, 
        "postID": 34, 
        "quote": "it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs", 
        "reply": " Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:48:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" It has been said by idiots that are clueless.", 
        "intTime": 20090430, 
        "postID": 35, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " It has been said by idiots that are clueless.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:54:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "intTime": 20090430, 
        "postID": 36, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:32:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "intTime": 20090430, 
        "postID": 37, 
        "quote": "", 
        "reply": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:37:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "intTime": 20090430, 
        "postID": 38, 
        "quote": "", 
        "reply": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 09:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "intTime": 20090430, 
        "postID": 39, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 10:28:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "The 3.5 trillion is not added to the deficit.", 
        "intTime": 20090430, 
        "postID": 40, 
        "quote": "", 
        "reply": "The 3.5 trillion is not added to the deficit.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "intTime": 20090430, 
        "postID": 41, 
        "quote": "Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit.", 
        "reply": " Right, they'll just print up MORE money to cover it!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "intTime": 20090430, 
        "postID": 42, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "reply": " Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:19:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "intTime": 20090430, 
        "postID": 43, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:25:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "intTime": 20090430, 
        "postID": 44, 
        "quote": "", 
        "reply": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:26:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know. It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "intTime": 20090430, 
        "postID": 45, 
        "quote": "xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "reply": " It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:30:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "intTime": 20090430, 
        "postID": 46, 
        "quote": "FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:35:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "intTime": 20090430, 
        "postID": 47, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:45:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president? It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "intTime": 20090430, 
        "postID": 48, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "reply": " It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:52:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090430, 
        "postID": 49, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "intTime": 20090430, 
        "postID": 50, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:27:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "intTime": 20090430, 
        "postID": 51, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart.", 
        "reply": " Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:17:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future. Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "intTime": 20090430, 
        "postID": 52, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "reply": " Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: So, no Obama has not spent more then Bush Ok.", 
        "intTime": 20090430, 
        "postID": 53, 
        "quote": "So, no Obama has not spent more then Bush", 
        "reply": " Ok.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:29:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "intTime": 20090430, 
        "postID": 54, 
        "quote": "Our grandchildren are broke and in debt before they're born!", 
        "reply": "21194237;  Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:42:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb they won't be getting my daughter pregnant though.", 
        "intTime": 20090501, 
        "postID": 55, 
        "quote": "Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb", 
        "reply": " they won't be getting my daughter pregnant though.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 00:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090501, 
        "postID": 56, 
        "quote": "Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "reply": " The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:09:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "intTime": 20090501, 
        "postID": 57, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:56:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then. LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 58, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "reply": " LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 12:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 59, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me.", 
        "reply": " well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:11:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 60, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "reply": "", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:13:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "intTime": 20090429, 
        "postID": 61, 
        "quote": "WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still.", 
        "reply": " Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "intTime": 20090429, 
        "postID": 62, 
        "quote": "", 
        "reply": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:34:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me. Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "intTime": 20090430, 
        "postID": 63, 
        "quote": "Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "reply": " Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "intTime": 20090430, 
        "postID": 64, 
        "quote": "it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs", 
        "reply": " Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:48:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" It has been said by idiots that are clueless.", 
        "intTime": 20090430, 
        "postID": 65, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " It has been said by idiots that are clueless.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:54:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "intTime": 20090430, 
        "postID": 66, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:32:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "intTime": 20090430, 
        "postID": 67, 
        "quote": "", 
        "reply": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:37:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "intTime": 20090430, 
        "postID": 68, 
        "quote": "", 
        "reply": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 09:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "intTime": 20090430, 
        "postID": 69, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 10:28:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "The 3.5 trillion is not added to the deficit.", 
        "intTime": 20090430, 
        "postID": 70, 
        "quote": "", 
        "reply": "The 3.5 trillion is not added to the deficit.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "intTime": 20090430, 
        "postID": 71, 
        "quote": "Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit.", 
        "reply": " Right, they'll just print up MORE money to cover it!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "intTime": 20090430, 
        "postID": 72, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "reply": " Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:19:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "intTime": 20090430, 
        "postID": 73, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:25:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "intTime": 20090430, 
        "postID": 74, 
        "quote": "", 
        "reply": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:26:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know. It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "intTime": 20090430, 
        "postID": 75, 
        "quote": "xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "reply": " It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:30:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "intTime": 20090430, 
        "postID": 76, 
        "quote": "FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:35:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "intTime": 20090430, 
        "postID": 77, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:45:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president? It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "intTime": 20090430, 
        "postID": 78, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "reply": " It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:52:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090430, 
        "postID": 79, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "intTime": 20090430, 
        "postID": 80, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:27:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "intTime": 20090430, 
        "postID": 81, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart.", 
        "reply": " Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:17:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future. Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "intTime": 20090430, 
        "postID": 82, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "reply": " Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: So, no Obama has not spent more then Bush Ok.", 
        "intTime": 20090430, 
        "postID": 83, 
        "quote": "So, no Obama has not spent more then Bush", 
        "reply": " Ok.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:29:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "intTime": 20090430, 
        "postID": 84, 
        "quote": "Our grandchildren are broke and in debt before they're born!", 
        "reply": "21194237;  Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:42:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb they won't be getting my daughter pregnant though.", 
        "intTime": 20090501, 
        "postID": 85, 
        "quote": "Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb", 
        "reply": " they won't be getting my daughter pregnant though.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 00:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090501, 
        "postID": 86, 
        "quote": "Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "reply": " The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:09:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "intTime": 20090501, 
        "postID": 87, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:56:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then. LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 88, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "reply": " LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 12:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 89, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me.", 
        "reply": " well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:11:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 90, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "reply": "", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:13:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "intTime": 20090429, 
        "postID": 91, 
        "quote": "WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still.", 
        "reply": " Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "intTime": 20090429, 
        "postID": 92, 
        "quote": "", 
        "reply": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:34:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me. Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "intTime": 20090430, 
        "postID": 93, 
        "quote": "Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "reply": " Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "intTime": 20090430, 
        "postID": 94, 
        "quote": "it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs", 
        "reply": " Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:48:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" It has been said by idiots that are clueless.", 
        "intTime": 20090430, 
        "postID": 95, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " It has been said by idiots that are clueless.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:54:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "intTime": 20090430, 
        "postID": 96, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:32:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "intTime": 20090430, 
        "postID": 97, 
        "quote": "", 
        "reply": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:37:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "intTime": 20090430, 
        "postID": 98, 
        "quote": "", 
        "reply": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 09:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "intTime": 20090430, 
        "postID": 99, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 10:28:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "The 3.5 trillion is not added to the deficit.", 
        "intTime": 20090430, 
        "postID": 100, 
        "quote": "", 
        "reply": "The 3.5 trillion is not added to the deficit.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "intTime": 20090430, 
        "postID": 101, 
        "quote": "Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit.", 
        "reply": " Right, they'll just print up MORE money to cover it!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "intTime": 20090430, 
        "postID": 102, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "reply": " Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:19:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "intTime": 20090430, 
        "postID": 103, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:25:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "intTime": 20090430, 
        "postID": 104, 
        "quote": "", 
        "reply": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:26:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know. It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "intTime": 20090430, 
        "postID": 105, 
        "quote": "xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "reply": " It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:30:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "intTime": 20090430, 
        "postID": 106, 
        "quote": "FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:35:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "intTime": 20090430, 
        "postID": 107, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:45:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president? It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "intTime": 20090430, 
        "postID": 108, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "reply": " It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:52:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090430, 
        "postID": 109, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "intTime": 20090430, 
        "postID": 110, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:27:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "intTime": 20090430, 
        "postID": 111, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart.", 
        "reply": " Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:17:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future. Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "intTime": 20090430, 
        "postID": 112, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "reply": " Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: So, no Obama has not spent more then Bush Ok.", 
        "intTime": 20090430, 
        "postID": 113, 
        "quote": "So, no Obama has not spent more then Bush", 
        "reply": " Ok.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:29:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "intTime": 20090430, 
        "postID": 114, 
        "quote": "Our grandchildren are broke and in debt before they're born!", 
        "reply": "21194237;  Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:42:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb they won't be getting my daughter pregnant though.", 
        "intTime": 20090501, 
        "postID": 115, 
        "quote": "Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb", 
        "reply": " they won't be getting my daughter pregnant though.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 00:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090501, 
        "postID": 116, 
        "quote": "Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "reply": " The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:09:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "intTime": 20090501, 
        "postID": 117, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:56:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then. LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 118, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "reply": " LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 12:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 119, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me.", 
        "reply": " well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:11:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 120, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "reply": "", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:13:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "intTime": 20090429, 
        "postID": 121, 
        "quote": "WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still.", 
        "reply": " Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "intTime": 20090429, 
        "postID": 122, 
        "quote": "", 
        "reply": "Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-29 19:34:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me. Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "intTime": 20090430, 
        "postID": 123, 
        "quote": "Originally posted by AngelHeart: quote: WASHINGTON – \"That wasn't me,\" President Barack Obama said on his 100th day in office, disclaiming responsibility for the huge budget deficit waiting for him on Day One. It actually was partly him — and the other Democrats controlling Congress the previous two years — who shaped the latest in a string of precipitously out-of-balance budgets. And as a presidential candidate and president-elect, he backed the twilight Bush-era stimulus plan that made the deficit deeper, all before he took over and promoted spending plans that have made it much deeper still. Excerpt from (\"http://news.yahoo.com/s/ap/20090430/ap_on_go_pr_wh/us_fact_check_obama\") Somehow this doesn't suprise me.", 
        "reply": " Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "intTime": 20090430, 
        "postID": 124, 
        "quote": "it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs", 
        "reply": " Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:48:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" It has been said by idiots that are clueless.", 
        "intTime": 20090430, 
        "postID": 125, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " It has been said by idiots that are clueless.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 04:54:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "intTime": 20090430, 
        "postID": 126, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " You're really splitting hairs here.. The fact is Obama's budgets increase outlays by $1 trillion over the 600 billion Bush had already increased. Beyond that if you play Obama's numbers out to 2012, which I'll grant you is a lot like wishing on a star, he has proposed my spending over that timke frame then the entire history of this country. So, no Obama has not spent more then Bush, but he has written the checks and not just needs to sign them.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:32:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "intTime": 20090430, 
        "postID": 127, 
        "quote": "", 
        "reply": "Fact Check.org: He said his budget projections are based on economic assumptions that “are perfectly consistent with what Blue Chip forecasters out there are saying.” Not true. The average projection by leading private economists is now for substantially less economic growth than the administration’s forecast assumes. He said he is reducing “nondefense discretionary spending” to less than it was under the past four presidents. Not true. His own forecast for the final budget of his four-year term puts this figure higher than in many years under Reagan, Clinton or either Bush. He said he was “angry” about “inexcusable” bonuses paid to AIG executives. But he glossed over the fact that his own aides insisted on watering down a Senate-passed amendment that might have prevented payment of such bonuses. He repeated that his budget is projected to cut the federal deficit in half by the end of his term. That’s true, but deficits also are projected to shoot up again later unless big policy changes are made.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 05:37:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "threerings"
    }, 
    {
        "content": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "intTime": 20090430, 
        "postID": 128, 
        "quote": "", 
        "reply": "Obama's predecessors are ALL...pikers when it comes to spending and deficits. Y'all ain't seen NOTHING....yet. Wait until the bills come due for all the spending in Obama's first budget. Our grandchildren are broke and in debt before they're born!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 09:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "21194237"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself. Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "intTime": 20090430, 
        "postID": 129, 
        "quote": "Originally posted by karlhungusjr: quote: it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs Yes it has been said. and it's not true. But it appears that you swallowed it without lifting a finger to find out for yourself.", 
        "reply": " Really? Have you chosen to ignore the 3.5 trillion dollar budget he just passed? How convenient. This message has been edited. Last edited by: AngelHeart, Thu 30 April 2009 11:16 AM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 10:28:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "The 3.5 trillion is not added to the deficit.", 
        "intTime": 20090430, 
        "postID": 130, 
        "quote": "", 
        "reply": "The 3.5 trillion is not added to the deficit.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:04:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "intTime": 20090430, 
        "postID": 131, 
        "quote": "Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit.", 
        "reply": " Right, they'll just print up MORE money to cover it!", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "intTime": 20090430, 
        "postID": 132, 
        "quote": "Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it!", 
        "reply": " Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:19:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "intTime": 20090430, 
        "postID": 133, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:25:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "intTime": 20090430, 
        "postID": 134, 
        "quote": "", 
        "reply": "Total tax income is projected to be $1.2 TRILLION shy of covering this budget. So the increase will be only that, not the full $3.5-6 trillion. There is no way for the Fed Gvt to tax enough to cover without completely shutting down the economy. The only way that the bill can be covered is by expanding the economy by a colossial amount. Unfortunately, the \"stimulus\" and all other plans could not be better designed to supress long term economic develpoement. So, the deficits will GROW and GROW as his term goes on.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:26:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know. It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "intTime": 20090430, 
        "postID": 135, 
        "quote": "xnavycg: Well now, who do we believe, the people that said that Obama wasn’t around in the Senate long enough to have any experience, or now, the same people saying that he actually was around and caused all our monetary woes? Enquiring minds want to know.", 
        "reply": " It's called \"party line voting.\" You don't have to know anything to toe the party line.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:30:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "intTime": 20090430, 
        "postID": 136, 
        "quote": "FrJohn1123: I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " LOL... That's funny... what a comedian. Didn't strain yourself with that one did you? BTW, the year is 2009.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:35:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "intTime": 20090430, 
        "postID": 137, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:45:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president? It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "intTime": 20090430, 
        "postID": 138, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Keep making excuses for your incompetent mesiah. You do realize you just compared money spent by 3 previous presidents and all of their combined time in office as opposed to BO and the mere hundred days he has been the president?", 
        "reply": " It is just so comical to watch you good folks whine about the debt. Especially when the largest socialist program added in decades was the republican sponsered Medicare Part D which along with Medicare together will add a trillion dollars a year in the coming years. Comical. This message has been edited. Last edited by: FrJohn1123, Thu 30 April 2009 12:23 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 11:52:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090430, 
        "postID": 139, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished.", 
        "reply": " Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:06:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "intTime": 20090430, 
        "postID": 140, 
        "quote": "Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this?", 
        "reply": " Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 19:27:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart. Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "intTime": 20090430, 
        "postID": 141, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. Don't 'spread the wealth' -- spread the work ethic. Elementary, really. Good to see ya, Angelheart.", 
        "reply": " Agreed. Good to see you too PinkBlossoms. Long time no see", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:17:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future. Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "intTime": 20090430, 
        "postID": 142, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by FrJohn1123: quote: Originally posted by AngelHeart: quote: Originally posted by navy8086: quote: Originally posted by FrJohn1123: The 3.5 trillion is not added to the deficit. Right, they'll just print up MORE money to cover it! Exactly. And he just started. I can't even imagine how large the debt will be when he is finished. I would guess that you whined while Reagan, Bush I and Bush II put on the $10 plus trillion? Or are you new to this? Just a reminder, it is now 2009. By all means continue beating up on the ghosts of Presidents past, the rest of use will be looking to the future.", 
        "reply": " Isn't that convenient. Yes and you will look to the future when Obama hangs it up in 1016.... This message has been edited. Last edited by: FrJohn1123, Fri 01 May 2009 05:48 PM", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 20:21:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: So, no Obama has not spent more then Bush Ok.", 
        "intTime": 20090430, 
        "postID": 143, 
        "quote": "So, no Obama has not spent more then Bush", 
        "reply": " Ok.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:29:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "intTime": 20090430, 
        "postID": 144, 
        "quote": "Our grandchildren are broke and in debt before they're born!", 
        "reply": "21194237;  Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-04-30 22:42:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb they won't be getting my daughter pregnant though.", 
        "intTime": 20090501, 
        "postID": 145, 
        "quote": "Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb", 
        "reply": " they won't be getting my daughter pregnant though.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 00:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090501, 
        "postID": 146, 
        "quote": "Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for..", 
        "reply": " The thought sickens me. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:09:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "intTime": 20090501, 
        "postID": 147, 
        "quote": "Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\"", 
        "reply": " Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 11:56:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then. LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090501, 
        "postID": 148, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Ira1945: Obama has stated that the general public has to avoid maxing credit cards and ease on borrowing money.. but what is he doing \"http://www.theobamadebt.com/\" it has been said he has \"charged more dollars in 100 days than President Bush did in 8 yrs\" Ira, he isn't \"charging money\" or \"running up the defit\", he's \"stimulating the economy\". Since the economy started its downturn during the Bush term, all the deficit spending now to \"spend our way out of it\" is also Bush's fault. Just like everything bad that happened from 2000 to 2008 was Clinton's fault, everything bad from 2008 to the next election is Bush's fault. In 2012 or later when we are paying the piper for this deficit, it will be Obama's fault, but not until then.", 
        "reply": " LOL, he is stimulating the economy? Where? hehe, too funny. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 12:23:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 149, 
        "quote": "Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me.", 
        "reply": " well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The nineth circuit is a good place to start looking for his replacement", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:11:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "intTime": 20090501, 
        "postID": 150, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by PinkBlossoms: quote: Originally posted by 3678131: 21194237; quote: Our grandchildren are broke and in debt before they're born! Just think of all those potential tax payers who won't be helping foot the bill because they will be killed while still in their mothers womb--that those same tax dollars are helping to pay for.. The thought sickens me. well tack on the Bush /cheney/Rumsfeld Iraq debacle on our children and grand childrens back...One more thing Roe V. Wade is the law of the land...OMG!!! David Souter is retiring....The ninth circuit is a good place to start looking for his replacement", 
        "reply": "", 
        "threadID": "409192893_8120021222001", 
        "time": "2009-05-01 13:13:00", 
        "title": "FACT CHECK: Obama disowns deficit he helped shape", 
        "userID": "scottrj50"
    }
]