[
    {
        "content": "quote: When we have taken steps that have violated the Geneva Conventions we rightly have been criticized, so as we move forward I think it's important to again live our values, to live the agreements that we have made in the international justice arena and to practice those.", 
        "intTime": 20090531, 
        "postID": 1, 
        "quote": "When we have taken steps that have violated the Geneva Conventions we rightly have been criticized, so as we move forward I think it's important to again live our values, to live the agreements that we have made in the international justice arena and to practice those.", 
        "reply": "", 
        "threadID": "409192893_6200057422001", 
        "time": "2009-05-31 14:16:00", 
        "title": "Who said it....", 
        "userID": "DMarkUhler"
    }, 
    {
        "content": "The source of the above quoote is General Petraeus. I believe he was speaking about closing Guantanamo Bay. First of all, I do not see the holding of enemy combatants as being, in and of itself a violation of the Geneva accords. Secondly, I am not aware of any plan the general may for the detainees once the facility is closed. The president already promised to close gitmo but was counting on support from \"allies\" that would take some of those prisoners off of our hands. How has that worked out?", 
        "intTime": 20090531, 
        "postID": 2, 
        "quote": "", 
        "reply": "The source of the above quoote is General Petraeus. I believe he was speaking about closing Guantanamo Bay. First of all, I do not see the holding of enemy combatants as being, in and of itself a violation of the Geneva accords. Secondly, I am not aware of any plan the general may for the detainees once the facility is closed. The president already promised to close gitmo but was counting on support from \"allies\" that would take some of those prisoners off of our hands. How has that worked out?", 
        "threadID": "409192893_6200057422001", 
        "time": "2009-05-31 15:48:00", 
        "title": "Who said it....", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: The source of the above quoote is General Petraeus. I believe he was speaking about closing Guantanamo Bay. First of all, I do not see the holding of enemy combatants as being, in and of itself a violation of the Geneva accords. Secondly, I am not aware of any plan the general may for the detainees once the facility is closed. The president already promised to close gitmo but was counting on support from \"allies\" that would take some of those prisoners off of our hands. How has that worked out? Exactly...If the General is offering his opinion then he should offer a solution as well.. Personally, I think he is saying this under political pressure. He is stil a General who answers to civilian authority.", 
        "intTime": 20090531, 
        "postID": 3, 
        "quote": "Originally posted by scooter_mech: The source of the above quoote is General Petraeus. I believe he was speaking about closing Guantanamo Bay. First of all, I do not see the holding of enemy combatants as being, in and of itself a violation of the Geneva accords. Secondly, I am not aware of any plan the general may for the detainees once the facility is closed. The president already promised to close gitmo but was counting on support from \"allies\" that would take some of those prisoners off of our hands. How has that worked out?", 
        "reply": " Exactly...If the General is offering his opinion then he should offer a solution as well.. Personally, I think he is saying this under political pressure. He is stil a General who answers to civilian authority.", 
        "threadID": "409192893_6200057422001", 
        "time": "2009-05-31 16:00:00", 
        "title": "Who said it....", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Personally, I think he is saying this under political pressure. He is stil a General who answers to civilian authority. This is probably the case.", 
        "intTime": 20090531, 
        "postID": 4, 
        "quote": "Personally, I think he is saying this under political pressure. He is stil a General who answers to civilian authority.", 
        "reply": " This is probably the case.", 
        "threadID": "409192893_6200057422001", 
        "time": "2009-05-31 16:32:00", 
        "title": "Who said it....", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Personally, I believe the \"wicket\" of a General Officer is winning Wars and Conflicts...not involving oneself in partisan politics.. Other, Great Generals, have been reprimanded and discharged for the same...", 
        "intTime": 20090531, 
        "postID": 5, 
        "quote": "", 
        "reply": "Personally, I believe the \"wicket\" of a General Officer is winning Wars and Conflicts...not involving oneself in partisan politics.. Other, Great Generals, have been reprimanded and discharged for the same...", 
        "threadID": "409192893_6200057422001", 
        "time": "2009-05-31 16:39:00", 
        "title": "Who said it....", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by DMarkUhler: quote: When we have taken steps that have violated the Geneva Conventions we rightly have been criticized, so as we move forward I think it's important to again live our values, to live the agreements that we have made in the international justice arena and to practice those. He must feel relieved to be able to speak his mind now...", 
        "intTime": 20090531, 
        "postID": 6, 
        "quote": "Originally posted by DMarkUhler: quote: When we have taken steps that have violated the Geneva Conventions we rightly have been criticized, so as we move forward I think it's important to again live our values, to live the agreements that we have made in the international justice arena and to practice those.", 
        "reply": " He must feel relieved to be able to speak his mind now...", 
        "threadID": "409192893_6200057422001", 
        "time": "2009-05-31 16:41:00", 
        "title": "Who said it....", 
        "userID": "SeaWitch1220"
    }
]