[
    {
        "content": "I almost feel sorry for all the O-Bots. You've been had. Feel not alone. Conservatives went through the same thing with Bush. LEARN FROM US. Call a spade a spade. FORCE YOUR GUY TO DO WHAT HE SAID HE WOULD...or face the same fate. +++http://online.wsj.com/article/SB1237342095849 65205.html By now, President Obama's lather-rinse-repeat approach to the legal war on terror is familiar: He lambastes his predecessor, then makes cosmetic changes that leave the substance of Bush policy intact. But Mr. Obama's decision last week to renounce the term \"enemy combatant\" is almost a parody of this method, given that the \"new standard\" for detaining terrorists is identical to the old one. Strunk & White counseled simplicity in prose, so whoever wrote the Justice Department's filing with the D.C. District Court learned his elements of style elsewhere. To avoid using enemy combatants, we instead get \"individuals captured in connection with armed conflicts and counterterrorism operations,\" or \"members of enemy forces,\" or \"persons who [the President] determines planned, authorized, committed, or aided the terrorist attacks that occurred on September 11, 2001, and persons who harbored those responsible for the September 11 attacks.\" These gyrations are bizarre because the brief is actually a solid legal argument for detaining e---- c---------. Justice argues that the U.S. has the right to hold indefinitely, without legal charges, those who \"substantially supported\" al Qaeda or the Taliban, reserving the right to define what qualifies as \"substantial\" in each case. It also extends its writ to people who support terror networks away from the battlefield, such as financiers. The concept of the unlawful enemy combatant is deeply rooted in international law and custom, including the Geneva Conventions. It refers to those who violate the laws of war by killing civilians or fighting out of uniform, and thus are not entitled to prisoner-of-war status. The Justice brief cites the Supreme Court's 2004 Hamdi decision, in which a plurality of Justices held that capture and detention is \"so fundamental and accepted an incident to war\" as to be an afterthought. The one difference between the Bush and Obama detention standards concerns core executive powers. The Obama team argues that its authority flows from the Authorization for the Use of Military Force Act, which Congress passed after 9/11 and authorizes the President to use \"all necessary and appropriate force\" to prosecute \"nations, organizations, or persons\" associated with the attack. Here, again, there is less than meets the eye. Bush lawyers also cited this act of Congress, but in addition they asserted inherent war power under the Constitution. Eric Holder's Justice Department does not assert Commander in Chief prerogatives, but it doesn't disavow them either. Justice knows it doesn't need the argument given Hamdi and that it appeases the anti-antiterror left not to echo every Bush claim. The risk is that Mr. Obama could one day face a more isolationist GOP Congress, run by a Tom DeLay or a Senator William Borah that is unwilling to endorse the President's national-security policies. Then Justice will not be able to cite its own precedents as the courts intrude on executive war powers. We're delighted that Mr. Obama has come around on one of the most rancorous controversies of the last eight years. Even so, Mr. Obama's supporters must be suffering some kind of post-traumatic stress disorder, because on the range of Bush antiterror policies that Mr. Obama has largely preserved -- interrogation, surveillance, rendition, state secrets, now detention -- no one seems to be vilifying him with the same intensity. Or maybe the problem with President Bush's policies was that they were President Bush's policies.", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "I almost feel sorry for all the O-Bots. You've been had. Feel not alone. Conservatives went through the same thing with Bush. LEARN FROM US. Call a spade a spade. FORCE YOUR GUY TO DO WHAT HE SAID HE WOULD...or face the same fate. +++http://online.wsj.com/article/SB1237342095849 65205.html By now, President Obama's lather-rinse-repeat approach to the legal war on terror is familiar: He lambastes his predecessor, then makes cosmetic changes that leave the substance of Bush policy intact. But Mr. Obama's decision last week to renounce the term \"enemy combatant\" is almost a parody of this method, given that the \"new standard\" for detaining terrorists is identical to the old one. Strunk & White counseled simplicity in prose, so whoever wrote the Justice Department's filing with the D.C. District Court learned his elements of style elsewhere. To avoid using enemy combatants, we instead get \"individuals captured in connection with armed conflicts and counterterrorism operations,\" or \"members of enemy forces,\" or \"persons who [the President] determines planned, authorized, committed, or aided the terrorist attacks that occurred on September 11, 2001, and persons who harbored those responsible for the September 11 attacks.\" These gyrations are bizarre because the brief is actually a solid legal argument for detaining e---- c---------. Justice argues that the U.S. has the right to hold indefinitely, without legal charges, those who \"substantially supported\" al Qaeda or the Taliban, reserving the right to define what qualifies as \"substantial\" in each case. It also extends its writ to people who support terror networks away from the battlefield, such as financiers. The concept of the unlawful enemy combatant is deeply rooted in international law and custom, including the Geneva Conventions. It refers to those who violate the laws of war by killing civilians or fighting out of uniform, and thus are not entitled to prisoner-of-war status. The Justice brief cites the Supreme Court's 2004 Hamdi decision, in which a plurality of Justices held that capture and detention is \"so fundamental and accepted an incident to war\" as to be an afterthought. The one difference between the Bush and Obama detention standards concerns core executive powers. The Obama team argues that its authority flows from the Authorization for the Use of Military Force Act, which Congress passed after 9/11 and authorizes the President to use \"all necessary and appropriate force\" to prosecute \"nations, organizations, or persons\" associated with the attack. Here, again, there is less than meets the eye. Bush lawyers also cited this act of Congress, but in addition they asserted inherent war power under the Constitution. Eric Holder's Justice Department does not assert Commander in Chief prerogatives, but it doesn't disavow them either. Justice knows it doesn't need the argument given Hamdi and that it appeases the anti-antiterror left not to echo every Bush claim. The risk is that Mr. Obama could one day face a more isolationist GOP Congress, run by a Tom DeLay or a Senator William Borah that is unwilling to endorse the President's national-security policies. Then Justice will not be able to cite its own precedents as the courts intrude on executive war powers. We're delighted that Mr. Obama has come around on one of the most rancorous controversies of the last eight years. Even so, Mr. Obama's supporters must be suffering some kind of post-traumatic stress disorder, because on the range of Bush antiterror policies that Mr. Obama has largely preserved -- interrogation, surveillance, rendition, state secrets, now detention -- no one seems to be vilifying him with the same intensity. Or maybe the problem with President Bush's policies was that they were President Bush's policies.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 06:46:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: I can understand your inpatients in regards to undoing eight years of bad policy (and it is a surprise to see you admit what a total failure Bush was), but it will take considerably more time than has been allotted to date. Bush was NEVER a conservative, but I'm not sure I would call him a failure... That said: Obama could wave his magic wand tomorrow and end rendition, or interrogations..the PATRIOT ACT...none of which he has done.. Maybe...GULP...Bush had the right idea?", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "Originally posted by dmuhler: I can understand your inpatients in regards to undoing eight years of bad policy (and it is a surprise to see you admit what a total failure Bush was), but it will take considerably more time than has been allotted to date.", 
        "reply": " Bush was NEVER a conservative, but I'm not sure I would call him a failure... That said: Obama could wave his magic wand tomorrow and end rendition, or interrogations..the PATRIOT ACT...none of which he has done.. Maybe...GULP...Bush had the right idea?", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 06:55:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "threerings"
    }, 
    {
        "content": "Bush was not a conservative...he was a neo-con...a contradiction to traditional American politics by \"not\" paying any attention to US laws, regulations, and the needs and interests of this nation and public. He was out there and we are lucky we are not in worse condition due to his Administration. The US public and the voter's made this apparent in the last election...if Bush had done anything with in reason and good conscience McCain would not have lost to a newby.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "", 
        "reply": "Bush was not a conservative...he was a neo-con...a contradiction to traditional American politics by \"not\" paying any attention to US laws, regulations, and the needs and interests of this nation and public. He was out there and we are lucky we are not in worse condition due to his Administration. The US public and the voter's made this apparent in the last election...if Bush had done anything with in reason and good conscience McCain would not have lost to a newby.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 08:28:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Change you can count on", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "Change you can count on", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 08:57:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "Except with Obama, the TOTUS (Teleprompter of the United States) is telling him what to say and what to do. \"The World's Finest\"", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "", 
        "reply": "Except with Obama, the TOTUS (Teleprompter of the United States) is telling him what to say and what to do. \"The World's Finest\"", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 10:16:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Or maybe when Barry got his first full level briefing on what is really going on in the world; that there really are bad guys out there intent on bringing destruction and terrorism to America, he realized it was easy to throw stones when you weren't the one responsible for the safety of America and much hard to actually have the stones to keep in place the policies that have been successful these last 7 years (despite the whining, gritching and moaning of every limp wristed appeasement apologist).", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "", 
        "reply": "Or maybe when Barry got his first full level briefing on what is really going on in the world; that there really are bad guys out there intent on bringing destruction and terrorism to America, he realized it was easy to throw stones when you weren't the one responsible for the safety of America and much hard to actually have the stones to keep in place the policies that have been successful these last 7 years (despite the whining, gritching and moaning of every limp wristed appeasement apologist).", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:14:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by dmuhler: I can understand your inpatients in regards to undoing eight years of bad policy (and it is a surprise to see you admit what a total failure Bush was), but it will take considerably more time than has been allotted to date. Bush was NEVER a conservative, but I'm not sure I would call him a failure... That said: Obama could wave his magic wand tomorrow and end rendition, or interrogations..the PATRIOT ACT...none of which he has done.. Maybe...GULP...Bush had the right idea? Funny that you mention that. Obama voted to reinstate the Patriot Act and the FISA bills. And, if you read his executive order in regard to Gitmo, it actually encourages rendition. Hmm...", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "Originally posted by threerings: quote: Originally posted by dmuhler: I can understand your inpatients in regards to undoing eight years of bad policy (and it is a surprise to see you admit what a total failure Bush was), but it will take considerably more time than has been allotted to date. Bush was NEVER a conservative, but I'm not sure I would call him a failure... That said: Obama could wave his magic wand tomorrow and end rendition, or interrogations..the PATRIOT ACT...none of which he has done.. Maybe...GULP...Bush had the right idea?", 
        "reply": " Funny that you mention that. Obama voted to reinstate the Patriot Act and the FISA bills. And, if you read his executive order in regard to Gitmo, it actually encourages rendition. Hmm...", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:26:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Well, its a tough rock to toe isn't you liberals and democrat who bash Bush over and over. Now you must bash Obama over and over...and for what? Because as Obama got closer and closer to being President and then going to Bush and was fill in on the REAL DEAL, Obama said, Self, this guy has a point, this guy isn't as bad as they said he was or as I said he was. He did have the interests of the America people first and not himself or anyone else. He had to make TUFF deceisions that he knew not everyone would agree with. And he did all of this with the full knowledge (after) that the Intell from the previous admin was VERY bad..as a matter of fact it suck. Iraq had no WMD's as the previous admin stated he did...and now we are in Iraq..we must stay the course and rid Iraq Sadamm (sp). And to keep America safe, we have to keep those items that were put in place. We cannot take the chance and lift our guard for they will strike again. So as much as I DON'T care for Obama nor did I vote for him. I'll give him one for that...He is doing the right thing by keeping certain items in place that Bush put there. Hey, And I'll bet you ALL, that there will be no classified documents stolen that pretain to Bush like Clinton had Berger do.", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "", 
        "reply": "Well, its a tough rock to toe isn't you liberals and democrat who bash Bush over and over. Now you must bash Obama over and over...and for what? Because as Obama got closer and closer to being President and then going to Bush and was fill in on the REAL DEAL, Obama said, Self, this guy has a point, this guy isn't as bad as they said he was or as I said he was. He did have the interests of the America people first and not himself or anyone else. He had to make TUFF deceisions that he knew not everyone would agree with. And he did all of this with the full knowledge (after) that the Intell from the previous admin was VERY bad..as a matter of fact it suck. Iraq had no WMD's as the previous admin stated he did...and now we are in Iraq..we must stay the course and rid Iraq Sadamm (sp). And to keep America safe, we have to keep those items that were put in place. We cannot take the chance and lift our guard for they will strike again. So as much as I DON'T care for Obama nor did I vote for him. I'll give him one for that...He is doing the right thing by keeping certain items in place that Bush put there. Hey, And I'll bet you ALL, that there will be no classified documents stolen that pretain to Bush like Clinton had Berger do.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:31:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Except with Obama, the TOTUS (Teleprompter of the United States) is telling him what to say and what to do. HAHAHAH how clever HAHAHA......how old are you again?", 
        "intTime": 20090318, 
        "postID": 9, 
        "quote": "Originally posted by Kegler300: Except with Obama, the TOTUS (Teleprompter of the United States) is telling him what to say and what to do.", 
        "reply": " HAHAHAH how clever HAHAHA......how old are you again?", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:38:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "Knele"
    }, 
    {
        "content": "More change you can count on.. quote: WASHINGTON (Reuters) – Some of the Guantanamo Bay prisoners could be released into the United States while others could be put on trial in the American court system, Attorney General Eric Holder said on Wednesday. Holder, who was chosen by President Barack Obama to lead the administration's efforts to close the U.S. military prison at Guantanamo Bay in Cuba within a year, said the review of what to do with each of the prisoners had begun. -http://news.yahoo.com/s/nm/20090318/us_nm/us_guantanamo_holder", 
        "intTime": 20090318, 
        "postID": 10, 
        "quote": "WASHINGTON (Reuters) – Some of the Guantanamo Bay prisoners could be released into the United States while others could be put on trial in the American court system, Attorney General Eric Holder said on Wednesday. Holder, who was chosen by President Barack Obama to lead the administration's efforts to close the U.S. military prison at Guantanamo Bay in Cuba within a year, said the review of what to do with each of the prisoners had begun.", 
        "reply": "More change you can count on..  -http://news.yahoo.com/s/nm/20090318/us_nm/us_guantanamo_holder", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:41:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: have the stones to keep in place the policies that have been successful these last 7 years I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses. Same standard you apply to Barry. Oh and he has a pretty good record too. Zero attacks. Not bad hey? Barry has ZERO record of doing anything without someone directing what that would be. Passing the biggest theivery of tax payer money in American history that rewards those who put him in office while decimating the American tax payer isn't what anyone would call a GOOD record.", 
        "intTime": 20090318, 
        "postID": 11, 
        "quote": "Originally posted by dmuhler: quote: have the stones to keep in place the policies that have been successful these last 7 years I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses. Same standard you apply to Barry. Oh and he has a pretty good record too. Zero attacks. Not bad hey?", 
        "reply": " Barry has ZERO record of doing anything without someone directing what that would be. Passing the biggest theivery of tax payer money in American history that rewards those who put him in office while decimating the American tax payer isn't what anyone would call a GOOD record.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:48:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Obama IS Bush??? You owe Bush an apology of the first order!", 
        "intTime": 20090318, 
        "postID": 12, 
        "quote": "", 
        "reply": "Obama IS Bush??? You owe Bush an apology of the first order!", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:49:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: He will also have a long way to go to match Bush's record on spending. Thats funny. He seems to be off to a record start. His current budget projection will do in 4 years that which Bush managed in 8..", 
        "intTime": 20090318, 
        "postID": 13, 
        "quote": "Originally posted by dmuhler: He will also have a long way to go to match Bush's record on spending.", 
        "reply": " Thats funny. He seems to be off to a record start. His current budget projection will do in 4 years that which Bush managed in 8..", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 17:48:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by floersh: quote: Originally posted by dmuhler: He will also have a long way to go to match Bush's record on spending. Thats funny. He seems to be off to a record start. His current budget projection will do in 4 years that which Bush managed in 8.. Yes well he was told by the CFR that if he didn't the whole world economy would melt down. Quite a mess he inherited, wouldn't you say? Still we have a good chance of recovering a good portion of the money paid to the banks and other bail outs. Far more than will ever be recovered from GWB's spending spree. Actually thats a bunch of nonsensical crap. The Bush plan and the Obama plan have and will continue to be collosal failures. And in the end the only thing we'll have to show for any of it is a gigantic tax bill, most of which will be needed to pay the interest on our debt. The Fed is already monitizing our debt. Its only a matter of time now.", 
        "intTime": 20090318, 
        "postID": 14, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by floersh: quote: Originally posted by dmuhler: He will also have a long way to go to match Bush's record on spending. Thats funny. He seems to be off to a record start. His current budget projection will do in 4 years that which Bush managed in 8.. Yes well he was told by the CFR that if he didn't the whole world economy would melt down. Quite a mess he inherited, wouldn't you say? Still we have a good chance of recovering a good portion of the money paid to the banks and other bail outs. Far more than will ever be recovered from GWB's spending spree.", 
        "reply": " Actually thats a bunch of nonsensical crap. The Bush plan and the Obama plan have and will continue to be collosal failures. And in the end the only thing we'll have to show for any of it is a gigantic tax bill, most of which will be needed to pay the interest on our debt. The Fed is already monitizing our debt. Its only a matter of time now.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 18:59:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "I said this somewhere else, but I will say it again here. Obama isn't just following the 'ol Bush plan, he is expanding upon it. Oh, and to remark on that \"we inherited\" crap. I seem to remember that Obama was a Senator during the latter years of Bush's presidency. Seems to me that he cannot say that he inherited something that he was a part of. Now, if a governor were elected as our current president, then I could allow it. But, not in this case. Not to mention that there are those in his cabinet who's hands are covered in this calamity. It is not as if a president can just do whatever he wants and the country has to follow. That is what checks and balances are for. So, to point blame in the governments direction, you must point it at all of them. Because, they are all part of this thing. Not just one or two bad seeds. If anything, I would say that it is the good guys that are in short supply. And, Obama is not one of those few good guys. It is quite obvious that he is nothing other than a cult of personality. He fits every description thereof. If you can prove otherwise I am all ears.", 
        "intTime": 20090318, 
        "postID": 15, 
        "quote": "", 
        "reply": "I said this somewhere else, but I will say it again here. Obama isn't just following the 'ol Bush plan, he is expanding upon it. Oh, and to remark on that \"we inherited\" crap. I seem to remember that Obama was a Senator during the latter years of Bush's presidency. Seems to me that he cannot say that he inherited something that he was a part of. Now, if a governor were elected as our current president, then I could allow it. But, not in this case. Not to mention that there are those in his cabinet who's hands are covered in this calamity. It is not as if a president can just do whatever he wants and the country has to follow. That is what checks and balances are for. So, to point blame in the governments direction, you must point it at all of them. Because, they are all part of this thing. Not just one or two bad seeds. If anything, I would say that it is the good guys that are in short supply. And, Obama is not one of those few good guys. It is quite obvious that he is nothing other than a cult of personality. He fits every description thereof. If you can prove otherwise I am all ears.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 19:03:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: The sky has been falling for years, pretty late to try to prop it up. Well that is certainly true. However, it would have been wise not to add fuel to the fire.", 
        "intTime": 20090318, 
        "postID": 16, 
        "quote": "Originally posted by dmuhler: The sky has been falling for years, pretty late to try to prop it up.", 
        "reply": " Well that is certainly true. However, it would have been wise not to add fuel to the fire.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 19:37:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by floersh: quote: Originally posted by dmuhler: The sky has been falling for years, pretty late to try to prop it up. Well that is certainly true. However, it would have been wise not to add fuel to the fire. Status quo that is what it is all about. Muddling through. So then you admit that change is a joke? Status Quo != Change", 
        "intTime": 20090318, 
        "postID": 17, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by floersh: quote: Originally posted by dmuhler: The sky has been falling for years, pretty late to try to prop it up. Well that is certainly true. However, it would have been wise not to add fuel to the fire. Status quo that is what it is all about. Muddling through.", 
        "reply": " So then you admit that change is a joke? Status Quo != Change", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 20:00:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Mom2APAJ: quote: Originally posted by dmuhler: quote: have the stones to keep in place the policies that have been successful these last 7 years I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses. Same standard you apply to Barry. Oh and he has a pretty good record too. Zero attacks. Not bad hey? Barry has ZERO record of doing anything without someone directing what that would be. Passing the biggest theivery of tax payer money in American history that rewards those who put him in office while decimating the American tax payer isn't what anyone would call a GOOD record. Military.com's broken record. No attack on his watch, much better than Bush's record. He will also have a long way to go to match Bush's record on spending. Kinda surprised you would even bring that up. Oh and a lot of Obama's spend has the potential of being repaid....not so much with Bush's hand outs. How low can you go, dmuhler? You're blaming Bush for 9/11.. and I suppose the previous administration's 8 years of refusing to effectively deal with terrorists and basically ignoring their attacks on Americans had nothing whatsoever to do with it, right? Your post above probably ranks in your Top 5 of inanely partisan and deliberately obtuse \"contributions\" to this forum. Congrats. As for B.O.'s spending.. give him a few more months.. he's already floating the idea of \"Porkulus II\". And if you really think that any of B.O.'s fraud, waste, and abuse of taxpayer funds is ever going to be \"repaid\", I've got some fantastic swampland down in FL to sell ya.", 
        "intTime": 20090318, 
        "postID": 18, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Mom2APAJ: quote: Originally posted by dmuhler: quote: have the stones to keep in place the policies that have been successful these last 7 years I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses. Same standard you apply to Barry. Oh and he has a pretty good record too. Zero attacks. Not bad hey? Barry has ZERO record of doing anything without someone directing what that would be. Passing the biggest theivery of tax payer money in American history that rewards those who put him in office while decimating the American tax payer isn't what anyone would call a GOOD record. Military.com's broken record. No attack on his watch, much better than Bush's record. He will also have a long way to go to match Bush's record on spending. Kinda surprised you would even bring that up. Oh and a lot of Obama's spend has the potential of being repaid....not so much with Bush's hand outs.", 
        "reply": " How low can you go, dmuhler? You're blaming Bush for 9/11.. and I suppose the previous administration's 8 years of refusing to effectively deal with terrorists and basically ignoring their attacks on Americans had nothing whatsoever to do with it, right? Your post above probably ranks in your Top 5 of inanely partisan and deliberately obtuse \"contributions\" to this forum. Congrats. As for B.O.'s spending.. give him a few more months.. he's already floating the idea of \"Porkulus II\". And if you really think that any of B.O.'s fraud, waste, and abuse of taxpayer funds is ever going to be \"repaid\", I've got some fantastic swampland down in FL to sell ya.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 20:05:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: You're blaming Bush for 9/11.. I see you still have a problem reading. There are programs that might help. Liberal dollars at your disposal. Yeah, I'm wrong and up is down, right? I read what you posted: quote: Originally posted by dmuhler: I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses... quote: Originally posted by dmuhler: ...No attack on his watch, much better than Bush's record... So, by saying that 9/11 happened on Bush's watch, and that B.O.'s record is better because we haven't yet been attacked during his term, you're not ascribing any fault or blame to Bush for this heinous act, (that could have been avoided completely were it not for Billy Jeff's ineptitude), right? Riiiiiiiiight.", 
        "intTime": 20090318, 
        "postID": 19, 
        "quote": "Originally posted by dmuhler: quote: You're blaming Bush for 9/11.. I see you still have a problem reading. There are programs that might help. Liberal dollars at your disposal.", 
        "reply": " Yeah, I'm wrong and up is down, right? I read what you posted: quote: Originally posted by dmuhler: I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses... quote: Originally posted by dmuhler: ...No attack on his watch, much better than Bush's record... So, by saying that 9/11 happened on Bush's watch, and that B.O.'s record is better because we haven't yet been attacked during his term, you're not ascribing any fault or blame to Bush for this heinous act, (that could have been avoided completely were it not for Billy Jeff's ineptitude), right? Riiiiiiiiight.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 20:18:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Wow - the title of this thread threw me. Ouch, very disturbing. President Bush is a man of honor and class. We were highly blessed to have him for eight years. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090318, 
        "postID": 20, 
        "quote": "", 
        "reply": "Wow - the title of this thread threw me. Ouch, very disturbing. President Bush is a man of honor and class. We were highly blessed to have him for eight years. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 20:35:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "I almost feel sorry for all the O-Bots. You've been had. Feel not alone. Conservatives went through the same thing with Bush. LEARN FROM US. Call a spade a spade. FORCE YOUR GUY TO DO WHAT HE SAID HE WOULD...or face the same fate. +++http://online.wsj.com/article/SB1237342095849 65205.html By now, President Obama's lather-rinse-repeat approach to the legal war on terror is familiar: He lambastes his predecessor, then makes cosmetic changes that leave the substance of Bush policy intact. But Mr. Obama's decision last week to renounce the term \"enemy combatant\" is almost a parody of this method, given that the \"new standard\" for detaining terrorists is identical to the old one. Strunk & White counseled simplicity in prose, so whoever wrote the Justice Department's filing with the D.C. District Court learned his elements of style elsewhere. To avoid using enemy combatants, we instead get \"individuals captured in connection with armed conflicts and counterterrorism operations,\" or \"members of enemy forces,\" or \"persons who [the President] determines planned, authorized, committed, or aided the terrorist attacks that occurred on September 11, 2001, and persons who harbored those responsible for the September 11 attacks.\" These gyrations are bizarre because the brief is actually a solid legal argument for detaining e---- c---------. Justice argues that the U.S. has the right to hold indefinitely, without legal charges, those who \"substantially supported\" al Qaeda or the Taliban, reserving the right to define what qualifies as \"substantial\" in each case. It also extends its writ to people who support terror networks away from the battlefield, such as financiers. The concept of the unlawful enemy combatant is deeply rooted in international law and custom, including the Geneva Conventions. It refers to those who violate the laws of war by killing civilians or fighting out of uniform, and thus are not entitled to prisoner-of-war status. The Justice brief cites the Supreme Court's 2004 Hamdi decision, in which a plurality of Justices held that capture and detention is \"so fundamental and accepted an incident to war\" as to be an afterthought. The one difference between the Bush and Obama detention standards concerns core executive powers. The Obama team argues that its authority flows from the Authorization for the Use of Military Force Act, which Congress passed after 9/11 and authorizes the President to use \"all necessary and appropriate force\" to prosecute \"nations, organizations, or persons\" associated with the attack. Here, again, there is less than meets the eye. Bush lawyers also cited this act of Congress, but in addition they asserted inherent war power under the Constitution. Eric Holder's Justice Department does not assert Commander in Chief prerogatives, but it doesn't disavow them either. Justice knows it doesn't need the argument given Hamdi and that it appeases the anti-antiterror left not to echo every Bush claim. The risk is that Mr. Obama could one day face a more isolationist GOP Congress, run by a Tom DeLay or a Senator William Borah that is unwilling to endorse the President's national-security policies. Then Justice will not be able to cite its own precedents as the courts intrude on executive war powers. We're delighted that Mr. Obama has come around on one of the most rancorous controversies of the last eight years. Even so, Mr. Obama's supporters must be suffering some kind of post-traumatic stress disorder, because on the range of Bush antiterror policies that Mr. Obama has largely preserved -- interrogation, surveillance, rendition, state secrets, now detention -- no one seems to be vilifying him with the same intensity. Or maybe the problem with President Bush's policies was that they were President Bush's policies.", 
        "intTime": 20090318, 
        "postID": 21, 
        "quote": "", 
        "reply": "I almost feel sorry for all the O-Bots. You've been had. Feel not alone. Conservatives went through the same thing with Bush. LEARN FROM US. Call a spade a spade. FORCE YOUR GUY TO DO WHAT HE SAID HE WOULD...or face the same fate. +++http://online.wsj.com/article/SB1237342095849 65205.html By now, President Obama's lather-rinse-repeat approach to the legal war on terror is familiar: He lambastes his predecessor, then makes cosmetic changes that leave the substance of Bush policy intact. But Mr. Obama's decision last week to renounce the term \"enemy combatant\" is almost a parody of this method, given that the \"new standard\" for detaining terrorists is identical to the old one. Strunk & White counseled simplicity in prose, so whoever wrote the Justice Department's filing with the D.C. District Court learned his elements of style elsewhere. To avoid using enemy combatants, we instead get \"individuals captured in connection with armed conflicts and counterterrorism operations,\" or \"members of enemy forces,\" or \"persons who [the President] determines planned, authorized, committed, or aided the terrorist attacks that occurred on September 11, 2001, and persons who harbored those responsible for the September 11 attacks.\" These gyrations are bizarre because the brief is actually a solid legal argument for detaining e---- c---------. Justice argues that the U.S. has the right to hold indefinitely, without legal charges, those who \"substantially supported\" al Qaeda or the Taliban, reserving the right to define what qualifies as \"substantial\" in each case. It also extends its writ to people who support terror networks away from the battlefield, such as financiers. The concept of the unlawful enemy combatant is deeply rooted in international law and custom, including the Geneva Conventions. It refers to those who violate the laws of war by killing civilians or fighting out of uniform, and thus are not entitled to prisoner-of-war status. The Justice brief cites the Supreme Court's 2004 Hamdi decision, in which a plurality of Justices held that capture and detention is \"so fundamental and accepted an incident to war\" as to be an afterthought. The one difference between the Bush and Obama detention standards concerns core executive powers. The Obama team argues that its authority flows from the Authorization for the Use of Military Force Act, which Congress passed after 9/11 and authorizes the President to use \"all necessary and appropriate force\" to prosecute \"nations, organizations, or persons\" associated with the attack. Here, again, there is less than meets the eye. Bush lawyers also cited this act of Congress, but in addition they asserted inherent war power under the Constitution. Eric Holder's Justice Department does not assert Commander in Chief prerogatives, but it doesn't disavow them either. Justice knows it doesn't need the argument given Hamdi and that it appeases the anti-antiterror left not to echo every Bush claim. The risk is that Mr. Obama could one day face a more isolationist GOP Congress, run by a Tom DeLay or a Senator William Borah that is unwilling to endorse the President's national-security policies. Then Justice will not be able to cite its own precedents as the courts intrude on executive war powers. We're delighted that Mr. Obama has come around on one of the most rancorous controversies of the last eight years. Even so, Mr. Obama's supporters must be suffering some kind of post-traumatic stress disorder, because on the range of Bush antiterror policies that Mr. Obama has largely preserved -- interrogation, surveillance, rendition, state secrets, now detention -- no one seems to be vilifying him with the same intensity. Or maybe the problem with President Bush's policies was that they were President Bush's policies.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 06:46:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: I can understand your inpatients in regards to undoing eight years of bad policy (and it is a surprise to see you admit what a total failure Bush was), but it will take considerably more time than has been allotted to date. Bush was NEVER a conservative, but I'm not sure I would call him a failure... That said: Obama could wave his magic wand tomorrow and end rendition, or interrogations..the PATRIOT ACT...none of which he has done.. Maybe...GULP...Bush had the right idea?", 
        "intTime": 20090318, 
        "postID": 22, 
        "quote": "Originally posted by dmuhler: I can understand your inpatients in regards to undoing eight years of bad policy (and it is a surprise to see you admit what a total failure Bush was), but it will take considerably more time than has been allotted to date.", 
        "reply": " Bush was NEVER a conservative, but I'm not sure I would call him a failure... That said: Obama could wave his magic wand tomorrow and end rendition, or interrogations..the PATRIOT ACT...none of which he has done.. Maybe...GULP...Bush had the right idea?", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 06:55:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "threerings"
    }, 
    {
        "content": "Bush was not a conservative...he was a neo-con...a contradiction to traditional American politics by \"not\" paying any attention to US laws, regulations, and the needs and interests of this nation and public. He was out there and we are lucky we are not in worse condition due to his Administration. The US public and the voter's made this apparent in the last election...if Bush had done anything with in reason and good conscience McCain would not have lost to a newby.", 
        "intTime": 20090318, 
        "postID": 23, 
        "quote": "", 
        "reply": "Bush was not a conservative...he was a neo-con...a contradiction to traditional American politics by \"not\" paying any attention to US laws, regulations, and the needs and interests of this nation and public. He was out there and we are lucky we are not in worse condition due to his Administration. The US public and the voter's made this apparent in the last election...if Bush had done anything with in reason and good conscience McCain would not have lost to a newby.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 08:28:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Change you can count on", 
        "intTime": 20090318, 
        "postID": 24, 
        "quote": "", 
        "reply": "Change you can count on", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 08:57:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "Except with Obama, the TOTUS (Teleprompter of the United States) is telling him what to say and what to do. \"The World's Finest\"", 
        "intTime": 20090318, 
        "postID": 25, 
        "quote": "", 
        "reply": "Except with Obama, the TOTUS (Teleprompter of the United States) is telling him what to say and what to do. \"The World's Finest\"", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 10:16:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Or maybe when Barry got his first full level briefing on what is really going on in the world; that there really are bad guys out there intent on bringing destruction and terrorism to America, he realized it was easy to throw stones when you weren't the one responsible for the safety of America and much hard to actually have the stones to keep in place the policies that have been successful these last 7 years (despite the whining, gritching and moaning of every limp wristed appeasement apologist).", 
        "intTime": 20090318, 
        "postID": 26, 
        "quote": "", 
        "reply": "Or maybe when Barry got his first full level briefing on what is really going on in the world; that there really are bad guys out there intent on bringing destruction and terrorism to America, he realized it was easy to throw stones when you weren't the one responsible for the safety of America and much hard to actually have the stones to keep in place the policies that have been successful these last 7 years (despite the whining, gritching and moaning of every limp wristed appeasement apologist).", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:14:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by dmuhler: I can understand your inpatients in regards to undoing eight years of bad policy (and it is a surprise to see you admit what a total failure Bush was), but it will take considerably more time than has been allotted to date. Bush was NEVER a conservative, but I'm not sure I would call him a failure... That said: Obama could wave his magic wand tomorrow and end rendition, or interrogations..the PATRIOT ACT...none of which he has done.. Maybe...GULP...Bush had the right idea? Funny that you mention that. Obama voted to reinstate the Patriot Act and the FISA bills. And, if you read his executive order in regard to Gitmo, it actually encourages rendition. Hmm...", 
        "intTime": 20090318, 
        "postID": 27, 
        "quote": "Originally posted by threerings: quote: Originally posted by dmuhler: I can understand your inpatients in regards to undoing eight years of bad policy (and it is a surprise to see you admit what a total failure Bush was), but it will take considerably more time than has been allotted to date. Bush was NEVER a conservative, but I'm not sure I would call him a failure... That said: Obama could wave his magic wand tomorrow and end rendition, or interrogations..the PATRIOT ACT...none of which he has done.. Maybe...GULP...Bush had the right idea?", 
        "reply": " Funny that you mention that. Obama voted to reinstate the Patriot Act and the FISA bills. And, if you read his executive order in regard to Gitmo, it actually encourages rendition. Hmm...", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:26:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Well, its a tough rock to toe isn't you liberals and democrat who bash Bush over and over. Now you must bash Obama over and over...and for what? Because as Obama got closer and closer to being President and then going to Bush and was fill in on the REAL DEAL, Obama said, Self, this guy has a point, this guy isn't as bad as they said he was or as I said he was. He did have the interests of the America people first and not himself or anyone else. He had to make TUFF deceisions that he knew not everyone would agree with. And he did all of this with the full knowledge (after) that the Intell from the previous admin was VERY bad..as a matter of fact it suck. Iraq had no WMD's as the previous admin stated he did...and now we are in Iraq..we must stay the course and rid Iraq Sadamm (sp). And to keep America safe, we have to keep those items that were put in place. We cannot take the chance and lift our guard for they will strike again. So as much as I DON'T care for Obama nor did I vote for him. I'll give him one for that...He is doing the right thing by keeping certain items in place that Bush put there. Hey, And I'll bet you ALL, that there will be no classified documents stolen that pretain to Bush like Clinton had Berger do.", 
        "intTime": 20090318, 
        "postID": 28, 
        "quote": "", 
        "reply": "Well, its a tough rock to toe isn't you liberals and democrat who bash Bush over and over. Now you must bash Obama over and over...and for what? Because as Obama got closer and closer to being President and then going to Bush and was fill in on the REAL DEAL, Obama said, Self, this guy has a point, this guy isn't as bad as they said he was or as I said he was. He did have the interests of the America people first and not himself or anyone else. He had to make TUFF deceisions that he knew not everyone would agree with. And he did all of this with the full knowledge (after) that the Intell from the previous admin was VERY bad..as a matter of fact it suck. Iraq had no WMD's as the previous admin stated he did...and now we are in Iraq..we must stay the course and rid Iraq Sadamm (sp). And to keep America safe, we have to keep those items that were put in place. We cannot take the chance and lift our guard for they will strike again. So as much as I DON'T care for Obama nor did I vote for him. I'll give him one for that...He is doing the right thing by keeping certain items in place that Bush put there. Hey, And I'll bet you ALL, that there will be no classified documents stolen that pretain to Bush like Clinton had Berger do.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:31:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Except with Obama, the TOTUS (Teleprompter of the United States) is telling him what to say and what to do. HAHAHAH how clever HAHAHA......how old are you again?", 
        "intTime": 20090318, 
        "postID": 29, 
        "quote": "Originally posted by Kegler300: Except with Obama, the TOTUS (Teleprompter of the United States) is telling him what to say and what to do.", 
        "reply": " HAHAHAH how clever HAHAHA......how old are you again?", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:38:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "Knele"
    }, 
    {
        "content": "More change you can count on.. quote: WASHINGTON (Reuters) – Some of the Guantanamo Bay prisoners could be released into the United States while others could be put on trial in the American court system, Attorney General Eric Holder said on Wednesday. Holder, who was chosen by President Barack Obama to lead the administration's efforts to close the U.S. military prison at Guantanamo Bay in Cuba within a year, said the review of what to do with each of the prisoners had begun. -http://news.yahoo.com/s/nm/20090318/us_nm/us_guantanamo_holder", 
        "intTime": 20090318, 
        "postID": 30, 
        "quote": "WASHINGTON (Reuters) – Some of the Guantanamo Bay prisoners could be released into the United States while others could be put on trial in the American court system, Attorney General Eric Holder said on Wednesday. Holder, who was chosen by President Barack Obama to lead the administration's efforts to close the U.S. military prison at Guantanamo Bay in Cuba within a year, said the review of what to do with each of the prisoners had begun.", 
        "reply": "More change you can count on..  -http://news.yahoo.com/s/nm/20090318/us_nm/us_guantanamo_holder", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:41:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: have the stones to keep in place the policies that have been successful these last 7 years I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses. Same standard you apply to Barry. Oh and he has a pretty good record too. Zero attacks. Not bad hey? Barry has ZERO record of doing anything without someone directing what that would be. Passing the biggest theivery of tax payer money in American history that rewards those who put him in office while decimating the American tax payer isn't what anyone would call a GOOD record.", 
        "intTime": 20090318, 
        "postID": 31, 
        "quote": "Originally posted by dmuhler: quote: have the stones to keep in place the policies that have been successful these last 7 years I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses. Same standard you apply to Barry. Oh and he has a pretty good record too. Zero attacks. Not bad hey?", 
        "reply": " Barry has ZERO record of doing anything without someone directing what that would be. Passing the biggest theivery of tax payer money in American history that rewards those who put him in office while decimating the American tax payer isn't what anyone would call a GOOD record.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:48:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "Obama IS Bush??? You owe Bush an apology of the first order!", 
        "intTime": 20090318, 
        "postID": 32, 
        "quote": "", 
        "reply": "Obama IS Bush??? You owe Bush an apology of the first order!", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 16:49:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: He will also have a long way to go to match Bush's record on spending. Thats funny. He seems to be off to a record start. His current budget projection will do in 4 years that which Bush managed in 8..", 
        "intTime": 20090318, 
        "postID": 33, 
        "quote": "Originally posted by dmuhler: He will also have a long way to go to match Bush's record on spending.", 
        "reply": " Thats funny. He seems to be off to a record start. His current budget projection will do in 4 years that which Bush managed in 8..", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 17:48:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by floersh: quote: Originally posted by dmuhler: He will also have a long way to go to match Bush's record on spending. Thats funny. He seems to be off to a record start. His current budget projection will do in 4 years that which Bush managed in 8.. Yes well he was told by the CFR that if he didn't the whole world economy would melt down. Quite a mess he inherited, wouldn't you say? Still we have a good chance of recovering a good portion of the money paid to the banks and other bail outs. Far more than will ever be recovered from GWB's spending spree. Actually thats a bunch of nonsensical crap. The Bush plan and the Obama plan have and will continue to be collosal failures. And in the end the only thing we'll have to show for any of it is a gigantic tax bill, most of which will be needed to pay the interest on our debt. The Fed is already monitizing our debt. Its only a matter of time now.", 
        "intTime": 20090318, 
        "postID": 34, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by floersh: quote: Originally posted by dmuhler: He will also have a long way to go to match Bush's record on spending. Thats funny. He seems to be off to a record start. His current budget projection will do in 4 years that which Bush managed in 8.. Yes well he was told by the CFR that if he didn't the whole world economy would melt down. Quite a mess he inherited, wouldn't you say? Still we have a good chance of recovering a good portion of the money paid to the banks and other bail outs. Far more than will ever be recovered from GWB's spending spree.", 
        "reply": " Actually thats a bunch of nonsensical crap. The Bush plan and the Obama plan have and will continue to be collosal failures. And in the end the only thing we'll have to show for any of it is a gigantic tax bill, most of which will be needed to pay the interest on our debt. The Fed is already monitizing our debt. Its only a matter of time now.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 18:59:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "I said this somewhere else, but I will say it again here. Obama isn't just following the 'ol Bush plan, he is expanding upon it. Oh, and to remark on that \"we inherited\" crap. I seem to remember that Obama was a Senator during the latter years of Bush's presidency. Seems to me that he cannot say that he inherited something that he was a part of. Now, if a governor were elected as our current president, then I could allow it. But, not in this case. Not to mention that there are those in his cabinet who's hands are covered in this calamity. It is not as if a president can just do whatever he wants and the country has to follow. That is what checks and balances are for. So, to point blame in the governments direction, you must point it at all of them. Because, they are all part of this thing. Not just one or two bad seeds. If anything, I would say that it is the good guys that are in short supply. And, Obama is not one of those few good guys. It is quite obvious that he is nothing other than a cult of personality. He fits every description thereof. If you can prove otherwise I am all ears.", 
        "intTime": 20090318, 
        "postID": 35, 
        "quote": "", 
        "reply": "I said this somewhere else, but I will say it again here. Obama isn't just following the 'ol Bush plan, he is expanding upon it. Oh, and to remark on that \"we inherited\" crap. I seem to remember that Obama was a Senator during the latter years of Bush's presidency. Seems to me that he cannot say that he inherited something that he was a part of. Now, if a governor were elected as our current president, then I could allow it. But, not in this case. Not to mention that there are those in his cabinet who's hands are covered in this calamity. It is not as if a president can just do whatever he wants and the country has to follow. That is what checks and balances are for. So, to point blame in the governments direction, you must point it at all of them. Because, they are all part of this thing. Not just one or two bad seeds. If anything, I would say that it is the good guys that are in short supply. And, Obama is not one of those few good guys. It is quite obvious that he is nothing other than a cult of personality. He fits every description thereof. If you can prove otherwise I am all ears.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 19:03:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: The sky has been falling for years, pretty late to try to prop it up. Well that is certainly true. However, it would have been wise not to add fuel to the fire.", 
        "intTime": 20090318, 
        "postID": 36, 
        "quote": "Originally posted by dmuhler: The sky has been falling for years, pretty late to try to prop it up.", 
        "reply": " Well that is certainly true. However, it would have been wise not to add fuel to the fire.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 19:37:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by floersh: quote: Originally posted by dmuhler: The sky has been falling for years, pretty late to try to prop it up. Well that is certainly true. However, it would have been wise not to add fuel to the fire. Status quo that is what it is all about. Muddling through. So then you admit that change is a joke? Status Quo != Change", 
        "intTime": 20090318, 
        "postID": 37, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by floersh: quote: Originally posted by dmuhler: The sky has been falling for years, pretty late to try to prop it up. Well that is certainly true. However, it would have been wise not to add fuel to the fire. Status quo that is what it is all about. Muddling through.", 
        "reply": " So then you admit that change is a joke? Status Quo != Change", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 20:00:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "floersh"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by Mom2APAJ: quote: Originally posted by dmuhler: quote: have the stones to keep in place the policies that have been successful these last 7 years I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses. Same standard you apply to Barry. Oh and he has a pretty good record too. Zero attacks. Not bad hey? Barry has ZERO record of doing anything without someone directing what that would be. Passing the biggest theivery of tax payer money in American history that rewards those who put him in office while decimating the American tax payer isn't what anyone would call a GOOD record. Military.com's broken record. No attack on his watch, much better than Bush's record. He will also have a long way to go to match Bush's record on spending. Kinda surprised you would even bring that up. Oh and a lot of Obama's spend has the potential of being repaid....not so much with Bush's hand outs. How low can you go, dmuhler? You're blaming Bush for 9/11.. and I suppose the previous administration's 8 years of refusing to effectively deal with terrorists and basically ignoring their attacks on Americans had nothing whatsoever to do with it, right? Your post above probably ranks in your Top 5 of inanely partisan and deliberately obtuse \"contributions\" to this forum. Congrats. As for B.O.'s spending.. give him a few more months.. he's already floating the idea of \"Porkulus II\". And if you really think that any of B.O.'s fraud, waste, and abuse of taxpayer funds is ever going to be \"repaid\", I've got some fantastic swampland down in FL to sell ya.", 
        "intTime": 20090318, 
        "postID": 38, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by Mom2APAJ: quote: Originally posted by dmuhler: quote: have the stones to keep in place the policies that have been successful these last 7 years I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses. Same standard you apply to Barry. Oh and he has a pretty good record too. Zero attacks. Not bad hey? Barry has ZERO record of doing anything without someone directing what that would be. Passing the biggest theivery of tax payer money in American history that rewards those who put him in office while decimating the American tax payer isn't what anyone would call a GOOD record. Military.com's broken record. No attack on his watch, much better than Bush's record. He will also have a long way to go to match Bush's record on spending. Kinda surprised you would even bring that up. Oh and a lot of Obama's spend has the potential of being repaid....not so much with Bush's hand outs.", 
        "reply": " How low can you go, dmuhler? You're blaming Bush for 9/11.. and I suppose the previous administration's 8 years of refusing to effectively deal with terrorists and basically ignoring their attacks on Americans had nothing whatsoever to do with it, right? Your post above probably ranks in your Top 5 of inanely partisan and deliberately obtuse \"contributions\" to this forum. Congrats. As for B.O.'s spending.. give him a few more months.. he's already floating the idea of \"Porkulus II\". And if you really think that any of B.O.'s fraud, waste, and abuse of taxpayer funds is ever going to be \"repaid\", I've got some fantastic swampland down in FL to sell ya.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 20:05:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: You're blaming Bush for 9/11.. I see you still have a problem reading. There are programs that might help. Liberal dollars at your disposal. Yeah, I'm wrong and up is down, right? I read what you posted: quote: Originally posted by dmuhler: I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses... quote: Originally posted by dmuhler: ...No attack on his watch, much better than Bush's record... So, by saying that 9/11 happened on Bush's watch, and that B.O.'s record is better because we haven't yet been attacked during his term, you're not ascribing any fault or blame to Bush for this heinous act, (that could have been avoided completely were it not for Billy Jeff's ineptitude), right? Riiiiiiiiight.", 
        "intTime": 20090318, 
        "postID": 39, 
        "quote": "Originally posted by dmuhler: quote: You're blaming Bush for 9/11.. I see you still have a problem reading. There are programs that might help. Liberal dollars at your disposal.", 
        "reply": " Yeah, I'm wrong and up is down, right? I read what you posted: quote: Originally posted by dmuhler: I am sure glad you said 7 years, since the worst attack on American soil occurred on his watch. No excuses... quote: Originally posted by dmuhler: ...No attack on his watch, much better than Bush's record... So, by saying that 9/11 happened on Bush's watch, and that B.O.'s record is better because we haven't yet been attacked during his term, you're not ascribing any fault or blame to Bush for this heinous act, (that could have been avoided completely were it not for Billy Jeff's ineptitude), right? Riiiiiiiiight.", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 20:18:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Wow - the title of this thread threw me. Ouch, very disturbing. President Bush is a man of honor and class. We were highly blessed to have him for eight years. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090318, 
        "postID": 40, 
        "quote": "", 
        "reply": "Wow - the title of this thread threw me. Ouch, very disturbing. President Bush is a man of honor and class. We were highly blessed to have him for eight years. \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5550091812001", 
        "time": "2009-03-18 20:35:00", 
        "title": "Change? What Change? Obama IS Bush.", 
        "userID": "PinkBlossoms"
    }
]