[
    {
        "content": "today the goverment announced that they were changing the national symbol to a CONDOM, the reason behind this change is that it more accurately reflects the goverments political stance. a condom allows for inflation, halts production, destroys the next generation, protects a bunch of *****s, and gives you a sense of security while your actually being screwed. it just doesn't get anyore accurate then that..lol", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "today the goverment announced that they were changing the national symbol to a CONDOM, the reason behind this change is that it more accurately reflects the goverments political stance. a condom allows for inflation, halts production, destroys the next generation, protects a bunch of *****s, and gives you a sense of security while your actually being screwed. it just doesn't get anyore accurate then that..lol", 
        "threadID": "409192893_8680007612001", 
        "time": "2009-03-02 14:49:00", 
        "title": "New symbol for america", 
        "userID": "blane"
    }, 
    {
        "content": "That's fine as long as we have stamped on the box \"introduced by the republican party and undergoing continued modifications by the democratic party.\" I wager that in the next presidential election we will not have a Democratic of Republican president.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "", 
        "reply": "That's fine as long as we have stamped on the box \"introduced by the republican party and undergoing continued modifications by the democratic party.\" I wager that in the next presidential election we will not have a Democratic of Republican president.", 
        "threadID": "409192893_8680007612001", 
        "time": "2009-03-02 14:51:00", 
        "title": "New symbol for america", 
        "userID": "R102"
    }, 
    {
        "content": "quote: Originally posted by R102: That's fine as long as we have stamped on the box \"introduced by the republican party and undergoing continued modifications by the democratic party.\" I wager that in the next presidential election we will not have a Democratic of Republican president. i most certainly have to agree with that...", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "Originally posted by R102: That's fine as long as we have stamped on the box \"introduced by the republican party and undergoing continued modifications by the democratic party.\" I wager that in the next presidential election we will not have a Democratic of Republican president.", 
        "reply": " i most certainly have to agree with that...", 
        "threadID": "409192893_8680007612001", 
        "time": "2009-03-02 14:52:00", 
        "title": "New symbol for america", 
        "userID": "blane"
    }, 
    {
        "content": "quote: Originally posted by blane: today the goverment announced that they were changing the national symbol to a CONDOM, the reason behind this change is that it more accurately reflects the goverments political stance. a condom allows for inflation, halts production, destroys the next generation, protects a bunch of *****s, and gives you a sense of security while your actually being screwed. it just doesn't get anyore accurate then that..lol COMMENT: That's such a disrespectful posting towards all Americans and our form of government. Disagree substantively with government policy, criticize politicians or cultural standards you dislike or oppose ... but that is so fundamentally base and cynical and adds nothing to genuine debate on extraordinarily difficult and momentous public issues facing all of us. I understand the intent is to be humorous, but that is just too low and negative in its reach.", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "Originally posted by blane: today the goverment announced that they were changing the national symbol to a CONDOM, the reason behind this change is that it more accurately reflects the goverments political stance. a condom allows for inflation, halts production, destroys the next generation, protects a bunch of *****s, and gives you a sense of security while your actually being screwed. it just doesn't get anyore accurate then that..lol", 
        "reply": " COMMENT: That's such a disrespectful posting towards all Americans and our form of government. Disagree substantively with government policy, criticize politicians or cultural standards you dislike or oppose ... but that is so fundamentally base and cynical and adds nothing to genuine debate on extraordinarily difficult and momentous public issues facing all of us. I understand the intent is to be humorous, but that is just too low and negative in its reach.", 
        "threadID": "409192893_8680007612001", 
        "time": "2009-03-02 15:18:00", 
        "title": "New symbol for america", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by R102: That's fine as long as we have stamped on the box \"introduced by the republican party and undergoing continued modifications by the democratic party.\" I wager that in the next presidential election we will not have a Democratic of Republican president. +++http://www.youtube.com/watch?v=_MGT_cSi7Rs", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "Originally posted by R102: That's fine as long as we have stamped on the box \"introduced by the republican party and undergoing continued modifications by the democratic party.\" I wager that in the next presidential election we will not have a Democratic of Republican president.", 
        "reply": " +++http://www.youtube.com/watch?v=_MGT_cSi7Rs", 
        "threadID": "409192893_8680007612001", 
        "time": "2009-03-02 16:07:00", 
        "title": "New symbol for america", 
        "userID": "threerings"
    }, 
    {
        "content": "This topic is closed.", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "", 
        "reply": "This topic is closed.", 
        "threadID": "409192893_8680007612001", 
        "time": "2009-03-02 16:56:00", 
        "title": "New symbol for america", 
        "userID": "gypsysnipe"
    }
]