[
    {
        "content": "I didn't say which President or when. \"http://www.nytimes.com/2009/03/03/us/politics/03legal.html?_r=2&hp A series of memos from our previous CinC have been released, clearly indicating his irreverence for our Constitution and the Bill of Rights. quote: \"Some of the positions had previously become known from statements of Bush administration officials in response to court challenges and Congressional inquiries. But taken together, the opinions disclosed Monday were the clearest illustration to date of the broad definition of presidential power approved by government lawyers in the months after the Sept. 11 attacks.\" Oh really? How much power did he want? quote: The use of the military envisioned in the Yoo-Delahunty reply appears to transcend by far the stationing of troops to keep watch at streets and airports, a familiar sight in the wake of the Sept. 11 attacks. The memorandum discussed the use of military forces to carry out “raids on terrorist cells” and even seize property. “The law has recognized that force (including deadly force) may be legitimately used in self-defense,” Mr. Yoo and Mr. Delahunty wrote to Mr. Gonzales. Therefore any objections based on the Fourth Amendment’s ban on unreasonable searches are swept away, they said, since any possible privacy offense resulting from such a search is a lesser matter than any injury from deadly force. The Oct. 23 memorandum also said that “First Amendment speech and press rights may also be subordinated to the overriding need to wage war successfully.” It added that “the current campaign against terrorism may require even broader exercises of federal power domestically.” Oh fun, there go two Amendments from the Bill of Rights. What else? quote: \"In another of the opinions, Mr. Yoo argued in a memorandum dated Sept. 25, 2001, that judicial precedents approving deadly force in self-defense could be extended to allow for eavesdropping without warrants. Still another memo, issued in March 2002, suggested that Congress lacked any power to limit a president’s authority to transfer detainees to other countries, a practice known as rendition that was widely used by Mr. Bush.\" Whoa, is this stuff Constitutional? quote: \"Mr. Dellinger said it was important that it was now widely recognized that the earlier assertions “that Congress had absolutely no role in these national security issues was contrary to constitutional text, historical practice and judicial precedent.” Huh, I guess not! Other related links regarding this topic: \"http://harpers.org/archive/2009/03/hbc-90004488 \"http://www.newsweek.com/id/187342", 
        "intTime": 20090303, 
        "postID": 1, 
        "quote": "\"Some of the positions had previously become known from statements of Bush administration officials in response to court challenges and Congressional inquiries. But taken together, the opinions disclosed Monday were the clearest illustration to date of the broad definition of presidential power approved by government lawyers in the months after the Sept. 11 attacks.\"", 
        "reply": "I didn't say which President or when. \"http://www.nytimes.com/2009/03/03/us/politics/03legal.html?_r=2&hp A series of memos from our previous CinC have been released, clearly indicating his irreverence for our Constitution and the Bill of Rights.  Oh really? How much power did he want? quote: The use of the military envisioned in the Yoo-Delahunty reply appears to transcend by far the stationing of troops to keep watch at streets and airports, a familiar sight in the wake of the Sept. 11 attacks. The memorandum discussed the use of military forces to carry out “raids on terrorist cells” and even seize property. “The law has recognized that force (including deadly force) may be legitimately used in self-defense,” Mr. Yoo and Mr. Delahunty wrote to Mr. Gonzales. Therefore any objections based on the Fourth Amendment’s ban on unreasonable searches are swept away, they said, since any possible privacy offense resulting from such a search is a lesser matter than any injury from deadly force. The Oct. 23 memorandum also said that “First Amendment speech and press rights may also be subordinated to the overriding need to wage war successfully.” It added that “the current campaign against terrorism may require even broader exercises of federal power domestically.” Oh fun, there go two Amendments from the Bill of Rights. What else? quote: \"In another of the opinions, Mr. Yoo argued in a memorandum dated Sept. 25, 2001, that judicial precedents approving deadly force in self-defense could be extended to allow for eavesdropping without warrants. Still another memo, issued in March 2002, suggested that Congress lacked any power to limit a president’s authority to transfer detainees to other countries, a practice known as rendition that was widely used by Mr. Bush.\" Whoa, is this stuff Constitutional? quote: \"Mr. Dellinger said it was important that it was now widely recognized that the earlier assertions “that Congress had absolutely no role in these national security issues was contrary to constitutional text, historical practice and judicial precedent.” Huh, I guess not! Other related links regarding this topic: \"http://harpers.org/archive/2009/03/hbc-90004488 \"http://www.newsweek.com/id/187342", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 14:02:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Good stuff.", 
        "intTime": 20090303, 
        "postID": 2, 
        "quote": "", 
        "reply": "Good stuff.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 14:15:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "threerings"
    }, 
    {
        "content": "I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President.", 
        "intTime": 20090303, 
        "postID": 3, 
        "quote": "", 
        "reply": "I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 14:28:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS...", 
        "intTime": 20090303, 
        "postID": 4, 
        "quote": "Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President.", 
        "reply": " Some people are still suffereing from a terminal case of BDS...", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:14:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton?", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS...", 
        "reply": " What do you call someone that keeps blaming everything on Carter and Clinton?", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:17:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime...", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton?", 
        "reply": " When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime...", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:31:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties.", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime...", 
        "reply": " All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:35:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties. Sorry... until I came on this forum, I'd never heard of Hannity and can honestly say I've never heard him speak. I haven't listen to a commentary by Rush in several years. I actually have a life (except what little of it I waste on here) and rarely listen to talk radio or the talking heads on the \"news\". I find their credibility lacking... but liberals continue to point every difference from their opinion as coming from a few... I guess that IB&P envy is contagious.", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties.", 
        "reply": " Sorry... until I came on this forum, I'd never heard of Hannity and can honestly say I've never heard him speak. I haven't listen to a commentary by Rush in several years. I actually have a life (except what little of it I waste on here) and rarely listen to talk radio or the talking heads on the \"news\". I find their credibility lacking... but liberals continue to point every difference from their opinion as coming from a few... I guess that IB&P envy is contagious.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:41:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties. Sorry... until I came on this forum, I'd never heard of Hannity and can honestly say I've never heard him speak. I haven't listen to a commentary by Rush in several years. I actually have a life (except what little of it I waste on here) and rarely listen to talk radio or the talking heads on the \"news\". I find their credibility lacking... but liberals continue to point every difference from their opinion as coming from a few... I guess that IB&P envy is contagious. They got their marching orders from Sleestack Carville, DeadEyes Rahm, PumpkinHead Begala and Snuffalopolus. Anytime someone has a problem with anything Liberal they are told to bring up Rush, Hannity blah blah blah. They cant take it on, on it's merits. This message has been edited. Last edited by: GunnyRet03, Wed 04 March 2009 08:17 AM", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties. Sorry... until I came on this forum, I'd never heard of Hannity and can honestly say I've never heard him speak. I haven't listen to a commentary by Rush in several years. I actually have a life (except what little of it I waste on here) and rarely listen to talk radio or the talking heads on the \"news\". I find their credibility lacking... but liberals continue to point every difference from their opinion as coming from a few... I guess that IB&P envy is contagious.", 
        "reply": " They got their marching orders from Sleestack Carville, DeadEyes Rahm, PumpkinHead Begala and Snuffalopolus. Anytime someone has a problem with anything Liberal they are told to bring up Rush, Hannity blah blah blah. They cant take it on, on it's merits. This message has been edited. Last edited by: GunnyRet03, Wed 04 March 2009 08:17 AM", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:58:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Personally, I'd think POTUS 44 was remiss in his duty to the country if he did not ... much as some people to this day believe POTUS 43 was remiss in not preempting Gov Blanco as soon as it became clear that she was incompetent during Katrina. Some here seem to forget that it was an active duty general ... and federal troops ... in conjunction with the Coast Guard and NG soldiers ... that brought order to chaos post-Katrina. Federal law, passed and supported by a Democratic Congress with broad bipartisan support would allow Obama to do what you suggest ... and rightly so in my opinion. Makes no difference to me whether the President at the time is Republican ... or Democrat.", 
        "intTime": 20090303, 
        "postID": 10, 
        "quote": "If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty?", 
        "reply": " Personally, I'd think POTUS 44 was remiss in his duty to the country if he did not ... much as some people to this day believe POTUS 43 was remiss in not preempting Gov Blanco as soon as it became clear that she was incompetent during Katrina. Some here seem to forget that it was an active duty general ... and federal troops ... in conjunction with the Coast Guard and NG soldiers ... that brought order to chaos post-Katrina. Federal law, passed and supported by a Democratic Congress with broad bipartisan support would allow Obama to do what you suggest ... and rightly so in my opinion. Makes no difference to me whether the President at the time is Republican ... or Democrat.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:59:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Here, read the memorandum yourself: http://www.usdoj.gov/opa/documents/olc-memos.htm If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic.", 
        "intTime": 20090303, 
        "postID": 11, 
        "quote": "", 
        "reply": "Here, read the memorandum yourself: http://www.usdoj.gov/opa/documents/olc-memos.htm If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 18:08:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "intTime": 20090304, 
        "postID": 12, 
        "quote": "Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers?", 
        "reply": " What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 06:27:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best. History shows that this president will continue the path that was inherited from the former president. I'm sure you'll find a way to justify the patriot act when its used by the current admin. When America realizes there is not a dimes difference between the two parties, then change will happen.", 
        "intTime": 20090304, 
        "postID": 13, 
        "quote": "Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "reply": " History shows that this president will continue the path that was inherited from the former president. I'm sure you'll find a way to justify the patriot act when its used by the current admin. When America realizes there is not a dimes difference between the two parties, then change will happen.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 06:38:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic. Did not see it happen. US citizens I think is a mis-representation. Rendition is not for US citizens here in the states. If a US citizen is found fighting with the enemy and they refuse their rights as a citizen then they should be treated like the enemy.", 
        "intTime": 20090304, 
        "postID": 14, 
        "quote": "If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic.", 
        "reply": " Did not see it happen. US citizens I think is a mis-representation. Rendition is not for US citizens here in the states. If a US citizen is found fighting with the enemy and they refuse their rights as a citizen then they should be treated like the enemy.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 06:56:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best. I apologize. I saw comments under each break in the document of your post and assumed they were yours.", 
        "intTime": 20090304, 
        "postID": 15, 
        "quote": "What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "reply": " I apologize. I saw comments under each break in the document of your post and assumed they were yours.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 06:58:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: What do you call someone that keeps blaming everything on Carter and Clinton? What does that have to do with the post and I was not aware that Pres Bush did. A tragedy arose, Pres Bush did what he felt was correct to protect Americans.", 
        "intTime": 20090304, 
        "postID": 16, 
        "quote": "What do you call someone that keeps blaming everything on Carter and Clinton?", 
        "reply": " What does that have to do with the post and I was not aware that Pres Bush did. A tragedy arose, Pres Bush did what he felt was correct to protect Americans.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:00:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. Come on...", 
        "intTime": 20090304, 
        "postID": 17, 
        "quote": "Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President.", 
        "reply": " LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. Come on...", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:10:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic. Did not see it happen. US citizens I think is a mis-representation. Rendition is not for US citizens here in the states. If a US citizen is found fighting with the enemy and they refuse their rights as a citizen then they should be treated like the enemy. What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events?", 
        "intTime": 20090304, 
        "postID": 18, 
        "quote": "Originally posted by ACR26: quote: If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic. Did not see it happen. US citizens I think is a mis-representation. Rendition is not for US citizens here in the states. If a US citizen is found fighting with the enemy and they refuse their rights as a citizen then they should be treated like the enemy.", 
        "reply": " What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events?", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:14:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best. What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. Lot of liars in this country...", 
        "intTime": 20090304, 
        "postID": 19, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "reply": " What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. Lot of liars in this country...", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:17:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: History shows that this president will continue the path that was inherited from the former president. I'm sure you'll find a way to justify the patriot act when its used by the current admin. Not a chance. I put the Constitution ahead of any partisan politics. I'm not a Democrat. I'm a registered Independent with Libertarian leanings. I see no rationale to justify any violations against the Constitution. And, in case you haven't noticed, I support 2nd Amendment rights, too. If I discover that our current administration makes statements to suggest that our Constitution and Bill of Rights are optional, then I will be just as furious as I was when our previous administration did it.", 
        "intTime": 20090304, 
        "postID": 20, 
        "quote": "Originally posted by soscorpio: History shows that this president will continue the path that was inherited from the former president. I'm sure you'll find a way to justify the patriot act when its used by the current admin.", 
        "reply": " Not a chance. I put the Constitution ahead of any partisan politics. I'm not a Democrat. I'm a registered Independent with Libertarian leanings. I see no rationale to justify any violations against the Constitution. And, in case you haven't noticed, I support 2nd Amendment rights, too. If I discover that our current administration makes statements to suggest that our Constitution and Bill of Rights are optional, then I will be just as furious as I was when our previous administration did it.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:18:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events? quote: LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. I guess my facts are from the thought process that we were not attacked again here in our country although that was the spoken intent of our enemy. I also was \"told\" by the media/white house/congress that other attacks were thwarted here and in our allies countries due to some of Pres Bush's policies", 
        "intTime": 20090304, 
        "postID": 21, 
        "quote": "What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events?", 
        "reply": " quote: LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. I guess my facts are from the thought process that we were not attacked again here in our country although that was the spoken intent of our enemy. I also was \"told\" by the media/white house/congress that other attacks were thwarted here and in our allies countries due to some of Pres Bush's policies", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:25:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events? quote: LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. I guess my facts are from the thought process that we were not attacked again here in our country although that was the spoken intent of our enemy. I also was \"told\" by the media/white house/congress that other attacks were thwarted here and in our allies countries due to some of Pres Bush's policies You were? Can you give us specifics?", 
        "intTime": 20090304, 
        "postID": 22, 
        "quote": "Originally posted by ACR26: quote: What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events? quote: LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. I guess my facts are from the thought process that we were not attacked again here in our country although that was the spoken intent of our enemy. I also was \"told\" by the media/white house/congress that other attacks were thwarted here and in our allies countries due to some of Pres Bush's policies", 
        "reply": " You were? Can you give us specifics?", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:27:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. So no matter what the costs to American lives the Presidents hands are tied? If these were constitutional changes made and were limitless in duration I would agree. If they were acted upon in a fascist manner I would agree. But I also believe in extraordinary times there are times that extra measurements need to be applied. If what President Bush did was illegal then we will be seeing this in the future in our courts. If he did this when no external threats were present in the form that they were then I would dis-agree. It is one thing to argue points when we are in relative safety. It is another thing though to look at this through hindsight when we were not attacked again. Why were we able to prevent attacks? Did any of this (topic of thread) have anything to do with it?", 
        "intTime": 20090304, 
        "postID": 23, 
        "quote": "What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK.", 
        "reply": " So no matter what the costs to American lives the Presidents hands are tied? If these were constitutional changes made and were limitless in duration I would agree. If they were acted upon in a fascist manner I would agree. But I also believe in extraordinary times there are times that extra measurements need to be applied. If what President Bush did was illegal then we will be seeing this in the future in our courts. If he did this when no external threats were present in the form that they were then I would dis-agree. It is one thing to argue points when we are in relative safety. It is another thing though to look at this through hindsight when we were not attacked again. Why were we able to prevent attacks? Did any of this (topic of thread) have anything to do with it?", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:33:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: You were? Can you give us specifics? Well lets see...no further attacks on our home front. I guess that is a specific. Other governments spoke of the same to include Britain. Do your own homework.", 
        "intTime": 20090304, 
        "postID": 24, 
        "quote": "You were? Can you give us specifics?", 
        "reply": " Well lets see...no further attacks on our home front. I guess that is a specific. Other governments spoke of the same to include Britain. Do your own homework.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:38:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. So no matter what the costs to American lives the Presidents hands are tied? If these were constitutional changes made and were limitless in duration I would agree. If they were acted upon in a fascist manner I would agree. But I also believe in extraordinary times there are times that extra measurements need to be applied. If what President Bush did was illegal then we will be seeing this in the future in our courts. If he did this when no external threats were present in the form that they were then I would dis-agree. It is one thing to argue points when we are in relative safety. It is another thing though to look at this through hindsight when we were not attacked again. Why were we able to prevent attacks? Did any of this (topic of thread) have anything to do with it? COMMENT: well, let's see ... Mr. Bush's Justice Dept. determined on 25 Sep 2001 that law enforcement did not need search warrants to conduct intelligence operations inside the U.S. because foreign intelligence constitutes \"national self defense.\" This was based on the rather interesting legal proposition that since U.S. courts had ruled that the use of \"deadly force\" in self defense is justifiable under the Fourth Amendment in that, \"if the government's heightened interest in self-defense justifies the use of deadly force, then it also must certainly justify warrantless searches.\" Not only is this convoluted legal application bereft of logic, it specifically contravened the FISA that forbid these exact same warrantless searches. If your personal desire is complete security and safety at all legal and civil costs, then simply endorse a complete autocratic government that will thoroughly \"protect\" you in \"assisting\" your comings and goings, sorting through your personal mail and your financial transactions, bank accounts, screening your personal contacts, business associates, and friends and family, etc. to ensure that no \"bad guys\" are using you to plan another attack, and perhaps even regular, unannounced official visits to your home and family to ensure that you haven't been \"brainwashed\" or have become an unknowing or unwilling dupe of the enemy in its attempts to undermine our safety again. Yes, the total level of protection that you desire is certainly possible.", 
        "intTime": 20090304, 
        "postID": 25, 
        "quote": "Originally posted by ACR26: quote: What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. So no matter what the costs to American lives the Presidents hands are tied? If these were constitutional changes made and were limitless in duration I would agree. If they were acted upon in a fascist manner I would agree. But I also believe in extraordinary times there are times that extra measurements need to be applied. If what President Bush did was illegal then we will be seeing this in the future in our courts. If he did this when no external threats were present in the form that they were then I would dis-agree. It is one thing to argue points when we are in relative safety. It is another thing though to look at this through hindsight when we were not attacked again. Why were we able to prevent attacks? Did any of this (topic of thread) have anything to do with it?", 
        "reply": " COMMENT: well, let's see ... Mr. Bush's Justice Dept. determined on 25 Sep 2001 that law enforcement did not need search warrants to conduct intelligence operations inside the U.S. because foreign intelligence constitutes \"national self defense.\" This was based on the rather interesting legal proposition that since U.S. courts had ruled that the use of \"deadly force\" in self defense is justifiable under the Fourth Amendment in that, \"if the government's heightened interest in self-defense justifies the use of deadly force, then it also must certainly justify warrantless searches.\" Not only is this convoluted legal application bereft of logic, it specifically contravened the FISA that forbid these exact same warrantless searches. If your personal desire is complete security and safety at all legal and civil costs, then simply endorse a complete autocratic government that will thoroughly \"protect\" you in \"assisting\" your comings and goings, sorting through your personal mail and your financial transactions, bank accounts, screening your personal contacts, business associates, and friends and family, etc. to ensure that no \"bad guys\" are using you to plan another attack, and perhaps even regular, unannounced official visits to your home and family to ensure that you haven't been \"brainwashed\" or have become an unknowing or unwilling dupe of the enemy in its attempts to undermine our safety again. Yes, the total level of protection that you desire is certainly possible.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 08:45:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Here, read the memorandum yourself: http://www.usdoj.gov/opa/documents/olc-memos.htm If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic. If you need to brag about it, you're probably lying.", 
        "intTime": 20090304, 
        "postID": 26, 
        "quote": "Originally posted by stillkit: Here, read the memorandum yourself: http://www.usdoj.gov/opa/documents/olc-memos.htm If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic.", 
        "reply": " If you need to brag about it, you're probably lying.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 08:54:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Fin_atic"
    }, 
    {
        "content": "quote: COMMENT: well, let's see ... Mr. Bush's Justice Dept. determined on 25 Sep 2001 that law enforcement did not need search warrants to conduct intelligence operations inside the U.S. because foreign intelligence constitutes \"national self defense.\" This was based on the rather interesting legal proposition that since U.S. courts had ruled that the use of \"deadly force\" in self defense is justifiable under the Fourth Amendment in that, \"if the government's heightened interest in self-defense justifies the use of deadly force, then it also must certainly justify warrantless searches.\" Not only is this convoluted legal application bereft of logic, it specifically contravened the FISA that forbid these exact same warrantless searches. If your personal desire is complete security and safety at all legal and civil costs, then simply endorse a complete autocratic government that will thoroughly \"protect\" you in \"assisting\" your comings and goings, sorting through your personal mail and your financial transactions, bank accounts, screening your personal contacts, business associates, and friends and family, etc. to ensure that no \"bad guys\" are using you to plan another attack, and perhaps even regular, unannounced official visits to your home and family to ensure that you haven't been \"brainwashed\" or have become an unknowing or unwilling dupe of the enemy in its attempts to undermine our safety again. Yes, the total level of protection that you desire is certainly possible. Well, your post acts like I want to be protected from the little ole lady down the street. Using the context of the purpose for the previous administrations thought process I still agree with his decisions and trusted his integrity. We were not threatened by the little old lady. We were not threatened by a tangible enemy ie a government. We were not threatened by an enemy who stands up and says \"here we are\". So I ask again...faced with UNKNOWN THREATS who had successfully attacked a US warship, military compounds, embassies of various countries, and the world trade centers twice...what should the President have done? In an unknown environment with the worst form of attack possible he did the proper thing. Using the comfort of no follow up attacks is an unfair judgment. Do not be mistaken that I take our constitution for granted. But I would expect if we are attacked again as in 9/11 the Standing President has a duty to do whatever it takes to stop those attacks. After the threat is minimized then the policy is abandoned. You are making it out that Pres Bush came up with all this on his own when factually he had Government lawyers and members of Congress involved.", 
        "intTime": 20090304, 
        "postID": 27, 
        "quote": "COMMENT: well, let's see ... Mr. Bush's Justice Dept. determined on 25 Sep 2001 that law enforcement did not need search warrants to conduct intelligence operations inside the U.S. because foreign intelligence constitutes \"national self defense.\" This was based on the rather interesting legal proposition that since U.S. courts had ruled that the use of \"deadly force\" in self defense is justifiable under the Fourth Amendment in that, \"if the government's heightened interest in self-defense justifies the use of deadly force, then it also must certainly justify warrantless searches.\" Not only is this convoluted legal application bereft of logic, it specifically contravened the FISA that forbid these exact same warrantless searches. If your personal desire is complete security and safety at all legal and civil costs, then simply endorse a complete autocratic government that will thoroughly \"protect\" you in \"assisting\" your comings and goings, sorting through your personal mail and your financial transactions, bank accounts, screening your personal contacts, business associates, and friends and family, etc. to ensure that no \"bad guys\" are using you to plan another attack, and perhaps even regular, unannounced official visits to your home and family to ensure that you haven't been \"brainwashed\" or have become an unknowing or unwilling dupe of the enemy in its attempts to undermine our safety again. Yes, the total level of protection that you desire is certainly possible.", 
        "reply": " Well, your post acts like I want to be protected from the little ole lady down the street. Using the context of the purpose for the previous administrations thought process I still agree with his decisions and trusted his integrity. We were not threatened by the little old lady. We were not threatened by a tangible enemy ie a government. We were not threatened by an enemy who stands up and says \"here we are\". So I ask again...faced with UNKNOWN THREATS who had successfully attacked a US warship, military compounds, embassies of various countries, and the world trade centers twice...what should the President have done? In an unknown environment with the worst form of attack possible he did the proper thing. Using the comfort of no follow up attacks is an unfair judgment. Do not be mistaken that I take our constitution for granted. But I would expect if we are attacked again as in 9/11 the Standing President has a duty to do whatever it takes to stop those attacks. After the threat is minimized then the policy is abandoned. You are making it out that Pres Bush came up with all this on his own when factually he had Government lawyers and members of Congress involved.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 09:19:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: You were? Can you give us specifics? Well lets see...no further attacks on our home front. I guess that is a specific. Other governments spoke of the same to include Britain. Do your own homework. LOL In order to make that tired old phrase valid, one would have to first prove that there were no-kidding attacks coming down the pike. I don't think that's possible for you to do, is it? I know a lot more about transnational terrorism than you assume I do. I don't have to rely on statements by politicians and pundits, as you obviously do from the statement you made. You have absolutely no idea how difficult it is for transnationals to pull off what they did in 2001. It's always been that way, and for a lot of different reasons. There were a lot of people asleep at the switch, and because we never got a proper accounting of why it happened, we still have a barrier to overcome to greater ensure our safety from terrorist attacks, which are, by the way, statistically less likely than lightning strikes.", 
        "intTime": 20090304, 
        "postID": 28, 
        "quote": "Originally posted by ACR26: quote: You were? Can you give us specifics? Well lets see...no further attacks on our home front. I guess that is a specific. Other governments spoke of the same to include Britain. Do your own homework.", 
        "reply": " LOL In order to make that tired old phrase valid, one would have to first prove that there were no-kidding attacks coming down the pike. I don't think that's possible for you to do, is it? I know a lot more about transnational terrorism than you assume I do. I don't have to rely on statements by politicians and pundits, as you obviously do from the statement you made. You have absolutely no idea how difficult it is for transnationals to pull off what they did in 2001. It's always been that way, and for a lot of different reasons. There were a lot of people asleep at the switch, and because we never got a proper accounting of why it happened, we still have a barrier to overcome to greater ensure our safety from terrorist attacks, which are, by the way, statistically less likely than lightning strikes.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 09:33:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I think the specifics of stopping attacks on American soil could be the attacks that have been carried out against other nations during the same time period. Of course, BDS symptoms include the denial of the possibility of attacks just because they cannot admit the President Bush's policies may have stoppped them from happening.", 
        "intTime": 20090304, 
        "postID": 29, 
        "quote": "", 
        "reply": "I think the specifics of stopping attacks on American soil could be the attacks that have been carried out against other nations during the same time period. Of course, BDS symptoms include the denial of the possibility of attacks just because they cannot admit the President Bush's policies may have stoppped them from happening.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 09:48:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: LOL In order to make that tired old phrase valid, one would have to first prove that there were no-kidding attacks coming down the pike. I don't think that's possible for you to do, is it? I know a lot more about transnational terrorism than you assume I do. I don't have to rely on statements by politicians and pundits, as you obviously do from the statement you made. You have absolutely no idea how difficult it is for transnationals to pull off what they did in 2001. It's always been that way, and for a lot of different reasons. There were a lot of people asleep at the switch, and because we never got a proper accounting of why it happened, we still have a barrier to overcome to greater ensure our safety from terrorist attacks, which are, by the way, statistically less likely than lightning strikes. Turn your argument around. So what I am to assume is that we can go back to 9/10 mentality and everything will be hunky dory. Or that it was sheer luck that they happened to get through. No way were they planning this stuff for years. I will concede...I was not present during the CIA briefs. I did not get my hands on classified material. All of my information was gathered by reading books written by those who may have trumped up the story. All the white house/military statements I have read brought to me by the \"media\" are to be taken as a false premise first. All the videos I have watched of radical Muslims were doctored to make them look like bad guys. I did watch the video time and again of the twin towers fall done by a handful of lucky few…", 
        "intTime": 20090304, 
        "postID": 30, 
        "quote": "LOL In order to make that tired old phrase valid, one would have to first prove that there were no-kidding attacks coming down the pike. I don't think that's possible for you to do, is it? I know a lot more about transnational terrorism than you assume I do. I don't have to rely on statements by politicians and pundits, as you obviously do from the statement you made. You have absolutely no idea how difficult it is for transnationals to pull off what they did in 2001. It's always been that way, and for a lot of different reasons. There were a lot of people asleep at the switch, and because we never got a proper accounting of why it happened, we still have a barrier to overcome to greater ensure our safety from terrorist attacks, which are, by the way, statistically less likely than lightning strikes.", 
        "reply": " Turn your argument around. So what I am to assume is that we can go back to 9/10 mentality and everything will be hunky dory. Or that it was sheer luck that they happened to get through. No way were they planning this stuff for years. I will concede...I was not present during the CIA briefs. I did not get my hands on classified material. All of my information was gathered by reading books written by those who may have trumped up the story. All the white house/military statements I have read brought to me by the \"media\" are to be taken as a false premise first. All the videos I have watched of radical Muslims were doctored to make them look like bad guys. I did watch the video time and again of the twin towers fall done by a handful of lucky few…", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 11:12:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "I didn't say which President or when. \"http://www.nytimes.com/2009/03/03/us/politics/03legal.html?_r=2&hp A series of memos from our previous CinC have been released, clearly indicating his irreverence for our Constitution and the Bill of Rights. quote: \"Some of the positions had previously become known from statements of Bush administration officials in response to court challenges and Congressional inquiries. But taken together, the opinions disclosed Monday were the clearest illustration to date of the broad definition of presidential power approved by government lawyers in the months after the Sept. 11 attacks.\" Oh really? How much power did he want? quote: The use of the military envisioned in the Yoo-Delahunty reply appears to transcend by far the stationing of troops to keep watch at streets and airports, a familiar sight in the wake of the Sept. 11 attacks. The memorandum discussed the use of military forces to carry out “raids on terrorist cells” and even seize property. “The law has recognized that force (including deadly force) may be legitimately used in self-defense,” Mr. Yoo and Mr. Delahunty wrote to Mr. Gonzales. Therefore any objections based on the Fourth Amendment’s ban on unreasonable searches are swept away, they said, since any possible privacy offense resulting from such a search is a lesser matter than any injury from deadly force. The Oct. 23 memorandum also said that “First Amendment speech and press rights may also be subordinated to the overriding need to wage war successfully.” It added that “the current campaign against terrorism may require even broader exercises of federal power domestically.” Oh fun, there go two Amendments from the Bill of Rights. What else? quote: \"In another of the opinions, Mr. Yoo argued in a memorandum dated Sept. 25, 2001, that judicial precedents approving deadly force in self-defense could be extended to allow for eavesdropping without warrants. Still another memo, issued in March 2002, suggested that Congress lacked any power to limit a president’s authority to transfer detainees to other countries, a practice known as rendition that was widely used by Mr. Bush.\" Whoa, is this stuff Constitutional? quote: \"Mr. Dellinger said it was important that it was now widely recognized that the earlier assertions “that Congress had absolutely no role in these national security issues was contrary to constitutional text, historical practice and judicial precedent.” Huh, I guess not! Other related links regarding this topic: \"http://harpers.org/archive/2009/03/hbc-90004488 \"http://www.newsweek.com/id/187342", 
        "intTime": 20090303, 
        "postID": 31, 
        "quote": "\"Some of the positions had previously become known from statements of Bush administration officials in response to court challenges and Congressional inquiries. But taken together, the opinions disclosed Monday were the clearest illustration to date of the broad definition of presidential power approved by government lawyers in the months after the Sept. 11 attacks.\"", 
        "reply": "I didn't say which President or when. \"http://www.nytimes.com/2009/03/03/us/politics/03legal.html?_r=2&hp A series of memos from our previous CinC have been released, clearly indicating his irreverence for our Constitution and the Bill of Rights.  Oh really? How much power did he want? quote: The use of the military envisioned in the Yoo-Delahunty reply appears to transcend by far the stationing of troops to keep watch at streets and airports, a familiar sight in the wake of the Sept. 11 attacks. The memorandum discussed the use of military forces to carry out “raids on terrorist cells” and even seize property. “The law has recognized that force (including deadly force) may be legitimately used in self-defense,” Mr. Yoo and Mr. Delahunty wrote to Mr. Gonzales. Therefore any objections based on the Fourth Amendment’s ban on unreasonable searches are swept away, they said, since any possible privacy offense resulting from such a search is a lesser matter than any injury from deadly force. The Oct. 23 memorandum also said that “First Amendment speech and press rights may also be subordinated to the overriding need to wage war successfully.” It added that “the current campaign against terrorism may require even broader exercises of federal power domestically.” Oh fun, there go two Amendments from the Bill of Rights. What else? quote: \"In another of the opinions, Mr. Yoo argued in a memorandum dated Sept. 25, 2001, that judicial precedents approving deadly force in self-defense could be extended to allow for eavesdropping without warrants. Still another memo, issued in March 2002, suggested that Congress lacked any power to limit a president’s authority to transfer detainees to other countries, a practice known as rendition that was widely used by Mr. Bush.\" Whoa, is this stuff Constitutional? quote: \"Mr. Dellinger said it was important that it was now widely recognized that the earlier assertions “that Congress had absolutely no role in these national security issues was contrary to constitutional text, historical practice and judicial precedent.” Huh, I guess not! Other related links regarding this topic: \"http://harpers.org/archive/2009/03/hbc-90004488 \"http://www.newsweek.com/id/187342", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 14:02:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Good stuff.", 
        "intTime": 20090303, 
        "postID": 32, 
        "quote": "", 
        "reply": "Good stuff.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 14:15:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "threerings"
    }, 
    {
        "content": "I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President.", 
        "intTime": 20090303, 
        "postID": 33, 
        "quote": "", 
        "reply": "I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 14:28:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS...", 
        "intTime": 20090303, 
        "postID": 34, 
        "quote": "Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President.", 
        "reply": " Some people are still suffereing from a terminal case of BDS...", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:14:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton?", 
        "intTime": 20090303, 
        "postID": 35, 
        "quote": "Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS...", 
        "reply": " What do you call someone that keeps blaming everything on Carter and Clinton?", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:17:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime...", 
        "intTime": 20090303, 
        "postID": 36, 
        "quote": "Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton?", 
        "reply": " When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime...", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:31:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties.", 
        "intTime": 20090303, 
        "postID": 37, 
        "quote": "Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime...", 
        "reply": " All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:35:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties. Sorry... until I came on this forum, I'd never heard of Hannity and can honestly say I've never heard him speak. I haven't listen to a commentary by Rush in several years. I actually have a life (except what little of it I waste on here) and rarely listen to talk radio or the talking heads on the \"news\". I find their credibility lacking... but liberals continue to point every difference from their opinion as coming from a few... I guess that IB&P envy is contagious.", 
        "intTime": 20090303, 
        "postID": 38, 
        "quote": "Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties.", 
        "reply": " Sorry... until I came on this forum, I'd never heard of Hannity and can honestly say I've never heard him speak. I haven't listen to a commentary by Rush in several years. I actually have a life (except what little of it I waste on here) and rarely listen to talk radio or the talking heads on the \"news\". I find their credibility lacking... but liberals continue to point every difference from their opinion as coming from a few... I guess that IB&P envy is contagious.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:41:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties. Sorry... until I came on this forum, I'd never heard of Hannity and can honestly say I've never heard him speak. I haven't listen to a commentary by Rush in several years. I actually have a life (except what little of it I waste on here) and rarely listen to talk radio or the talking heads on the \"news\". I find their credibility lacking... but liberals continue to point every difference from their opinion as coming from a few... I guess that IB&P envy is contagious. They got their marching orders from Sleestack Carville, DeadEyes Rahm, PumpkinHead Begala and Snuffalopolus. Anytime someone has a problem with anything Liberal they are told to bring up Rush, Hannity blah blah blah. They cant take it on, on it's merits. This message has been edited. Last edited by: GunnyRet03, Wed 04 March 2009 08:17 AM", 
        "intTime": 20090303, 
        "postID": 39, 
        "quote": "Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by esample1: quote: Originally posted by Mom2APAJ: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. Some people are still suffereing from a terminal case of BDS... What do you call someone that keeps blaming everything on Carter and Clinton? When it comes to the liberal lending laws, or slashing the military, just telling the truth... try it sometime... All i've ever seen you post is your opinion. I suspect you get all your talking points from Hannity and Rush, just like 90% of the other righties. Sorry... until I came on this forum, I'd never heard of Hannity and can honestly say I've never heard him speak. I haven't listen to a commentary by Rush in several years. I actually have a life (except what little of it I waste on here) and rarely listen to talk radio or the talking heads on the \"news\". I find their credibility lacking... but liberals continue to point every difference from their opinion as coming from a few... I guess that IB&P envy is contagious.", 
        "reply": " They got their marching orders from Sleestack Carville, DeadEyes Rahm, PumpkinHead Begala and Snuffalopolus. Anytime someone has a problem with anything Liberal they are told to bring up Rush, Hannity blah blah blah. They cant take it on, on it's merits. This message has been edited. Last edited by: GunnyRet03, Wed 04 March 2009 08:17 AM", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:58:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Personally, I'd think POTUS 44 was remiss in his duty to the country if he did not ... much as some people to this day believe POTUS 43 was remiss in not preempting Gov Blanco as soon as it became clear that she was incompetent during Katrina. Some here seem to forget that it was an active duty general ... and federal troops ... in conjunction with the Coast Guard and NG soldiers ... that brought order to chaos post-Katrina. Federal law, passed and supported by a Democratic Congress with broad bipartisan support would allow Obama to do what you suggest ... and rightly so in my opinion. Makes no difference to me whether the President at the time is Republican ... or Democrat.", 
        "intTime": 20090303, 
        "postID": 40, 
        "quote": "If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty?", 
        "reply": " Personally, I'd think POTUS 44 was remiss in his duty to the country if he did not ... much as some people to this day believe POTUS 43 was remiss in not preempting Gov Blanco as soon as it became clear that she was incompetent during Katrina. Some here seem to forget that it was an active duty general ... and federal troops ... in conjunction with the Coast Guard and NG soldiers ... that brought order to chaos post-Katrina. Federal law, passed and supported by a Democratic Congress with broad bipartisan support would allow Obama to do what you suggest ... and rightly so in my opinion. Makes no difference to me whether the President at the time is Republican ... or Democrat.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 16:59:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Here, read the memorandum yourself: http://www.usdoj.gov/opa/documents/olc-memos.htm If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic.", 
        "intTime": 20090303, 
        "postID": 41, 
        "quote": "", 
        "reply": "Here, read the memorandum yourself: http://www.usdoj.gov/opa/documents/olc-memos.htm If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-03 18:08:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "intTime": 20090304, 
        "postID": 42, 
        "quote": "Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers?", 
        "reply": " What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 06:27:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best. History shows that this president will continue the path that was inherited from the former president. I'm sure you'll find a way to justify the patriot act when its used by the current admin. When America realizes there is not a dimes difference between the two parties, then change will happen.", 
        "intTime": 20090304, 
        "postID": 43, 
        "quote": "Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "reply": " History shows that this president will continue the path that was inherited from the former president. I'm sure you'll find a way to justify the patriot act when its used by the current admin. When America realizes there is not a dimes difference between the two parties, then change will happen.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 06:38:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic. Did not see it happen. US citizens I think is a mis-representation. Rendition is not for US citizens here in the states. If a US citizen is found fighting with the enemy and they refuse their rights as a citizen then they should be treated like the enemy.", 
        "intTime": 20090304, 
        "postID": 44, 
        "quote": "If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic.", 
        "reply": " Did not see it happen. US citizens I think is a mis-representation. Rendition is not for US citizens here in the states. If a US citizen is found fighting with the enemy and they refuse their rights as a citizen then they should be treated like the enemy.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 06:56:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best. I apologize. I saw comments under each break in the document of your post and assumed they were yours.", 
        "intTime": 20090304, 
        "postID": 45, 
        "quote": "What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "reply": " I apologize. I saw comments under each break in the document of your post and assumed they were yours.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 06:58:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: What do you call someone that keeps blaming everything on Carter and Clinton? What does that have to do with the post and I was not aware that Pres Bush did. A tragedy arose, Pres Bush did what he felt was correct to protect Americans.", 
        "intTime": 20090304, 
        "postID": 46, 
        "quote": "What do you call someone that keeps blaming everything on Carter and Clinton?", 
        "reply": " What does that have to do with the post and I was not aware that Pres Bush did. A tragedy arose, Pres Bush did what he felt was correct to protect Americans.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:00:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President. LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. Come on...", 
        "intTime": 20090304, 
        "postID": 47, 
        "quote": "Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? No matter what the spin, the warrant-less taps were on known terrorist locations and attacks were thwarted. Rendition was not designed by Pres Bush...it as there before him. This is all a big what if. What if on 9/12 another attack occurred? Then another and another? To protect American lives from unknown threats the President has a duty and obligation to protect Americans at home. If a dirty or bio bomb is exploded in the states...do you think Pres Obama would hesitate to activate any military organization that can contain and assist in saving lives because of their specialty? Nope...concerning our safety Pres Bush did a stand up job. It has been said that Pres Lincoln did un-constitutional things...thankfully he did what he felt was right as President.", 
        "reply": " LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. Come on...", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:10:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic. Did not see it happen. US citizens I think is a mis-representation. Rendition is not for US citizens here in the states. If a US citizen is found fighting with the enemy and they refuse their rights as a citizen then they should be treated like the enemy. What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events?", 
        "intTime": 20090304, 
        "postID": 48, 
        "quote": "Originally posted by ACR26: quote: If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic. Did not see it happen. US citizens I think is a mis-representation. Rendition is not for US citizens here in the states. If a US citizen is found fighting with the enemy and they refuse their rights as a citizen then they should be treated like the enemy.", 
        "reply": " What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events?", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:14:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best. What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. Lot of liars in this country...", 
        "intTime": 20090304, 
        "postID": 49, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by ACR26: I disagree to the trampling of the constitution. Did he enact all these powers? What is the title of this thread? \"The President's INTENT to trample our Constitutional Rights.\" Not once did I say that he enacted all of his intents. However, some of these were enacted, at least in part, and the Constitutionality of many portions of the painfully misnamed \"Patriot Act\" is questionable at best.", 
        "reply": " What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. Lot of liars in this country...", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:17:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: History shows that this president will continue the path that was inherited from the former president. I'm sure you'll find a way to justify the patriot act when its used by the current admin. Not a chance. I put the Constitution ahead of any partisan politics. I'm not a Democrat. I'm a registered Independent with Libertarian leanings. I see no rationale to justify any violations against the Constitution. And, in case you haven't noticed, I support 2nd Amendment rights, too. If I discover that our current administration makes statements to suggest that our Constitution and Bill of Rights are optional, then I will be just as furious as I was when our previous administration did it.", 
        "intTime": 20090304, 
        "postID": 50, 
        "quote": "Originally posted by soscorpio: History shows that this president will continue the path that was inherited from the former president. I'm sure you'll find a way to justify the patriot act when its used by the current admin.", 
        "reply": " Not a chance. I put the Constitution ahead of any partisan politics. I'm not a Democrat. I'm a registered Independent with Libertarian leanings. I see no rationale to justify any violations against the Constitution. And, in case you haven't noticed, I support 2nd Amendment rights, too. If I discover that our current administration makes statements to suggest that our Constitution and Bill of Rights are optional, then I will be just as furious as I was when our previous administration did it.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:18:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events? quote: LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. I guess my facts are from the thought process that we were not attacked again here in our country although that was the spoken intent of our enemy. I also was \"told\" by the media/white house/congress that other attacks were thwarted here and in our allies countries due to some of Pres Bush's policies", 
        "intTime": 20090304, 
        "postID": 51, 
        "quote": "What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events?", 
        "reply": " quote: LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. I guess my facts are from the thought process that we were not attacked again here in our country although that was the spoken intent of our enemy. I also was \"told\" by the media/white house/congress that other attacks were thwarted here and in our allies countries due to some of Pres Bush's policies", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:25:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events? quote: LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. I guess my facts are from the thought process that we were not attacked again here in our country although that was the spoken intent of our enemy. I also was \"told\" by the media/white house/congress that other attacks were thwarted here and in our allies countries due to some of Pres Bush's policies You were? Can you give us specifics?", 
        "intTime": 20090304, 
        "postID": 52, 
        "quote": "Originally posted by ACR26: quote: What if he isn't? Is unrealistic or unreasonable for an American citizen to expect that their Constitutional rights aren't going to be abridged on someone's ham-fisted, ideologically driven interpretation of events? quote: LOL How do you any of that if you had no access to the facts? Because they told you so? And virtually everything you spoke of were hypotheticals. We can operate \"what if\" all the livelong day. I guess my facts are from the thought process that we were not attacked again here in our country although that was the spoken intent of our enemy. I also was \"told\" by the media/white house/congress that other attacks were thwarted here and in our allies countries due to some of Pres Bush's policies", 
        "reply": " You were? Can you give us specifics?", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:27:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. So no matter what the costs to American lives the Presidents hands are tied? If these were constitutional changes made and were limitless in duration I would agree. If they were acted upon in a fascist manner I would agree. But I also believe in extraordinary times there are times that extra measurements need to be applied. If what President Bush did was illegal then we will be seeing this in the future in our courts. If he did this when no external threats were present in the form that they were then I would dis-agree. It is one thing to argue points when we are in relative safety. It is another thing though to look at this through hindsight when we were not attacked again. Why were we able to prevent attacks? Did any of this (topic of thread) have anything to do with it?", 
        "intTime": 20090304, 
        "postID": 53, 
        "quote": "What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK.", 
        "reply": " So no matter what the costs to American lives the Presidents hands are tied? If these were constitutional changes made and were limitless in duration I would agree. If they were acted upon in a fascist manner I would agree. But I also believe in extraordinary times there are times that extra measurements need to be applied. If what President Bush did was illegal then we will be seeing this in the future in our courts. If he did this when no external threats were present in the form that they were then I would dis-agree. It is one thing to argue points when we are in relative safety. It is another thing though to look at this through hindsight when we were not attacked again. Why were we able to prevent attacks? Did any of this (topic of thread) have anything to do with it?", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:33:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: You were? Can you give us specifics? Well lets see...no further attacks on our home front. I guess that is a specific. Other governments spoke of the same to include Britain. Do your own homework.", 
        "intTime": 20090304, 
        "postID": 54, 
        "quote": "You were? Can you give us specifics?", 
        "reply": " Well lets see...no further attacks on our home front. I guess that is a specific. Other governments spoke of the same to include Britain. Do your own homework.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 07:38:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. So no matter what the costs to American lives the Presidents hands are tied? If these were constitutional changes made and were limitless in duration I would agree. If they were acted upon in a fascist manner I would agree. But I also believe in extraordinary times there are times that extra measurements need to be applied. If what President Bush did was illegal then we will be seeing this in the future in our courts. If he did this when no external threats were present in the form that they were then I would dis-agree. It is one thing to argue points when we are in relative safety. It is another thing though to look at this through hindsight when we were not attacked again. Why were we able to prevent attacks? Did any of this (topic of thread) have anything to do with it? COMMENT: well, let's see ... Mr. Bush's Justice Dept. determined on 25 Sep 2001 that law enforcement did not need search warrants to conduct intelligence operations inside the U.S. because foreign intelligence constitutes \"national self defense.\" This was based on the rather interesting legal proposition that since U.S. courts had ruled that the use of \"deadly force\" in self defense is justifiable under the Fourth Amendment in that, \"if the government's heightened interest in self-defense justifies the use of deadly force, then it also must certainly justify warrantless searches.\" Not only is this convoluted legal application bereft of logic, it specifically contravened the FISA that forbid these exact same warrantless searches. If your personal desire is complete security and safety at all legal and civil costs, then simply endorse a complete autocratic government that will thoroughly \"protect\" you in \"assisting\" your comings and goings, sorting through your personal mail and your financial transactions, bank accounts, screening your personal contacts, business associates, and friends and family, etc. to ensure that no \"bad guys\" are using you to plan another attack, and perhaps even regular, unannounced official visits to your home and family to ensure that you haven't been \"brainwashed\" or have become an unknowing or unwilling dupe of the enemy in its attempts to undermine our safety again. Yes, the total level of protection that you desire is certainly possible.", 
        "intTime": 20090304, 
        "postID": 55, 
        "quote": "Originally posted by ACR26: quote: What amuses me that so-called patriotic Americans, especially those who swore an oath to defend and preserve the Constitution, thought all this crap was OK. So no matter what the costs to American lives the Presidents hands are tied? If these were constitutional changes made and were limitless in duration I would agree. If they were acted upon in a fascist manner I would agree. But I also believe in extraordinary times there are times that extra measurements need to be applied. If what President Bush did was illegal then we will be seeing this in the future in our courts. If he did this when no external threats were present in the form that they were then I would dis-agree. It is one thing to argue points when we are in relative safety. It is another thing though to look at this through hindsight when we were not attacked again. Why were we able to prevent attacks? Did any of this (topic of thread) have anything to do with it?", 
        "reply": " COMMENT: well, let's see ... Mr. Bush's Justice Dept. determined on 25 Sep 2001 that law enforcement did not need search warrants to conduct intelligence operations inside the U.S. because foreign intelligence constitutes \"national self defense.\" This was based on the rather interesting legal proposition that since U.S. courts had ruled that the use of \"deadly force\" in self defense is justifiable under the Fourth Amendment in that, \"if the government's heightened interest in self-defense justifies the use of deadly force, then it also must certainly justify warrantless searches.\" Not only is this convoluted legal application bereft of logic, it specifically contravened the FISA that forbid these exact same warrantless searches. If your personal desire is complete security and safety at all legal and civil costs, then simply endorse a complete autocratic government that will thoroughly \"protect\" you in \"assisting\" your comings and goings, sorting through your personal mail and your financial transactions, bank accounts, screening your personal contacts, business associates, and friends and family, etc. to ensure that no \"bad guys\" are using you to plan another attack, and perhaps even regular, unannounced official visits to your home and family to ensure that you haven't been \"brainwashed\" or have become an unknowing or unwilling dupe of the enemy in its attempts to undermine our safety again. Yes, the total level of protection that you desire is certainly possible.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 08:45:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Here, read the memorandum yourself: http://www.usdoj.gov/opa/documents/olc-memos.htm If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic. If you need to brag about it, you're probably lying.", 
        "intTime": 20090304, 
        "postID": 56, 
        "quote": "Originally posted by stillkit: Here, read the memorandum yourself: http://www.usdoj.gov/opa/documents/olc-memos.htm If you really don't have a problem with the President being able to detain, interrogate, torture and ship US citizens off to whatever foriegn government his likes, without any checks and balances by either the courts or the Congress, and if you really think he should have the authority to order military strikes within the United States without answering to anyone....then I pity our Republic.", 
        "reply": " If you need to brag about it, you're probably lying.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 08:54:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "Fin_atic"
    }, 
    {
        "content": "quote: COMMENT: well, let's see ... Mr. Bush's Justice Dept. determined on 25 Sep 2001 that law enforcement did not need search warrants to conduct intelligence operations inside the U.S. because foreign intelligence constitutes \"national self defense.\" This was based on the rather interesting legal proposition that since U.S. courts had ruled that the use of \"deadly force\" in self defense is justifiable under the Fourth Amendment in that, \"if the government's heightened interest in self-defense justifies the use of deadly force, then it also must certainly justify warrantless searches.\" Not only is this convoluted legal application bereft of logic, it specifically contravened the FISA that forbid these exact same warrantless searches. If your personal desire is complete security and safety at all legal and civil costs, then simply endorse a complete autocratic government that will thoroughly \"protect\" you in \"assisting\" your comings and goings, sorting through your personal mail and your financial transactions, bank accounts, screening your personal contacts, business associates, and friends and family, etc. to ensure that no \"bad guys\" are using you to plan another attack, and perhaps even regular, unannounced official visits to your home and family to ensure that you haven't been \"brainwashed\" or have become an unknowing or unwilling dupe of the enemy in its attempts to undermine our safety again. Yes, the total level of protection that you desire is certainly possible. Well, your post acts like I want to be protected from the little ole lady down the street. Using the context of the purpose for the previous administrations thought process I still agree with his decisions and trusted his integrity. We were not threatened by the little old lady. We were not threatened by a tangible enemy ie a government. We were not threatened by an enemy who stands up and says \"here we are\". So I ask again...faced with UNKNOWN THREATS who had successfully attacked a US warship, military compounds, embassies of various countries, and the world trade centers twice...what should the President have done? In an unknown environment with the worst form of attack possible he did the proper thing. Using the comfort of no follow up attacks is an unfair judgment. Do not be mistaken that I take our constitution for granted. But I would expect if we are attacked again as in 9/11 the Standing President has a duty to do whatever it takes to stop those attacks. After the threat is minimized then the policy is abandoned. You are making it out that Pres Bush came up with all this on his own when factually he had Government lawyers and members of Congress involved.", 
        "intTime": 20090304, 
        "postID": 57, 
        "quote": "COMMENT: well, let's see ... Mr. Bush's Justice Dept. determined on 25 Sep 2001 that law enforcement did not need search warrants to conduct intelligence operations inside the U.S. because foreign intelligence constitutes \"national self defense.\" This was based on the rather interesting legal proposition that since U.S. courts had ruled that the use of \"deadly force\" in self defense is justifiable under the Fourth Amendment in that, \"if the government's heightened interest in self-defense justifies the use of deadly force, then it also must certainly justify warrantless searches.\" Not only is this convoluted legal application bereft of logic, it specifically contravened the FISA that forbid these exact same warrantless searches. If your personal desire is complete security and safety at all legal and civil costs, then simply endorse a complete autocratic government that will thoroughly \"protect\" you in \"assisting\" your comings and goings, sorting through your personal mail and your financial transactions, bank accounts, screening your personal contacts, business associates, and friends and family, etc. to ensure that no \"bad guys\" are using you to plan another attack, and perhaps even regular, unannounced official visits to your home and family to ensure that you haven't been \"brainwashed\" or have become an unknowing or unwilling dupe of the enemy in its attempts to undermine our safety again. Yes, the total level of protection that you desire is certainly possible.", 
        "reply": " Well, your post acts like I want to be protected from the little ole lady down the street. Using the context of the purpose for the previous administrations thought process I still agree with his decisions and trusted his integrity. We were not threatened by the little old lady. We were not threatened by a tangible enemy ie a government. We were not threatened by an enemy who stands up and says \"here we are\". So I ask again...faced with UNKNOWN THREATS who had successfully attacked a US warship, military compounds, embassies of various countries, and the world trade centers twice...what should the President have done? In an unknown environment with the worst form of attack possible he did the proper thing. Using the comfort of no follow up attacks is an unfair judgment. Do not be mistaken that I take our constitution for granted. But I would expect if we are attacked again as in 9/11 the Standing President has a duty to do whatever it takes to stop those attacks. After the threat is minimized then the policy is abandoned. You are making it out that Pres Bush came up with all this on his own when factually he had Government lawyers and members of Congress involved.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 09:19:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: You were? Can you give us specifics? Well lets see...no further attacks on our home front. I guess that is a specific. Other governments spoke of the same to include Britain. Do your own homework. LOL In order to make that tired old phrase valid, one would have to first prove that there were no-kidding attacks coming down the pike. I don't think that's possible for you to do, is it? I know a lot more about transnational terrorism than you assume I do. I don't have to rely on statements by politicians and pundits, as you obviously do from the statement you made. You have absolutely no idea how difficult it is for transnationals to pull off what they did in 2001. It's always been that way, and for a lot of different reasons. There were a lot of people asleep at the switch, and because we never got a proper accounting of why it happened, we still have a barrier to overcome to greater ensure our safety from terrorist attacks, which are, by the way, statistically less likely than lightning strikes.", 
        "intTime": 20090304, 
        "postID": 58, 
        "quote": "Originally posted by ACR26: quote: You were? Can you give us specifics? Well lets see...no further attacks on our home front. I guess that is a specific. Other governments spoke of the same to include Britain. Do your own homework.", 
        "reply": " LOL In order to make that tired old phrase valid, one would have to first prove that there were no-kidding attacks coming down the pike. I don't think that's possible for you to do, is it? I know a lot more about transnational terrorism than you assume I do. I don't have to rely on statements by politicians and pundits, as you obviously do from the statement you made. You have absolutely no idea how difficult it is for transnationals to pull off what they did in 2001. It's always been that way, and for a lot of different reasons. There were a lot of people asleep at the switch, and because we never got a proper accounting of why it happened, we still have a barrier to overcome to greater ensure our safety from terrorist attacks, which are, by the way, statistically less likely than lightning strikes.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 09:33:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I think the specifics of stopping attacks on American soil could be the attacks that have been carried out against other nations during the same time period. Of course, BDS symptoms include the denial of the possibility of attacks just because they cannot admit the President Bush's policies may have stoppped them from happening.", 
        "intTime": 20090304, 
        "postID": 59, 
        "quote": "", 
        "reply": "I think the specifics of stopping attacks on American soil could be the attacks that have been carried out against other nations during the same time period. Of course, BDS symptoms include the denial of the possibility of attacks just because they cannot admit the President Bush's policies may have stoppped them from happening.", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 09:48:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: LOL In order to make that tired old phrase valid, one would have to first prove that there were no-kidding attacks coming down the pike. I don't think that's possible for you to do, is it? I know a lot more about transnational terrorism than you assume I do. I don't have to rely on statements by politicians and pundits, as you obviously do from the statement you made. You have absolutely no idea how difficult it is for transnationals to pull off what they did in 2001. It's always been that way, and for a lot of different reasons. There were a lot of people asleep at the switch, and because we never got a proper accounting of why it happened, we still have a barrier to overcome to greater ensure our safety from terrorist attacks, which are, by the way, statistically less likely than lightning strikes. Turn your argument around. So what I am to assume is that we can go back to 9/10 mentality and everything will be hunky dory. Or that it was sheer luck that they happened to get through. No way were they planning this stuff for years. I will concede...I was not present during the CIA briefs. I did not get my hands on classified material. All of my information was gathered by reading books written by those who may have trumped up the story. All the white house/military statements I have read brought to me by the \"media\" are to be taken as a false premise first. All the videos I have watched of radical Muslims were doctored to make them look like bad guys. I did watch the video time and again of the twin towers fall done by a handful of lucky few…", 
        "intTime": 20090304, 
        "postID": 60, 
        "quote": "LOL In order to make that tired old phrase valid, one would have to first prove that there were no-kidding attacks coming down the pike. I don't think that's possible for you to do, is it? I know a lot more about transnational terrorism than you assume I do. I don't have to rely on statements by politicians and pundits, as you obviously do from the statement you made. You have absolutely no idea how difficult it is for transnationals to pull off what they did in 2001. It's always been that way, and for a lot of different reasons. There were a lot of people asleep at the switch, and because we never got a proper accounting of why it happened, we still have a barrier to overcome to greater ensure our safety from terrorist attacks, which are, by the way, statistically less likely than lightning strikes.", 
        "reply": " Turn your argument around. So what I am to assume is that we can go back to 9/10 mentality and everything will be hunky dory. Or that it was sheer luck that they happened to get through. No way were they planning this stuff for years. I will concede...I was not present during the CIA briefs. I did not get my hands on classified material. All of my information was gathered by reading books written by those who may have trumped up the story. All the white house/military statements I have read brought to me by the \"media\" are to be taken as a false premise first. All the videos I have watched of radical Muslims were doctored to make them look like bad guys. I did watch the video time and again of the twin towers fall done by a handful of lucky few…", 
        "threadID": "409192893_8820028612001", 
        "time": "2009-03-04 11:12:00", 
        "title": "The President's Intent to Trample our Constitutional Rights", 
        "userID": "ACR26"
    }
]