[
    {
        "content": "Defense Secretary Robert Gates on Monday recommended major changes in the Pentagon's procurement priorities and acquisition practices, and said the department would scale back significantly the role of contractors in support services. The recommendations are part of the Pentagon's 2010 budget request, which the White House will submit to Congress in a few weeks. Gates said President Obama agreed to the \"unorthodox approach\" of announcing the Pentagon's request before the White House sends the full budget to Capitol Hill, because the scope and significance of the changes warrant a deeper explanation in the context of military reform. The recommendations also are sure to generate a lot of pushback from lawmakers. Within an hour of Gates' briefing to reporters, a bipartisan group of senators sent the president a letter protesting recommended cuts in missile defense funding. Gates said Defense had three main objectives: take care of troops; rebalance programs to adequately support the ongoing wars in Iraq and Afghanistan; and reform how the services buy weapons. Among the most far-reaching changes he recommended were reducing the number of support service contractors from the current level of 39 percent of the workforce to the pre-2001 level of 26 percent and replacing them with full-time government employees. \"Our goal is to hire as many as 13,000 new civil servants in 2010 to replace contractors and up to 30,000 new civil servants in place of contractors over the next five years,\" Gates said. In addition, he said the department would increase the size of the defense acquisition workforce, converting 11,000 contactors and hiring an additional 9,000 government acquisition professionals by 2015, beginning with 4,100 in 2010. Bringing back in-house more support work and expanding the acquisition workforce are essential to restoring accountability to the procurement process, Gates said. A number of programs would be accelerated, delayed or terminated under the proposed 2010 budget. Some of the key changes include: * Increase the number of F-35 Joint Strike Fighter from 14 aircraft to 30 in 2010 * End production of the F-22 Raptor program * Increase funding for theater missile defense programs * Augment funding for the conversion of six additional Aegis ships to provide ballistic missile defense capability * Increase the number of cyber experts the department can train from 80 students annually to 250 annually by 2011 * Solicit bids for a new refueling tanker by this summer * Delay the next-generation cruiser to reconsider requirements and strategic rationale * Postpone amphibious ship and sea-basing programs to better assess costs, capabilities and strategic needs * Complete and end production of the C-17 airlifter this year. The Pentagon must demonstrate a commitment to stop programs that significantly exceed their budget or that spend limited tax dollars to buy more capability than the nation needs, Gates said. In that vein, he recommended that Congress cancel a number of programs, including: * The VH-71 presidential helicopter program, which was designed to provide 23 helicopters for $6.5 billion. Today the program is estimated to cost more than $13 billion and is six years behind schedule. * The Air Force combat search-and-rescue helicopter. It's not clear that the mission is best-served by a single-service solution with a single-purpose aircraft, according to Gates. * The Transformational Satellite program. As an alternative to this program, the Pentagon wants to purchase two more Advanced Extremely High-Frequency satellites. * Several programs in the area of missile defense, largely due to technical problems, estimated to cost about $1.4 billion. Under the 2010 budget proposal, the Pentagon would significantly restructure the Army's Future Combat Systems, spinning out technology enhancements to all combat brigades, but canceling the vehicle component of the program. The Pentagon also plans to press Bath Iron Works to produce all three DDG-1000 Navy destroyers in Maine in an effort to achieve economies of scale and facilitate restarting the older DDG-51 destroyer program at Northrop Grumman Corp.'s Ingalls shipyard in Mississippi, eventually building the DDG-51 at both shipyards when the DDG-1000 program wraps up after three ships. If those negotiations fail, the department would consider instead building only one prototype DDG-1000 ship. \"It would unfortunately reduce our overall procurement of ships and cut workload in both shipyards,\" he said. Gates said his decisions in the 2010 budget were made with an eye toward what the nation needs, and not to balance the books or to meet some pre-determined budget figure. The budget provides an opportunity to reform the way Defense does business, he said: \"It is one thing to speak generally about the need for budget discipline and acquisition and contract reform. It is quite another to make tough choices about specific systems.\"", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "", 
        "reply": "Defense Secretary Robert Gates on Monday recommended major changes in the Pentagon's procurement priorities and acquisition practices, and said the department would scale back significantly the role of contractors in support services. The recommendations are part of the Pentagon's 2010 budget request, which the White House will submit to Congress in a few weeks. Gates said President Obama agreed to the \"unorthodox approach\" of announcing the Pentagon's request before the White House sends the full budget to Capitol Hill, because the scope and significance of the changes warrant a deeper explanation in the context of military reform. The recommendations also are sure to generate a lot of pushback from lawmakers. Within an hour of Gates' briefing to reporters, a bipartisan group of senators sent the president a letter protesting recommended cuts in missile defense funding. Gates said Defense had three main objectives: take care of troops; rebalance programs to adequately support the ongoing wars in Iraq and Afghanistan; and reform how the services buy weapons. Among the most far-reaching changes he recommended were reducing the number of support service contractors from the current level of 39 percent of the workforce to the pre-2001 level of 26 percent and replacing them with full-time government employees. \"Our goal is to hire as many as 13,000 new civil servants in 2010 to replace contractors and up to 30,000 new civil servants in place of contractors over the next five years,\" Gates said. In addition, he said the department would increase the size of the defense acquisition workforce, converting 11,000 contactors and hiring an additional 9,000 government acquisition professionals by 2015, beginning with 4,100 in 2010. Bringing back in-house more support work and expanding the acquisition workforce are essential to restoring accountability to the procurement process, Gates said. A number of programs would be accelerated, delayed or terminated under the proposed 2010 budget. Some of the key changes include: * Increase the number of F-35 Joint Strike Fighter from 14 aircraft to 30 in 2010 * End production of the F-22 Raptor program * Increase funding for theater missile defense programs * Augment funding for the conversion of six additional Aegis ships to provide ballistic missile defense capability * Increase the number of cyber experts the department can train from 80 students annually to 250 annually by 2011 * Solicit bids for a new refueling tanker by this summer * Delay the next-generation cruiser to reconsider requirements and strategic rationale * Postpone amphibious ship and sea-basing programs to better assess costs, capabilities and strategic needs * Complete and end production of the C-17 airlifter this year. The Pentagon must demonstrate a commitment to stop programs that significantly exceed their budget or that spend limited tax dollars to buy more capability than the nation needs, Gates said. In that vein, he recommended that Congress cancel a number of programs, including: * The VH-71 presidential helicopter program, which was designed to provide 23 helicopters for $6.5 billion. Today the program is estimated to cost more than $13 billion and is six years behind schedule. * The Air Force combat search-and-rescue helicopter. It's not clear that the mission is best-served by a single-service solution with a single-purpose aircraft, according to Gates. * The Transformational Satellite program. As an alternative to this program, the Pentagon wants to purchase two more Advanced Extremely High-Frequency satellites. * Several programs in the area of missile defense, largely due to technical problems, estimated to cost about $1.4 billion. Under the 2010 budget proposal, the Pentagon would significantly restructure the Army's Future Combat Systems, spinning out technology enhancements to all combat brigades, but canceling the vehicle component of the program. The Pentagon also plans to press Bath Iron Works to produce all three DDG-1000 Navy destroyers in Maine in an effort to achieve economies of scale and facilitate restarting the older DDG-51 destroyer program at Northrop Grumman Corp.'s Ingalls shipyard in Mississippi, eventually building the DDG-51 at both shipyards when the DDG-1000 program wraps up after three ships. If those negotiations fail, the department would consider instead building only one prototype DDG-1000 ship. \"It would unfortunately reduce our overall procurement of ships and cut workload in both shipyards,\" he said. Gates said his decisions in the 2010 budget were made with an eye toward what the nation needs, and not to balance the books or to meet some pre-determined budget figure. The budget provides an opportunity to reform the way Defense does business, he said: \"It is one thing to speak generally about the need for budget discipline and acquisition and contract reform. It is quite another to make tough choices about specific systems.\"", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 10:08:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line", 
        "intTime": 20090408, 
        "postID": 2, 
        "quote": "Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us.", 
        "reply": " ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 14:34:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line The date line issue was due to data base programming, not hardware. the did not lose all avionics, they lost navigation. The lock-up and freeze-up isses were solved a couple of years ago. Do you have any back-up to prove the acqusations you made?", 
        "intTime": 20090408, 
        "postID": 3, 
        "quote": "Originally posted by liberal90: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line", 
        "reply": " The date line issue was due to data base programming, not hardware. the did not lose all avionics, they lost navigation. The lock-up and freeze-up isses were solved a couple of years ago. Do you have any back-up to prove the acqusations you made?", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 14:48:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "Yeah, the man..... The tanker fiasco continues under his watch Major programs have experienced overruns during his watch. And he is putting all eggs in one basket with the F-35. Clue - it will perform air-to-air as goos as the F-22. Yeah, the man......", 
        "intTime": 20090408, 
        "postID": 4, 
        "quote": "", 
        "reply": "Yeah, the man..... The tanker fiasco continues under his watch Major programs have experienced overruns during his watch. And he is putting all eggs in one basket with the F-35. Clue - it will perform air-to-air as goos as the F-22. Yeah, the man......", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 14:52:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by samh32: Defense Secretary Robert Gates on Monday recommended major changes in the Pentagon's procurement priorities and acquisition practices, and said the department would scale back significantly the role of contractors in support services. The recommendations are part of the Pentagon's 2010 budget request, which the White House will submit to Congress in a few weeks. Gates said President Obama agreed to the \"unorthodox approach\" of announcing the Pentagon's request before the White House sends the full budget to Capitol Hill, because the scope and significance of the changes warrant a deeper explanation in the context of military reform. The recommendations also are sure to generate a lot of pushback from lawmakers. Within an hour of Gates' briefing to reporters, a bipartisan group of senators sent the president a letter protesting recommended cuts in missile defense funding. Gates said Defense had three main objectives: take care of troops; rebalance programs to adequately support the ongoing wars in Iraq and Afghanistan; and reform how the services buy weapons. Among the most far-reaching changes he recommended were reducing the number of support service contractors from the current level of 39 percent of the workforce to the pre-2001 level of 26 percent and replacing them with full-time government employees. \"Our goal is to hire as many as 13,000 new civil servants in 2010 to replace contractors and up to 30,000 new civil servants in place of contractors over the next five years,\" Gates said. In addition, he said the department would increase the size of the defense acquisition workforce, converting 11,000 contactors and hiring an additional 9,000 government acquisition professionals by 2015, beginning with 4,100 in 2010. Bringing back in-house more support work and expanding the acquisition workforce are essential to restoring accountability to the procurement process, Gates said. A number of programs would be accelerated, delayed or terminated under the proposed 2010 budget. Some of the key changes include: * Increase the number of F-35 Joint Strike Fighter from 14 aircraft to 30 in 2010 * End production of the F-22 Raptor program * Increase funding for theater missile defense programs * Augment funding for the conversion of six additional Aegis ships to provide ballistic missile defense capability * Increase the number of cyber experts the department can train from 80 students annually to 250 annually by 2011 * Solicit bids for a new refueling tanker by this summer * Delay the next-generation cruiser to reconsider requirements and strategic rationale * Postpone amphibious ship and sea-basing programs to better assess costs, capabilities and strategic needs * Complete and end production of the C-17 airlifter this year. The Pentagon must demonstrate a commitment to stop programs that significantly exceed their budget or that spend limited tax dollars to buy more capability than the nation needs, Gates said. In that vein, he recommended that Congress cancel a number of programs, including: * The VH-71 presidential helicopter program, which was designed to provide 23 helicopters for $6.5 billion. Today the program is estimated to cost more than $13 billion and is six years behind schedule. * The Air Force combat search-and-rescue helicopter. It's not clear that the mission is best-served by a single-service solution with a single-purpose aircraft, according to Gates. * The Transformational Satellite program. As an alternative to this program, the Pentagon wants to purchase two more Advanced Extremely High-Frequency satellites. * Several programs in the area of missile defense, largely due to technical problems, estimated to cost about $1.4 billion. Under the 2010 budget proposal, the Pentagon would significantly restructure the Army's Future Combat Systems, spinning out technology enhancements to all combat brigades, but canceling the vehicle component of the program. The Pentagon also plans to press Bath Iron Works to produce all three DDG-1000 Navy destroyers in Maine in an effort to achieve economies of scale and facilitate restarting the older DDG-51 destroyer program at Northrop Grumman Corp.'s Ingalls shipyard in Mississippi, eventually building the DDG-51 at both shipyards when the DDG-1000 program wraps up after three ships. If those negotiations fail, the department would consider instead building only one prototype DDG-1000 ship. \"It would unfortunately reduce our overall procurement of ships and cut workload in both shipyards,\" he said. Gates said his decisions in the 2010 budget were made with an eye toward what the nation needs, and not to balance the books or to meet some pre-determined budget figure. The budget provides an opportunity to reform the way Defense does business, he said: \"It is one thing to speak generally about the need for budget discipline and acquisition and contract reform. It is quite another to make tough choices about specific systems.\" The country's Special Forces are sure getting a boost...", 
        "intTime": 20090408, 
        "postID": 5, 
        "quote": "Originally posted by samh32: Defense Secretary Robert Gates on Monday recommended major changes in the Pentagon's procurement priorities and acquisition practices, and said the department would scale back significantly the role of contractors in support services. The recommendations are part of the Pentagon's 2010 budget request, which the White House will submit to Congress in a few weeks. Gates said President Obama agreed to the \"unorthodox approach\" of announcing the Pentagon's request before the White House sends the full budget to Capitol Hill, because the scope and significance of the changes warrant a deeper explanation in the context of military reform. The recommendations also are sure to generate a lot of pushback from lawmakers. Within an hour of Gates' briefing to reporters, a bipartisan group of senators sent the president a letter protesting recommended cuts in missile defense funding. Gates said Defense had three main objectives: take care of troops; rebalance programs to adequately support the ongoing wars in Iraq and Afghanistan; and reform how the services buy weapons. Among the most far-reaching changes he recommended were reducing the number of support service contractors from the current level of 39 percent of the workforce to the pre-2001 level of 26 percent and replacing them with full-time government employees. \"Our goal is to hire as many as 13,000 new civil servants in 2010 to replace contractors and up to 30,000 new civil servants in place of contractors over the next five years,\" Gates said. In addition, he said the department would increase the size of the defense acquisition workforce, converting 11,000 contactors and hiring an additional 9,000 government acquisition professionals by 2015, beginning with 4,100 in 2010. Bringing back in-house more support work and expanding the acquisition workforce are essential to restoring accountability to the procurement process, Gates said. A number of programs would be accelerated, delayed or terminated under the proposed 2010 budget. Some of the key changes include: * Increase the number of F-35 Joint Strike Fighter from 14 aircraft to 30 in 2010 * End production of the F-22 Raptor program * Increase funding for theater missile defense programs * Augment funding for the conversion of six additional Aegis ships to provide ballistic missile defense capability * Increase the number of cyber experts the department can train from 80 students annually to 250 annually by 2011 * Solicit bids for a new refueling tanker by this summer * Delay the next-generation cruiser to reconsider requirements and strategic rationale * Postpone amphibious ship and sea-basing programs to better assess costs, capabilities and strategic needs * Complete and end production of the C-17 airlifter this year. The Pentagon must demonstrate a commitment to stop programs that significantly exceed their budget or that spend limited tax dollars to buy more capability than the nation needs, Gates said. In that vein, he recommended that Congress cancel a number of programs, including: * The VH-71 presidential helicopter program, which was designed to provide 23 helicopters for $6.5 billion. Today the program is estimated to cost more than $13 billion and is six years behind schedule. * The Air Force combat search-and-rescue helicopter. It's not clear that the mission is best-served by a single-service solution with a single-purpose aircraft, according to Gates. * The Transformational Satellite program. As an alternative to this program, the Pentagon wants to purchase two more Advanced Extremely High-Frequency satellites. * Several programs in the area of missile defense, largely due to technical problems, estimated to cost about $1.4 billion. Under the 2010 budget proposal, the Pentagon would significantly restructure the Army's Future Combat Systems, spinning out technology enhancements to all combat brigades, but canceling the vehicle component of the program. The Pentagon also plans to press Bath Iron Works to produce all three DDG-1000 Navy destroyers in Maine in an effort to achieve economies of scale and facilitate restarting the older DDG-51 destroyer program at Northrop Grumman Corp.'s Ingalls shipyard in Mississippi, eventually building the DDG-51 at both shipyards when the DDG-1000 program wraps up after three ships. If those negotiations fail, the department would consider instead building only one prototype DDG-1000 ship. \"It would unfortunately reduce our overall procurement of ships and cut workload in both shipyards,\" he said. Gates said his decisions in the 2010 budget were made with an eye toward what the nation needs, and not to balance the books or to meet some pre-determined budget figure. The budget provides an opportunity to reform the way Defense does business, he said: \"It is one thing to speak generally about the need for budget discipline and acquisition and contract reform. It is quite another to make tough choices about specific systems.\"", 
        "reply": " The country's Special Forces are sure getting a boost...", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 15:24:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "California is ready to raise hell over the F22 Whats funny is that the defense budget actually INCREASES this year over last....And we still spend more than the next 25 nations combined on defense.... Yet President Obama is stealing the troops money and giving it too poor minorities...according to some", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "", 
        "reply": "California is ready to raise hell over the F22 Whats funny is that the defense budget actually INCREASES this year over last....And we still spend more than the next 25 nations combined on defense.... Yet President Obama is stealing the troops money and giving it too poor minorities...according to some", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 15:30:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: California is ready to raise hell over the F22 Whats funny is that the defense budget actually INCREASES this year over last....And we still spend more than the next 25 nations combined on defense.... Yet President Obama is stealing the troops money and giving it too poor minorities...according to some Well IRS you gotta remember that the single largest item in the DoD budget is personnel accounts, not weapons and O&M. Our forces also are in motion more than anyone else's, so O&M will be higher.", 
        "intTime": 20090408, 
        "postID": 7, 
        "quote": "Originally posted by Irwin_R_Schyster: California is ready to raise hell over the F22 Whats funny is that the defense budget actually INCREASES this year over last....And we still spend more than the next 25 nations combined on defense.... Yet President Obama is stealing the troops money and giving it too poor minorities...according to some", 
        "reply": " Well IRS you gotta remember that the single largest item in the DoD budget is personnel accounts, not weapons and O&M. Our forces also are in motion more than anyone else's, so O&M will be higher.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 19:32:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run.", 
        "intTime": 20090408, 
        "postID": 8, 
        "quote": "", 
        "reply": "The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 20:07:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "9475297"
    }, 
    {
        "content": "quote: Originally posted by 9475297: The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run. Contractors have been screwing the government for the last 9 years! when Rumsfeld decided to have contractors do the jobs that soldiers would normally perform. I just got back from Afghanistan, and to pay a person $160.000 annually for working on MRAPs is unacceptable.", 
        "intTime": 20090408, 
        "postID": 9, 
        "quote": "Originally posted by 9475297: The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run.", 
        "reply": " Contractors have been screwing the government for the last 9 years! when Rumsfeld decided to have contractors do the jobs that soldiers would normally perform. I just got back from Afghanistan, and to pay a person $160.000 annually for working on MRAPs is unacceptable.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 20:21:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters.", 
        "intTime": 20090408, 
        "postID": 10, 
        "quote": "Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us.", 
        "reply": " How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 20:25:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "samh32"
    }, 
    {
        "content": "We had another Sec of Def like this guy Gates. His name was McNamarra and did the same as Gates. His first action back in the early 1960's was to reduce the production of the UH1 helicopter. For you younger fellows we went to Vietnam shortly after the production lines were shut down. It meant that we would not have a sufficient number of assult choppers to support our operations starting in late 1963. We had to use H19's H21's, H34's that were left over from the Korean war days. Yes, this was the same guy that screwed up the world bank when he was in charge of it.", 
        "intTime": 20090408, 
        "postID": 11, 
        "quote": "", 
        "reply": "We had another Sec of Def like this guy Gates. His name was McNamarra and did the same as Gates. His first action back in the early 1960's was to reduce the production of the UH1 helicopter. For you younger fellows we went to Vietnam shortly after the production lines were shut down. It meant that we would not have a sufficient number of assult choppers to support our operations starting in late 1963. We had to use H19's H21's, H34's that were left over from the Korean war days. Yes, this was the same guy that screwed up the world bank when he was in charge of it.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 21:09:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "9475297"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\"", 
        "intTime": 20090408, 
        "postID": 12, 
        "quote": "Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us.", 
        "reply": " Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\"", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 21:15:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "I used to think that outsourcing government functions led to greater efficiency through competition, too. What changed my mind? I live in Florida. Governor Christ is right now deciding which budgetary limbs to chop off because of the money the state is sinking into failed projects and no-bid contracts, problems incurred during Governor Bush's push to privatize government functions. Florida is right now, under a heavy republican majority leadership, pushing to tip the balance of state services back toward government, because it has been proven by this little experiment that there are some things that government does better. A little tangent here: it seems that the only defense procurement programs to remain on time, on budget, and on mission are submarine projects. Go Electric Boat! They (with General Dynamics) have been quietly churning out the best submarines the world has ever seen without the massive deficiencies and cost overruns seen by the Army, Air Force, and surface Navy.", 
        "intTime": 20090408, 
        "postID": 13, 
        "quote": "", 
        "reply": "I used to think that outsourcing government functions led to greater efficiency through competition, too. What changed my mind? I live in Florida. Governor Christ is right now deciding which budgetary limbs to chop off because of the money the state is sinking into failed projects and no-bid contracts, problems incurred during Governor Bush's push to privatize government functions. Florida is right now, under a heavy republican majority leadership, pushing to tip the balance of state services back toward government, because it has been proven by this little experiment that there are some things that government does better. A little tangent here: it seems that the only defense procurement programs to remain on time, on budget, and on mission are submarine projects. Go Electric Boat! They (with General Dynamics) have been quietly churning out the best submarines the world has ever seen without the massive deficiencies and cost overruns seen by the Army, Air Force, and surface Navy.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 21:32:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by liberal90: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line Oh yeah, kinda like the F-15 guys that shot down the Blackhawks. Yeah we don't fix our problems we just let 'em slide...... Careful Robert, Lib90 is an expert of aircraft and what they do in combat.", 
        "intTime": 20090409, 
        "postID": 14, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by liberal90: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line Oh yeah, kinda like the F-15 guys that shot down the Blackhawks. Yeah we don't fix our problems we just let 'em slide......", 
        "reply": " Careful Robert, Lib90 is an expert of aircraft and what they do in combat.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 05:44:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear...", 
        "intTime": 20090409, 
        "postID": 15, 
        "quote": "", 
        "reply": "There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear...", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 05:58:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear... They may or may not have known how the ship was flagged when they tried to take it. One pirate was captured by the crew and the rest are in a lifeboat, out of fuel, floating dead in the water between the cargo ship and a USN destroyer. You make it sound like these guys are on Al Jezeera parading their hostages around and demanding millions of dollars. Even if they were, what is your grand scheme? Napalm the Somali coast? Rome could go and murder an entire \"barbarian\" town if the whim struck them, which it often did. Where did that get them eventually? All those tribes united against them, invaded them, sacked Rome and forced most of the city's population to flee all the way to Africa. Everyone who was left after the Visigoths spent 3 days sacking the place, that is. If you are going to pick an example, pick a good one.", 
        "intTime": 20090409, 
        "postID": 16, 
        "quote": "Originally posted by threerings: There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear...", 
        "reply": " They may or may not have known how the ship was flagged when they tried to take it. One pirate was captured by the crew and the rest are in a lifeboat, out of fuel, floating dead in the water between the cargo ship and a USN destroyer. You make it sound like these guys are on Al Jezeera parading their hostages around and demanding millions of dollars. Even if they were, what is your grand scheme? Napalm the Somali coast? Rome could go and murder an entire \"barbarian\" town if the whim struck them, which it often did. Where did that get them eventually? All those tribes united against them, invaded them, sacked Rome and forced most of the city's population to flee all the way to Africa. Everyone who was left after the Visigoths spent 3 days sacking the place, that is. If you are going to pick an example, pick a good one.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 06:17:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by threerings: There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear... The romans also took slaves and fed minorities to the lions.", 
        "intTime": 20090409, 
        "postID": 17, 
        "quote": "Originally posted by threerings: There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear...", 
        "reply": " The romans also took slaves and fed minorities to the lions.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 06:20:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years.", 
        "intTime": 20090409, 
        "postID": 18, 
        "quote": "Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters.", 
        "reply": " Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 07:19:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 9475297: The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run. Contractors have been screwing the government for the last 9 years! when Rumsfeld decided to have contractors do the jobs that soldiers would normally perform. I just got back from Afghanistan, and to pay a person $160.000 annually for working on MRAPs is unacceptable. Gotta agree with most of this. I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture.", 
        "intTime": 20090409, 
        "postID": 19, 
        "quote": "Originally posted by samh32: quote: Originally posted by 9475297: The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run. Contractors have been screwing the government for the last 9 years! when Rumsfeld decided to have contractors do the jobs that soldiers would normally perform. I just got back from Afghanistan, and to pay a person $160.000 annually for working on MRAPs is unacceptable.", 
        "reply": " Gotta agree with most of this. I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 07:23:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture. I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented.", 
        "intTime": 20090409, 
        "postID": 20, 
        "quote": "Originally posted by sw614: I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture.", 
        "reply": " I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 10:00:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\" Yeah, well, if you're so great, how come you couldn't do a fly by without wrecking the plane? Man. You must be some kinda \"glass half empty guy.\" I brought most of the plane back!\"", 
        "intTime": 20090409, 
        "postID": 21, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\" Yeah, well, if you're so great, how come you couldn't do a fly by without wrecking the plane?", 
        "reply": " Man. You must be some kinda \"glass half empty guy.\" I brought most of the plane back!\"", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 11:09:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years. Yeah we really could have used the F (fighter) 22 in Iraq... The Iraqi air force posed such a threat.", 
        "intTime": 20090409, 
        "postID": 22, 
        "quote": "Originally posted by sw614: quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years.", 
        "reply": " Yeah we really could have used the F (fighter) 22 in Iraq... The Iraqi air force posed such a threat.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 12:52:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by sw614: quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years. Yeah we really could have used the F (fighter) 22 in Iraq... The Iraqi air force posed such a threat. The F-22 can drop JDAMs and SDBs. Plus its sensor can monitor a whole slew of things. The reason the Iraqi AF was not a threat was because air superiority fighters kicked their azzes the first time and they had no stomach for a second round of it. In case you haven't noticed, there are many acft deployed to Iraq and Afghanistan that have a \"F\" designation: F-15, F-16, F/A-18, etc. Seems to me they are all contributing one way or another along with some acft with \"B\" designations. But your hero SecDef Gates cancelled the follow-on bomber also. No US troops have come under air attack in over 56 years. I would think we would want to keep it that way. What is your grand scheme to replace our 20+ year old air superiority fighters? Yeah, he \"da man\". Oh, BTW - thanks for pointing out \"F\" stands for fighter. The entire 23 years I worked on acft I never knew that.....", 
        "intTime": 20090409, 
        "postID": 23, 
        "quote": "Originally posted by samh32: quote: Originally posted by sw614: quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years. Yeah we really could have used the F (fighter) 22 in Iraq... The Iraqi air force posed such a threat.", 
        "reply": " The F-22 can drop JDAMs and SDBs. Plus its sensor can monitor a whole slew of things. The reason the Iraqi AF was not a threat was because air superiority fighters kicked their azzes the first time and they had no stomach for a second round of it. In case you haven't noticed, there are many acft deployed to Iraq and Afghanistan that have a \"F\" designation: F-15, F-16, F/A-18, etc. Seems to me they are all contributing one way or another along with some acft with \"B\" designations. But your hero SecDef Gates cancelled the follow-on bomber also. No US troops have come under air attack in over 56 years. I would think we would want to keep it that way. What is your grand scheme to replace our 20+ year old air superiority fighters? Yeah, he \"da man\". Oh, BTW - thanks for pointing out \"F\" stands for fighter. The entire 23 years I worked on acft I never knew that.....", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 14:23:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by sw614: I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture. I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented. Yes, I understand the economics of the reasoning and spreadsheets published by various sources seem to prove the concept. I just feel that having so much done by contractors takes something away from being military. At my first base (yeah, over 3 decades ago) there were very few civilians and details were the order of the day and the base felt like a community all its own. Toward the end of my career it seemed more of people just going to work and going home and when details came along, the whining was many times more than it should have been because they do it so little. I don't know, but there was more of the \"not my job\" mentality than when I first enlisted. Maybe its just nostalgia...but I liked it much better when a sharp looking GI was checking ID cards then when it is a civilian contractor.", 
        "intTime": 20090409, 
        "postID": 24, 
        "quote": "Originally posted by jwr6: quote: Originally posted by sw614: I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture. I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented.", 
        "reply": " Yes, I understand the economics of the reasoning and spreadsheets published by various sources seem to prove the concept. I just feel that having so much done by contractors takes something away from being military. At my first base (yeah, over 3 decades ago) there were very few civilians and details were the order of the day and the base felt like a community all its own. Toward the end of my career it seemed more of people just going to work and going home and when details came along, the whining was many times more than it should have been because they do it so little. I don't know, but there was more of the \"not my job\" mentality than when I first enlisted. Maybe its just nostalgia...but I liked it much better when a sharp looking GI was checking ID cards then when it is a civilian contractor.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 14:31:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jwr6: I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented. Costs less? They don't do it for cost. That's a given. If you have any long term data to support your conclusions I would certainly like to see it. Funding is funding is funding. The money is going somewhere. One less servicemember to benefit some profit oriented contractor?...No thanks. Keep it internal, i.e. all jobs military (with FEW minimal exceptions). As I recall, every \"military\" cook, mechanic, bookkeeper was also trained to shoot back which would seem to make your \"teeth\" comment moot when some civilian puke contractor doesn't know the business end of an M-16 from his rear. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090409, 
        "postID": 25, 
        "quote": "Originally posted by jwr6: I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented.", 
        "reply": " Costs less? They don't do it for cost. That's a given. If you have any long term data to support your conclusions I would certainly like to see it. Funding is funding is funding. The money is going somewhere. One less servicemember to benefit some profit oriented contractor?...No thanks. Keep it internal, i.e. all jobs military (with FEW minimal exceptions). As I recall, every \"military\" cook, mechanic, bookkeeper was also trained to shoot back which would seem to make your \"teeth\" comment moot when some civilian puke contractor doesn't know the business end of an M-16 from his rear. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 15:12:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\" Yeah, well, if you're so great, how come you couldn't do a fly by without wrecking the plane? Man. You must be some kinda \"glass half empty guy.\" I brought most of the plane back!\" The way I see it, any landing you can walk away from, is a good landing.", 
        "intTime": 20090409, 
        "postID": 26, 
        "quote": "Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\" Yeah, well, if you're so great, how come you couldn't do a fly by without wrecking the plane? Man. You must be some kinda \"glass half empty guy.\" I brought most of the plane back!\"", 
        "reply": " The way I see it, any landing you can walk away from, is a good landing.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 18:33:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "Defense Secretary Robert Gates on Monday recommended major changes in the Pentagon's procurement priorities and acquisition practices, and said the department would scale back significantly the role of contractors in support services. The recommendations are part of the Pentagon's 2010 budget request, which the White House will submit to Congress in a few weeks. Gates said President Obama agreed to the \"unorthodox approach\" of announcing the Pentagon's request before the White House sends the full budget to Capitol Hill, because the scope and significance of the changes warrant a deeper explanation in the context of military reform. The recommendations also are sure to generate a lot of pushback from lawmakers. Within an hour of Gates' briefing to reporters, a bipartisan group of senators sent the president a letter protesting recommended cuts in missile defense funding. Gates said Defense had three main objectives: take care of troops; rebalance programs to adequately support the ongoing wars in Iraq and Afghanistan; and reform how the services buy weapons. Among the most far-reaching changes he recommended were reducing the number of support service contractors from the current level of 39 percent of the workforce to the pre-2001 level of 26 percent and replacing them with full-time government employees. \"Our goal is to hire as many as 13,000 new civil servants in 2010 to replace contractors and up to 30,000 new civil servants in place of contractors over the next five years,\" Gates said. In addition, he said the department would increase the size of the defense acquisition workforce, converting 11,000 contactors and hiring an additional 9,000 government acquisition professionals by 2015, beginning with 4,100 in 2010. Bringing back in-house more support work and expanding the acquisition workforce are essential to restoring accountability to the procurement process, Gates said. A number of programs would be accelerated, delayed or terminated under the proposed 2010 budget. Some of the key changes include: * Increase the number of F-35 Joint Strike Fighter from 14 aircraft to 30 in 2010 * End production of the F-22 Raptor program * Increase funding for theater missile defense programs * Augment funding for the conversion of six additional Aegis ships to provide ballistic missile defense capability * Increase the number of cyber experts the department can train from 80 students annually to 250 annually by 2011 * Solicit bids for a new refueling tanker by this summer * Delay the next-generation cruiser to reconsider requirements and strategic rationale * Postpone amphibious ship and sea-basing programs to better assess costs, capabilities and strategic needs * Complete and end production of the C-17 airlifter this year. The Pentagon must demonstrate a commitment to stop programs that significantly exceed their budget or that spend limited tax dollars to buy more capability than the nation needs, Gates said. In that vein, he recommended that Congress cancel a number of programs, including: * The VH-71 presidential helicopter program, which was designed to provide 23 helicopters for $6.5 billion. Today the program is estimated to cost more than $13 billion and is six years behind schedule. * The Air Force combat search-and-rescue helicopter. It's not clear that the mission is best-served by a single-service solution with a single-purpose aircraft, according to Gates. * The Transformational Satellite program. As an alternative to this program, the Pentagon wants to purchase two more Advanced Extremely High-Frequency satellites. * Several programs in the area of missile defense, largely due to technical problems, estimated to cost about $1.4 billion. Under the 2010 budget proposal, the Pentagon would significantly restructure the Army's Future Combat Systems, spinning out technology enhancements to all combat brigades, but canceling the vehicle component of the program. The Pentagon also plans to press Bath Iron Works to produce all three DDG-1000 Navy destroyers in Maine in an effort to achieve economies of scale and facilitate restarting the older DDG-51 destroyer program at Northrop Grumman Corp.'s Ingalls shipyard in Mississippi, eventually building the DDG-51 at both shipyards when the DDG-1000 program wraps up after three ships. If those negotiations fail, the department would consider instead building only one prototype DDG-1000 ship. \"It would unfortunately reduce our overall procurement of ships and cut workload in both shipyards,\" he said. Gates said his decisions in the 2010 budget were made with an eye toward what the nation needs, and not to balance the books or to meet some pre-determined budget figure. The budget provides an opportunity to reform the way Defense does business, he said: \"It is one thing to speak generally about the need for budget discipline and acquisition and contract reform. It is quite another to make tough choices about specific systems.\"", 
        "intTime": 20090408, 
        "postID": 27, 
        "quote": "", 
        "reply": "Defense Secretary Robert Gates on Monday recommended major changes in the Pentagon's procurement priorities and acquisition practices, and said the department would scale back significantly the role of contractors in support services. The recommendations are part of the Pentagon's 2010 budget request, which the White House will submit to Congress in a few weeks. Gates said President Obama agreed to the \"unorthodox approach\" of announcing the Pentagon's request before the White House sends the full budget to Capitol Hill, because the scope and significance of the changes warrant a deeper explanation in the context of military reform. The recommendations also are sure to generate a lot of pushback from lawmakers. Within an hour of Gates' briefing to reporters, a bipartisan group of senators sent the president a letter protesting recommended cuts in missile defense funding. Gates said Defense had three main objectives: take care of troops; rebalance programs to adequately support the ongoing wars in Iraq and Afghanistan; and reform how the services buy weapons. Among the most far-reaching changes he recommended were reducing the number of support service contractors from the current level of 39 percent of the workforce to the pre-2001 level of 26 percent and replacing them with full-time government employees. \"Our goal is to hire as many as 13,000 new civil servants in 2010 to replace contractors and up to 30,000 new civil servants in place of contractors over the next five years,\" Gates said. In addition, he said the department would increase the size of the defense acquisition workforce, converting 11,000 contactors and hiring an additional 9,000 government acquisition professionals by 2015, beginning with 4,100 in 2010. Bringing back in-house more support work and expanding the acquisition workforce are essential to restoring accountability to the procurement process, Gates said. A number of programs would be accelerated, delayed or terminated under the proposed 2010 budget. Some of the key changes include: * Increase the number of F-35 Joint Strike Fighter from 14 aircraft to 30 in 2010 * End production of the F-22 Raptor program * Increase funding for theater missile defense programs * Augment funding for the conversion of six additional Aegis ships to provide ballistic missile defense capability * Increase the number of cyber experts the department can train from 80 students annually to 250 annually by 2011 * Solicit bids for a new refueling tanker by this summer * Delay the next-generation cruiser to reconsider requirements and strategic rationale * Postpone amphibious ship and sea-basing programs to better assess costs, capabilities and strategic needs * Complete and end production of the C-17 airlifter this year. The Pentagon must demonstrate a commitment to stop programs that significantly exceed their budget or that spend limited tax dollars to buy more capability than the nation needs, Gates said. In that vein, he recommended that Congress cancel a number of programs, including: * The VH-71 presidential helicopter program, which was designed to provide 23 helicopters for $6.5 billion. Today the program is estimated to cost more than $13 billion and is six years behind schedule. * The Air Force combat search-and-rescue helicopter. It's not clear that the mission is best-served by a single-service solution with a single-purpose aircraft, according to Gates. * The Transformational Satellite program. As an alternative to this program, the Pentagon wants to purchase two more Advanced Extremely High-Frequency satellites. * Several programs in the area of missile defense, largely due to technical problems, estimated to cost about $1.4 billion. Under the 2010 budget proposal, the Pentagon would significantly restructure the Army's Future Combat Systems, spinning out technology enhancements to all combat brigades, but canceling the vehicle component of the program. The Pentagon also plans to press Bath Iron Works to produce all three DDG-1000 Navy destroyers in Maine in an effort to achieve economies of scale and facilitate restarting the older DDG-51 destroyer program at Northrop Grumman Corp.'s Ingalls shipyard in Mississippi, eventually building the DDG-51 at both shipyards when the DDG-1000 program wraps up after three ships. If those negotiations fail, the department would consider instead building only one prototype DDG-1000 ship. \"It would unfortunately reduce our overall procurement of ships and cut workload in both shipyards,\" he said. Gates said his decisions in the 2010 budget were made with an eye toward what the nation needs, and not to balance the books or to meet some pre-determined budget figure. The budget provides an opportunity to reform the way Defense does business, he said: \"It is one thing to speak generally about the need for budget discipline and acquisition and contract reform. It is quite another to make tough choices about specific systems.\"", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 10:08:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line", 
        "intTime": 20090408, 
        "postID": 28, 
        "quote": "Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us.", 
        "reply": " ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 14:34:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line The date line issue was due to data base programming, not hardware. the did not lose all avionics, they lost navigation. The lock-up and freeze-up isses were solved a couple of years ago. Do you have any back-up to prove the acqusations you made?", 
        "intTime": 20090408, 
        "postID": 29, 
        "quote": "Originally posted by liberal90: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line", 
        "reply": " The date line issue was due to data base programming, not hardware. the did not lose all avionics, they lost navigation. The lock-up and freeze-up isses were solved a couple of years ago. Do you have any back-up to prove the acqusations you made?", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 14:48:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "Yeah, the man..... The tanker fiasco continues under his watch Major programs have experienced overruns during his watch. And he is putting all eggs in one basket with the F-35. Clue - it will perform air-to-air as goos as the F-22. Yeah, the man......", 
        "intTime": 20090408, 
        "postID": 30, 
        "quote": "", 
        "reply": "Yeah, the man..... The tanker fiasco continues under his watch Major programs have experienced overruns during his watch. And he is putting all eggs in one basket with the F-35. Clue - it will perform air-to-air as goos as the F-22. Yeah, the man......", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 14:52:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by samh32: Defense Secretary Robert Gates on Monday recommended major changes in the Pentagon's procurement priorities and acquisition practices, and said the department would scale back significantly the role of contractors in support services. The recommendations are part of the Pentagon's 2010 budget request, which the White House will submit to Congress in a few weeks. Gates said President Obama agreed to the \"unorthodox approach\" of announcing the Pentagon's request before the White House sends the full budget to Capitol Hill, because the scope and significance of the changes warrant a deeper explanation in the context of military reform. The recommendations also are sure to generate a lot of pushback from lawmakers. Within an hour of Gates' briefing to reporters, a bipartisan group of senators sent the president a letter protesting recommended cuts in missile defense funding. Gates said Defense had three main objectives: take care of troops; rebalance programs to adequately support the ongoing wars in Iraq and Afghanistan; and reform how the services buy weapons. Among the most far-reaching changes he recommended were reducing the number of support service contractors from the current level of 39 percent of the workforce to the pre-2001 level of 26 percent and replacing them with full-time government employees. \"Our goal is to hire as many as 13,000 new civil servants in 2010 to replace contractors and up to 30,000 new civil servants in place of contractors over the next five years,\" Gates said. In addition, he said the department would increase the size of the defense acquisition workforce, converting 11,000 contactors and hiring an additional 9,000 government acquisition professionals by 2015, beginning with 4,100 in 2010. Bringing back in-house more support work and expanding the acquisition workforce are essential to restoring accountability to the procurement process, Gates said. A number of programs would be accelerated, delayed or terminated under the proposed 2010 budget. Some of the key changes include: * Increase the number of F-35 Joint Strike Fighter from 14 aircraft to 30 in 2010 * End production of the F-22 Raptor program * Increase funding for theater missile defense programs * Augment funding for the conversion of six additional Aegis ships to provide ballistic missile defense capability * Increase the number of cyber experts the department can train from 80 students annually to 250 annually by 2011 * Solicit bids for a new refueling tanker by this summer * Delay the next-generation cruiser to reconsider requirements and strategic rationale * Postpone amphibious ship and sea-basing programs to better assess costs, capabilities and strategic needs * Complete and end production of the C-17 airlifter this year. The Pentagon must demonstrate a commitment to stop programs that significantly exceed their budget or that spend limited tax dollars to buy more capability than the nation needs, Gates said. In that vein, he recommended that Congress cancel a number of programs, including: * The VH-71 presidential helicopter program, which was designed to provide 23 helicopters for $6.5 billion. Today the program is estimated to cost more than $13 billion and is six years behind schedule. * The Air Force combat search-and-rescue helicopter. It's not clear that the mission is best-served by a single-service solution with a single-purpose aircraft, according to Gates. * The Transformational Satellite program. As an alternative to this program, the Pentagon wants to purchase two more Advanced Extremely High-Frequency satellites. * Several programs in the area of missile defense, largely due to technical problems, estimated to cost about $1.4 billion. Under the 2010 budget proposal, the Pentagon would significantly restructure the Army's Future Combat Systems, spinning out technology enhancements to all combat brigades, but canceling the vehicle component of the program. The Pentagon also plans to press Bath Iron Works to produce all three DDG-1000 Navy destroyers in Maine in an effort to achieve economies of scale and facilitate restarting the older DDG-51 destroyer program at Northrop Grumman Corp.'s Ingalls shipyard in Mississippi, eventually building the DDG-51 at both shipyards when the DDG-1000 program wraps up after three ships. If those negotiations fail, the department would consider instead building only one prototype DDG-1000 ship. \"It would unfortunately reduce our overall procurement of ships and cut workload in both shipyards,\" he said. Gates said his decisions in the 2010 budget were made with an eye toward what the nation needs, and not to balance the books or to meet some pre-determined budget figure. The budget provides an opportunity to reform the way Defense does business, he said: \"It is one thing to speak generally about the need for budget discipline and acquisition and contract reform. It is quite another to make tough choices about specific systems.\" The country's Special Forces are sure getting a boost...", 
        "intTime": 20090408, 
        "postID": 31, 
        "quote": "Originally posted by samh32: Defense Secretary Robert Gates on Monday recommended major changes in the Pentagon's procurement priorities and acquisition practices, and said the department would scale back significantly the role of contractors in support services. The recommendations are part of the Pentagon's 2010 budget request, which the White House will submit to Congress in a few weeks. Gates said President Obama agreed to the \"unorthodox approach\" of announcing the Pentagon's request before the White House sends the full budget to Capitol Hill, because the scope and significance of the changes warrant a deeper explanation in the context of military reform. The recommendations also are sure to generate a lot of pushback from lawmakers. Within an hour of Gates' briefing to reporters, a bipartisan group of senators sent the president a letter protesting recommended cuts in missile defense funding. Gates said Defense had three main objectives: take care of troops; rebalance programs to adequately support the ongoing wars in Iraq and Afghanistan; and reform how the services buy weapons. Among the most far-reaching changes he recommended were reducing the number of support service contractors from the current level of 39 percent of the workforce to the pre-2001 level of 26 percent and replacing them with full-time government employees. \"Our goal is to hire as many as 13,000 new civil servants in 2010 to replace contractors and up to 30,000 new civil servants in place of contractors over the next five years,\" Gates said. In addition, he said the department would increase the size of the defense acquisition workforce, converting 11,000 contactors and hiring an additional 9,000 government acquisition professionals by 2015, beginning with 4,100 in 2010. Bringing back in-house more support work and expanding the acquisition workforce are essential to restoring accountability to the procurement process, Gates said. A number of programs would be accelerated, delayed or terminated under the proposed 2010 budget. Some of the key changes include: * Increase the number of F-35 Joint Strike Fighter from 14 aircraft to 30 in 2010 * End production of the F-22 Raptor program * Increase funding for theater missile defense programs * Augment funding for the conversion of six additional Aegis ships to provide ballistic missile defense capability * Increase the number of cyber experts the department can train from 80 students annually to 250 annually by 2011 * Solicit bids for a new refueling tanker by this summer * Delay the next-generation cruiser to reconsider requirements and strategic rationale * Postpone amphibious ship and sea-basing programs to better assess costs, capabilities and strategic needs * Complete and end production of the C-17 airlifter this year. The Pentagon must demonstrate a commitment to stop programs that significantly exceed their budget or that spend limited tax dollars to buy more capability than the nation needs, Gates said. In that vein, he recommended that Congress cancel a number of programs, including: * The VH-71 presidential helicopter program, which was designed to provide 23 helicopters for $6.5 billion. Today the program is estimated to cost more than $13 billion and is six years behind schedule. * The Air Force combat search-and-rescue helicopter. It's not clear that the mission is best-served by a single-service solution with a single-purpose aircraft, according to Gates. * The Transformational Satellite program. As an alternative to this program, the Pentagon wants to purchase two more Advanced Extremely High-Frequency satellites. * Several programs in the area of missile defense, largely due to technical problems, estimated to cost about $1.4 billion. Under the 2010 budget proposal, the Pentagon would significantly restructure the Army's Future Combat Systems, spinning out technology enhancements to all combat brigades, but canceling the vehicle component of the program. The Pentagon also plans to press Bath Iron Works to produce all three DDG-1000 Navy destroyers in Maine in an effort to achieve economies of scale and facilitate restarting the older DDG-51 destroyer program at Northrop Grumman Corp.'s Ingalls shipyard in Mississippi, eventually building the DDG-51 at both shipyards when the DDG-1000 program wraps up after three ships. If those negotiations fail, the department would consider instead building only one prototype DDG-1000 ship. \"It would unfortunately reduce our overall procurement of ships and cut workload in both shipyards,\" he said. Gates said his decisions in the 2010 budget were made with an eye toward what the nation needs, and not to balance the books or to meet some pre-determined budget figure. The budget provides an opportunity to reform the way Defense does business, he said: \"It is one thing to speak generally about the need for budget discipline and acquisition and contract reform. It is quite another to make tough choices about specific systems.\"", 
        "reply": " The country's Special Forces are sure getting a boost...", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 15:24:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "scottrj50"
    }, 
    {
        "content": "California is ready to raise hell over the F22 Whats funny is that the defense budget actually INCREASES this year over last....And we still spend more than the next 25 nations combined on defense.... Yet President Obama is stealing the troops money and giving it too poor minorities...according to some", 
        "intTime": 20090408, 
        "postID": 32, 
        "quote": "", 
        "reply": "California is ready to raise hell over the F22 Whats funny is that the defense budget actually INCREASES this year over last....And we still spend more than the next 25 nations combined on defense.... Yet President Obama is stealing the troops money and giving it too poor minorities...according to some", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 15:30:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: California is ready to raise hell over the F22 Whats funny is that the defense budget actually INCREASES this year over last....And we still spend more than the next 25 nations combined on defense.... Yet President Obama is stealing the troops money and giving it too poor minorities...according to some Well IRS you gotta remember that the single largest item in the DoD budget is personnel accounts, not weapons and O&M. Our forces also are in motion more than anyone else's, so O&M will be higher.", 
        "intTime": 20090408, 
        "postID": 33, 
        "quote": "Originally posted by Irwin_R_Schyster: California is ready to raise hell over the F22 Whats funny is that the defense budget actually INCREASES this year over last....And we still spend more than the next 25 nations combined on defense.... Yet President Obama is stealing the troops money and giving it too poor minorities...according to some", 
        "reply": " Well IRS you gotta remember that the single largest item in the DoD budget is personnel accounts, not weapons and O&M. Our forces also are in motion more than anyone else's, so O&M will be higher.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 19:32:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run.", 
        "intTime": 20090408, 
        "postID": 34, 
        "quote": "", 
        "reply": "The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 20:07:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "9475297"
    }, 
    {
        "content": "quote: Originally posted by 9475297: The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run. Contractors have been screwing the government for the last 9 years! when Rumsfeld decided to have contractors do the jobs that soldiers would normally perform. I just got back from Afghanistan, and to pay a person $160.000 annually for working on MRAPs is unacceptable.", 
        "intTime": 20090408, 
        "postID": 35, 
        "quote": "Originally posted by 9475297: The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run.", 
        "reply": " Contractors have been screwing the government for the last 9 years! when Rumsfeld decided to have contractors do the jobs that soldiers would normally perform. I just got back from Afghanistan, and to pay a person $160.000 annually for working on MRAPs is unacceptable.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 20:21:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters.", 
        "intTime": 20090408, 
        "postID": 36, 
        "quote": "Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us.", 
        "reply": " How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 20:25:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "samh32"
    }, 
    {
        "content": "We had another Sec of Def like this guy Gates. His name was McNamarra and did the same as Gates. His first action back in the early 1960's was to reduce the production of the UH1 helicopter. For you younger fellows we went to Vietnam shortly after the production lines were shut down. It meant that we would not have a sufficient number of assult choppers to support our operations starting in late 1963. We had to use H19's H21's, H34's that were left over from the Korean war days. Yes, this was the same guy that screwed up the world bank when he was in charge of it.", 
        "intTime": 20090408, 
        "postID": 37, 
        "quote": "", 
        "reply": "We had another Sec of Def like this guy Gates. His name was McNamarra and did the same as Gates. His first action back in the early 1960's was to reduce the production of the UH1 helicopter. For you younger fellows we went to Vietnam shortly after the production lines were shut down. It meant that we would not have a sufficient number of assult choppers to support our operations starting in late 1963. We had to use H19's H21's, H34's that were left over from the Korean war days. Yes, this was the same guy that screwed up the world bank when he was in charge of it.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 21:09:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "9475297"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\"", 
        "intTime": 20090408, 
        "postID": 38, 
        "quote": "Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us.", 
        "reply": " Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\"", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 21:15:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "I used to think that outsourcing government functions led to greater efficiency through competition, too. What changed my mind? I live in Florida. Governor Christ is right now deciding which budgetary limbs to chop off because of the money the state is sinking into failed projects and no-bid contracts, problems incurred during Governor Bush's push to privatize government functions. Florida is right now, under a heavy republican majority leadership, pushing to tip the balance of state services back toward government, because it has been proven by this little experiment that there are some things that government does better. A little tangent here: it seems that the only defense procurement programs to remain on time, on budget, and on mission are submarine projects. Go Electric Boat! They (with General Dynamics) have been quietly churning out the best submarines the world has ever seen without the massive deficiencies and cost overruns seen by the Army, Air Force, and surface Navy.", 
        "intTime": 20090408, 
        "postID": 39, 
        "quote": "", 
        "reply": "I used to think that outsourcing government functions led to greater efficiency through competition, too. What changed my mind? I live in Florida. Governor Christ is right now deciding which budgetary limbs to chop off because of the money the state is sinking into failed projects and no-bid contracts, problems incurred during Governor Bush's push to privatize government functions. Florida is right now, under a heavy republican majority leadership, pushing to tip the balance of state services back toward government, because it has been proven by this little experiment that there are some things that government does better. A little tangent here: it seems that the only defense procurement programs to remain on time, on budget, and on mission are submarine projects. Go Electric Boat! They (with General Dynamics) have been quietly churning out the best submarines the world has ever seen without the massive deficiencies and cost overruns seen by the Army, Air Force, and surface Navy.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-08 21:32:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by liberal90: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line Oh yeah, kinda like the F-15 guys that shot down the Blackhawks. Yeah we don't fix our problems we just let 'em slide...... Careful Robert, Lib90 is an expert of aircraft and what they do in combat.", 
        "intTime": 20090409, 
        "postID": 40, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by liberal90: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. ever hear of the f-35? the f-22 is a terrible plane whose avionics package goes haywire in any combat situation and which lost all avionics when it crossed the international date line Oh yeah, kinda like the F-15 guys that shot down the Blackhawks. Yeah we don't fix our problems we just let 'em slide......", 
        "reply": " Careful Robert, Lib90 is an expert of aircraft and what they do in combat.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 05:44:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear...", 
        "intTime": 20090409, 
        "postID": 41, 
        "quote": "", 
        "reply": "There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear...", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 05:58:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear... They may or may not have known how the ship was flagged when they tried to take it. One pirate was captured by the crew and the rest are in a lifeboat, out of fuel, floating dead in the water between the cargo ship and a USN destroyer. You make it sound like these guys are on Al Jezeera parading their hostages around and demanding millions of dollars. Even if they were, what is your grand scheme? Napalm the Somali coast? Rome could go and murder an entire \"barbarian\" town if the whim struck them, which it often did. Where did that get them eventually? All those tribes united against them, invaded them, sacked Rome and forced most of the city's population to flee all the way to Africa. Everyone who was left after the Visigoths spent 3 days sacking the place, that is. If you are going to pick an example, pick a good one.", 
        "intTime": 20090409, 
        "postID": 42, 
        "quote": "Originally posted by threerings: There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear...", 
        "reply": " They may or may not have known how the ship was flagged when they tried to take it. One pirate was captured by the crew and the rest are in a lifeboat, out of fuel, floating dead in the water between the cargo ship and a USN destroyer. You make it sound like these guys are on Al Jezeera parading their hostages around and demanding millions of dollars. Even if they were, what is your grand scheme? Napalm the Somali coast? Rome could go and murder an entire \"barbarian\" town if the whim struck them, which it often did. Where did that get them eventually? All those tribes united against them, invaded them, sacked Rome and forced most of the city's population to flee all the way to Africa. Everyone who was left after the Visigoths spent 3 days sacking the place, that is. If you are going to pick an example, pick a good one.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 06:17:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by threerings: There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear... The romans also took slaves and fed minorities to the lions.", 
        "intTime": 20090409, 
        "postID": 43, 
        "quote": "Originally posted by threerings: There was a time when a roman citizen, about to be stoned to death by some barbarian mob, simply yelled: I was born a roman. And the mob feared to lift a finger against him. Because they knew the romans would unleash the hounds of hell on them. Now muslim pirates feel free to attack U.S. citizens under the banner of the U.S. flag without fear...", 
        "reply": " The romans also took slaves and fed minorities to the lions.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 06:20:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years.", 
        "intTime": 20090409, 
        "postID": 44, 
        "quote": "Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters.", 
        "reply": " Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 07:19:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by 9475297: The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run. Contractors have been screwing the government for the last 9 years! when Rumsfeld decided to have contractors do the jobs that soldiers would normally perform. I just got back from Afghanistan, and to pay a person $160.000 annually for working on MRAPs is unacceptable. Gotta agree with most of this. I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture.", 
        "intTime": 20090409, 
        "postID": 45, 
        "quote": "Originally posted by samh32: quote: Originally posted by 9475297: The majority of Gate's recommendations are helping Obama increase the size of the government. Another small step in Obama's conversion of America to socialism. I have worked on both sides, as a government employee and as a sub contractor to the government. The most efficient was the sub contractor and cheaper in the long run. Contractors have been screwing the government for the last 9 years! when Rumsfeld decided to have contractors do the jobs that soldiers would normally perform. I just got back from Afghanistan, and to pay a person $160.000 annually for working on MRAPs is unacceptable.", 
        "reply": " Gotta agree with most of this. I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 07:23:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture. I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented.", 
        "intTime": 20090409, 
        "postID": 46, 
        "quote": "Originally posted by sw614: I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture.", 
        "reply": " I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 10:00:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\" Yeah, well, if you're so great, how come you couldn't do a fly by without wrecking the plane? Man. You must be some kinda \"glass half empty guy.\" I brought most of the plane back!\"", 
        "intTime": 20090409, 
        "postID": 47, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\" Yeah, well, if you're so great, how come you couldn't do a fly by without wrecking the plane?", 
        "reply": " Man. You must be some kinda \"glass half empty guy.\" I brought most of the plane back!\"", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 11:09:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years. Yeah we really could have used the F (fighter) 22 in Iraq... The Iraqi air force posed such a threat.", 
        "intTime": 20090409, 
        "postID": 48, 
        "quote": "Originally posted by sw614: quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years.", 
        "reply": " Yeah we really could have used the F (fighter) 22 in Iraq... The Iraqi air force posed such a threat.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 12:52:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by sw614: quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years. Yeah we really could have used the F (fighter) 22 in Iraq... The Iraqi air force posed such a threat. The F-22 can drop JDAMs and SDBs. Plus its sensor can monitor a whole slew of things. The reason the Iraqi AF was not a threat was because air superiority fighters kicked their azzes the first time and they had no stomach for a second round of it. In case you haven't noticed, there are many acft deployed to Iraq and Afghanistan that have a \"F\" designation: F-15, F-16, F/A-18, etc. Seems to me they are all contributing one way or another along with some acft with \"B\" designations. But your hero SecDef Gates cancelled the follow-on bomber also. No US troops have come under air attack in over 56 years. I would think we would want to keep it that way. What is your grand scheme to replace our 20+ year old air superiority fighters? Yeah, he \"da man\". Oh, BTW - thanks for pointing out \"F\" stands for fighter. The entire 23 years I worked on acft I never knew that.....", 
        "intTime": 20090409, 
        "postID": 49, 
        "quote": "Originally posted by samh32: quote: Originally posted by sw614: quote: Originally posted by samh32: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. How many missions have the F-22 have flown over the last 7 years during OIF and OEF ? Like John Mccain said...Why does the president need 16 400 million dollar helicopters. Why did SecDef Gates refuse to allow the USAF to deploy it ot SWA? Can not fly mission if the DoD denies permission to deploy. And besides, the F-22 has not been operational for the entire 7 years. Yeah we really could have used the F (fighter) 22 in Iraq... The Iraqi air force posed such a threat.", 
        "reply": " The F-22 can drop JDAMs and SDBs. Plus its sensor can monitor a whole slew of things. The reason the Iraqi AF was not a threat was because air superiority fighters kicked their azzes the first time and they had no stomach for a second round of it. In case you haven't noticed, there are many acft deployed to Iraq and Afghanistan that have a \"F\" designation: F-15, F-16, F/A-18, etc. Seems to me they are all contributing one way or another along with some acft with \"B\" designations. But your hero SecDef Gates cancelled the follow-on bomber also. No US troops have come under air attack in over 56 years. I would think we would want to keep it that way. What is your grand scheme to replace our 20+ year old air superiority fighters? Yeah, he \"da man\". Oh, BTW - thanks for pointing out \"F\" stands for fighter. The entire 23 years I worked on acft I never knew that.....", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 14:23:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by sw614: I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture. I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented. Yes, I understand the economics of the reasoning and spreadsheets published by various sources seem to prove the concept. I just feel that having so much done by contractors takes something away from being military. At my first base (yeah, over 3 decades ago) there were very few civilians and details were the order of the day and the base felt like a community all its own. Toward the end of my career it seemed more of people just going to work and going home and when details came along, the whining was many times more than it should have been because they do it so little. I don't know, but there was more of the \"not my job\" mentality than when I first enlisted. Maybe its just nostalgia...but I liked it much better when a sharp looking GI was checking ID cards then when it is a civilian contractor.", 
        "intTime": 20090409, 
        "postID": 50, 
        "quote": "Originally posted by jwr6: quote: Originally posted by sw614: I groaned when Rumsfeld's name was announced as SecDef. I also didn't like the continual transfer of jobs and responsibilities from active duty to the private sector. GAO say it saves money in the long run. I say it is destroying the military culture. I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented.", 
        "reply": " Yes, I understand the economics of the reasoning and spreadsheets published by various sources seem to prove the concept. I just feel that having so much done by contractors takes something away from being military. At my first base (yeah, over 3 decades ago) there were very few civilians and details were the order of the day and the base felt like a community all its own. Toward the end of my career it seemed more of people just going to work and going home and when details came along, the whining was many times more than it should have been because they do it so little. I don't know, but there was more of the \"not my job\" mentality than when I first enlisted. Maybe its just nostalgia...but I liked it much better when a sharp looking GI was checking ID cards then when it is a civilian contractor.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 14:31:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jwr6: I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented. Costs less? They don't do it for cost. That's a given. If you have any long term data to support your conclusions I would certainly like to see it. Funding is funding is funding. The money is going somewhere. One less servicemember to benefit some profit oriented contractor?...No thanks. Keep it internal, i.e. all jobs military (with FEW minimal exceptions). As I recall, every \"military\" cook, mechanic, bookkeeper was also trained to shoot back which would seem to make your \"teeth\" comment moot when some civilian puke contractor doesn't know the business end of an M-16 from his rear. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090409, 
        "postID": 51, 
        "quote": "Originally posted by jwr6: I'm not sure I agree with part 2. It does cost less, even long term. Keep in mind that every mechanic or cook or electrician that is civ instead of military, you get to have a gunslinger instead of a support troop. Depending on how you look at it, increasing the \"teeth\" in proportion to \"tail\" (and our military had a LOT of tail for not much teeth) isn't a bad thing. Congress will only authorize so many active and reserve servicemembers. It's not a bad idea to increase the bang for your buck when deciding how many are going to be combat v/s support. The current culture is (and has been) to increase the combat capability of the military, without significantly increasing endstrngth. The only way to do this is reduce support functions and replace them with civilians...doesn't matter if they are contracted or DOD federal employees. Either way, it's a civilian doing the support work so more servicemembers can be combat-oriented.", 
        "reply": " Costs less? They don't do it for cost. That's a given. If you have any long term data to support your conclusions I would certainly like to see it. Funding is funding is funding. The money is going somewhere. One less servicemember to benefit some profit oriented contractor?...No thanks. Keep it internal, i.e. all jobs military (with FEW minimal exceptions). As I recall, every \"military\" cook, mechanic, bookkeeper was also trained to shoot back which would seem to make your \"teeth\" comment moot when some civilian puke contractor doesn't know the business end of an M-16 from his rear. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 15:12:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\" Yeah, well, if you're so great, how come you couldn't do a fly by without wrecking the plane? Man. You must be some kinda \"glass half empty guy.\" I brought most of the plane back!\" The way I see it, any landing you can walk away from, is a good landing.", 
        "intTime": 20090409, 
        "postID": 52, 
        "quote": "Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by SSgtRobertMorris: Yeah! Who needs a modern plane anyways? Give everybody Brewster Buffaloes. THAT'll teach folks to mess with us. Damn straight. I'm the best Brewster Buffalo pilot in the world right now! \"http://www.youtube.com/watch?v=oHJvvx6ljq4\" Yeah, well, if you're so great, how come you couldn't do a fly by without wrecking the plane? Man. You must be some kinda \"glass half empty guy.\" I brought most of the plane back!\"", 
        "reply": " The way I see it, any landing you can walk away from, is a good landing.", 
        "threadID": "409192893_3440071022001", 
        "time": "2009-04-09 18:33:00", 
        "title": "Secretary Gates is the man! Plans to axe the F-22 and Contractors!", 
        "userID": "EspritDeCorps"
    }
]