[
    {
        "content": "For the long version, read this .... My Personal Credit Crisis By EDMUND L. ANDREWS Published: May 14, 2009 If there was anybody who should have avoided the mortgage catastrophe, it was I. As an economics reporter for The New York Times, I have been the paper’s chief eyes and ears on the Federal Reserve for the past six years. I watched Alan Greenspan and his successor, Ben S. Bernanke, at close range. I wrote several early-warning articles in 2004 about the spike in go-go mortgages. Before that, I had a hand in covering the Asian financial crisis of 1997, the Russia meltdown in 1998 and the dot-com collapse in 2000. I know a lot about the curveballs that the economy can throw at us. But in 2004, I joined millions of otherwise-sane Americans in what we now know was a catastrophic binge on overpriced real estate and reckless mortgages. Nobody duped or hypnotized me. Like so many others — borrowers, lenders and the Wall Street dealmakers behind them — I just thought I could beat the odds. We all had our reasons. The brokers and dealmakers were scoring huge commissions. Ordinary homebuyers were stretching to get into first houses, or bigger houses, or better neighborhoods. Some were greedy, some were desperate and some were deceived. As for me, I had two utterly compelling reasons for taking the plunge: the money was there, and I was in love. It was August 2004, just as the mortgage party was getting really good. I was 48 years old and eager to start a new chapter in my life with Patricia Barreiro, who was then my fiancée. Patty was brainy, regal, sexy, fiery and eclectic. She was one of my closest friends when we were both students at an American high school in Argentina. Back then, we would talk together about politics and books at a coffee shop every day after school. We were not romantic in those days and went our separate ways after high school. But each of us would go through bruising two-decade-long marriages, and we felt that sweet spark of remembrance and renewal upon meeting again in middle age. After a one-year bicoastal courtship, Patty was about to move from her home in Los Angeles to Washington. We would need a home with enough space for her two youngest children, as well as for my own teenage boys on the weekends. I had assumed we would start by renting a house or an apartment, but it quickly became clear that it was almost easier to borrow a half-million dollars and buy something. Patty discovered a small but stately brick home in a leafy, kid-filled neighborhood in Silver Spring, Md. We sent in an offer of $460,000 and one day later got our answer: the sellers accepted. I felt both amazed and exhilarated, convinced that the stars had aligned for us. I loved the house as soon as I saw it. It was one block from a school and a park. My boys would be within a 15-minute drive, and it would be easy for them to come over and stay whenever they wanted. The only problem was money. Having separated from my wife of 21 years, who had physical custody of our sons, I was handing over $4,000 a month in alimony and child-support payments. That left me with take-home pay of $2,777, barely enough to make ends meet in a one-bedroom rental apartment. Patty had yet to even look for a job. At any other time in history, the idea of someone like me borrowing more than $400,000 would have seemed insane. But this was unlike any other time in history. My real estate agent gave me the number of Bob Andrews, a loan officer at American Home Mortgage Corporation. Bob wasn’t related to me, and I had never heard of his company. “Bob can be very helpful,” my agent explained. “He specializes in unusual situations.” Bob returned my call right away. “How big a mortgage do you think you’ll need?” he asked. “My situation is a little complicated,” I warned. I told him about my child support and alimony payments and said I was banking on Patty to earn enough money to keep us afloat. Bob cut me off. “I specialize in challenges,” he said confidently. As I quickly found out, American Home Mortgage had become one of the fastest-growing mortgage lenders in the country. One of its specialties was serving people just like me: borrowers with good credit scores who wanted to stretch their finances far beyond what our incomes could justify. In industry jargon, we were “Alt-A” customers, and we usually paid slightly higher rates for the privilege of concealing our financial weaknesses. I thought I knew a lot about go-go mortgages. I had already written several articles about the explosive growth of liar’s loans, no-money-down loans, interest-only loans and other even more exotic mortgages. I had interviewed people with very modest incomes who had taken out big loans. Yet for all that, I was stunned at how much money people were willing to throw at me. Bob called back the next morning. “Your credit scores are almost perfect,” he said happily. “Based on your income, you can qualify for a mortgage of about $500,000.” What about my alimony and child-support obligations? No need to mention them. What would happen when they saw the automatic withholdings in my paycheck? No need to show them. If I wanted to buy a house, Bob figured, it was my job to decide whether I could afford it. His job was to make it happen. “I am here to enable dreams,” he explained to me long afterward. Bob’s view was that if I’d been unemployed for seven years and didn’t have a dime to my name but I wanted a house, he wouldn’t question my prudence. “Who am I to tell you that you shouldn’t do what you want to do? I am here to sell money and to help you do what you want to do. At the end of the day, it’s your signature on the mortgage — not mine.” You had to admire this muscular logic. My lenders weren’t assuming that I was an angel. They were betting that a default would be more painful to me than to them. If I wanted to take a risk, for whatever reason, they were not going to second-guess me. What mattered more than anything, Bob explained, was a person’s credit record. History seemed to show that the most important predictor of whether people defaulted on their mortgages was their “FICO” score (named after the Fair Isaac Corporation, which developed the main rating system). If you always paid your debts on time before, the theory went, you would probably keep paying on time in the future. Bob’s original plan was to write two mortgages, one for 80 percent of the purchase price and a piggyback loan for 10 percent. I would kick in the final 10 percent, cashing out a chunk of New York Times stock — my last. If I had been a normal borrower, the whole deal would have sailed through at a low interest rate. My $120,000 base salary and my assets were easy to document. But given my actual income after alimony and child support, I couldn’t possibly have qualified for a standard mortgage. Bob’s plan was to write a “stated-income loan,” or “liar’s loan,” so that I wouldn’t have to give the game away by producing paychecks or tax returns. Unfortunately, Bob’s plan hit a snag a few days later. “Ed, the underwriters say that your name is on another mortgage,” he told me. “That means you’re carrying too much debt.” The mortgage was on my old house, which I had turned over to my ex-wife. As part of our separation agreement, she accepted full legal responsibility for making the payments. But the separation agreement also spelled out exactly how much I had to pay each month to my ex-wife. If we showed it to the underwriters, they would reject me. Bob didn’t get flustered. If Plan A didn’t work, he would simply move down another step on the ladder of credibility. Instead of “stating” my income without documenting it, I would take out a “no ratio” mortgage and not state my income at all. For the price of a slightly higher interest rate, American Home would verify my assets, but that was it. Because I wasn’t stating my income, I couldn’t have a debt-to-income ratio, and therefore, I couldn’t have too much debt. I could have had four other mortgages, and it wouldn’t have mattered. American Home was practically begging me to take the money. Despite the obvious red flag of applying for a Don’t Ask, Don’t Tell loan, I wasn’t paying that much for the money. The rate on my primary mortgage of $333,700 was a remarkably low 5.625 percent for the first five years, though my monthly payments would probably jump substantially after the fifth year. On top of that, I was paying a much higher rate of 8.5 percent on my “piggyback” loan for $80,300. Even so, I would be paying slightly more than $2,500 a month for the first five years. It would get expensive eventually, but I could worry about that later. “Don’t worry,” Bob reassured me, saying what almost everybody else in real estate was saying at that moment. “The value of your house will be higher in five years. You’ll be able to refinance.” As I walked out of the settlement office with my loan papers, I couldn’t shake the sense of having just done something bad . . . but also kind of cool. I had just come up with almost a half-million dollars, and I had barely lifted a finger. It had been so easy and fast. Almost fun. I couldn’t help feeling like a high roller, a sophisticated player who could lay his hands on big money at a moment’s notice. Despite my nagging anxiety about the gamble that Patty and I were taking, I had whipped through the pile of loan documents in less than 45 minutes. The icy slap of reality hit me two weeks after New Year’s Day in January 2005. We had been living in our new house for five months. I walked out of The Times’s Washington bureau, several blocks from the White House, and crossed Farragut Square to my bank. I had a bad feeling about what the A.T.M. would reveal about my balance, but I was shocked when I looked at the receipt: $196. We were broke. My stomach churning, I reached Patty on her cellphone as she was running errands. “We are out of money,” I snapped, skipping over any warm-up chat. “What do you mean, we’re out of money?” she asked in bewilderment. “I mean, I just checked my bank account, and we are out of money,” I repeated, my voice rising in panic. “We can’t buy anything!” My next paycheck would come in about a day or so, but that was entirely reserved for the February mortgage payment. We didn’t have enough cash to cover more than a week’s worth of groceries and gasoline. For the last few months we were living off the cash left over after I sold my Times stock and we bought the house. But now it was gone. “How the hell could we have run through so much money so quickly?” I asked her accusingly. Patty wasn’t sharing my shock. “I don’t know what’s going on,” she responded. “Let’s talk about it when you get home.” Patty had spent much of the two previous decades as a stay-at-home mother in Los Angeles. Her last full-time job, as an editor at a political research company, was back in the early 1980s. Not surprisingly, Patty’s re-entry into the job market was bumpy. When Saks Fifth Avenue offered her a full-time job selling high-end clothing on commission — something she knew about and loved — she grabbed it. But with her take-home income averaging only about $2,400 a month, we didn’t make enough to cover our bills because my take-home pay was going straight to the mortgage. We were spending way more than we were earning. In the euphoria of moving in together, we both succumbed to magical thinking about ourselves, as well as about money. My fantasy was that Patty would become an ambitious go-getter. “This can really be an exciting new chapter of your life,” I kept telling her. Patty had a very different dream. “I feel as if I am finally at home,” she exclaimed as soon as we moved into the house. She could settle down and do the things she had always been best at: making a new home, nurturing her children and loving me. One way or another, she figured, we would earn enough money to make good on our glorious gamble. We had very different ideas about money. Patty spent little on herself, but she refused to scrimp on top-quality produce, Starbucks coffee, bottled juices, fresh cheeses and clothing for the children and for me. She regularly bought me new shirts and ties to replace the frayed and drab ones in my closet. She thought it wasn’t worth agonizing over nickels and dimes. I was almost exactly the opposite. My answer to any money squeeze was to stop spending. I would skip lunch at work to save $7. If I arrived at the Metro just before the end of rush hour, I would wait for five minutes to save 50 cents on the fare. We were both building up grudges. “You can’t keep second-guessing me,” she told me angrily. “It’s small-minded and petty, and it’s not very attractive.” I was beginning to wonder whether she had any clue about how money worked. We were lurching from paycheck to paycheck, one big home repair away from disaster. Meanwhile, neither of us was paying attention to how easy our bank had made it to build up debt. The key was the overdraft protection — more accurately described as “bounced-check loans.” Every time I overdrew my checking account by even a few dollars, the bank would tap my MasterCard for $100, helpfully deposit the cash in my account and charge me $10 for the privilege. Patty and I were now unwittingly tapping into our credit line at a terrifying pace: $5 overdrawn because of school supplies for Patty’s daughter Emily — $100 from the MasterCard. Fifteen bucks over because of gasoline? Another $100 from the MasterCard. Groceries for $305? No problem! Uncle MasterCard would front us $400. Our debt spiraled up faster than I had ever dreamed possible. Chase Bank had cold-called me to offer a “platinum” card with no interest charges for the first six months. I took them up on it and shifted $3,000 in debt from my old card onto the new Chase card. But instead of paying down the balance before the interest charges began, I let it balloon to $6,000. Chase had sent us blank checks that we could use to either pay bills or give ourselves cash advances. I dismissed them as a cheap trick to lure dimwits into borrowing more money. In March, I grabbed one of the checks and used it to pay down $1,000 on my more expensive credit card. I felt like a crack addict calling up my dealer. It was April 2006, and I had just reached Bob Andrews, our once and future mortgage broker, on his cellphone. I was surprised at how glad I was to hear his voice. In his own way, Bob knew more about my messy life than almost anybody else. He never seemed judgmental or condescending. Instead, he seemed to think that money trouble and failed marriages were natural parts of life, even for good people with decent jobs. I felt relieved to have the chance to unload my problems and ask for his advice. “Bob, we’re dying over here,” I wailed. “I can’t even explain how it happened, but we’ve got these unbelievable credit-card bills, and the minimum payments add up to almost $1,100 a month. There’s no way we can keep that up.” I had months and months of credit-card bills spread across the dining-room table, and I quickly confessed the full horror of what they contained. We were approaching $50,000 in credit-card debt alone, and it was amazing how fast and how deeply we had dug ourselves in. It was even more amazing how long we had avoided the screaming evidence of a train wreck in the making. Patty had suddenly got the break that seemed to solve our problems. In November 2005, she was hired as a full-time editor at a nonprofit organization with a salary of $60,000 a year. The problem, I told Bob, was that things were so bad that even Patty’s new job wouldn’t be enough to rescue us. Chase was now charging us 13.99 percent on our platinum card, and the rate on our SunTrust card was up to 27 percent. Between humongous loan balances and high rates, we had hung ourselves with the rope they gave us. In the previous December alone, we charged $2,845 on the Chase card for Christmas gifts, food, gasoline, clothing and other expenses. The charges included almost $350 for groceries, $700 in clothes from J. Crew, $179 at GapKids and $700 for airplane tickets for two of Patty’s children to visit their father in Los Angeles. Our balance climbed from $14,118 to $17,135, and in January 2006 we maxed out at our $19,000 credit limit. And there were other expenses on other cards: $1,200 in dental work for Patty’s son Ben; $1,600 to rent a beach house the previous year for us and all the children. Granted, the beach house was an embarrassing mistake. But given that Patty had landed a solid job, it seemed like an indulgence we could work off later. I felt foolish, ashamed and angry as I confessed to Bob. Why had I been trying to live a lifestyle that I couldn’t afford? Why had I tried to keep up the image of a conventional suburban family man, when nothing about my situation was conventional? How could I have glossed over the fact that we had been spending about $3,000 more than we were earning, month after month after month? How could a person who wrote about economics for a living fall into the kind of credit-card trap that consumer groups had warned about for years? “My inclination is to just raid my 401(k) account to pay off the cards,” I told Bob. “I know we’d be paying huge taxes and penalties for withdrawing money before retirement, but it’s not as bad as paying all that interest to the banks.” “No!” Bob interrupted fiercely. “You don’t want to do that. You’ll be paying a basic tax rate of 28 percent, and they’ll hit you with another 10 percent penalty. You’d be giving up 40 percent in taxes. There’s got to be a better way.” I gave Bob permission to pull a credit report on us, and by the next day, he had come up with a scheme that was either wickedly smart or proof that the big-money people had gone mad. Or both. “What we’re going to do is a two-step plan,” he announced. “The bad news is that your credit scores are down, so we can’t just do a simple refinance. But the good news is that you’ve owned your house for a year and a half, and it’s gone up in value. So you can borrow against the equity. So in the first step of the plan, we’re going to get you a really ugly mortgage that is big enough to pay off all your credit cards.” “O.K., I’m with you so far,” I said uncertainly. “Now, because this mortgage is really ugly, your monthly payments will jump to about $3,700. But don’t worry about it, because you’re only going to stay in it for about three months. Once we pay off your credit cards, your credit scores will go up and we can get you a cheaper loan.” The way Bob figured it, my monthly payment would be down to about $3,200 by the fall. The new mortgage would be nearly $700 more than my current mortgage because it would include all my credit-card debt, but it would be at least $500 a month less than the combined total of what I was paying on everything right then. And mortgage interest, unlike interest on credit-card debt, is entirely tax-deductible. The whole plan worked exactly as Bob had predicted. Within a few weeks, an appraiser valued our house at $505,000, almost 10 percent above the original purchase price two years earlier. On June 12, Patty and I signed a new mortgage for $472,000 with Fremont Investment and Loan in Santa Monica, Calif. Fremont gave us a classic subprime loan. Our monthly payment jumped to $3,700 from $2,500. If we kept the mortgage for two years, the interest rate would jump as high as 11.5 percent, and the monthly payments would ratchet up to as high as $4,500. The paperwork was so confusing that I was never exactly sure who was paying what. I hazily understood that I was paying most of the fees, one way or another, but I couldn’t figure out how, and I couldn’t see any better alternatives. After it was all over, I figured we had paid about $5,800 in fees to Bob’s mortgage company and the settlement company, on top of the sales commission that came out in higher interest rates every month. But Patty and I paid off our credit cards, and my credit scores jumped. In October 2006, Bob refinanced us once again, and our payments dropped just as he had predicted. We were still loaded with debt, but we weren’t paying 27 percent interest rates on our credit cards. Patty was earning a solid salary, and I was earning extra money working overtime at The Times. If we were careful, we could meet our monthly expenses, chip away at our debt and even go out to dinner once in a while. Our brief interlude of optimism and peace ended on Oct. 10, 2006, when Patty lost her job. “Don’t worry,” she said bravely. “This will not be like the first time I was looking for a job. I’ve learned so much since then, and I am going to find another job quickly.” In the meantime, she said, she could collect unemployment for six months. She would also cash out her retirement account, which had about $7,000 in it. By any measure, the loss of Patty’s job was a financial catastrophe. We hadn’t yet gone more than 30 days delinquent on the mortgage, thanks, in part, to $15,000 I had borrowed shamefacedly from my mother after Patty stopped working. But we were behind on everything else. Bill collectors were calling six days a week, starting promptly at 8 a.m. “Telemarketers,” I would mumble when my son Matthew asked why we got so many robocalls from 800 numbers. Our stately little house looked increasingly trashy: peeling paint and broken screens on the front windows, crumbling concrete on the front stoop, a lawn that was mostly crabgrass. The furniture that Patty salvaged from her first marriage was falling apart. The cotton slipcovers on the sofa and armchair were in shreds. The frosted-crystal shade on a beloved Italian floor lamp was cracked. The dog had gnawed the leg on her Biedermeier chair. The panic attack hit me around 2 a.m. on Patty’s birthday. It was Oct. 17, 2007, and I was lying in bed obsessing over bills that couldn’t be postponed and the money we didn’t have to pay them. Like many of my predawn fear cascades, this one had its start with a specific unpaid bill: $240 in traffic tickets — $140 for speeding, $50 each for expired tags and inspection. The fines would double if we didn’t pay them in less than a week. The tickets had uncorked the bottle on all the other “must pays”: the $400 electric bill with the cutoff date printed in red; the $220 cable/telephone/Internet bill for the past two months; the MasterCard and American Express bills — at least one of which had to be brought current or I wouldn’t even be able to travel for work. And of course, there was the $3,271 mortgage payment. My panic circuitry was in fine form, connecting small debts to big ones, short-term problems to the bottomless abyss, private calamity to public shame. Once Patty was asleep and I was alone in the dark, the bottled-up fear reached the surface. I tossed from side to side, trying to figure out at least a triage plan for our bills. I was too fidgety to lie still in bed, but I was in no mood to actually sit down with the bills themselves. I climbed out of bed for a moment, then jumped back in. I couldn’t decide if I would rather feel confined or all alone. Patty woke up, irritated by all my movement and my occasional moans of despair. “What’s the matter?” she asked. “I can’t sleep,” I answered. “I’m panicking about money, because I don’t know how we’re going to pay all the bills that need to be paid right now.” I wanted her to take me in her arms and reassure me that everything would be O.K. But that wasn’t happening. “There’s nothing you can do about it right now,” she answered sleepily. “If this keeps on, we’re going to lose the house,” I persisted, sounding less panicked than petulant. If Patty wouldn’t give me comfort, then I wanted her to suffer alongside me. “I don’t know how we’re going to make it. We can’t go on like this.” Patty had begged me to grant her a birthday reprieve from my nagging and kvetching over money issues. What I saw as an uncontrollable moment of panic, she saw as another deliberate attempt to browbeat her. “I can’t believe you are doing this to me on my birthday,” she hissed in fury. “All I asked for was one day of peace — one day when you weren’t beating me over the head. And here it is, not even daylight yet, and you’re waking me up to berate me about money.” “Son of a *****, what did I do to you?” I asked, punching my pillow in the dark. “Do you think I enjoy having a panic attack? I can’t help what I’m feeling. I’m just scared out of my mind.” “That’s it!” Patty snapped, getting out of bed and pulling on her robe. “I’m not going to listen to any more of this. I’m going to sleep downstairs.” In the morning, she let me have it. “You lied to me,” she told me as I got coffee. “You said that what I saw on the outside was pretty much what you were. But you’re completely different. If I had known what you were really like, I would never have come out here.” Patty and I were hurtling toward bottom. We had been under so much strain for so long that we were often at each other’s throats, jeopardizing the love that brought us together in the first place. In November, four years after buying the house, we finally crossed our personal Rubicon and fell 30 days behind on our mortgage. “The last thing Chase wants is to foreclose on your home,” JPMorgan Chase wrote us. It assured us that it wanted to “help” and was willing to evaluate us for a number of “alternatives.” If we didn’t “resolve” our payment delinquency, it politely warned, “you will lose your home.” *** I took a certain pride that I outlasted two of my three mortgage lenders. American Home, my original lender, collapsed overnight when the financial markets first froze up in August 2007. Fremont, my second lender, was forced out of the mortgage business by federal regulators. That left me with JPMorgan Chase, one of the few big banks smart enough to sell off most of the subprime loans it financed. It still serviced my loan, but it wasn’t on the hook if I defaulted. By the time that Patty and I fell behind, the rest of the world was falling apart so fast that Chase barely had time for us. Bear Stearns and Lehman Brothers were gone. American International Group, one of the world’s biggest insurance conglomerates, received the biggest taxpayer-financed bailout in history. Citigroup was a zombie bank. All of them were brought down by the same mortgage madness that infected me. When I first called Chase in October, a representative named Sarah said I didn’t qualify for a loan modification because I wasn’t yet 90 days past due. The only “loan modification” she could offer me was a “repayment plan” under which I paid $400 more per month for six months until I was current again. “It sounds as if I would be better off waiting to fall 90 days behind,” I said. “I think I’ll wait for that.” It took a while, but Patty and I found we could get past blaming each other. We had seen each other’s worst sides, but we were still together, and that helped us to get closer. We started listening to each other. Patty began to find her way in the work world, and I was learning that I didn’t have all the answers. And we saw how our children were thriving. My three sons transferred to schools in our neighborhood and made scores of friends. Emily, Patty’s daughter, was a sparkling 10-year-old who loved her home and her school as well as all her brothers. Even if we lost the house, we had gained in other ways. I called Chase back in January, when I was 90 days past due. Another representative told me that I would automatically be evaluated for a loan modification. “You should just wait until you hear from one of our negotiators,” he told me politely. Another two months passed without anyone calling, so I tried again in late March. “I’m sorry, but our analysts have been backed up,” yet another Chase rep told me, even more politely than the previous one. She said each analyst had about 500 distressed borrowers to deal with, and it had been taking about five weeks for customers to get a direct response. The delays seemed to be getting longer. I was actually beginning to feel sorry for Chase. It seemed to be so flooded with defaulting borrowers that it didn’t have time to foreclose on my house. Eight months after my last payment to the bank, I am still waiting for the ax to fall. nytimes.com/2009/05/17/magazine/17foreclosure-t.html?pagewanted=6&_r=1", 
        "intTime": 20090518, 
        "postID": 1, 
        "quote": "", 
        "reply": "For the long version, read this .... My Personal Credit Crisis By EDMUND L. ANDREWS Published: May 14, 2009 If there was anybody who should have avoided the mortgage catastrophe, it was I. As an economics reporter for The New York Times, I have been the paper’s chief eyes and ears on the Federal Reserve for the past six years. I watched Alan Greenspan and his successor, Ben S. Bernanke, at close range. I wrote several early-warning articles in 2004 about the spike in go-go mortgages. Before that, I had a hand in covering the Asian financial crisis of 1997, the Russia meltdown in 1998 and the dot-com collapse in 2000. I know a lot about the curveballs that the economy can throw at us. But in 2004, I joined millions of otherwise-sane Americans in what we now know was a catastrophic binge on overpriced real estate and reckless mortgages. Nobody duped or hypnotized me. Like so many others — borrowers, lenders and the Wall Street dealmakers behind them — I just thought I could beat the odds. We all had our reasons. The brokers and dealmakers were scoring huge commissions. Ordinary homebuyers were stretching to get into first houses, or bigger houses, or better neighborhoods. Some were greedy, some were desperate and some were deceived. As for me, I had two utterly compelling reasons for taking the plunge: the money was there, and I was in love. It was August 2004, just as the mortgage party was getting really good. I was 48 years old and eager to start a new chapter in my life with Patricia Barreiro, who was then my fiancée. Patty was brainy, regal, sexy, fiery and eclectic. She was one of my closest friends when we were both students at an American high school in Argentina. Back then, we would talk together about politics and books at a coffee shop every day after school. We were not romantic in those days and went our separate ways after high school. But each of us would go through bruising two-decade-long marriages, and we felt that sweet spark of remembrance and renewal upon meeting again in middle age. After a one-year bicoastal courtship, Patty was about to move from her home in Los Angeles to Washington. We would need a home with enough space for her two youngest children, as well as for my own teenage boys on the weekends. I had assumed we would start by renting a house or an apartment, but it quickly became clear that it was almost easier to borrow a half-million dollars and buy something. Patty discovered a small but stately brick home in a leafy, kid-filled neighborhood in Silver Spring, Md. We sent in an offer of $460,000 and one day later got our answer: the sellers accepted. I felt both amazed and exhilarated, convinced that the stars had aligned for us. I loved the house as soon as I saw it. It was one block from a school and a park. My boys would be within a 15-minute drive, and it would be easy for them to come over and stay whenever they wanted. The only problem was money. Having separated from my wife of 21 years, who had physical custody of our sons, I was handing over $4,000 a month in alimony and child-support payments. That left me with take-home pay of $2,777, barely enough to make ends meet in a one-bedroom rental apartment. Patty had yet to even look for a job. At any other time in history, the idea of someone like me borrowing more than $400,000 would have seemed insane. But this was unlike any other time in history. My real estate agent gave me the number of Bob Andrews, a loan officer at American Home Mortgage Corporation. Bob wasn’t related to me, and I had never heard of his company. “Bob can be very helpful,” my agent explained. “He specializes in unusual situations.” Bob returned my call right away. “How big a mortgage do you think you’ll need?” he asked. “My situation is a little complicated,” I warned. I told him about my child support and alimony payments and said I was banking on Patty to earn enough money to keep us afloat. Bob cut me off. “I specialize in challenges,” he said confidently. As I quickly found out, American Home Mortgage had become one of the fastest-growing mortgage lenders in the country. One of its specialties was serving people just like me: borrowers with good credit scores who wanted to stretch their finances far beyond what our incomes could justify. In industry jargon, we were “Alt-A” customers, and we usually paid slightly higher rates for the privilege of concealing our financial weaknesses. I thought I knew a lot about go-go mortgages. I had already written several articles about the explosive growth of liar’s loans, no-money-down loans, interest-only loans and other even more exotic mortgages. I had interviewed people with very modest incomes who had taken out big loans. Yet for all that, I was stunned at how much money people were willing to throw at me. Bob called back the next morning. “Your credit scores are almost perfect,” he said happily. “Based on your income, you can qualify for a mortgage of about $500,000.” What about my alimony and child-support obligations? No need to mention them. What would happen when they saw the automatic withholdings in my paycheck? No need to show them. If I wanted to buy a house, Bob figured, it was my job to decide whether I could afford it. His job was to make it happen. “I am here to enable dreams,” he explained to me long afterward. Bob’s view was that if I’d been unemployed for seven years and didn’t have a dime to my name but I wanted a house, he wouldn’t question my prudence. “Who am I to tell you that you shouldn’t do what you want to do? I am here to sell money and to help you do what you want to do. At the end of the day, it’s your signature on the mortgage — not mine.” You had to admire this muscular logic. My lenders weren’t assuming that I was an angel. They were betting that a default would be more painful to me than to them. If I wanted to take a risk, for whatever reason, they were not going to second-guess me. What mattered more than anything, Bob explained, was a person’s credit record. History seemed to show that the most important predictor of whether people defaulted on their mortgages was their “FICO” score (named after the Fair Isaac Corporation, which developed the main rating system). If you always paid your debts on time before, the theory went, you would probably keep paying on time in the future. Bob’s original plan was to write two mortgages, one for 80 percent of the purchase price and a piggyback loan for 10 percent. I would kick in the final 10 percent, cashing out a chunk of New York Times stock — my last. If I had been a normal borrower, the whole deal would have sailed through at a low interest rate. My $120,000 base salary and my assets were easy to document. But given my actual income after alimony and child support, I couldn’t possibly have qualified for a standard mortgage. Bob’s plan was to write a “stated-income loan,” or “liar’s loan,” so that I wouldn’t have to give the game away by producing paychecks or tax returns. Unfortunately, Bob’s plan hit a snag a few days later. “Ed, the underwriters say that your name is on another mortgage,” he told me. “That means you’re carrying too much debt.” The mortgage was on my old house, which I had turned over to my ex-wife. As part of our separation agreement, she accepted full legal responsibility for making the payments. But the separation agreement also spelled out exactly how much I had to pay each month to my ex-wife. If we showed it to the underwriters, they would reject me. Bob didn’t get flustered. If Plan A didn’t work, he would simply move down another step on the ladder of credibility. Instead of “stating” my income without documenting it, I would take out a “no ratio” mortgage and not state my income at all. For the price of a slightly higher interest rate, American Home would verify my assets, but that was it. Because I wasn’t stating my income, I couldn’t have a debt-to-income ratio, and therefore, I couldn’t have too much debt. I could have had four other mortgages, and it wouldn’t have mattered. American Home was practically begging me to take the money. Despite the obvious red flag of applying for a Don’t Ask, Don’t Tell loan, I wasn’t paying that much for the money. The rate on my primary mortgage of $333,700 was a remarkably low 5.625 percent for the first five years, though my monthly payments would probably jump substantially after the fifth year. On top of that, I was paying a much higher rate of 8.5 percent on my “piggyback” loan for $80,300. Even so, I would be paying slightly more than $2,500 a month for the first five years. It would get expensive eventually, but I could worry about that later. “Don’t worry,” Bob reassured me, saying what almost everybody else in real estate was saying at that moment. “The value of your house will be higher in five years. You’ll be able to refinance.” As I walked out of the settlement office with my loan papers, I couldn’t shake the sense of having just done something bad . . . but also kind of cool. I had just come up with almost a half-million dollars, and I had barely lifted a finger. It had been so easy and fast. Almost fun. I couldn’t help feeling like a high roller, a sophisticated player who could lay his hands on big money at a moment’s notice. Despite my nagging anxiety about the gamble that Patty and I were taking, I had whipped through the pile of loan documents in less than 45 minutes. The icy slap of reality hit me two weeks after New Year’s Day in January 2005. We had been living in our new house for five months. I walked out of The Times’s Washington bureau, several blocks from the White House, and crossed Farragut Square to my bank. I had a bad feeling about what the A.T.M. would reveal about my balance, but I was shocked when I looked at the receipt: $196. We were broke. My stomach churning, I reached Patty on her cellphone as she was running errands. “We are out of money,” I snapped, skipping over any warm-up chat. “What do you mean, we’re out of money?” she asked in bewilderment. “I mean, I just checked my bank account, and we are out of money,” I repeated, my voice rising in panic. “We can’t buy anything!” My next paycheck would come in about a day or so, but that was entirely reserved for the February mortgage payment. We didn’t have enough cash to cover more than a week’s worth of groceries and gasoline. For the last few months we were living off the cash left over after I sold my Times stock and we bought the house. But now it was gone. “How the hell could we have run through so much money so quickly?” I asked her accusingly. Patty wasn’t sharing my shock. “I don’t know what’s going on,” she responded. “Let’s talk about it when you get home.” Patty had spent much of the two previous decades as a stay-at-home mother in Los Angeles. Her last full-time job, as an editor at a political research company, was back in the early 1980s. Not surprisingly, Patty’s re-entry into the job market was bumpy. When Saks Fifth Avenue offered her a full-time job selling high-end clothing on commission — something she knew about and loved — she grabbed it. But with her take-home income averaging only about $2,400 a month, we didn’t make enough to cover our bills because my take-home pay was going straight to the mortgage. We were spending way more than we were earning. In the euphoria of moving in together, we both succumbed to magical thinking about ourselves, as well as about money. My fantasy was that Patty would become an ambitious go-getter. “This can really be an exciting new chapter of your life,” I kept telling her. Patty had a very different dream. “I feel as if I am finally at home,” she exclaimed as soon as we moved into the house. She could settle down and do the things she had always been best at: making a new home, nurturing her children and loving me. One way or another, she figured, we would earn enough money to make good on our glorious gamble. We had very different ideas about money. Patty spent little on herself, but she refused to scrimp on top-quality produce, Starbucks coffee, bottled juices, fresh cheeses and clothing for the children and for me. She regularly bought me new shirts and ties to replace the frayed and drab ones in my closet. She thought it wasn’t worth agonizing over nickels and dimes. I was almost exactly the opposite. My answer to any money squeeze was to stop spending. I would skip lunch at work to save $7. If I arrived at the Metro just before the end of rush hour, I would wait for five minutes to save 50 cents on the fare. We were both building up grudges. “You can’t keep second-guessing me,” she told me angrily. “It’s small-minded and petty, and it’s not very attractive.” I was beginning to wonder whether she had any clue about how money worked. We were lurching from paycheck to paycheck, one big home repair away from disaster. Meanwhile, neither of us was paying attention to how easy our bank had made it to build up debt. The key was the overdraft protection — more accurately described as “bounced-check loans.” Every time I overdrew my checking account by even a few dollars, the bank would tap my MasterCard for $100, helpfully deposit the cash in my account and charge me $10 for the privilege. Patty and I were now unwittingly tapping into our credit line at a terrifying pace: $5 overdrawn because of school supplies for Patty’s daughter Emily — $100 from the MasterCard. Fifteen bucks over because of gasoline? Another $100 from the MasterCard. Groceries for $305? No problem! Uncle MasterCard would front us $400. Our debt spiraled up faster than I had ever dreamed possible. Chase Bank had cold-called me to offer a “platinum” card with no interest charges for the first six months. I took them up on it and shifted $3,000 in debt from my old card onto the new Chase card. But instead of paying down the balance before the interest charges began, I let it balloon to $6,000. Chase had sent us blank checks that we could use to either pay bills or give ourselves cash advances. I dismissed them as a cheap trick to lure dimwits into borrowing more money. In March, I grabbed one of the checks and used it to pay down $1,000 on my more expensive credit card. I felt like a crack addict calling up my dealer. It was April 2006, and I had just reached Bob Andrews, our once and future mortgage broker, on his cellphone. I was surprised at how glad I was to hear his voice. In his own way, Bob knew more about my messy life than almost anybody else. He never seemed judgmental or condescending. Instead, he seemed to think that money trouble and failed marriages were natural parts of life, even for good people with decent jobs. I felt relieved to have the chance to unload my problems and ask for his advice. “Bob, we’re dying over here,” I wailed. “I can’t even explain how it happened, but we’ve got these unbelievable credit-card bills, and the minimum payments add up to almost $1,100 a month. There’s no way we can keep that up.” I had months and months of credit-card bills spread across the dining-room table, and I quickly confessed the full horror of what they contained. We were approaching $50,000 in credit-card debt alone, and it was amazing how fast and how deeply we had dug ourselves in. It was even more amazing how long we had avoided the screaming evidence of a train wreck in the making. Patty had suddenly got the break that seemed to solve our problems. In November 2005, she was hired as a full-time editor at a nonprofit organization with a salary of $60,000 a year. The problem, I told Bob, was that things were so bad that even Patty’s new job wouldn’t be enough to rescue us. Chase was now charging us 13.99 percent on our platinum card, and the rate on our SunTrust card was up to 27 percent. Between humongous loan balances and high rates, we had hung ourselves with the rope they gave us. In the previous December alone, we charged $2,845 on the Chase card for Christmas gifts, food, gasoline, clothing and other expenses. The charges included almost $350 for groceries, $700 in clothes from J. Crew, $179 at GapKids and $700 for airplane tickets for two of Patty’s children to visit their father in Los Angeles. Our balance climbed from $14,118 to $17,135, and in January 2006 we maxed out at our $19,000 credit limit. And there were other expenses on other cards: $1,200 in dental work for Patty’s son Ben; $1,600 to rent a beach house the previous year for us and all the children. Granted, the beach house was an embarrassing mistake. But given that Patty had landed a solid job, it seemed like an indulgence we could work off later. I felt foolish, ashamed and angry as I confessed to Bob. Why had I been trying to live a lifestyle that I couldn’t afford? Why had I tried to keep up the image of a conventional suburban family man, when nothing about my situation was conventional? How could I have glossed over the fact that we had been spending about $3,000 more than we were earning, month after month after month? How could a person who wrote about economics for a living fall into the kind of credit-card trap that consumer groups had warned about for years? “My inclination is to just raid my 401(k) account to pay off the cards,” I told Bob. “I know we’d be paying huge taxes and penalties for withdrawing money before retirement, but it’s not as bad as paying all that interest to the banks.” “No!” Bob interrupted fiercely. “You don’t want to do that. You’ll be paying a basic tax rate of 28 percent, and they’ll hit you with another 10 percent penalty. You’d be giving up 40 percent in taxes. There’s got to be a better way.” I gave Bob permission to pull a credit report on us, and by the next day, he had come up with a scheme that was either wickedly smart or proof that the big-money people had gone mad. Or both. “What we’re going to do is a two-step plan,” he announced. “The bad news is that your credit scores are down, so we can’t just do a simple refinance. But the good news is that you’ve owned your house for a year and a half, and it’s gone up in value. So you can borrow against the equity. So in the first step of the plan, we’re going to get you a really ugly mortgage that is big enough to pay off all your credit cards.” “O.K., I’m with you so far,” I said uncertainly. “Now, because this mortgage is really ugly, your monthly payments will jump to about $3,700. But don’t worry about it, because you’re only going to stay in it for about three months. Once we pay off your credit cards, your credit scores will go up and we can get you a cheaper loan.” The way Bob figured it, my monthly payment would be down to about $3,200 by the fall. The new mortgage would be nearly $700 more than my current mortgage because it would include all my credit-card debt, but it would be at least $500 a month less than the combined total of what I was paying on everything right then. And mortgage interest, unlike interest on credit-card debt, is entirely tax-deductible. The whole plan worked exactly as Bob had predicted. Within a few weeks, an appraiser valued our house at $505,000, almost 10 percent above the original purchase price two years earlier. On June 12, Patty and I signed a new mortgage for $472,000 with Fremont Investment and Loan in Santa Monica, Calif. Fremont gave us a classic subprime loan. Our monthly payment jumped to $3,700 from $2,500. If we kept the mortgage for two years, the interest rate would jump as high as 11.5 percent, and the monthly payments would ratchet up to as high as $4,500. The paperwork was so confusing that I was never exactly sure who was paying what. I hazily understood that I was paying most of the fees, one way or another, but I couldn’t figure out how, and I couldn’t see any better alternatives. After it was all over, I figured we had paid about $5,800 in fees to Bob’s mortgage company and the settlement company, on top of the sales commission that came out in higher interest rates every month. But Patty and I paid off our credit cards, and my credit scores jumped. In October 2006, Bob refinanced us once again, and our payments dropped just as he had predicted. We were still loaded with debt, but we weren’t paying 27 percent interest rates on our credit cards. Patty was earning a solid salary, and I was earning extra money working overtime at The Times. If we were careful, we could meet our monthly expenses, chip away at our debt and even go out to dinner once in a while. Our brief interlude of optimism and peace ended on Oct. 10, 2006, when Patty lost her job. “Don’t worry,” she said bravely. “This will not be like the first time I was looking for a job. I’ve learned so much since then, and I am going to find another job quickly.” In the meantime, she said, she could collect unemployment for six months. She would also cash out her retirement account, which had about $7,000 in it. By any measure, the loss of Patty’s job was a financial catastrophe. We hadn’t yet gone more than 30 days delinquent on the mortgage, thanks, in part, to $15,000 I had borrowed shamefacedly from my mother after Patty stopped working. But we were behind on everything else. Bill collectors were calling six days a week, starting promptly at 8 a.m. “Telemarketers,” I would mumble when my son Matthew asked why we got so many robocalls from 800 numbers. Our stately little house looked increasingly trashy: peeling paint and broken screens on the front windows, crumbling concrete on the front stoop, a lawn that was mostly crabgrass. The furniture that Patty salvaged from her first marriage was falling apart. The cotton slipcovers on the sofa and armchair were in shreds. The frosted-crystal shade on a beloved Italian floor lamp was cracked. The dog had gnawed the leg on her Biedermeier chair. The panic attack hit me around 2 a.m. on Patty’s birthday. It was Oct. 17, 2007, and I was lying in bed obsessing over bills that couldn’t be postponed and the money we didn’t have to pay them. Like many of my predawn fear cascades, this one had its start with a specific unpaid bill: $240 in traffic tickets — $140 for speeding, $50 each for expired tags and inspection. The fines would double if we didn’t pay them in less than a week. The tickets had uncorked the bottle on all the other “must pays”: the $400 electric bill with the cutoff date printed in red; the $220 cable/telephone/Internet bill for the past two months; the MasterCard and American Express bills — at least one of which had to be brought current or I wouldn’t even be able to travel for work. And of course, there was the $3,271 mortgage payment. My panic circuitry was in fine form, connecting small debts to big ones, short-term problems to the bottomless abyss, private calamity to public shame. Once Patty was asleep and I was alone in the dark, the bottled-up fear reached the surface. I tossed from side to side, trying to figure out at least a triage plan for our bills. I was too fidgety to lie still in bed, but I was in no mood to actually sit down with the bills themselves. I climbed out of bed for a moment, then jumped back in. I couldn’t decide if I would rather feel confined or all alone. Patty woke up, irritated by all my movement and my occasional moans of despair. “What’s the matter?” she asked. “I can’t sleep,” I answered. “I’m panicking about money, because I don’t know how we’re going to pay all the bills that need to be paid right now.” I wanted her to take me in her arms and reassure me that everything would be O.K. But that wasn’t happening. “There’s nothing you can do about it right now,” she answered sleepily. “If this keeps on, we’re going to lose the house,” I persisted, sounding less panicked than petulant. If Patty wouldn’t give me comfort, then I wanted her to suffer alongside me. “I don’t know how we’re going to make it. We can’t go on like this.” Patty had begged me to grant her a birthday reprieve from my nagging and kvetching over money issues. What I saw as an uncontrollable moment of panic, she saw as another deliberate attempt to browbeat her. “I can’t believe you are doing this to me on my birthday,” she hissed in fury. “All I asked for was one day of peace — one day when you weren’t beating me over the head. And here it is, not even daylight yet, and you’re waking me up to berate me about money.” “Son of a *****, what did I do to you?” I asked, punching my pillow in the dark. “Do you think I enjoy having a panic attack? I can’t help what I’m feeling. I’m just scared out of my mind.” “That’s it!” Patty snapped, getting out of bed and pulling on her robe. “I’m not going to listen to any more of this. I’m going to sleep downstairs.” In the morning, she let me have it. “You lied to me,” she told me as I got coffee. “You said that what I saw on the outside was pretty much what you were. But you’re completely different. If I had known what you were really like, I would never have come out here.” Patty and I were hurtling toward bottom. We had been under so much strain for so long that we were often at each other’s throats, jeopardizing the love that brought us together in the first place. In November, four years after buying the house, we finally crossed our personal Rubicon and fell 30 days behind on our mortgage. “The last thing Chase wants is to foreclose on your home,” JPMorgan Chase wrote us. It assured us that it wanted to “help” and was willing to evaluate us for a number of “alternatives.” If we didn’t “resolve” our payment delinquency, it politely warned, “you will lose your home.” *** I took a certain pride that I outlasted two of my three mortgage lenders. American Home, my original lender, collapsed overnight when the financial markets first froze up in August 2007. Fremont, my second lender, was forced out of the mortgage business by federal regulators. That left me with JPMorgan Chase, one of the few big banks smart enough to sell off most of the subprime loans it financed. It still serviced my loan, but it wasn’t on the hook if I defaulted. By the time that Patty and I fell behind, the rest of the world was falling apart so fast that Chase barely had time for us. Bear Stearns and Lehman Brothers were gone. American International Group, one of the world’s biggest insurance conglomerates, received the biggest taxpayer-financed bailout in history. Citigroup was a zombie bank. All of them were brought down by the same mortgage madness that infected me. When I first called Chase in October, a representative named Sarah said I didn’t qualify for a loan modification because I wasn’t yet 90 days past due. The only “loan modification” she could offer me was a “repayment plan” under which I paid $400 more per month for six months until I was current again. “It sounds as if I would be better off waiting to fall 90 days behind,” I said. “I think I’ll wait for that.” It took a while, but Patty and I found we could get past blaming each other. We had seen each other’s worst sides, but we were still together, and that helped us to get closer. We started listening to each other. Patty began to find her way in the work world, and I was learning that I didn’t have all the answers. And we saw how our children were thriving. My three sons transferred to schools in our neighborhood and made scores of friends. Emily, Patty’s daughter, was a sparkling 10-year-old who loved her home and her school as well as all her brothers. Even if we lost the house, we had gained in other ways. I called Chase back in January, when I was 90 days past due. Another representative told me that I would automatically be evaluated for a loan modification. “You should just wait until you hear from one of our negotiators,” he told me politely. Another two months passed without anyone calling, so I tried again in late March. “I’m sorry, but our analysts have been backed up,” yet another Chase rep told me, even more politely than the previous one. She said each analyst had about 500 distressed borrowers to deal with, and it had been taking about five weeks for customers to get a direct response. The delays seemed to be getting longer. I was actually beginning to feel sorry for Chase. It seemed to be so flooded with defaulting borrowers that it didn’t have time to foreclose on my house. Eight months after my last payment to the bank, I am still waiting for the ax to fall. nytimes.com/2009/05/17/magazine/17foreclosure-t.html?pagewanted=6&_r=1", 
        "threadID": "409192893_6310075322001", 
        "time": "2009-05-18 08:40:00", 
        "title": "Short version: I want stuff!!!! And I couldn't afford it!!!", 
        "userID": "Boospar"
    }, 
    {
        "content": "I've got NO sympathy for this guy. None whatsoever. This isn't an uneducated person who could be duped by math that's beyond his comprehension. This is a guy who allegedly has a professional career and can understand more than basic arithmetic. People used to live within their means. If they couldn't afford something, they didn't buy it. They saved and planned for things as if they had less money than they actually did, giving them a safe margin of error. They didn't pretend they had more money than they did. I've never had a credit card. My student loans were always paid up-to-date. I've bought all my cars in cash. And if I decide to buy a house, I'll wait until I have a 30% down payment. Yes, that's right, 30%. Any less means I can't afford it, as far as I'm concerned. This idiot who almost destroyed his family and trashed his financial stability gets no sympathy from me. None at all.", 
        "intTime": 20090518, 
        "postID": 2, 
        "quote": "", 
        "reply": "I've got NO sympathy for this guy. None whatsoever. This isn't an uneducated person who could be duped by math that's beyond his comprehension. This is a guy who allegedly has a professional career and can understand more than basic arithmetic. People used to live within their means. If they couldn't afford something, they didn't buy it. They saved and planned for things as if they had less money than they actually did, giving them a safe margin of error. They didn't pretend they had more money than they did. I've never had a credit card. My student loans were always paid up-to-date. I've bought all my cars in cash. And if I decide to buy a house, I'll wait until I have a 30% down payment. Yes, that's right, 30%. Any less means I can't afford it, as far as I'm concerned. This idiot who almost destroyed his family and trashed his financial stability gets no sympathy from me. None at all.", 
        "threadID": "409192893_6310075322001", 
        "time": "2009-05-18 11:39:00", 
        "title": "Short version: I want stuff!!!! And I couldn't afford it!!!", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: I've got NO sympathy for this guy. None whatsoever. This isn't an uneducated person who could be duped by math that's beyond his comprehension. This is a guy who allegedly has a professional career and can understand more than basic arithmetic. People used to live within their means. If they couldn't afford something, they didn't buy it. They saved and planned for things as if they had less money than they actually did, giving them a safe margin of error. They didn't pretend they had more money than they did. I've never had a credit card. My student loans were always paid up-to-date. I've bought all my cars in cash. And if I decide to buy a house, I'll wait until I have a 30% down payment. Yes, that's right, 30%. Any less means I can't afford it, as far as I'm concerned. This idiot who almost destroyed his family and trashed his financial stability gets no sympathy from me. None at all. I agree 100% Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 3, 
        "quote": "Originally posted by Whirled_Peas: I've got NO sympathy for this guy. None whatsoever. This isn't an uneducated person who could be duped by math that's beyond his comprehension. This is a guy who allegedly has a professional career and can understand more than basic arithmetic. People used to live within their means. If they couldn't afford something, they didn't buy it. They saved and planned for things as if they had less money than they actually did, giving them a safe margin of error. They didn't pretend they had more money than they did. I've never had a credit card. My student loans were always paid up-to-date. I've bought all my cars in cash. And if I decide to buy a house, I'll wait until I have a 30% down payment. Yes, that's right, 30%. Any less means I can't afford it, as far as I'm concerned. This idiot who almost destroyed his family and trashed his financial stability gets no sympathy from me. None at all.", 
        "reply": " I agree 100% Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6310075322001", 
        "time": "2009-05-18 11:45:00", 
        "title": "Short version: I want stuff!!!! And I couldn't afford it!!!", 
        "userID": "L0A1"
    }, 
    {
        "content": "It happens to the best of us, whether its a hispanic immigrant or a trained economist....everyone wants the American dream, no matter how delusional it might actually be.. Atleast housing prices are coming down to where they belong, I think I can rent a place by the beach now", 
        "intTime": 20090518, 
        "postID": 4, 
        "quote": "", 
        "reply": "It happens to the best of us, whether its a hispanic immigrant or a trained economist....everyone wants the American dream, no matter how delusional it might actually be.. Atleast housing prices are coming down to where they belong, I think I can rent a place by the beach now", 
        "threadID": "409192893_6310075322001", 
        "time": "2009-05-18 12:01:00", 
        "title": "Short version: I want stuff!!!! And I couldn't afford it!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "ya gotta ask yourself.... \"How bad do I want it\"? and... \"How bad do I NEED it\"? we often times WANT something REAL bad but the bottom line to often says \"..but I don't NEED it\". When money is an issue I have found this small rule to bode me well. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090518, 
        "postID": 5, 
        "quote": "", 
        "reply": "ya gotta ask yourself.... \"How bad do I want it\"? and... \"How bad do I NEED it\"? we often times WANT something REAL bad but the bottom line to often says \"..but I don't NEED it\". When money is an issue I have found this small rule to bode me well. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_6310075322001", 
        "time": "2009-05-18 13:13:00", 
        "title": "Short version: I want stuff!!!! And I couldn't afford it!!!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: ya gotta ask yourself.... \"How bad do I want it\"? and... \"How bad do I NEED it\"? we often times WANT something REAL bad but the bottom line to often says \"..but I don't NEED it\". When money is an issue I have found this small rule to bode me well. I have 2 storage places, what I did to prove a point to my ole lady was take some things she said she needed and put them in storage, about 1 year later she was looking for it. I said what are you looking for, she said the china set from my grandma, I need it. I said, if you needed it, why is this the first time you asked about it since I put it away last year. Point is, most people DON'T NEED what they say they do, their priorities are mixed up over something they want compared to something they need. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 6, 
        "quote": "Originally posted by m551sheridan: ya gotta ask yourself.... \"How bad do I want it\"? and... \"How bad do I NEED it\"? we often times WANT something REAL bad but the bottom line to often says \"..but I don't NEED it\". When money is an issue I have found this small rule to bode me well.", 
        "reply": " I have 2 storage places, what I did to prove a point to my ole lady was take some things she said she needed and put them in storage, about 1 year later she was looking for it. I said what are you looking for, she said the china set from my grandma, I need it. I said, if you needed it, why is this the first time you asked about it since I put it away last year. Point is, most people DON'T NEED what they say they do, their priorities are mixed up over something they want compared to something they need. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6310075322001", 
        "time": "2009-05-18 13:18:00", 
        "title": "Short version: I want stuff!!!! And I couldn't afford it!!!", 
        "userID": "L0A1"
    }, 
    {
        "content": "Stupid idiot. He could have bought a two year old 27' RV for $16,000 and parked it somewhere for about $150.00 a month and saved $2500.00 a month.", 
        "intTime": 20090518, 
        "postID": 7, 
        "quote": "", 
        "reply": "Stupid idiot. He could have bought a two year old 27' RV for $16,000 and parked it somewhere for about $150.00 a month and saved $2500.00 a month.", 
        "threadID": "409192893_6310075322001", 
        "time": "2009-05-18 13:32:00", 
        "title": "Short version: I want stuff!!!! And I couldn't afford it!!!", 
        "userID": "Duster6"
    }
]