[
    {
        "content": "Not THAT Speaker. Quite unprecedented in recent history. At least he has the decency to walk away. quote: AP LONDON – For the first time in 300 years, the Speaker of the House of Commons has resigned — the biggest casualty in a widening scandal in which lawmakers expensed such things as installing a chandelier or cleaning a moat at a country home. Michael Martin took just 30 seconds Tuesday to break with centuries of convention, announcing that in the interest of maintaining unity in Parliament's lower house, he would leave his prestigious post by June 21. \"That is all I have to say on this matter,\" Martin said softly in his Scottish accent, swiftly calling the house to order and moving on to other business. Lawmakers who had crowded the chamber to hear the historic announcement filed out, surprised that such a moment was over in a flash. The rest of Britain will likely not move on so easily. Since details of lawmakers' expenses became public earlier this month, the public's anger has intensified. Claims have included such mundane items as cookies and pet food to more costly ones such as a chandelier installation, cleaning of a moat and even mortgage payments. Conservative leader David Cameron is asking the public to sign a petition urging Prime Minister Gordon Brown to call an election as soon as possible, offering voters a chance to kick out lawmakers who have abused expenses. Brown is resisting calling an election. He said Tuesday that any lawmaker in his Labour Party who broke expense rules won't be allowed to run in next national election, which must be held by mid-2010. Instead, he is calling for an overhaul of the system which allowed excesses, and said that Parliament can no longer self-regulate, but should hand supervision of salaries and expenses over to an independent body. \"Westminster cannot operate like some gentleman's club, where the members make up the rules,\" he said, noting that a junior minister in his government has had to step down and that two members of his party were suspended over their claims. In a second statement to lawmakers later Tuesday, Martin said Britain's political leaders had agreed to a set of emergency measures aimed at cleaning up the expense system. The proposed rules would bar lawmakers from claiming taxpayer money for furniture, impose a cap on the amount of cash claimed for mortgage payments, and provide for all claims to be published online every three months. The last measure is particularly striking given that, only a few months ago, the government was still seeking to keep the expense claims secret. Martin has not been caught up in the recent revelations about lawmakers' expenses, although his spending has been scrutinized in the past. And as the latest wave of revelations hit, Martin was blamed for creating a climate in which such excesses were allowed. He became a symbol of the scandal because he has resisted reforms designed to make lawmakers' expenses more transparent. But the lawmakers themselves have been reluctant to expose their sometimes lavish spending, and Martin's defenders said he was taking the fall for their avarice. The Daily Telegraph began publishing stories about lawmakers' claims earlier this month after being leaked thousands of pages of details. About 80 lawmakers have been singled out so far, but the newspaper publishes new details every day and the scandal shows no sign of stopping. No party has been spared embarrassment, with Labour, Conservatives, and Liberal Democrats all coming under fire. Martin was elected to represent a Glasgow constituency in 1979 as a Labour Party lawmaker and became speaker in 2000. Speakers usually choose when they retire, and are generally not subject to the whims of the electorate. So Martin had to run for re-election when the country went to the polls, but tradition dictated that major political parties don't field candidates in the speaker's constituency. Last year, he was criticized for claiming about 4,280 pounds ($6,640) for his wife's taxi fares and around 17,500 pounds ($27,140) toward the cost of his second home in Scotland while he lived in a government-paid apartment in the Palace of Westminster. The new speaker, who will be chosen from the 646 lawmakers in the House of Commons, will take over a position steeped in history and tradition. The speaker is entrusted with the running of the House of Commons, trying to maintain decorum during debates — sometimes shouting \"Order! Order!\" — and deciding which lawmakers are called on. He or she also represents the chamber in discussions with Queen Elizabeth II and the House of Lords. Unlike in the U.S., where the speaker of the House of Representatives is often a partisan advocate for the majority party, the British speaker is supposed to be impartial and independent of government. Speakers are usually treated with great respect, and publicly criticizing them just isn't done. The last speaker to be forced from his position was Sir John Trevor, who was found guilty of accepting a bribe in 1695. Rodney Barker, a government professor at the London School of Economics, said Martin's departure shows Parliament is taking reform seriously. \"It won't solve anything at all, but if his successor could appear to be taking charge of things in a way that implements proper procedures, probity, and decent use of public money, that would be the very opposite of Michael Martin's position,\" Barker said. \"He has been seen as a supporter of the most greedy and the most mean.\" \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "AP LONDON – For the first time in 300 years, the Speaker of the House of Commons has resigned — the biggest casualty in a widening scandal in which lawmakers expensed such things as installing a chandelier or cleaning a moat at a country home. Michael Martin took just 30 seconds Tuesday to break with centuries of convention, announcing that in the interest of maintaining unity in Parliament's lower house, he would leave his prestigious post by June 21. \"That is all I have to say on this matter,\" Martin said softly in his Scottish accent, swiftly calling the house to order and moving on to other business. Lawmakers who had crowded the chamber to hear the historic announcement filed out, surprised that such a moment was over in a flash. The rest of Britain will likely not move on so easily. Since details of lawmakers' expenses became public earlier this month, the public's anger has intensified. Claims have included such mundane items as cookies and pet food to more costly ones such as a chandelier installation, cleaning of a moat and even mortgage payments. Conservative leader David Cameron is asking the public to sign a petition urging Prime Minister Gordon Brown to call an election as soon as possible, offering voters a chance to kick out lawmakers who have abused expenses. Brown is resisting calling an election. He said Tuesday that any lawmaker in his Labour Party who broke expense rules won't be allowed to run in next national election, which must be held by mid-2010. Instead, he is calling for an overhaul of the system which allowed excesses, and said that Parliament can no longer self-regulate, but should hand supervision of salaries and expenses over to an independent body. \"Westminster cannot operate like some gentleman's club, where the members make up the rules,\" he said, noting that a junior minister in his government has had to step down and that two members of his party were suspended over their claims. In a second statement to lawmakers later Tuesday, Martin said Britain's political leaders had agreed to a set of emergency measures aimed at cleaning up the expense system. The proposed rules would bar lawmakers from claiming taxpayer money for furniture, impose a cap on the amount of cash claimed for mortgage payments, and provide for all claims to be published online every three months. The last measure is particularly striking given that, only a few months ago, the government was still seeking to keep the expense claims secret. Martin has not been caught up in the recent revelations about lawmakers' expenses, although his spending has been scrutinized in the past. And as the latest wave of revelations hit, Martin was blamed for creating a climate in which such excesses were allowed. He became a symbol of the scandal because he has resisted reforms designed to make lawmakers' expenses more transparent. But the lawmakers themselves have been reluctant to expose their sometimes lavish spending, and Martin's defenders said he was taking the fall for their avarice. The Daily Telegraph began publishing stories about lawmakers' claims earlier this month after being leaked thousands of pages of details. About 80 lawmakers have been singled out so far, but the newspaper publishes new details every day and the scandal shows no sign of stopping. No party has been spared embarrassment, with Labour, Conservatives, and Liberal Democrats all coming under fire. Martin was elected to represent a Glasgow constituency in 1979 as a Labour Party lawmaker and became speaker in 2000. Speakers usually choose when they retire, and are generally not subject to the whims of the electorate. So Martin had to run for re-election when the country went to the polls, but tradition dictated that major political parties don't field candidates in the speaker's constituency. Last year, he was criticized for claiming about 4,280 pounds ($6,640) for his wife's taxi fares and around 17,500 pounds ($27,140) toward the cost of his second home in Scotland while he lived in a government-paid apartment in the Palace of Westminster. The new speaker, who will be chosen from the 646 lawmakers in the House of Commons, will take over a position steeped in history and tradition. The speaker is entrusted with the running of the House of Commons, trying to maintain decorum during debates — sometimes shouting \"Order! Order!\" — and deciding which lawmakers are called on. He or she also represents the chamber in discussions with Queen Elizabeth II and the House of Lords. Unlike in the U.S., where the speaker of the House of Representatives is often a partisan advocate for the majority party, the British speaker is supposed to be impartial and independent of government. Speakers are usually treated with great respect, and publicly criticizing them just isn't done. The last speaker to be forced from his position was Sir John Trevor, who was found guilty of accepting a bribe in 1695. Rodney Barker, a government professor at the London School of Economics, said Martin's departure shows Parliament is taking reform seriously. \"It won't solve anything at all, but if his successor could appear to be taking charge of things in a way that implements proper procedures, probity, and decent use of public money, that would be the very opposite of Michael Martin's position,\" Barker said. \"He has been seen as a supporter of the most greedy and the most mean.\"", 
        "reply": "Not THAT Speaker. Quite unprecedented in recent history. At least he has the decency to walk away.  \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 04:56:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "At least he did the right thing in this case. Pelosi doesn't have the integrity or the balls.", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "At least he did the right thing in this case. Pelosi doesn't have the integrity or the balls.", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 05:05:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "Duster6"
    }, 
    {
        "content": "Dayem ElTee! Ya sure had my hopes running high this mornin'!", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "", 
        "reply": "Dayem ElTee! Ya sure had my hopes running high this mornin'!", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 05:08:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Unlike in the U.S., where the speaker of the House of Representatives is often a partisan advocate for the majority party, the British speaker is supposed to be impartial and independent of government. Speakers are usually treated with great respect, and publicly criticizing them just isn't done. The last speaker to be forced from his position was Sir John Trevor, who was found guilty of accepting a bribe in 1695. Rodney Barker, a government professor at the London School of Economics, said Martin's departure shows Parliament is taking reform seriously. Hmmm...maybe the Brits are onto something? Although honestly, I am not sure how one can truly be impartial and nonpartisan. Just look at our SCOTUS Justices. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "Unlike in the U.S., where the speaker of the House of Representatives is often a partisan advocate for the majority party, the British speaker is supposed to be impartial and independent of government. Speakers are usually treated with great respect, and publicly criticizing them just isn't done. The last speaker to be forced from his position was Sir John Trevor, who was found guilty of accepting a bribe in 1695. Rodney Barker, a government professor at the London School of Economics, said Martin's departure shows Parliament is taking reform seriously.", 
        "reply": " Hmmm...maybe the Brits are onto something? Although honestly, I am not sure how one can truly be impartial and nonpartisan. Just look at our SCOTUS Justices. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 05:09:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: Dayem ElTee! Ya sure had my hopes running high this mornin'! Hoffy, we must know each other from MODF. I apologize that I don't remember you well. I haven't been on these forums in several years now (we didn't exactly have WiFi in Afghanistan ). You must remember me from way back when as I haven't been an ElTee in several years now. Ahhh...those were the days. You could get away with ANYTHING with one bar. Now I actually have to work and stuff. \"Common sense was an uncommon virtue\"", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "Originally posted by Hoffy1951: Dayem ElTee! Ya sure had my hopes running high this mornin'!", 
        "reply": " Hoffy, we must know each other from MODF. I apologize that I don't remember you well. I haven't been on these forums in several years now (we didn't exactly have WiFi in Afghanistan ). You must remember me from way back when as I haven't been an ElTee in several years now. Ahhh...those were the days. You could get away with ANYTHING with one bar. Now I actually have to work and stuff. \"Common sense was an uncommon virtue\"", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 05:14:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "QuanticoBornMarine"
    }, 
    {
        "content": "quote: Originally posted by Duster6: At least he did the right thing in this case. Pelosi doesn't have the integrity or the balls. Don't be so sure about him doing the right thing. He jumped because he was about to be pushed.", 
        "intTime": 20090520, 
        "postID": 6, 
        "quote": "Originally posted by Duster6: At least he did the right thing in this case. Pelosi doesn't have the integrity or the balls.", 
        "reply": " Don't be so sure about him doing the right thing. He jumped because he was about to be pushed.", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 09:31:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "BritishAlly"
    }, 
    {
        "content": "quote: Although honestly, I am not sure how one can truly be impartial and nonpartisan The British Parliamentry system could'nt work if the Speaker of the House of Commons was not divorced from party politics. As BA says, he was obliged to jump before he was pushed. He had surpressed calls and moves to divulge the amount of public cash that MPs were claiming for allowances that were difficult to justify. One of then claimed to have his moat cleaned at his ancestral home !!! Two others were claiming for mortgages that had been paid off two years previously. A whole can of worms has been uncovered by the \"Telegraph\" and many MPs are squirming in the spotlight.", 
        "intTime": 20090520, 
        "postID": 7, 
        "quote": "Although honestly, I am not sure how one can truly be impartial and nonpartisan", 
        "reply": " The British Parliamentry system could'nt work if the Speaker of the House of Commons was not divorced from party politics. As BA says, he was obliged to jump before he was pushed. He had surpressed calls and moves to divulge the amount of public cash that MPs were claiming for allowances that were difficult to justify. One of then claimed to have his moat cleaned at his ancestral home !!! Two others were claiming for mortgages that had been paid off two years previously. A whole can of worms has been uncovered by the \"Telegraph\" and many MPs are squirming in the spotlight.", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 12:07:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "ScotsVisitor"
    }, 
    {
        "content": "quote: Originally posted by QuanticoBornMarine: quote: Unlike in the U.S., where the speaker of the House of Representatives is often a partisan advocate for the majority party, the British speaker is supposed to be impartial and independent of government. Speakers are usually treated with great respect, and publicly criticizing them just isn't done. The last speaker to be forced from his position was Sir John Trevor, who was found guilty of accepting a bribe in 1695. Rodney Barker, a government professor at the London School of Economics, said Martin's departure shows Parliament is taking reform seriously. Hmmm...maybe the Brits are onto something? Although honestly, I am not sure how one can truly be impartial and nonpartisan. Just look at our SCOTUS Justices. It's an ethos that is I think completely alien to the American \"with us or against us\" two party system the Speaker requires support from MPs of more than one party before he can be nominated and the vote is usually fairly free. However, it's worth noting that \"Gorbels Mick\" as Martin was known was elected at a time when the influence of Tony Blair in British politics was very strong and that one of Blair's many unpleasant characteristics (in addition to a contempt for Parliament) was a tendency to control freakery. Blair used his influence with young, impressionable, stupid and change obsessed newly elected Labour MPs to ensure that Martin was elected over several better qualified and more experienced parliamentarians from other parties. It was this taint of partisan politics that contributed to him being such a useless speaker. I have to say that I'm always slightly shocked when I realise how partisan US judges can be, you almost never hear a judge over here venture any form of political opinion at all - in fact a politicised barrister is unlikely to be appointed as a judge. Even the Law Lords who occupy a similar position to your Supreme Court (although tediously and predictably Labour has decided to chuck out our tried and tested system and replace it with a \"supreme court\") but also sit in the House of Lords are almost always \"Crossbenchers\" (independents). Mind you I gather that some judicial positions in the US are elected which means that some level of partisanship is inevitable.", 
        "intTime": 20090520, 
        "postID": 8, 
        "quote": "Originally posted by QuanticoBornMarine: quote: Unlike in the U.S., where the speaker of the House of Representatives is often a partisan advocate for the majority party, the British speaker is supposed to be impartial and independent of government. Speakers are usually treated with great respect, and publicly criticizing them just isn't done. The last speaker to be forced from his position was Sir John Trevor, who was found guilty of accepting a bribe in 1695. Rodney Barker, a government professor at the London School of Economics, said Martin's departure shows Parliament is taking reform seriously. Hmmm...maybe the Brits are onto something? Although honestly, I am not sure how one can truly be impartial and nonpartisan. Just look at our SCOTUS Justices.", 
        "reply": " It's an ethos that is I think completely alien to the American \"with us or against us\" two party system the Speaker requires support from MPs of more than one party before he can be nominated and the vote is usually fairly free. However, it's worth noting that \"Gorbels Mick\" as Martin was known was elected at a time when the influence of Tony Blair in British politics was very strong and that one of Blair's many unpleasant characteristics (in addition to a contempt for Parliament) was a tendency to control freakery. Blair used his influence with young, impressionable, stupid and change obsessed newly elected Labour MPs to ensure that Martin was elected over several better qualified and more experienced parliamentarians from other parties. It was this taint of partisan politics that contributed to him being such a useless speaker. I have to say that I'm always slightly shocked when I realise how partisan US judges can be, you almost never hear a judge over here venture any form of political opinion at all - in fact a politicised barrister is unlikely to be appointed as a judge. Even the Law Lords who occupy a similar position to your Supreme Court (although tediously and predictably Labour has decided to chuck out our tried and tested system and replace it with a \"supreme court\") but also sit in the House of Lords are almost always \"Crossbenchers\" (independents). Mind you I gather that some judicial positions in the US are elected which means that some level of partisanship is inevitable.", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 16:00:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by ScotsVisitor: quote: Although honestly, I am not sure how one can truly be impartial and nonpartisan The British Parliamentry system could'nt work if the Speaker of the House of Commons was not divorced from party politics. As BA says, he was obliged to jump before he was pushed. He had surpressed calls and moves to divulge the amount of public cash that MPs were claiming for allowances that were difficult to justify. One of then claimed to have his moat cleaned at his ancestral home !!! Two others were claiming for mortgages that had been paid off two years previously. A whole can of worms has been uncovered by the \"Telegraph\" and many MPs are squirming in the spotlight. You know Scots I actually had some dealings with Douglas Hogg a while back and have to say that it's a pity he's going when more egregious gits are staying. He was a good MP for Lincolnshire and a pretty good agriculture minister (unlike Elliot Morely who was a sh17). It seems a shame for him to get binned for the moat thing (which he may or may not have actually claimed for) when others seem to have got away with worse.", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "Originally posted by ScotsVisitor: quote: Although honestly, I am not sure how one can truly be impartial and nonpartisan The British Parliamentry system could'nt work if the Speaker of the House of Commons was not divorced from party politics. As BA says, he was obliged to jump before he was pushed. He had surpressed calls and moves to divulge the amount of public cash that MPs were claiming for allowances that were difficult to justify. One of then claimed to have his moat cleaned at his ancestral home !!! Two others were claiming for mortgages that had been paid off two years previously. A whole can of worms has been uncovered by the \"Telegraph\" and many MPs are squirming in the spotlight.", 
        "reply": " You know Scots I actually had some dealings with Douglas Hogg a while back and have to say that it's a pity he's going when more egregious gits are staying. He was a good MP for Lincolnshire and a pretty good agriculture minister (unlike Elliot Morely who was a sh17). It seems a shame for him to get binned for the moat thing (which he may or may not have actually claimed for) when others seem to have got away with worse.", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-20 16:07:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Bladensburg - you're right. Some of the MPs caught up in this mess are simply guilty of poor judgement rather than calculated snout in the cash trough. They probably just dumped such accountancy admin on their secretaries - but the buck stops with them at the end of the day. The one that really got to me was the claim from Shahid Malik (?) for a £65 court fine he got for not paying Council Tax. That really was extracting the urine at our expenses. BTW - The \"Telegraph\" ain't finished yet it seems !!! There are several tightening sphincter muscles in the Commons these days !!!", 
        "intTime": 20090522, 
        "postID": 10, 
        "quote": "", 
        "reply": "Bladensburg - you're right. Some of the MPs caught up in this mess are simply guilty of poor judgement rather than calculated snout in the cash trough. They probably just dumped such accountancy admin on their secretaries - but the buck stops with them at the end of the day. The one that really got to me was the claim from Shahid Malik (?) for a £65 court fine he got for not paying Council Tax. That really was extracting the urine at our expenses. BTW - The \"Telegraph\" ain't finished yet it seems !!! There are several tightening sphincter muscles in the Commons these days !!!", 
        "threadID": "409192893_5750037322001", 
        "time": "2009-05-22 05:07:00", 
        "title": "Speaker of the House announces resignation", 
        "userID": "ScotsVisitor"
    }
]