[
    {
        "content": "FEDS CAUSE GM TO DUMP CHIEF EXEC, BUT AUTO PROBLEMS ALSO HAVE TO BE UNDER THE UNIONS UMBRELLA WHAT TO HAPPEN TO UNION LEADERS THAT ARE UP TO ARMPITS IN AUTO PROBLEMS What are the Unions going to have to give up?? does not seem to be much?? DETROIT (AP) - Time and time again, General Motors Corp.'s board of directors reaffirmed its support for Chairman and CEO Rick Wagoner, even as the company piled up billions of dollars in losses and begged for government loans to stay alive. But Wagoner is now a high-profile casualty of government intervention, forced out as part of the Obama administration's sweeping last-ditch effort to save the century-old auto giant. Wagoner, 56, who spent 32 years with GM working all over the world, stepped down effective immediately, the company said in a statement early Monday. He was replaced as CEO by Fritz Henderson, the company's vice chairman and chief operating officer.", 
        "intTime": 20090330, 
        "postID": 1, 
        "quote": "", 
        "reply": "FEDS CAUSE GM TO DUMP CHIEF EXEC, BUT AUTO PROBLEMS ALSO HAVE TO BE UNDER THE UNIONS UMBRELLA WHAT TO HAPPEN TO UNION LEADERS THAT ARE UP TO ARMPITS IN AUTO PROBLEMS What are the Unions going to have to give up?? does not seem to be much?? DETROIT (AP) - Time and time again, General Motors Corp.'s board of directors reaffirmed its support for Chairman and CEO Rick Wagoner, even as the company piled up billions of dollars in losses and begged for government loans to stay alive. But Wagoner is now a high-profile casualty of government intervention, forced out as part of the Obama administration's sweeping last-ditch effort to save the century-old auto giant. Wagoner, 56, who spent 32 years with GM working all over the world, stepped down effective immediately, the company said in a statement early Monday. He was replaced as CEO by Fritz Henderson, the company's vice chairman and chief operating officer.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 04:34:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product...", 
        "intTime": 20090330, 
        "postID": 2, 
        "quote": "", 
        "reply": "Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product...", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:10:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product... The little guy? You mean the autoworkers who have forced the automakers into a no win situation?", 
        "intTime": 20090330, 
        "postID": 3, 
        "quote": "Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product...", 
        "reply": " The little guy? You mean the autoworkers who have forced the automakers into a no win situation?", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:37:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product... The little guy? You mean the autoworkers who have forced the automakers into a no win situation? The little guy, you know those people that get a 100% life long pension.", 
        "intTime": 20090330, 
        "postID": 4, 
        "quote": "Originally posted by threerings: quote: Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product... The little guy? You mean the autoworkers who have forced the automakers into a no win situation?", 
        "reply": " The little guy, you know those people that get a 100% life long pension.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:44:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "War on unions, war on the middle class. The \"union busters\" have simply gotten more subtle.", 
        "intTime": 20090330, 
        "postID": 5, 
        "quote": "", 
        "reply": "War on unions, war on the middle class. The \"union busters\" have simply gotten more subtle.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:47:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: The little guy, you know those people that get a 100% life long pension. So do you. Would you like to see that renegotiated because of our economic crisis?", 
        "intTime": 20090330, 
        "postID": 6, 
        "quote": "Originally posted by GunnyRet03: The little guy, you know those people that get a 100% life long pension.", 
        "reply": " So do you. Would you like to see that renegotiated because of our economic crisis?", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:54:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "The top unions execs need to be oust as well. The union has gotten way out of hand. The union can be a good thing if properly used, but the unions of today has done nothing but produce lazy \"it's not my job\" workers and strangled the American consumer. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090330, 
        "postID": 7, 
        "quote": "", 
        "reply": "The top unions execs need to be oust as well. The union has gotten way out of hand. The union can be a good thing if properly used, but the unions of today has done nothing but produce lazy \"it's not my job\" workers and strangled the American consumer. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:02:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "The UAW already made huge deals with the auto workers. The changes made in the last month bring the labor cost down to parity with the Japanese automakers.", 
        "intTime": 20090330, 
        "postID": 8, 
        "quote": "", 
        "reply": "The UAW already made huge deals with the auto workers. The changes made in the last month bring the labor cost down to parity with the Japanese automakers.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:07:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Don't buy a car for more than $10,000.00. Set that standard for yourself, and every manufacturer will have to come down to that price and find you, it's as simple as that. They can build all the $50,000.00 cars they want, but if nobody will buy them, something will have to give. Management and the Unions will have have to compromise their way down to what you will pay for, or throw in the towel. I've been driving the same Ford pickup for 15 years and will probably drive it for another 15 years because it cost me $30,000.00 to purchase on a 10 year equity loan. My wife drives a 10 year old Pontiac we bought from a rental company for under $10,000.00. Don't feed the monster, and it will have to go on a diet or die! I don't see Ford screaming for help (yet), but that is probably because they haven't spread themselves too thin with too many variants and lines, the way GM has - - If you don't buy, they'll come down to your wallet size or die - - Wandering and Wondering", 
        "intTime": 20090330, 
        "postID": 9, 
        "quote": "", 
        "reply": "Don't buy a car for more than $10,000.00. Set that standard for yourself, and every manufacturer will have to come down to that price and find you, it's as simple as that. They can build all the $50,000.00 cars they want, but if nobody will buy them, something will have to give. Management and the Unions will have have to compromise their way down to what you will pay for, or throw in the towel. I've been driving the same Ford pickup for 15 years and will probably drive it for another 15 years because it cost me $30,000.00 to purchase on a 10 year equity loan. My wife drives a 10 year old Pontiac we bought from a rental company for under $10,000.00. Don't feed the monster, and it will have to go on a diet or die! I don't see Ford screaming for help (yet), but that is probably because they haven't spread themselves too thin with too many variants and lines, the way GM has - - If you don't buy, they'll come down to your wallet size or die - - Wandering and Wondering", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:21:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "intTime": 20090330, 
        "postID": 10, 
        "quote": "", 
        "reply": "GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:29:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc. Not to mention V-8 Engines, and DAMNED STRAIGHT I work my azz off. Why shouldn't I take what I've EARNED and ENJOY some of the \"fruits of my labors\"? Maybe you'd be happier if we all lived in caves, wore fig leaves and ate grass clippings?", 
        "intTime": 20090330, 
        "postID": 11, 
        "quote": "Originally posted by SeaWitch1220: our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "reply": " Not to mention V-8 Engines, and DAMNED STRAIGHT I work my azz off. Why shouldn't I take what I've EARNED and ENJOY some of the \"fruits of my labors\"? Maybe you'd be happier if we all lived in caves, wore fig leaves and ate grass clippings?", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:39:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: War on unions, war on the middle class. The \"union busters\" have simply gotten more subtle. Subtle? How is forcing GM into bankruptcy and telling UAW retirees to get on medicaide subtle? This is the grand scheme: Tell GM and Chrysler they can either go bankrupt, or become owned by the Federal government. As federal employees, the workers will have to dump UAW and join the federal civil service union. They will lose their $40/hr paychecks, free medical care and full pension for WG-10 wages (which will still be around $30/hr), but the medical care will become some HMO and the retirement will become federal retirement...more like 30% of pay, and you still pay for health insurance. I love it! We'll combine GM and Chrylser and dub them \"Federal Auto\".", 
        "intTime": 20090330, 
        "postID": 12, 
        "quote": "Originally posted by SeaWitch1220: War on unions, war on the middle class. The \"union busters\" have simply gotten more subtle.", 
        "reply": " Subtle? How is forcing GM into bankruptcy and telling UAW retirees to get on medicaide subtle? This is the grand scheme: Tell GM and Chrysler they can either go bankrupt, or become owned by the Federal government. As federal employees, the workers will have to dump UAW and join the federal civil service union. They will lose their $40/hr paychecks, free medical care and full pension for WG-10 wages (which will still be around $30/hr), but the medical care will become some HMO and the retirement will become federal retirement...more like 30% of pay, and you still pay for health insurance. I love it! We'll combine GM and Chrylser and dub them \"Federal Auto\".", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:45:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by GunnyRet03: The little guy, you know those people that get a 100% life long pension. So do you. Would you like to see that renegotiated because of our economic crisis? I have a hard time equating a union worker with an active duty servicemember. But, since you mentioned it, I can see the \"standard\" 50% retirement w/ free healthcare for 20 years active service changing at some point in the future. I don't like it, but I can see it...especially after the annointed one suggesting having combat vets pay for service-related injuries with their own insurance within his first 100 days.", 
        "intTime": 20090330, 
        "postID": 13, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by GunnyRet03: The little guy, you know those people that get a 100% life long pension. So do you. Would you like to see that renegotiated because of our economic crisis?", 
        "reply": " I have a hard time equating a union worker with an active duty servicemember. But, since you mentioned it, I can see the \"standard\" 50% retirement w/ free healthcare for 20 years active service changing at some point in the future. I don't like it, but I can see it...especially after the annointed one suggesting having combat vets pay for service-related injuries with their own insurance within his first 100 days.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:48:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc. The US automakers have them as well. I have an 03 Pontiac Grand Am with a 5 speed, no power windows, basic radio, and no frills. It also gets 30 mpg.", 
        "intTime": 20090330, 
        "postID": 14, 
        "quote": "Originally posted by SeaWitch1220: GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "reply": " The US automakers have them as well. I have an 03 Pontiac Grand Am with a 5 speed, no power windows, basic radio, and no frills. It also gets 30 mpg.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:48:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: ... and the public should not have to bare it all. ... at least not until the weather heats up ... (I agree with your comment)", 
        "intTime": 20090330, 
        "postID": 15, 
        "quote": "... and the public should not have to bare it all.", 
        "reply": " ... at least not until the weather heats up ... (I agree with your comment)", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 07:02:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc. GM, Ford, Chrysler make no-frills cars. Problem is, they are sh**y cars for what you get. A basic Chevy Cobalt is 15k, and it feels cheap. The interior, the drive, everything, feels cheap. A base VW Jetta is 17k, a base Honda Civic is 16k, a base Toyota Corolla is 15k, and none of those cars feel cheap. Base model Kias are even less...and they don't feel cheap.", 
        "intTime": 20090330, 
        "postID": 16, 
        "quote": "Originally posted by SeaWitch1220: GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "reply": " GM, Ford, Chrysler make no-frills cars. Problem is, they are sh**y cars for what you get. A basic Chevy Cobalt is 15k, and it feels cheap. The interior, the drive, everything, feels cheap. A base VW Jetta is 17k, a base Honda Civic is 16k, a base Toyota Corolla is 15k, and none of those cars feel cheap. Base model Kias are even less...and they don't feel cheap.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 07:03:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "jwr6"
    }, 
    {
        "content": "Some of the union leadership should be taking a walk with this critter.", 
        "intTime": 20090330, 
        "postID": 17, 
        "quote": "", 
        "reply": "Some of the union leadership should be taking a walk with this critter.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 07:32:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "67NOV"
    }, 
    {
        "content": "Everyday the grip of the socialist administration grows tighter while the sheeple and moles cheer it on. Viva the United Socialist States Republic, Viva the new Massa in chief!! This message has been edited. Last edited by: Drmwvr, Mon 30 March 2009 07:52 AM \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090330, 
        "postID": 18, 
        "quote": "", 
        "reply": "Everyday the grip of the socialist administration grows tighter while the sheeple and moles cheer it on. Viva the United Socialist States Republic, Viva the new Massa in chief!! This message has been edited. Last edited by: Drmwvr, Mon 30 March 2009 07:52 AM \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 07:35:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "With all the taxes I paid for those damn lazy welfare parasites and all the hugh bonuses paid to the corporate parasites I'm owed a $50,000 car, a $300,000 home and free health care.", 
        "intTime": 20090330, 
        "postID": 19, 
        "quote": "", 
        "reply": "With all the taxes I paid for those damn lazy welfare parasites and all the hugh bonuses paid to the corporate parasites I'm owed a $50,000 car, a $300,000 home and free health care.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 09:17:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Can anyone tell me what Wagoner's severance package is? How about what he's \"banked\" over his career compared to what the 32 year autoworker has banked. The entire compensation scale from the top down needs to be overhauled. It's impossible to demand pay cuts from the workers without equal reductions from management. Of course the unions got what they demanded because the management was getting their's too. Funny how anyone would give a damn about one man (who probably has plenty of money for his retirement) when thousands of long term employee's have been let go without so much as kick in the rear...??? The self righteous indignation is humorous at best. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090330, 
        "postID": 20, 
        "quote": "", 
        "reply": "Can anyone tell me what Wagoner's severance package is? How about what he's \"banked\" over his career compared to what the 32 year autoworker has banked. The entire compensation scale from the top down needs to be overhauled. It's impossible to demand pay cuts from the workers without equal reductions from management. Of course the unions got what they demanded because the management was getting their's too. Funny how anyone would give a damn about one man (who probably has plenty of money for his retirement) when thousands of long term employee's have been let go without so much as kick in the rear...??? The self righteous indignation is humorous at best. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 09:40:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: Everyday the grip of the socialist administration grows tighter while the sheeple and moles cheer it on. Viva the United Socialist States Republic, Viva the new Massa in chief!! I made the point on another thread about bail outs being de facto socialism. No Obama can order these car companies to do anything he (th govt) wants. Watch, part of the \"restructuring\" will probably include a reduction / elimination of SUVs, increase in unionization, dictating hiring / firing policies, bonus payments, the list is endless. By holding thier hands out, various industies have sold thier collecitive souls to the devil.", 
        "intTime": 20090330, 
        "postID": 21, 
        "quote": "Originally posted by Drmwvr: Everyday the grip of the socialist administration grows tighter while the sheeple and moles cheer it on. Viva the United Socialist States Republic, Viva the new Massa in chief!!", 
        "reply": " I made the point on another thread about bail outs being de facto socialism. No Obama can order these car companies to do anything he (th govt) wants. Watch, part of the \"restructuring\" will probably include a reduction / elimination of SUVs, increase in unionization, dictating hiring / firing policies, bonus payments, the list is endless. By holding thier hands out, various industies have sold thier collecitive souls to the devil.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 10:31:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by jwr6: But, since you mentioned it, I can see the \"standard\" 50% retirement w/ free healthcare for 20 years active service changing at some point in the future. It already is gone. As far as I know, the last 20 yr 50%ers enlisted sone time during the late '80's, early '90's. I think you have to do 30 to get 50% now. That is incorrect. Military retirement is on three systems now depending on DIEMS date. Prior to a September 1980 entry it is based on your final pay, 50% at 20 years and 2.5% for each year after up to 75%. Under Carter the retirment systme was changed. September 1980 to August 1986 is the same, except pay is computed on the average of your final three years pay. This is the High 3 system. Under Reagan the retirement system was changed to under 50% at 20 years. In 1986 the retirement system was changed to 40% at 20 years, but a 3.5% increase per year so at 30 years it would be 75%. There is also a readjustment that beings it back to the same as High 3 at age 62. This is called Redux. That was changed again in 1999 under Clinton, with the FY 2000 Defense Budget. Now people that entered after 1986 have the option of choosing between the High 3 system, or taking a $30,000 payment at 15 years of service and the Redux retirement. I entered in August 95, so in Feb 2010 at my 14.5 year point I have to decide between Redux and the $30,000 payment and High 3. I'll be taking the High 3 since it will be at least $150,000 difference in retirement pay from the time I retire at about age 42 until Redux would catch up at 62. Since the law was changed before anyone under redux actually had 20 years, there is nobody that was forced to retire with less than the full 50% at 20 years.", 
        "intTime": 20090330, 
        "postID": 22, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by jwr6: But, since you mentioned it, I can see the \"standard\" 50% retirement w/ free healthcare for 20 years active service changing at some point in the future. It already is gone. As far as I know, the last 20 yr 50%ers enlisted sone time during the late '80's, early '90's. I think you have to do 30 to get 50% now.", 
        "reply": " That is incorrect. Military retirement is on three systems now depending on DIEMS date. Prior to a September 1980 entry it is based on your final pay, 50% at 20 years and 2.5% for each year after up to 75%. Under Carter the retirment systme was changed. September 1980 to August 1986 is the same, except pay is computed on the average of your final three years pay. This is the High 3 system. Under Reagan the retirement system was changed to under 50% at 20 years. In 1986 the retirement system was changed to 40% at 20 years, but a 3.5% increase per year so at 30 years it would be 75%. There is also a readjustment that beings it back to the same as High 3 at age 62. This is called Redux. That was changed again in 1999 under Clinton, with the FY 2000 Defense Budget. Now people that entered after 1986 have the option of choosing between the High 3 system, or taking a $30,000 payment at 15 years of service and the Redux retirement. I entered in August 95, so in Feb 2010 at my 14.5 year point I have to decide between Redux and the $30,000 payment and High 3. I'll be taking the High 3 since it will be at least $150,000 difference in retirement pay from the time I retire at about age 42 until Redux would catch up at 62. Since the law was changed before anyone under redux actually had 20 years, there is nobody that was forced to retire with less than the full 50% at 20 years.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 10:58:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product... Yes and we need to fire the CEO of the housing market companies, they have run that business into the ground as well. The housing/credit bubble had nothing do do with it, the boss just failed. Forget the dog, Beware of Owner", 
        "intTime": 20090331, 
        "postID": 23, 
        "quote": "Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product...", 
        "reply": " Yes and we need to fire the CEO of the housing market companies, they have run that business into the ground as well. The housing/credit bubble had nothing do do with it, the boss just failed. Forget the dog, Beware of Owner", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-31 09:39:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "Tomcatt"
    }, 
    {
        "content": "The solution is simple. The US automakers need to create a product that people want and sell it at an affordable price. All rhetoric aside, they obviously have failed to do this and all the goverment programs, CEO changes and union 'give backs' will not change that. The American consumer has spoken, the industry has not been listening.", 
        "intTime": 20090331, 
        "postID": 24, 
        "quote": "", 
        "reply": "The solution is simple. The US automakers need to create a product that people want and sell it at an affordable price. All rhetoric aside, they obviously have failed to do this and all the goverment programs, CEO changes and union 'give backs' will not change that. The American consumer has spoken, the industry has not been listening.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-31 10:57:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "adminnco1"
    }, 
    {
        "content": "FEDS CAUSE GM TO DUMP CHIEF EXEC, BUT AUTO PROBLEMS ALSO HAVE TO BE UNDER THE UNIONS UMBRELLA WHAT TO HAPPEN TO UNION LEADERS THAT ARE UP TO ARMPITS IN AUTO PROBLEMS What are the Unions going to have to give up?? does not seem to be much?? DETROIT (AP) - Time and time again, General Motors Corp.'s board of directors reaffirmed its support for Chairman and CEO Rick Wagoner, even as the company piled up billions of dollars in losses and begged for government loans to stay alive. But Wagoner is now a high-profile casualty of government intervention, forced out as part of the Obama administration's sweeping last-ditch effort to save the century-old auto giant. Wagoner, 56, who spent 32 years with GM working all over the world, stepped down effective immediately, the company said in a statement early Monday. He was replaced as CEO by Fritz Henderson, the company's vice chairman and chief operating officer.", 
        "intTime": 20090330, 
        "postID": 25, 
        "quote": "", 
        "reply": "FEDS CAUSE GM TO DUMP CHIEF EXEC, BUT AUTO PROBLEMS ALSO HAVE TO BE UNDER THE UNIONS UMBRELLA WHAT TO HAPPEN TO UNION LEADERS THAT ARE UP TO ARMPITS IN AUTO PROBLEMS What are the Unions going to have to give up?? does not seem to be much?? DETROIT (AP) - Time and time again, General Motors Corp.'s board of directors reaffirmed its support for Chairman and CEO Rick Wagoner, even as the company piled up billions of dollars in losses and begged for government loans to stay alive. But Wagoner is now a high-profile casualty of government intervention, forced out as part of the Obama administration's sweeping last-ditch effort to save the century-old auto giant. Wagoner, 56, who spent 32 years with GM working all over the world, stepped down effective immediately, the company said in a statement early Monday. He was replaced as CEO by Fritz Henderson, the company's vice chairman and chief operating officer.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 04:34:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product...", 
        "intTime": 20090330, 
        "postID": 26, 
        "quote": "", 
        "reply": "Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product...", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:10:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product... The little guy? You mean the autoworkers who have forced the automakers into a no win situation?", 
        "intTime": 20090330, 
        "postID": 27, 
        "quote": "Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product...", 
        "reply": " The little guy? You mean the autoworkers who have forced the automakers into a no win situation?", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:37:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product... The little guy? You mean the autoworkers who have forced the automakers into a no win situation? The little guy, you know those people that get a 100% life long pension.", 
        "intTime": 20090330, 
        "postID": 28, 
        "quote": "Originally posted by threerings: quote: Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product... The little guy? You mean the autoworkers who have forced the automakers into a no win situation?", 
        "reply": " The little guy, you know those people that get a 100% life long pension.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:44:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "War on unions, war on the middle class. The \"union busters\" have simply gotten more subtle.", 
        "intTime": 20090330, 
        "postID": 29, 
        "quote": "", 
        "reply": "War on unions, war on the middle class. The \"union busters\" have simply gotten more subtle.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:47:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: The little guy, you know those people that get a 100% life long pension. So do you. Would you like to see that renegotiated because of our economic crisis?", 
        "intTime": 20090330, 
        "postID": 30, 
        "quote": "Originally posted by GunnyRet03: The little guy, you know those people that get a 100% life long pension.", 
        "reply": " So do you. Would you like to see that renegotiated because of our economic crisis?", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 05:54:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "The top unions execs need to be oust as well. The union has gotten way out of hand. The union can be a good thing if properly used, but the unions of today has done nothing but produce lazy \"it's not my job\" workers and strangled the American consumer. You can keep your change, I'll continue to hug my guns and religion.", 
        "intTime": 20090330, 
        "postID": 31, 
        "quote": "", 
        "reply": "The top unions execs need to be oust as well. The union has gotten way out of hand. The union can be a good thing if properly used, but the unions of today has done nothing but produce lazy \"it's not my job\" workers and strangled the American consumer. You can keep your change, I'll continue to hug my guns and religion.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:02:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "mnoble1066"
    }, 
    {
        "content": "The UAW already made huge deals with the auto workers. The changes made in the last month bring the labor cost down to parity with the Japanese automakers.", 
        "intTime": 20090330, 
        "postID": 32, 
        "quote": "", 
        "reply": "The UAW already made huge deals with the auto workers. The changes made in the last month bring the labor cost down to parity with the Japanese automakers.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:07:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Don't buy a car for more than $10,000.00. Set that standard for yourself, and every manufacturer will have to come down to that price and find you, it's as simple as that. They can build all the $50,000.00 cars they want, but if nobody will buy them, something will have to give. Management and the Unions will have have to compromise their way down to what you will pay for, or throw in the towel. I've been driving the same Ford pickup for 15 years and will probably drive it for another 15 years because it cost me $30,000.00 to purchase on a 10 year equity loan. My wife drives a 10 year old Pontiac we bought from a rental company for under $10,000.00. Don't feed the monster, and it will have to go on a diet or die! I don't see Ford screaming for help (yet), but that is probably because they haven't spread themselves too thin with too many variants and lines, the way GM has - - If you don't buy, they'll come down to your wallet size or die - - Wandering and Wondering", 
        "intTime": 20090330, 
        "postID": 33, 
        "quote": "", 
        "reply": "Don't buy a car for more than $10,000.00. Set that standard for yourself, and every manufacturer will have to come down to that price and find you, it's as simple as that. They can build all the $50,000.00 cars they want, but if nobody will buy them, something will have to give. Management and the Unions will have have to compromise their way down to what you will pay for, or throw in the towel. I've been driving the same Ford pickup for 15 years and will probably drive it for another 15 years because it cost me $30,000.00 to purchase on a 10 year equity loan. My wife drives a 10 year old Pontiac we bought from a rental company for under $10,000.00. Don't feed the monster, and it will have to go on a diet or die! I don't see Ford screaming for help (yet), but that is probably because they haven't spread themselves too thin with too many variants and lines, the way GM has - - If you don't buy, they'll come down to your wallet size or die - - Wandering and Wondering", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:21:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "intTime": 20090330, 
        "postID": 34, 
        "quote": "", 
        "reply": "GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:29:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc. Not to mention V-8 Engines, and DAMNED STRAIGHT I work my azz off. Why shouldn't I take what I've EARNED and ENJOY some of the \"fruits of my labors\"? Maybe you'd be happier if we all lived in caves, wore fig leaves and ate grass clippings?", 
        "intTime": 20090330, 
        "postID": 35, 
        "quote": "Originally posted by SeaWitch1220: our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "reply": " Not to mention V-8 Engines, and DAMNED STRAIGHT I work my azz off. Why shouldn't I take what I've EARNED and ENJOY some of the \"fruits of my labors\"? Maybe you'd be happier if we all lived in caves, wore fig leaves and ate grass clippings?", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:39:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: War on unions, war on the middle class. The \"union busters\" have simply gotten more subtle. Subtle? How is forcing GM into bankruptcy and telling UAW retirees to get on medicaide subtle? This is the grand scheme: Tell GM and Chrysler they can either go bankrupt, or become owned by the Federal government. As federal employees, the workers will have to dump UAW and join the federal civil service union. They will lose their $40/hr paychecks, free medical care and full pension for WG-10 wages (which will still be around $30/hr), but the medical care will become some HMO and the retirement will become federal retirement...more like 30% of pay, and you still pay for health insurance. I love it! We'll combine GM and Chrylser and dub them \"Federal Auto\".", 
        "intTime": 20090330, 
        "postID": 36, 
        "quote": "Originally posted by SeaWitch1220: War on unions, war on the middle class. The \"union busters\" have simply gotten more subtle.", 
        "reply": " Subtle? How is forcing GM into bankruptcy and telling UAW retirees to get on medicaide subtle? This is the grand scheme: Tell GM and Chrysler they can either go bankrupt, or become owned by the Federal government. As federal employees, the workers will have to dump UAW and join the federal civil service union. They will lose their $40/hr paychecks, free medical care and full pension for WG-10 wages (which will still be around $30/hr), but the medical care will become some HMO and the retirement will become federal retirement...more like 30% of pay, and you still pay for health insurance. I love it! We'll combine GM and Chrylser and dub them \"Federal Auto\".", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:45:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by GunnyRet03: The little guy, you know those people that get a 100% life long pension. So do you. Would you like to see that renegotiated because of our economic crisis? I have a hard time equating a union worker with an active duty servicemember. But, since you mentioned it, I can see the \"standard\" 50% retirement w/ free healthcare for 20 years active service changing at some point in the future. I don't like it, but I can see it...especially after the annointed one suggesting having combat vets pay for service-related injuries with their own insurance within his first 100 days.", 
        "intTime": 20090330, 
        "postID": 37, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by GunnyRet03: The little guy, you know those people that get a 100% life long pension. So do you. Would you like to see that renegotiated because of our economic crisis?", 
        "reply": " I have a hard time equating a union worker with an active duty servicemember. But, since you mentioned it, I can see the \"standard\" 50% retirement w/ free healthcare for 20 years active service changing at some point in the future. I don't like it, but I can see it...especially after the annointed one suggesting having combat vets pay for service-related injuries with their own insurance within his first 100 days.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:48:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc. The US automakers have them as well. I have an 03 Pontiac Grand Am with a 5 speed, no power windows, basic radio, and no frills. It also gets 30 mpg.", 
        "intTime": 20090330, 
        "postID": 38, 
        "quote": "Originally posted by SeaWitch1220: GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "reply": " The US automakers have them as well. I have an 03 Pontiac Grand Am with a 5 speed, no power windows, basic radio, and no frills. It also gets 30 mpg.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 06:48:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: ... and the public should not have to bare it all. ... at least not until the weather heats up ... (I agree with your comment)", 
        "intTime": 20090330, 
        "postID": 39, 
        "quote": "... and the public should not have to bare it all.", 
        "reply": " ... at least not until the weather heats up ... (I agree with your comment)", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 07:02:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc. GM, Ford, Chrysler make no-frills cars. Problem is, they are sh**y cars for what you get. A basic Chevy Cobalt is 15k, and it feels cheap. The interior, the drive, everything, feels cheap. A base VW Jetta is 17k, a base Honda Civic is 16k, a base Toyota Corolla is 15k, and none of those cars feel cheap. Base model Kias are even less...and they don't feel cheap.", 
        "intTime": 20090330, 
        "postID": 40, 
        "quote": "Originally posted by SeaWitch1220: GWG, you are absolutely right. There IS a demand for simple, get-you-where-you-are-going, cars with no frills, but the only people making them are overseas. But we MUST have our leather seats, 8 stereo sound system, DVD player, backup camera, GPS, satellite radio, etc.", 
        "reply": " GM, Ford, Chrysler make no-frills cars. Problem is, they are sh**y cars for what you get. A basic Chevy Cobalt is 15k, and it feels cheap. The interior, the drive, everything, feels cheap. A base VW Jetta is 17k, a base Honda Civic is 16k, a base Toyota Corolla is 15k, and none of those cars feel cheap. Base model Kias are even less...and they don't feel cheap.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 07:03:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "jwr6"
    }, 
    {
        "content": "Some of the union leadership should be taking a walk with this critter.", 
        "intTime": 20090330, 
        "postID": 41, 
        "quote": "", 
        "reply": "Some of the union leadership should be taking a walk with this critter.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 07:32:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "67NOV"
    }, 
    {
        "content": "Everyday the grip of the socialist administration grows tighter while the sheeple and moles cheer it on. Viva the United Socialist States Republic, Viva the new Massa in chief!! This message has been edited. Last edited by: Drmwvr, Mon 30 March 2009 07:52 AM \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090330, 
        "postID": 42, 
        "quote": "", 
        "reply": "Everyday the grip of the socialist administration grows tighter while the sheeple and moles cheer it on. Viva the United Socialist States Republic, Viva the new Massa in chief!! This message has been edited. Last edited by: Drmwvr, Mon 30 March 2009 07:52 AM \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 07:35:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "With all the taxes I paid for those damn lazy welfare parasites and all the hugh bonuses paid to the corporate parasites I'm owed a $50,000 car, a $300,000 home and free health care.", 
        "intTime": 20090330, 
        "postID": 43, 
        "quote": "", 
        "reply": "With all the taxes I paid for those damn lazy welfare parasites and all the hugh bonuses paid to the corporate parasites I'm owed a $50,000 car, a $300,000 home and free health care.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 09:17:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Can anyone tell me what Wagoner's severance package is? How about what he's \"banked\" over his career compared to what the 32 year autoworker has banked. The entire compensation scale from the top down needs to be overhauled. It's impossible to demand pay cuts from the workers without equal reductions from management. Of course the unions got what they demanded because the management was getting their's too. Funny how anyone would give a damn about one man (who probably has plenty of money for his retirement) when thousands of long term employee's have been let go without so much as kick in the rear...??? The self righteous indignation is humorous at best. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090330, 
        "postID": 44, 
        "quote": "", 
        "reply": "Can anyone tell me what Wagoner's severance package is? How about what he's \"banked\" over his career compared to what the 32 year autoworker has banked. The entire compensation scale from the top down needs to be overhauled. It's impossible to demand pay cuts from the workers without equal reductions from management. Of course the unions got what they demanded because the management was getting their's too. Funny how anyone would give a damn about one man (who probably has plenty of money for his retirement) when thousands of long term employee's have been let go without so much as kick in the rear...??? The self righteous indignation is humorous at best. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 09:40:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by Drmwvr: Everyday the grip of the socialist administration grows tighter while the sheeple and moles cheer it on. Viva the United Socialist States Republic, Viva the new Massa in chief!! I made the point on another thread about bail outs being de facto socialism. No Obama can order these car companies to do anything he (th govt) wants. Watch, part of the \"restructuring\" will probably include a reduction / elimination of SUVs, increase in unionization, dictating hiring / firing policies, bonus payments, the list is endless. By holding thier hands out, various industies have sold thier collecitive souls to the devil.", 
        "intTime": 20090330, 
        "postID": 45, 
        "quote": "Originally posted by Drmwvr: Everyday the grip of the socialist administration grows tighter while the sheeple and moles cheer it on. Viva the United Socialist States Republic, Viva the new Massa in chief!!", 
        "reply": " I made the point on another thread about bail outs being de facto socialism. No Obama can order these car companies to do anything he (th govt) wants. Watch, part of the \"restructuring\" will probably include a reduction / elimination of SUVs, increase in unionization, dictating hiring / firing policies, bonus payments, the list is endless. By holding thier hands out, various industies have sold thier collecitive souls to the devil.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 10:31:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by jwr6: But, since you mentioned it, I can see the \"standard\" 50% retirement w/ free healthcare for 20 years active service changing at some point in the future. It already is gone. As far as I know, the last 20 yr 50%ers enlisted sone time during the late '80's, early '90's. I think you have to do 30 to get 50% now. That is incorrect. Military retirement is on three systems now depending on DIEMS date. Prior to a September 1980 entry it is based on your final pay, 50% at 20 years and 2.5% for each year after up to 75%. Under Carter the retirment systme was changed. September 1980 to August 1986 is the same, except pay is computed on the average of your final three years pay. This is the High 3 system. Under Reagan the retirement system was changed to under 50% at 20 years. In 1986 the retirement system was changed to 40% at 20 years, but a 3.5% increase per year so at 30 years it would be 75%. There is also a readjustment that beings it back to the same as High 3 at age 62. This is called Redux. That was changed again in 1999 under Clinton, with the FY 2000 Defense Budget. Now people that entered after 1986 have the option of choosing between the High 3 system, or taking a $30,000 payment at 15 years of service and the Redux retirement. I entered in August 95, so in Feb 2010 at my 14.5 year point I have to decide between Redux and the $30,000 payment and High 3. I'll be taking the High 3 since it will be at least $150,000 difference in retirement pay from the time I retire at about age 42 until Redux would catch up at 62. Since the law was changed before anyone under redux actually had 20 years, there is nobody that was forced to retire with less than the full 50% at 20 years.", 
        "intTime": 20090330, 
        "postID": 46, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by jwr6: But, since you mentioned it, I can see the \"standard\" 50% retirement w/ free healthcare for 20 years active service changing at some point in the future. It already is gone. As far as I know, the last 20 yr 50%ers enlisted sone time during the late '80's, early '90's. I think you have to do 30 to get 50% now.", 
        "reply": " That is incorrect. Military retirement is on three systems now depending on DIEMS date. Prior to a September 1980 entry it is based on your final pay, 50% at 20 years and 2.5% for each year after up to 75%. Under Carter the retirment systme was changed. September 1980 to August 1986 is the same, except pay is computed on the average of your final three years pay. This is the High 3 system. Under Reagan the retirement system was changed to under 50% at 20 years. In 1986 the retirement system was changed to 40% at 20 years, but a 3.5% increase per year so at 30 years it would be 75%. There is also a readjustment that beings it back to the same as High 3 at age 62. This is called Redux. That was changed again in 1999 under Clinton, with the FY 2000 Defense Budget. Now people that entered after 1986 have the option of choosing between the High 3 system, or taking a $30,000 payment at 15 years of service and the Redux retirement. I entered in August 95, so in Feb 2010 at my 14.5 year point I have to decide between Redux and the $30,000 payment and High 3. I'll be taking the High 3 since it will be at least $150,000 difference in retirement pay from the time I retire at about age 42 until Redux would catch up at 62. Since the law was changed before anyone under redux actually had 20 years, there is nobody that was forced to retire with less than the full 50% at 20 years.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-30 10:58:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product... Yes and we need to fire the CEO of the housing market companies, they have run that business into the ground as well. The housing/credit bubble had nothing do do with it, the boss just failed. Forget the dog, Beware of Owner", 
        "intTime": 20090331, 
        "postID": 47, 
        "quote": "Originally posted by SeaWitch1220: Good. It is about time the little guy doesn't take the hit. The war on the ever shrinking middle class has to stop sometime. I say fire all the top execs and let the workers take over. There was a time in this country when the businesses used to be run by people who knew something about the product...", 
        "reply": " Yes and we need to fire the CEO of the housing market companies, they have run that business into the ground as well. The housing/credit bubble had nothing do do with it, the boss just failed. Forget the dog, Beware of Owner", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-31 09:39:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "Tomcatt"
    }, 
    {
        "content": "The solution is simple. The US automakers need to create a product that people want and sell it at an affordable price. All rhetoric aside, they obviously have failed to do this and all the goverment programs, CEO changes and union 'give backs' will not change that. The American consumer has spoken, the industry has not been listening.", 
        "intTime": 20090331, 
        "postID": 48, 
        "quote": "", 
        "reply": "The solution is simple. The US automakers need to create a product that people want and sell it at an affordable price. All rhetoric aside, they obviously have failed to do this and all the goverment programs, CEO changes and union 'give backs' will not change that. The American consumer has spoken, the industry has not been listening.", 
        "threadID": "409192893_4770013912001", 
        "time": "2009-03-31 10:57:00", 
        "title": "GM EXEC TANKED, BUT WHAT ABOUT UNION??", 
        "userID": "adminnco1"
    }
]