[
    {
        "content": "Look! The Great Obstructionist Party came up with a budget. Okay, it is more of an outline of a budget. Maybe more of an invitation to a budget. The only actual numbers in it are the page numbers. Just four or five days ago he of too much bronzer, John Boehner called Timothy Geithner's proposal for Congress to pass legislation allowing the federal government to take over failing non-bank financial institutions \"an unprecedented grab of power.\" And what did Boehner (how is that pronounced? When two vowels go walking…) put into his “Prelude to a Budget”? Well gosh, lookie here…they proposed giving the federal government authority to take over financial institutions. GOP Budget This is a .gov link They DID try really hard though…and someone was able to use shapes! That ought to raise your approval rating!", 
        "intTime": 20090328, 
        "postID": 1, 
        "quote": "", 
        "reply": "Look! The Great Obstructionist Party came up with a budget. Okay, it is more of an outline of a budget. Maybe more of an invitation to a budget. The only actual numbers in it are the page numbers. Just four or five days ago he of too much bronzer, John Boehner called Timothy Geithner's proposal for Congress to pass legislation allowing the federal government to take over failing non-bank financial institutions \"an unprecedented grab of power.\" And what did Boehner (how is that pronounced? When two vowels go walking…) put into his “Prelude to a Budget”? Well gosh, lookie here…they proposed giving the federal government authority to take over financial institutions. GOP Budget This is a .gov link They DID try really hard though…and someone was able to use shapes! That ought to raise your approval rating!", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 07:11:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Its easy to create a budget when all you do is walk into a stroe and say: total it up! Then drop your \"Citizen's card\" on the desk and say: They'll cover it. It would have been a real attempt at leadership if Obama HAD actually attempted to create a budget: You know sitting down and figuring out how much money he had to spend and then attempting to fund his projects with it.. Instead he just opened up a vein in the heart of America and will let it flow until we bleed dry. In a very real sense, Obama doesn't have a budget either.", 
        "intTime": 20090328, 
        "postID": 2, 
        "quote": "", 
        "reply": "Its easy to create a budget when all you do is walk into a stroe and say: total it up! Then drop your \"Citizen's card\" on the desk and say: They'll cover it. It would have been a real attempt at leadership if Obama HAD actually attempted to create a budget: You know sitting down and figuring out how much money he had to spend and then attempting to fund his projects with it.. Instead he just opened up a vein in the heart of America and will let it flow until we bleed dry. In a very real sense, Obama doesn't have a budget either.", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 08:20:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "threerings"
    }, 
    {
        "content": "It would be interesting if we were not already witness to the abject failure of socialism in the U.S.S.R. but THIS time they're gonna get it right........ THEY PROMISED!!! Now, I got a great bridge I can give you such a deal on...... your own mother wouldn't give you!!! Call 1-800-SUCKERS !!!", 
        "intTime": 20090328, 
        "postID": 3, 
        "quote": "", 
        "reply": "It would be interesting if we were not already witness to the abject failure of socialism in the U.S.S.R. but THIS time they're gonna get it right........ THEY PROMISED!!! Now, I got a great bridge I can give you such a deal on...... your own mother wouldn't give you!!! Call 1-800-SUCKERS !!!", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 08:34:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "tawodi"
    }, 
    {
        "content": "It's too bad the republicans had to get an ass-whippin' during the recent elections to come up with what they purport to be a sensible plan to reduce spending, cut the deficit, and eliminate government waste. They should try this approach when they are in power, but as the saying goes, power corrupts, and absolute power corrupts absolutely. We are witnessing the beginning effects with the new Obama Administration and we've seen the results with the democrats who now control congress. \"The World's Finest\"", 
        "intTime": 20090328, 
        "postID": 4, 
        "quote": "", 
        "reply": "It's too bad the republicans had to get an ass-whippin' during the recent elections to come up with what they purport to be a sensible plan to reduce spending, cut the deficit, and eliminate government waste. They should try this approach when they are in power, but as the saying goes, power corrupts, and absolute power corrupts absolutely. We are witnessing the beginning effects with the new Obama Administration and we've seen the results with the democrats who now control congress. \"The World's Finest\"", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 11:03:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "You can't spend your way out of a recession and you can't borrow your way out of a deficit...food for thought JMHO, I could be wrong...", 
        "intTime": 20090328, 
        "postID": 5, 
        "quote": "", 
        "reply": "You can't spend your way out of a recession and you can't borrow your way out of a deficit...food for thought JMHO, I could be wrong...", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 11:10:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: It's too bad the republicans had to get an ass-whippin' during the recent elections to come up with what they purport to be a sensible plan to reduce spending, cut the deficit, and eliminate government waste. They should try this approach when they are in power, but as the saying goes, power corrupts, and absolute power corrupts absolutely. We are witnessing the beginning effects with the new Obama Administration and we've seen the results with the democrats who now control congress. You do realize I hope that once the actual numbers get added (which will not happen BTW. The Republicans are shrewd not stupid), the budget may actually be worse than the obama and Democrat version.", 
        "intTime": 20090328, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: It's too bad the republicans had to get an ass-whippin' during the recent elections to come up with what they purport to be a sensible plan to reduce spending, cut the deficit, and eliminate government waste. They should try this approach when they are in power, but as the saying goes, power corrupts, and absolute power corrupts absolutely. We are witnessing the beginning effects with the new Obama Administration and we've seen the results with the democrats who now control congress.", 
        "reply": " You do realize I hope that once the actual numbers get added (which will not happen BTW. The Republicans are shrewd not stupid), the budget may actually be worse than the obama and Democrat version.", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 12:37:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Hey, here's a thought...why don't the government get out of the way and let we the people get out of this mess ourselves? JMHO, I could be wrong...", 
        "intTime": 20090328, 
        "postID": 7, 
        "quote": "", 
        "reply": "Hey, here's a thought...why don't the government get out of the way and let we the people get out of this mess ourselves? JMHO, I could be wrong...", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 12:48:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Look! The Great Obstructionist Party came up with a budget. Okay, it is more of an outline of a budget. Maybe more of an invitation to a budget. The only actual numbers in it are the page numbers. Only the page numbers? I guess you didn't read much into it. There are some other things I would like to see in there, as well as more details. It sure seems better than the crap the Obama administration has been throwing around. Where was the line by line review, accountability and so on? People speak out about Bush's spending (many of us have spoken out), but yet are quiet when Obama is spending at record amounts. Oh, but it's all OK now, because Obama is signing for the spending. The blame goes around to many people, both Democrat and Republican. The Dem's and Repubs who signed porkulus with over 8,000 earmarks should be ashamed of themselves. Those who support Cap and Trade, the GWPRA, and carbon taxes, should as well be ashamed. So I guess you support the GWPRA, Carbon Taxes, and the Cap and trade scam? That will fix everything . People that have never generated an ounce of steam, or Watt of electricity are coming up with these scams. Many of these same folks are put in charge, whether it be a cabinet position, within the EPA, or just the writing of legislation. The fact that any of those ill equipped, ill informed folks are allowed to make decisions and draft policy is beyond me. When you refer to the great obstructionist party....are you talking about many Democrats, and their obstruction of further drilling and exploration? Pelosi and others have nerve saying anything about \"failed energy policy\". Ever been to the UAE Sea Witch? In 2006 their GDP grew by 35%. Oh the evil oil companies over here don't deserve to expand, create more jobs, and make us less dependent on imported oil. Those evil greedy Americans don't deserve any more wealth. Let's just keep it overseas. You talk of obstructionist policies? You need to know where to look. How can Obama talk about growing our economy, creating more jobs, and his famous \"tax cuts for 95% of Americans\" when he supports Cap and Trade along with energy taxes to boot ? Their energy taxes and cap and trade scams will be an increase on 100% of Americans. There was one thing that was most effective by way of environmental control's, and bettering the environment. Can you guess what that was? I'll give you a hint. It has been more effective and successful than Al Gore, the IPCC, the UN, and even the alarmists. It also has been and will be more effective than any scam they have on the drawing board. It has actually produced results, instead of hot air. You have people here calling the Republicans and some Democrats obstructionists, and they should, as one poster said in another thread \"shut up and let Obama do what he wants\". I'm glad some of these elected officials are obstructing policy that will lead us to disaster, rather than help. I am glad they are getting in the way of Cap and Trade, carbon taxes and the other scams they are throwing around. Many have woken up, and it's about damn time. Maybe some Democrats will run against Polosi, Dodd, Reid, and Frank. If not, I do hope there will be someone to put up a challenge. There are many others that need to be voted out on both sides as well.", 
        "intTime": 20090328, 
        "postID": 8, 
        "quote": "Originally posted by SeaWitch1220: Look! The Great Obstructionist Party came up with a budget. Okay, it is more of an outline of a budget. Maybe more of an invitation to a budget. The only actual numbers in it are the page numbers.", 
        "reply": " Only the page numbers? I guess you didn't read much into it. There are some other things I would like to see in there, as well as more details. It sure seems better than the crap the Obama administration has been throwing around. Where was the line by line review, accountability and so on? People speak out about Bush's spending (many of us have spoken out), but yet are quiet when Obama is spending at record amounts. Oh, but it's all OK now, because Obama is signing for the spending. The blame goes around to many people, both Democrat and Republican. The Dem's and Repubs who signed porkulus with over 8,000 earmarks should be ashamed of themselves. Those who support Cap and Trade, the GWPRA, and carbon taxes, should as well be ashamed. So I guess you support the GWPRA, Carbon Taxes, and the Cap and trade scam? That will fix everything . People that have never generated an ounce of steam, or Watt of electricity are coming up with these scams. Many of these same folks are put in charge, whether it be a cabinet position, within the EPA, or just the writing of legislation. The fact that any of those ill equipped, ill informed folks are allowed to make decisions and draft policy is beyond me. When you refer to the great obstructionist party....are you talking about many Democrats, and their obstruction of further drilling and exploration? Pelosi and others have nerve saying anything about \"failed energy policy\". Ever been to the UAE Sea Witch? In 2006 their GDP grew by 35%. Oh the evil oil companies over here don't deserve to expand, create more jobs, and make us less dependent on imported oil. Those evil greedy Americans don't deserve any more wealth. Let's just keep it overseas. You talk of obstructionist policies? You need to know where to look. How can Obama talk about growing our economy, creating more jobs, and his famous \"tax cuts for 95% of Americans\" when he supports Cap and Trade along with energy taxes to boot ? Their energy taxes and cap and trade scams will be an increase on 100% of Americans. There was one thing that was most effective by way of environmental control's, and bettering the environment. Can you guess what that was? I'll give you a hint. It has been more effective and successful than Al Gore, the IPCC, the UN, and even the alarmists. It also has been and will be more effective than any scam they have on the drawing board. It has actually produced results, instead of hot air. You have people here calling the Republicans and some Democrats obstructionists, and they should, as one poster said in another thread \"shut up and let Obama do what he wants\". I'm glad some of these elected officials are obstructing policy that will lead us to disaster, rather than help. I am glad they are getting in the way of Cap and Trade, carbon taxes and the other scams they are throwing around. Many have woken up, and it's about damn time. Maybe some Democrats will run against Polosi, Dodd, Reid, and Frank. If not, I do hope there will be someone to put up a challenge. There are many others that need to be voted out on both sides as well.", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 14:23:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "Instead of the bailouts, Obama could have sent each taxpayer a check for 150K..think that would have helped the economy? Instead he didn't..why.. Because his voters are not taxpayers and he has to pay off and buy more support from those who did get the \"stimulus\".", 
        "intTime": 20090328, 
        "postID": 9, 
        "quote": "", 
        "reply": "Instead of the bailouts, Obama could have sent each taxpayer a check for 150K..think that would have helped the economy? Instead he didn't..why.. Because his voters are not taxpayers and he has to pay off and buy more support from those who did get the \"stimulus\".", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 18:19:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Instead of the bailouts, Obama could have sent each taxpayer a check for 150K..think that would have helped the economy? Instead he didn't..why.. Because his voters are not taxpayers and he has to pay off and buy more support from those who did get the \"stimulus\". Well thats a interesting thought? But Bush tried that with the Iraqis and were still paying thru the nose", 
        "intTime": 20090328, 
        "postID": 10, 
        "quote": "Originally posted by threerings: Instead of the bailouts, Obama could have sent each taxpayer a check for 150K..think that would have helped the economy? Instead he didn't..why.. Because his voters are not taxpayers and he has to pay off and buy more support from those who did get the \"stimulus\".", 
        "reply": " Well thats a interesting thought? But Bush tried that with the Iraqis and were still paying thru the nose", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 18:47:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by threerings: Instead of the bailouts, Obama could have sent each taxpayer a check for 150K..think that would have helped the economy? Instead he didn't..why.. Because his voters are not taxpayers and he has to pay off and buy more support from those who did get the \"stimulus\". Never forget, this gross waste of money is not about \"fixing\" the economy, which they only make worse in any event with their delayed and inaccurate collectivism and payoffs to substandard groups (morally and intellectually) whose ideas and innate values are so worthless that they must get help from cronies in polyticks, or their ideas would be ignored by good Americans. MoveBowels.org and the fecal matter it floats cannot survive long among intelligent, well-informed, hard-working, honest Americans. The ultimate objective here is power and control over the lives of competent and good Americans who do not need such intrusive, wasteful, deceitful guvmint and polytishuns, who know well how to serve themselves, like some of the top execs in some of the major companies, but have forgotten how to serve the people (did they ever really know?).", 
        "intTime": 20090328, 
        "postID": 11, 
        "quote": "Originally posted by threerings: Instead of the bailouts, Obama could have sent each taxpayer a check for 150K..think that would have helped the economy? Instead he didn't..why.. Because his voters are not taxpayers and he has to pay off and buy more support from those who did get the \"stimulus\".", 
        "reply": " Never forget, this gross waste of money is not about \"fixing\" the economy, which they only make worse in any event with their delayed and inaccurate collectivism and payoffs to substandard groups (morally and intellectually) whose ideas and innate values are so worthless that they must get help from cronies in polyticks, or their ideas would be ignored by good Americans. MoveBowels.org and the fecal matter it floats cannot survive long among intelligent, well-informed, hard-working, honest Americans. The ultimate objective here is power and control over the lives of competent and good Americans who do not need such intrusive, wasteful, deceitful guvmint and polytishuns, who know well how to serve themselves, like some of the top execs in some of the major companies, but have forgotten how to serve the people (did they ever really know?).", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-28 19:34:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Look! The Great Obstructionist Party came up with a budget. Okay, it is more of an outline of a budget. Maybe more of an invitation to a budget. The only actual numbers in it are the page numbers. Just four or five days ago he of too much bronzer, John Boehner called Timothy Geithner's proposal for Congress to pass legislation allowing the federal government to take over failing non-bank financial institutions \"an unprecedented grab of power.\" And what did Boehner (how is that pronounced? When two vowels go walking…) put into his “Prelude to a Budget”? Well gosh, lookie here…they proposed giving the federal government authority to take over financial institutions. GOP Budget This is a .gov link They DID try really hard though…and someone was able to use shapes! That ought to raise your approval rating! Sea they had pretty pictures though! and graphs! *stamping feet* sheesh,simply being the party of no was workin much better for them than that press conference and those cute little binders", 
        "intTime": 20090329, 
        "postID": 12, 
        "quote": "Originally posted by SeaWitch1220: Look! The Great Obstructionist Party came up with a budget. Okay, it is more of an outline of a budget. Maybe more of an invitation to a budget. The only actual numbers in it are the page numbers. Just four or five days ago he of too much bronzer, John Boehner called Timothy Geithner's proposal for Congress to pass legislation allowing the federal government to take over failing non-bank financial institutions \"an unprecedented grab of power.\" And what did Boehner (how is that pronounced? When two vowels go walking…) put into his “Prelude to a Budget”? Well gosh, lookie here…they proposed giving the federal government authority to take over financial institutions. GOP Budget This is a .gov link They DID try really hard though…and someone was able to use shapes! That ought to raise your approval rating!", 
        "reply": " Sea they had pretty pictures though! and graphs! *stamping feet* sheesh,simply being the party of no was workin much better for them than that press conference and those cute little binders", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-29 05:44:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "ccurtis0801"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Where's the beef? More hot air from the right. Actually this thread came from the left...way left...way way way....", 
        "intTime": 20090329, 
        "postID": 13, 
        "quote": "Originally posted by dmuhler: Where's the beef? More hot air from the right.", 
        "reply": " Actually this thread came from the left...way left...way way way....", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-29 07:04:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by dmuhler: Where's the beef? More hot air from the right. Actually this thread came from the left...way left...way way way.... No, not WAY left. I am pretty left, but then I have some pretty centrist views as well as some views people would call conservative. You know, kinda like the rest of the country...a little bit of everything. Tell me, what do you think of the Republican response? How 'bout that \"budget\" of theirs? Do you really see this 19 page outline as the best thing the Republican Party, the party that has been in power for the last eight years, could have come up with after all this time (and obstructionism)?", 
        "intTime": 20090329, 
        "postID": 14, 
        "quote": "Originally posted by threerings: quote: Originally posted by dmuhler: Where's the beef? More hot air from the right. Actually this thread came from the left...way left...way way way....", 
        "reply": " No, not WAY left. I am pretty left, but then I have some pretty centrist views as well as some views people would call conservative. You know, kinda like the rest of the country...a little bit of everything. Tell me, what do you think of the Republican response? How 'bout that \"budget\" of theirs? Do you really see this 19 page outline as the best thing the Republican Party, the party that has been in power for the last eight years, could have come up with after all this time (and obstructionism)?", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-29 07:13:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by threerings: quote: Originally posted by dmuhler: Where's the beef? More hot air from the right. Actually this thread came from the left...way left...way way way.... No, not WAY left. I am pretty left, but then I have some pretty centrist views as well as some views people would call conservative. You know, kinda like the rest of the country...a little bit of everything. Tell me, what do you think of the Republican response? How 'bout that \"budget\" of theirs? Do you really see this 19 page outline as the best thing the Republican Party, the party that has been in power for the last eight years, could have come up with after all this time (and obstructionism)? I honestly have not taken the time to read it, its like looking at the roster Detriot Lions...why bother? It is just as dishonest to call the GOP obstructionist, or to insist they held power for the last 8 years.. In any event I refuse to tie my beliefs to any party..I dont see Bush as someone how shared my views on...well anything. But compare him to Kerry? Ya.", 
        "intTime": 20090329, 
        "postID": 15, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by threerings: quote: Originally posted by dmuhler: Where's the beef? More hot air from the right. Actually this thread came from the left...way left...way way way.... No, not WAY left. I am pretty left, but then I have some pretty centrist views as well as some views people would call conservative. You know, kinda like the rest of the country...a little bit of everything. Tell me, what do you think of the Republican response? How 'bout that \"budget\" of theirs? Do you really see this 19 page outline as the best thing the Republican Party, the party that has been in power for the last eight years, could have come up with after all this time (and obstructionism)?", 
        "reply": " I honestly have not taken the time to read it, its like looking at the roster Detriot Lions...why bother? It is just as dishonest to call the GOP obstructionist, or to insist they held power for the last 8 years.. In any event I refuse to tie my beliefs to any party..I dont see Bush as someone how shared my views on...well anything. But compare him to Kerry? Ya.", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-29 09:20:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Look! The Great Obstructionist Party came up with a budget. Okay, it is more of an outline of a budget. Maybe more of an invitation to a budget. The only actual numbers in it are the page numbers. Just four or five days ago he of too much bronzer, John Boehner called Timothy Geithner's proposal for Congress to pass legislation allowing the federal government to take over failing non-bank financial institutions \"an unprecedented grab of power.\" And what did Boehner (how is that pronounced? When two vowels go walking…) put into his “Prelude to a Budget”? Well gosh, lookie here…they proposed giving the federal government authority to take over financial institutions. GOP Budget This is a .gov link They DID try really hard though…and someone was able to use shapes! That ought to raise your approval rating! I know a joke. They \"curb\" spending and \"curb\" taxes. Of course as long as it's the curb on the road to thier (mis)agenda it must be A ok!", 
        "intTime": 20090329, 
        "postID": 16, 
        "quote": "Originally posted by SeaWitch1220: Look! The Great Obstructionist Party came up with a budget. Okay, it is more of an outline of a budget. Maybe more of an invitation to a budget. The only actual numbers in it are the page numbers. Just four or five days ago he of too much bronzer, John Boehner called Timothy Geithner's proposal for Congress to pass legislation allowing the federal government to take over failing non-bank financial institutions \"an unprecedented grab of power.\" And what did Boehner (how is that pronounced? When two vowels go walking…) put into his “Prelude to a Budget”? Well gosh, lookie here…they proposed giving the federal government authority to take over financial institutions. GOP Budget This is a .gov link They DID try really hard though…and someone was able to use shapes! That ought to raise your approval rating!", 
        "reply": " I know a joke. They \"curb\" spending and \"curb\" taxes. Of course as long as it's the curb on the road to thier (mis)agenda it must be A ok!", 
        "threadID": "409192893_5150061912001", 
        "time": "2009-03-29 10:16:00", 
        "title": "Hey! The GOP got themselves a budget! Well, not really but...", 
        "userID": "crackerjacks61"
    }
]