[
    {
        "content": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\" quote: George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher. \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "intTime": 20090601, 
        "postID": 1, 
        "quote": "George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher.", 
        "reply": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\"  \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 05:35:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "intTime": 20090601, 
        "postID": 2, 
        "quote": "", 
        "reply": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 06:54:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "stillkit"
    }, 
    {
        "content": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "intTime": 20090601, 
        "postID": 3, 
        "quote": "", 
        "reply": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 09:50:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect. You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "intTime": 20090601, 
        "postID": 4, 
        "quote": "Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "reply": " You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "intTime": 20090601, 
        "postID": 5, 
        "quote": "", 
        "reply": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:01:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "intTime": 20090601, 
        "postID": 6, 
        "quote": "", 
        "reply": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:02:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes. Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "intTime": 20090601, 
        "postID": 7, 
        "quote": "Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "reply": " Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:53:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "intTime": 20090601, 
        "postID": 8, 
        "quote": "", 
        "reply": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:03:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "intTime": 20090601, 
        "postID": 9, 
        "quote": "...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" ", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:05:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now? Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090601, 
        "postID": 10, 
        "quote": "Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": " Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:06:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "L0A1"
    }, 
    {
        "content": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "intTime": 20090601, 
        "postID": 11, 
        "quote": "", 
        "reply": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "intTime": 20090601, 
        "postID": 12, 
        "quote": "Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "reply": " well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:23:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: own troops in a courtroom in Baghdad. hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "intTime": 20090601, 
        "postID": 13, 
        "quote": "own troops in a courtroom in Baghdad.", 
        "reply": " hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:40:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "intTime": 20090601, 
        "postID": 14, 
        "quote": "Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "reply": " There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "intTime": 20090601, 
        "postID": 15, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "reply": " I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:24:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "intTime": 20090601, 
        "postID": 16, 
        "quote": "Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "reply": " ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:49:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "intTime": 20090601, 
        "postID": 17, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "reply": " Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:59:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie. Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "intTime": 20090601, 
        "postID": 18, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie.", 
        "reply": " Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 14:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom. Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "intTime": 20090601, 
        "postID": 19, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom.", 
        "reply": " Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 15:36:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "intTime": 20090601, 
        "postID": 20, 
        "quote": "", 
        "reply": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 16:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Boospar"
    }, 
    {
        "content": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "intTime": 20090601, 
        "postID": 21, 
        "quote": "", 
        "reply": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 20:46:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "intTime": 20090601, 
        "postID": 22, 
        "quote": "", 
        "reply": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 22:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "intTime": 20090601, 
        "postID": 23, 
        "quote": "", 
        "reply": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 23:16:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\" quote: George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher. \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "intTime": 20090601, 
        "postID": 25, 
        "quote": "George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher.", 
        "reply": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\"  \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 05:35:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "intTime": 20090601, 
        "postID": 26, 
        "quote": "", 
        "reply": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 06:54:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "stillkit"
    }, 
    {
        "content": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "intTime": 20090601, 
        "postID": 27, 
        "quote": "", 
        "reply": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 09:50:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect. You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "intTime": 20090601, 
        "postID": 28, 
        "quote": "Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "reply": " You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "intTime": 20090601, 
        "postID": 29, 
        "quote": "", 
        "reply": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:01:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "intTime": 20090601, 
        "postID": 30, 
        "quote": "", 
        "reply": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:02:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes. Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "intTime": 20090601, 
        "postID": 31, 
        "quote": "Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "reply": " Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:53:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "intTime": 20090601, 
        "postID": 32, 
        "quote": "", 
        "reply": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:03:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "intTime": 20090601, 
        "postID": 33, 
        "quote": "...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" ", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:05:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now? Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090601, 
        "postID": 34, 
        "quote": "Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": " Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:06:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "L0A1"
    }, 
    {
        "content": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "intTime": 20090601, 
        "postID": 35, 
        "quote": "", 
        "reply": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "intTime": 20090601, 
        "postID": 36, 
        "quote": "Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "reply": " well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:23:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: own troops in a courtroom in Baghdad. hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "intTime": 20090601, 
        "postID": 37, 
        "quote": "own troops in a courtroom in Baghdad.", 
        "reply": " hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:40:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "intTime": 20090601, 
        "postID": 38, 
        "quote": "Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "reply": " There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "intTime": 20090601, 
        "postID": 39, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "reply": " I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:24:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "intTime": 20090601, 
        "postID": 40, 
        "quote": "Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "reply": " ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:49:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "intTime": 20090601, 
        "postID": 41, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "reply": " Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:59:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie. Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "intTime": 20090601, 
        "postID": 42, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie.", 
        "reply": " Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 14:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom. Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "intTime": 20090601, 
        "postID": 43, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom.", 
        "reply": " Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 15:36:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "intTime": 20090601, 
        "postID": 44, 
        "quote": "", 
        "reply": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 16:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Boospar"
    }, 
    {
        "content": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "intTime": 20090601, 
        "postID": 45, 
        "quote": "", 
        "reply": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 20:46:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "intTime": 20090601, 
        "postID": 46, 
        "quote": "", 
        "reply": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 22:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "intTime": 20090601, 
        "postID": 47, 
        "quote": "", 
        "reply": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 23:16:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\" quote: George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher. \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "intTime": 20090601, 
        "postID": 49, 
        "quote": "George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher.", 
        "reply": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\"  \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 05:35:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "intTime": 20090601, 
        "postID": 50, 
        "quote": "", 
        "reply": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 06:54:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "stillkit"
    }, 
    {
        "content": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "intTime": 20090601, 
        "postID": 51, 
        "quote": "", 
        "reply": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 09:50:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect. You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "intTime": 20090601, 
        "postID": 52, 
        "quote": "Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "reply": " You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "intTime": 20090601, 
        "postID": 53, 
        "quote": "", 
        "reply": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:01:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "intTime": 20090601, 
        "postID": 54, 
        "quote": "", 
        "reply": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:02:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes. Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "intTime": 20090601, 
        "postID": 55, 
        "quote": "Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "reply": " Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:53:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "intTime": 20090601, 
        "postID": 56, 
        "quote": "", 
        "reply": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:03:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "intTime": 20090601, 
        "postID": 57, 
        "quote": "...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" ", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:05:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now? Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090601, 
        "postID": 58, 
        "quote": "Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": " Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:06:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "L0A1"
    }, 
    {
        "content": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "intTime": 20090601, 
        "postID": 59, 
        "quote": "", 
        "reply": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "intTime": 20090601, 
        "postID": 60, 
        "quote": "Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "reply": " well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:23:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: own troops in a courtroom in Baghdad. hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "intTime": 20090601, 
        "postID": 61, 
        "quote": "own troops in a courtroom in Baghdad.", 
        "reply": " hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:40:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "intTime": 20090601, 
        "postID": 62, 
        "quote": "Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "reply": " There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "intTime": 20090601, 
        "postID": 63, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "reply": " I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:24:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "intTime": 20090601, 
        "postID": 64, 
        "quote": "Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "reply": " ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:49:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "intTime": 20090601, 
        "postID": 65, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "reply": " Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:59:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie. Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "intTime": 20090601, 
        "postID": 66, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie.", 
        "reply": " Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 14:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom. Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "intTime": 20090601, 
        "postID": 67, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom.", 
        "reply": " Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 15:36:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "intTime": 20090601, 
        "postID": 68, 
        "quote": "", 
        "reply": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 16:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Boospar"
    }, 
    {
        "content": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "intTime": 20090601, 
        "postID": 69, 
        "quote": "", 
        "reply": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 20:46:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "intTime": 20090601, 
        "postID": 70, 
        "quote": "", 
        "reply": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 22:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "intTime": 20090601, 
        "postID": 71, 
        "quote": "", 
        "reply": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 23:16:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\" quote: George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher. \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "intTime": 20090601, 
        "postID": 73, 
        "quote": "George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher.", 
        "reply": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\"  \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 05:35:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "intTime": 20090601, 
        "postID": 74, 
        "quote": "", 
        "reply": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 06:54:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "stillkit"
    }, 
    {
        "content": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "intTime": 20090601, 
        "postID": 75, 
        "quote": "", 
        "reply": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 09:50:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect. You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "intTime": 20090601, 
        "postID": 76, 
        "quote": "Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "reply": " You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "intTime": 20090601, 
        "postID": 77, 
        "quote": "", 
        "reply": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:01:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "intTime": 20090601, 
        "postID": 78, 
        "quote": "", 
        "reply": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:02:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes. Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "intTime": 20090601, 
        "postID": 79, 
        "quote": "Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "reply": " Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:53:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "intTime": 20090601, 
        "postID": 80, 
        "quote": "", 
        "reply": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:03:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "intTime": 20090601, 
        "postID": 81, 
        "quote": "...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" ", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:05:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now? Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090601, 
        "postID": 82, 
        "quote": "Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": " Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:06:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "L0A1"
    }, 
    {
        "content": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "intTime": 20090601, 
        "postID": 83, 
        "quote": "", 
        "reply": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "intTime": 20090601, 
        "postID": 84, 
        "quote": "Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "reply": " well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:23:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: own troops in a courtroom in Baghdad. hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "intTime": 20090601, 
        "postID": 85, 
        "quote": "own troops in a courtroom in Baghdad.", 
        "reply": " hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:40:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "intTime": 20090601, 
        "postID": 86, 
        "quote": "Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "reply": " There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "intTime": 20090601, 
        "postID": 87, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "reply": " I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:24:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "intTime": 20090601, 
        "postID": 88, 
        "quote": "Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "reply": " ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:49:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "intTime": 20090601, 
        "postID": 89, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "reply": " Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:59:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie. Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "intTime": 20090601, 
        "postID": 90, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie.", 
        "reply": " Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 14:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom. Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "intTime": 20090601, 
        "postID": 91, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom.", 
        "reply": " Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 15:36:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "intTime": 20090601, 
        "postID": 92, 
        "quote": "", 
        "reply": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 16:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Boospar"
    }, 
    {
        "content": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "intTime": 20090601, 
        "postID": 93, 
        "quote": "", 
        "reply": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 20:46:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "intTime": 20090601, 
        "postID": 94, 
        "quote": "", 
        "reply": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 22:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "intTime": 20090601, 
        "postID": 95, 
        "quote": "", 
        "reply": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 23:16:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\" quote: George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher. \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "intTime": 20090601, 
        "postID": 97, 
        "quote": "George R. Tiller, the nation's most prominent provider of controversial late-term abortions, was shot and killed yesterday in the lobby of his Lutheran church in Wichita, where he was serving as an usher.", 
        "reply": "\"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/31/AR2009053101181.html?wprss=rss_politics\"  \"http://www.salon.com/news/feature/2009/05/31/tiller/index.html\" quote: When his show airs tomorrow, Bill O'Reilly will most certainly decry the death of Kansas doctor George Tiller, who was killed Sunday while attending church services with his wife. Tiller, O'Reilly will say, was a man who was guilty of barbaric acts, but a civilized society does not resort to lawless murder, even against its worst members. And O'Reilly, we can assume, will genuinely mean this. But there's no other person who bears as much responsibility for the characterization of Tiller as a savage on the loose, killing babies willy-nilly thanks to the collusion of would-be sophisticated cultural elites, a bought-and-paid-for governor and scofflaw secular journalists. Tiller's name first appeared on \"The Factor\" on Feb. 25, 2005. Since then, O'Reilly and his guest hosts have brought up the doctor on 28 more episodes, including as recently as April 27 of this year. Almost invariably, Tiller is described as \"Tiller the Baby Killer.\" Tiller, O'Reilly likes to say, \"destroys fetuses for just about any reason right up until the birth date for $5,000.\" He's guilty of \"Nazi stuff,\" said O'Reilly on June 8, 2005; a moral equivalent to NAMBLA and al-Qaida, he suggested on March 15, 2006. \"This is the kind of stuff happened in Mao's China, Hitler's Germany, Stalin's Soviet Union,\" said O'Reilly on Nov. 9, 2006. O'Reilly has also frequently linked Tiller to his longtime obsession, child molestation and rape. Because a young teenager who received an abortion from Tiller could, by definition, have been a victim of statutory rape, O'Reilly frequently suggested that the clinic was covering up for child rapists (rather than teenage boyfriends) by refusing to release records on the abortions performed. When Kansas Attorney General Phill Kline, an O'Reilly favorite who faced harsh criticism for seeking Tiller's records, was facing electoral defeat by challenger Paul Morrison, O'Reilly said, \"Now we don't endorse candidates here, but obviously, that would be a colossal mistake. Society must afford some protection for viable babies and children who are raped.\" (Morrison ultimately unseated Kline.) This is where O'Reilly's campaign against George Tiller becomes dangerous. While he never advocated anything violent or illegal, the Fox bully repeatedly portrayed the doctor as a murderer on the loose, allowed to do whatever he wanted by corrupt and decadent authorities. \"Also, it looks like Dr. Tiller, who some call Tiller the Baby Killer, is spending a large amount of money in order to get Mr. Morrison elected. That opens up all kinds of questions,\" said O'Reilly on Nov. 6, 2006, in one of many suggestions that Tiller was improperly influencing the election. Tiller's excuses for performing late-term abortions, O'Reilly suggested, were frou-frou, New Age, false ailments: The woman might have a headache or anxiety, or have been dumped by her boyfriend. She might be \"depressed,\" scoffed O'Reilly, which he dismissed as \"feeling a bit blue and carrying a certified check.\" There was, he proposed on Jan. 5, 2007, a kind of elite conspiracy of silence on Tiller. \"Yes, OK, but we know about the press. But it becomes a much more intense problem when you have a judge, confronted with evidence of criminal wrongdoing, who throws it out on some technicality because he wants to be liked at the country club. Then it's intense.\" Tiller, said O'Reilly on Jan. 6 of this year, was a major supporter of then-Gov. Kathleen Sebelius. \"I think it's unfairly characterized as just a grip and grin relationship. He was a pretty big supporter of hers.\" She had cashed her campaign check from Tiller, \"doesn't seem to be real upset about this guy operating a death mill, which is exactly what it is in her state, does she?\" he asked on July 14 of last year. \"Maybe she'll - maybe she'll pardon him,\" he scoffed two months ago. This is where it gets most troubling. O'Reilly's language describing Tiller, and accusing the state and its elites of complicity in his actions, could become extremely vivid. On June 12, 2007, he said, \"Yes, I think we all know what this is. And if the state of Kansas doesn't stop this man, then anybody who prevents that from happening has blood on their hands as the governor does right now, Governor Sebelius.\" Three days later, he added, \"No question Dr. Tiller has blood on his hands. But now so does Governor Sebelius. She is not fit to serve. Nor is any Kansas politician who supports Tiller's business of destruction. I wouldn't want to be these people if there is a Judgment Day. I just - you know...Kansas is a great state, but this is a disgrace upon everyone who lives in Kansas. Is it not?\" This characterization of Tiller fits exactly into ancient conservative, paranoid stories: a decadent, permissive and callous elite tolerates moral monstrosities that every common-sense citizen just knows to be awful. Conspiring against our folk wisdom, O'Reilly says, the sophisticates have shielded Tiller from the appropriate, legal consequences for his deeds. It's left to \"judgment day\" to give him what's coming. O'Reilly didn't tell anyone to do anything violent, but he did put Tiller in the public eye, and help make him the focus of a movement with a history of violence against exactly these kinds of targets (including Tiller himself, who had already been shot). In those circumstances, flinging around words like \"blood on their hands,\" \"pardon,\" \"country club\" and \"judgment day\" was sensationally irresponsible. Has O'Reilly been, in effect, yelling \"Fire\" in a crowded theater and therefore, does he have some responsibility for inciting the death of Doctor Tiller, who was murdered standing in the foyer of his church during Sunday religious services, by an anti-abortion terrorist? Or was it just the act of a terrorist, and O'Reilly's continual attacks on the doctor (\"No question Dr. Tiller has blood on his hands\") had no connection with his murder?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 05:35:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "intTime": 20090601, 
        "postID": 98, 
        "quote": "", 
        "reply": "Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 06:54:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "stillkit"
    }, 
    {
        "content": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "intTime": 20090601, 
        "postID": 99, 
        "quote": "", 
        "reply": "You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 09:50:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect. You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "intTime": 20090601, 
        "postID": 100, 
        "quote": "Originally posted by stillkit: Of course words have meaning and consequences. The same could be said of those who continually accuse the President of all sorts of monstrosities and blandly forward lies about him around the internet. When, God forbid, someone kills him, they'll all have the same blood on their hands. But, as with O'Reilly, they'll never see the cause and effect.", 
        "reply": " You're right they're not lies they're truths and people don't listen to truths even if it's from their own leader; See when common sense folks like me tell liberals what truths are they call us liars. I dunno go figure.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "intTime": 20090601, 
        "postID": 101, 
        "quote": "", 
        "reply": "LMBO Salon news.. oh no it's not a liberal magazine or anything.....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:01:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "intTime": 20090601, 
        "postID": 102, 
        "quote": "", 
        "reply": "Will the same logic be applied to MoveOn.org for the shooting incident at the Little Rock Recruiting office or is irrational hyperole reserved solely for attacks on non-liberals?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:02:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes. Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "intTime": 20090601, 
        "postID": 103, 
        "quote": "Originally posted by Bladensburg: You Americans are crazy. You go absolutely bonkers about Janet Jackson's covered nipple flash but this bloke gets away with virtual incitement to murder on a regular basis. You really do have a wonky set of priorities sometimes.", 
        "reply": " Wonky and bonkers in 1 sentence damn! Yeh, he incited them. Hey but at least we dont have muslims calling for death in our streets. Whats that about priorities... Didnt hear the usual suspects here get up in arms about air america randy rhodes making assasination jokes about gb2. so, puhleeeese....", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 10:53:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "intTime": 20090601, 
        "postID": 104, 
        "quote": "", 
        "reply": "No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:03:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "peter3_1"
    }, 
    {
        "content": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "intTime": 20090601, 
        "postID": 105, 
        "quote": "...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": "\"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" ", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:05:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now? Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090601, 
        "postID": 106, 
        "quote": "Originally posted by Fightdirector: \"http://blog.beliefnet.com/stevenwaldman/2009/05/tiller-assassination.html\" quote: ...at a minimum, conservatives have to make a new choice: take seriously right wing extremists - the real ones, not the bloviators -or run the risk of truly being lumped together. In a way, conservatives now face a choice similar to what liberals in the late 1960s and early 1970s faced during the hayday of the Weather Underground. Some on the New Left defended them as legitimate-albeit-excitable members of their broad coalition, while other more traditional liberals attacked them as extremists who violated liberal ideals. My sense of the history is that enough on the New Left defended extremists to tar all of liberalism. Will that happen for conservatives now?", 
        "reply": " Really, so it would be fair to say that all muslims are terrorists then right??? I have never heard of anyone so blantantly baiting in my life. I call BS on the OP. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:06:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "L0A1"
    }, 
    {
        "content": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "intTime": 20090601, 
        "postID": 107, 
        "quote": "", 
        "reply": "One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "intTime": 20090601, 
        "postID": 108, 
        "quote": "Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business.", 
        "reply": " well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 11:23:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: own troops in a courtroom in Baghdad. hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "intTime": 20090601, 
        "postID": 109, 
        "quote": "own troops in a courtroom in Baghdad.", 
        "reply": " hmmm seem to remember they get beheaded before they even see a court in the hands of jihadist wonder why very few prisoners being taken,,, hmmmm wonder why", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:40:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "intTime": 20090601, 
        "postID": 110, 
        "quote": "Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too?", 
        "reply": " There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 12:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "intTime": 20090601, 
        "postID": 111, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it", 
        "reply": " I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:24:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "intTime": 20090601, 
        "postID": 112, 
        "quote": "Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.'", 
        "reply": " ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:49:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "intTime": 20090601, 
        "postID": 113, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by esample1: quote: Originally posted by Ira1945: quote: Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but there's a bit of a difference between jokes obviously intended as such and what does read as being not far off \"Who will rid me of this turbulent [doctor]?\" A street demonstration is not really the same as a national broadcast but quite a few of those Muslims you mention have been done for incitement recently. More amusingly one lot down in Luton actually got filled in by lads from a more \"mainstream\" mosque the other week on the grounds that amongst other things they were bad for business. well we do have our issues and problems, but wth another guy that pulled babies out of the womb but killed them while partially in the womb, when in fact they might live just fine.... is now dead good freakin riddance The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' ANY MOTHER THAT ALLOWS OR HAS A PARTIAL BIRTH ABORTION WHERE A LIVING CHILD IS MURDERED RIGHT BEFORE IT IS 'REMOVED' IS A POS AND BARES THE BURDEN OF MURDER JUST LIKE THE DEAD DOC", 
        "reply": " Partial birth abortions are against the law. Late term abortions aren't performed with that procedure anymore. I wonder why these abortion doctor killers don't share your views? Do they really think killing doctors is going to stop abortions? Women will just go elsewhere. Maybe they should follow my advice about kidnapping mothers since they advocate force. That will teach those mothers...", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 13:59:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie. Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "intTime": 20090601, 
        "postID": 114, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by rayld2: quote: Originally posted by peter3_1: No, the adult that takes the action is responsible for those results. Making the facts public knowledge should be a requirement of the free press, not hiding it! O'Reilly is a Catholic and believes abortion is infanticide. When it comes to late third trimester abortion, I agree completely. DO his killings justify the murder? No. Did Kansas Justice fail to effectively end Dr. Tiller's terrable practice? Yes they did fail. So, should we blame the former Kansas Gov. , beneficiary of Dr. Tiller's political largess too? There is a DIFFERENCE between getting out the facts and doing the equivalent of shouting fire in a crowded room. Oh and by the way giving out FACTS WAS NOT what Mr. O'Reilly did since many of his so called FACTS were so twisted and loaded that they were in fact LIES. I\"d bet one grand sum of cash that the shooter and his lawyer are hoping everyone in the jury pool buys what you're selling, ray. Besides...I don't like O'Reilly enough to put him in the same class as a Twinkie.", 
        "reply": " Bull. If they bought what I actually said all that would happen is that if charged they would convict O'Reilly of incitement. Definition quote: in Criminal Law to instigate, persuade, or move another to commit a crime; in this sense nearly synonymous with abet.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 14:00:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom. Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "intTime": 20090601, 
        "postID": 115, 
        "quote": "Originally posted by Yooper_tj: quote: Originally posted by esample1: quote: Originally posted by Ira1945: [QUOTE]Originally posted by Bladensburg: One paragraph actually Gunny . I see your point but <snip>The Factor did not cause it I've always wondered why you people who advocate violence against abortion doctors, never blame the mother? I'm sure the doctors don't hogtie the mothers and forcibly abort their babies. Perhaps they could kidnap the mothers and strap them down until they have the baby, and send the mother and baby on their merry way. Then they'd really be 'saving a life.' Don't you doubt for a minute that there's hate leftover for the Mothers. That pit's got no bottom.", 
        "reply": " Hmm, do they ever mention the fathers I wonder? Quite a lot of unwanted pregnancies must come about from fathers not wanting to use condoms but one rarely hears any condemnation of them.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 15:36:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "intTime": 20090601, 
        "postID": 116, 
        "quote": "", 
        "reply": "I have been aware of Tiller the Killer since the 1990s. Many pro-life activists have known of him prior to Bill O'Reilly taking up the cause.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 16:07:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Boospar"
    }, 
    {
        "content": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "intTime": 20090601, 
        "postID": 117, 
        "quote": "", 
        "reply": "Just to correct something here... The vast majority of late-term abortions do not occur because the child isn't wanted. Typically, they occur because of a severe deformity in the fetus or a major health problem for the mother. I used to be obsessively pro-life, and I heard all the rhetoric about late-term abortions, and I thought it was that simple. I THOUGHT that they happened because women who were stupid and waited to get the abortion (which I thought was wrong anyway), and that healthy infants were being slaughtered. And THAT sort of lie is the garbage I believed because I swallowed the right-wing religious rhetoric hook, line, and sinker. The truth is that late-term abortions only occur in extreme circumstances. Often, the babies are WANTED, and it turns out that the baby would be born with such extreme deformities (malfunctioning organs, missing heart chambers, NO BRAIN) that it would only suffer severely before dying a miserable death. Sometimes, the risk is even so bad that the fetus could die while still in the mother, leading to severe complications that put the mother's life at risk. These things HAPPEN. And there's often no way to know until LATE in the pregnancy. Go on... read a few case studies. Read it, if you dare to subject yourself to the medical truths. Other circumstances are when younger girls are raped and are not allowed to see a doctor until it becomes obvious that there's no way to hide the pregnancy. This image of perfectly healthy mothers with perfectly healthy fetuses strolling in for late-term abortions because they just decided they had a \"headache\" (as one poster here put it), or were depressed, or just decided they didn't want a kid... that's BULL. You see, it's easy to condemn things when you have an idealized negative view of the opponents. It's easy to condemn women and the doctors who provide the services they need when you don't know the specifics, when you can imagine that they're callous, careless people who want to kill children... which is the farthest thing from the truth.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 20:46:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "intTime": 20090601, 
        "postID": 118, 
        "quote": "", 
        "reply": "O'Reilly repeatedly claimed that Dr. Tiller, or \"Tiller the Killer\" as he referred to him, would perform late term abortions right up to the end of the ninth month for anyone with $5,000, no questions asked. He claimed you could \"murder your child\" simply because you were having a bad day. That's typical O'Reilly and FOX Noise BS! A late term abortion can't legally be performed in Kansas until after at least two physicians have independently determined that not terminating the pregnancy would cause serious irreparable harm to the mother. In some cases that would include the mother's probable death. I can't imagine any pregnant woman or doctor taking such a decision lightly.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 22:57:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "intTime": 20090601, 
        "postID": 119, 
        "quote": "", 
        "reply": "O'Reilly walked the line but just barely didn't cross it. That's what the talking heads do. whip up hate with half truths and outright lies then deny any and all involvement.", 
        "threadID": "409192893_2570077422001", 
        "time": "2009-06-01 23:16:00", 
        "title": "Bill O'Reilly and the Kansas Terrorist: Cause and Effect?", 
        "userID": "karlhungusjr"
    }
]