[
    {
        "content": "I thought this might be fun to do and a good deviation from the usual politics and bickering around here. so. just two questions. answer as best you can. I'll post the link to the answers later(if anyone has any interest). Question: If you are standing on the Moon, and holding a pen, and you let it go, it will: Choices: float away float where it is move sideways fall to the ground none of the above Question: When the Apollo astronauts were on the Moon, they did not fall off because: Choices: the Earth's gravity extends to the Moon the Moon has gravity they wore heavy boots they had safety ropes they had spiked shoes  ", 
        "intTime": 20090504, 
        "postID": 1, 
        "quote": "", 
        "reply": "I thought this might be fun to do and a good deviation from the usual politics and bickering around here. so. just two questions. answer as best you can. I'll post the link to the answers later(if anyone has any interest). Question: If you are standing on the Moon, and holding a pen, and you let it go, it will: Choices: float away float where it is move sideways fall to the ground none of the above Question: When the Apollo astronauts were on the Moon, they did not fall off because: Choices: the Earth's gravity extends to the Moon the Moon has gravity they wore heavy boots they had safety ropes they had spiked shoes  ", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-04 23:43:00", 
        "title": "just for fun.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "The car the astronauts drove on the moon was... A. A Meyers Manx dune buggy. B. A big block Camaro. C. A Hemi 'Cuda. D. An electric vehicle. During one of the Apollo missions I saw a shooting star. I swear it had \"Titleist\" written on it.", 
        "intTime": 20090505, 
        "postID": 2, 
        "quote": "", 
        "reply": "The car the astronauts drove on the moon was... A. A Meyers Manx dune buggy. B. A big block Camaro. C. A Hemi 'Cuda. D. An electric vehicle. During one of the Apollo missions I saw a shooting star. I swear it had \"Titleist\" written on it.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-05 01:17:00", 
        "title": "just for fun.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "duh! it was a Hemi 'Cuda!!", 
        "intTime": 20090505, 
        "postID": 3, 
        "quote": "", 
        "reply": "duh! it was a Hemi 'Cuda!!", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-05 01:24:00", 
        "title": "just for fun.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Next time it won't be so easy!", 
        "intTime": 20090505, 
        "postID": 4, 
        "quote": "", 
        "reply": "Next time it won't be so easy!", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-05 01:28:00", 
        "title": "just for fun.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I voted that it would float where it was and that the moon has gravity (just a lot less gravity). Curious to see the answers! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 5, 
        "quote": "", 
        "reply": "I voted that it would float where it was and that the moon has gravity (just a lot less gravity). Curious to see the answers! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-05 05:52:00", 
        "title": "just for fun.", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: I voted that it would float where it was and that the moon has gravity (just a lot less gravity). Curious to see the answers! I'm thinking the same thing. Don", 
        "intTime": 20090505, 
        "postID": 6, 
        "quote": "Originally posted by FollowMeInfantry: I voted that it would float where it was and that the moon has gravity (just a lot less gravity). Curious to see the answers!", 
        "reply": " I'm thinking the same thing. Don", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-05 06:01:00", 
        "title": "just for fun.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "man...i was kinda hoping more people would have voted on this...", 
        "intTime": 20090505, 
        "postID": 7, 
        "quote": "", 
        "reply": "man...i was kinda hoping more people would have voted on this...", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-05 21:13:00", 
        "title": "just for fun.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: I voted that it would float where it was and that the moon has gravity (just a lot less gravity). FollowMeInfantry The Moon has one-sixth the gravity of Earth. Astronauts on foot found that hopping was better than walking on the Moon. If the gravity were low enough to allow a pen to \"float\" the astronauts would shoot hundreds of feet up when hopping. I almost said \"up into the air\" but the moon has none. Which is also why an electric vehicle was chosen for transportation. The \"Cuda, Camaro, and dune buggy would have been non-starters. But you all knew that! Moon cruiser Earth cruiser", 
        "intTime": 20090505, 
        "postID": 8, 
        "quote": "I voted that it would float where it was and that the moon has gravity (just a lot less gravity). FollowMeInfantry", 
        "reply": " The Moon has one-sixth the gravity of Earth. Astronauts on foot found that hopping was better than walking on the Moon. If the gravity were low enough to allow a pen to \"float\" the astronauts would shoot hundreds of feet up when hopping. I almost said \"up into the air\" but the moon has none. Which is also why an electric vehicle was chosen for transportation. The \"Cuda, Camaro, and dune buggy would have been non-starters. But you all knew that! Moon cruiser Earth cruiser", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-05 23:57:00", 
        "title": "just for fun.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth.", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "", 
        "reply": "The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-06 05:30:00", 
        "title": "just for fun.", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth. Bingo How about this one just for fun If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? considering a sound is created by a compression and rarefaction of air?", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth.", 
        "reply": " Bingo How about this one just for fun If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? considering a sound is created by a compression and rarefaction of air?", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-06 18:19:00", 
        "title": "just for fun.", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? of course. unless you were also inside the Vacuum.", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "If you put a metal object in a glass Vacumme tube and shake it will you hear a sound?", 
        "reply": " of course. unless you were also inside the Vacuum.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-06 21:54:00", 
        "title": "just for fun.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth. A fun thing I read once is that up on the moon people actually can strap wings on their arms and fly (assuming they have a room full of air to fly in). Our arm muscles are strong enough to lift our 1/6th weight up there. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090508, 
        "postID": 12, 
        "quote": "Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth.", 
        "reply": " A fun thing I read once is that up on the moon people actually can strap wings on their arms and fly (assuming they have a room full of air to fly in). Our arm muscles are strong enough to lift our 1/6th weight up there. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-08 08:10:00", 
        "title": "just for fun.", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth. Bingo How about this one just for fun If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? considering a sound is created by a compression and rarefaction of air? The metal STRIKING the glass causes the AIR out the tube to vibrate which is preceived as sound.", 
        "intTime": 20090508, 
        "postID": 13, 
        "quote": "Originally posted by john2x: quote: Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth. Bingo How about this one just for fun If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? considering a sound is created by a compression and rarefaction of air?", 
        "reply": " The metal STRIKING the glass causes the AIR out the tube to vibrate which is preceived as sound.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-08 08:49:00", 
        "title": "just for fun.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? of course. unless you were also inside the Vacuum. in which case you are dead and the dead can not hear Even in vacuum sound (vibration) travels via OTHER materials such as a space suit glove or helmet.", 
        "intTime": 20090508, 
        "postID": 14, 
        "quote": "Originally posted by karlhungusjr: quote: If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? of course. unless you were also inside the Vacuum.", 
        "reply": " in which case you are dead and the dead can not hear Even in vacuum sound (vibration) travels via OTHER materials such as a space suit glove or helmet.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-08 08:51:00", 
        "title": "just for fun.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by JakobA_DK: quote: Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth. A fun thing I read once is that up on the moon people actually can strap wings on their arms and fly (assuming they have a room full of air to fly in). Our arm muscles are strong enough to lift our 1/6th weight up there. That also makes assumption about the air pressure. I think the calculation required air pressure AT LEAST as high as sealevel on Earth.", 
        "intTime": 20090508, 
        "postID": 15, 
        "quote": "Originally posted by JakobA_DK: quote: Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth. A fun thing I read once is that up on the moon people actually can strap wings on their arms and fly (assuming they have a room full of air to fly in). Our arm muscles are strong enough to lift our 1/6th weight up there.", 
        "reply": " That also makes assumption about the air pressure. I think the calculation required air pressure AT LEAST as high as sealevel on Earth.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-08 08:52:00", 
        "title": "just for fun.", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Even in vacuum sound (vibration) travels via OTHER materials such as a space suit glove or helmet. right. but ONLY if that object is impacted. otherwise there's no way for the sound/vibration to reach that \"other material\".", 
        "intTime": 20090508, 
        "postID": 16, 
        "quote": "Even in vacuum sound (vibration) travels via OTHER materials such as a space suit glove or helmet.", 
        "reply": " right. but ONLY if that object is impacted. otherwise there's no way for the sound/vibration to reach that \"other material\".", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-08 08:59:00", 
        "title": "just for fun.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by john2x: quote: Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth. Bingo How about this one just for fun If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? considering a sound is created by a compression and rarefaction of air? The metal STRIKING the glass causes the AIR out the tube to vibrate which is preceived as sound. Hey you guys are good. So I guess that answers the question of a tree falling in the woods with no one there to hear it.", 
        "intTime": 20090508, 
        "postID": 17, 
        "quote": "Originally posted by rayld2: quote: Originally posted by john2x: quote: Originally posted by cosmicfish: The moon has gravity, with a force ~1/6 that of the Earth. Anything within its sphere of influence will be attracted towards its surface, which is why neither the astronauts, the landers, the buggies, or dropped pens floated away. Drop a pen on the moon, and it falls, albeit slower than on Earth. Bingo How about this one just for fun If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? considering a sound is created by a compression and rarefaction of air? The metal STRIKING the glass causes the AIR out the tube to vibrate which is preceived as sound.", 
        "reply": " Hey you guys are good. So I guess that answers the question of a tree falling in the woods with no one there to hear it.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-08 20:55:00", 
        "title": "just for fun.", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by karlhungusjr: quote: If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? of course. unless you were also inside the Vacuum. in which case you are dead and the dead can not hear Even in vacuum sound (vibration) travels via OTHER materials such as a space suit glove or helmet. There would be no compression or rarefaction of air to transmit any audable sound wave from any media in a vaccum.", 
        "intTime": 20090508, 
        "postID": 18, 
        "quote": "Originally posted by rayld2: quote: Originally posted by karlhungusjr: quote: If you put a metal object in a glass Vacumme tube and shake it will you hear a sound? of course. unless you were also inside the Vacuum. in which case you are dead and the dead can not hear Even in vacuum sound (vibration) travels via OTHER materials such as a space suit glove or helmet.", 
        "reply": " There would be no compression or rarefaction of air to transmit any audable sound wave from any media in a vaccum.", 
        "threadID": "409192893_2380015222001", 
        "time": "2009-05-08 21:03:00", 
        "title": "just for fun.", 
        "userID": "john2x"
    }
]