[
    {
        "content": "I recieved this as an e-mail and wanted to share Washington, DC 20500 Dear Mr. President, I am appalled that you bowed to the King of Saudi Arabia! We are a sovereign nation and bow to no one! The following letter, which I received as an email, expresses my sentiments a lot better than I could. I don’t know who actually wrote it, but he ought to be given an award. You have NO i dea what being an American is. You are tearing my country apart. Dear Mr. President, You don't speak for me. When you go to Europe and say that Americans are \"arrogant, dismissive and derisive\" of our allies, you don't speak for me. When you pander to foreign leaders, presuming to speak on behalf of all Americans, apologizing for the actions of President Bush, you don't speak for me. When you desperately try to surrender to the French and the Germans, the Russians and the Saudis, and even our great friends in the U.K. , just for the sake of maintaining your \"Messiah\" image, you don't speak for me. You and your wife may not be proud of America , but I am, sir. The Europeans seem to have forgotten who saved their collective asses in World War II, but I haven't. I haven't forgotten the tens of thousands of American fighting men who spilled their blood all across Europe to stop a murderous psychopath and his rampaging army. And I haven't forgotten the tens of thousands more who served in theater after that war, when the threat of Soviet advance through the Fulda Gap was ever present. I haven't forgotten, because I was there, for a time, anyway. I saw the obscenity of the Berlin Wall. I saw what happened to people who tried to escape communist Germany by climbing it, or trying to navigate the surrounding mine fields. I occasionally patrolled that border, mirroring Soviet or Czech patrols. And I remember watching on TV, crying as the wall was finally torn down. I love Germany and England ( France , not so much) and was ready to put my life on the line to defend them. So were the men I served with. Many Americ ans continue to serve across Europe in the military uniform of the United States , more willing, apparently, than many Europeans themselves, to preserve the freedom there that we have already paid for with our blood. I spent my money all over Europe , helping those economies flourish and grow, as did many other American servicemen and women who lived and served there. My only thanks was a very small paycheck, some wonderful memories and the knowledge that I was doing something worthwhile that I could be proud of for the rest of my life. I was, until today. And then some pandering politician comes along and apologizes for all of that. You never served your country in military uniform, sir, so you wouldn't know how positively insulting that is. In fact, you've never done anything for this country but run for office. You won the election and still you're running a campaign instead of acting like the leader of our great nation. And I don't like it one bit. I want peace. I want it for my family, for my friends and for my country. I've earned it and will continue to do so until the day I die. I want peace with Russia and China , even Iran and North Korea , if it were somehow p ossible. I want there to be a free exchange of ideas and trade goods and tourism between all of our nations. But the difference between you and I, sir, is that I would never sell out my country to gain their applause. Maybe you think you're earning their respect and admiration by being weak and apologetic, but I know better. The only thing you did was weaken my country. And I won't forget it. I am proud of my country and not even the President of the United States can take that away from me. Sir, you must stop bankrupting my country and taking it down a road to Socialism. You and the Democrats are tearing this country apart. Regards, Theo L. Peebles", 
        "intTime": 20090422, 
        "postID": 1, 
        "quote": "", 
        "reply": "I recieved this as an e-mail and wanted to share Washington, DC 20500 Dear Mr. President, I am appalled that you bowed to the King of Saudi Arabia! We are a sovereign nation and bow to no one! The following letter, which I received as an email, expresses my sentiments a lot better than I could. I don’t know who actually wrote it, but he ought to be given an award. You have NO i dea what being an American is. You are tearing my country apart. Dear Mr. President, You don't speak for me. When you go to Europe and say that Americans are \"arrogant, dismissive and derisive\" of our allies, you don't speak for me. When you pander to foreign leaders, presuming to speak on behalf of all Americans, apologizing for the actions of President Bush, you don't speak for me. When you desperately try to surrender to the French and the Germans, the Russians and the Saudis, and even our great friends in the U.K. , just for the sake of maintaining your \"Messiah\" image, you don't speak for me. You and your wife may not be proud of America , but I am, sir. The Europeans seem to have forgotten who saved their collective asses in World War II, but I haven't. I haven't forgotten the tens of thousands of American fighting men who spilled their blood all across Europe to stop a murderous psychopath and his rampaging army. And I haven't forgotten the tens of thousands more who served in theater after that war, when the threat of Soviet advance through the Fulda Gap was ever present. I haven't forgotten, because I was there, for a time, anyway. I saw the obscenity of the Berlin Wall. I saw what happened to people who tried to escape communist Germany by climbing it, or trying to navigate the surrounding mine fields. I occasionally patrolled that border, mirroring Soviet or Czech patrols. And I remember watching on TV, crying as the wall was finally torn down. I love Germany and England ( France , not so much) and was ready to put my life on the line to defend them. So were the men I served with. Many Americ ans continue to serve across Europe in the military uniform of the United States , more willing, apparently, than many Europeans themselves, to preserve the freedom there that we have already paid for with our blood. I spent my money all over Europe , helping those economies flourish and grow, as did many other American servicemen and women who lived and served there. My only thanks was a very small paycheck, some wonderful memories and the knowledge that I was doing something worthwhile that I could be proud of for the rest of my life. I was, until today. And then some pandering politician comes along and apologizes for all of that. You never served your country in military uniform, sir, so you wouldn't know how positively insulting that is. In fact, you've never done anything for this country but run for office. You won the election and still you're running a campaign instead of acting like the leader of our great nation. And I don't like it one bit. I want peace. I want it for my family, for my friends and for my country. I've earned it and will continue to do so until the day I die. I want peace with Russia and China , even Iran and North Korea , if it were somehow p ossible. I want there to be a free exchange of ideas and trade goods and tourism between all of our nations. But the difference between you and I, sir, is that I would never sell out my country to gain their applause. Maybe you think you're earning their respect and admiration by being weak and apologetic, but I know better. The only thing you did was weaken my country. And I won't forget it. I am proud of my country and not even the President of the United States can take that away from me. Sir, you must stop bankrupting my country and taking it down a road to Socialism. You and the Democrats are tearing this country apart. Regards, Theo L. Peebles", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 09:31:00", 
        "title": "Letter to President Obama", 
        "userID": "gmcneill"
    }, 
    {
        "content": "This belongs in Point/Counterpoint...", 
        "intTime": 20090422, 
        "postID": 2, 
        "quote": "", 
        "reply": "This belongs in Point/Counterpoint...", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 09:32:00", 
        "title": "Letter to President Obama", 
        "userID": "mcgreer"
    }, 
    {
        "content": "This could get fun... Here's a letter I wrote Obama. Anybody else have one? Mr. President; Sir you have been in office now for around three weeks and I have observed that you are not very good at doing your job. I knew this before you won the election but I am very pleased to see I was correct. The reason why you are having such a hard time handing the presidency is because of your Socialist ideology. It doesn’t work well in a Capitalist society like ours. I understand how proud you are of your past, even though personally it’s disturbing to know my President could not pass a background check to get a conceal carry permit in the state of Texas, but I digress. You obviously believed that you would be able to do what ever you liked to our country. I am so glad to see that your narcissistic views are being challenged at every corner. I understand that the Democrats are behind you because they have become the new “American Socialist Party”. And because of ACORN and few other entities that have been set up and protected in our country, the leftists in our government are feeling empowered. Regardless of all this, you are going to find an opposition to your agenda that will continue to make you feel incompetent, uncomfortable, and you will continue to feel a need to speak to second graders so you can keep a captive audience. Which by the way, I feel wasn’t a very wise thing to do. You being the president you should not have put those children in danger like that. You are the president, not some “Joe the plumber” that can just go around to elementary schools when you like. But that’s a whole other topic for another day. I noticed in the papers the other day, you were quoted as saying “I won”. Like that is some precursor to having everybody bow down to you like you’re some kind of a king, or dare I say “Messiah”. I’ve got a news flash for you sir; the only thing you’ve done is won an election. Just because you won it doesn’t make you a winner. You are part of the executive branch, a branch which is supposed to protect us from enemies, both foreign and domestic. Nowhere in the constitution does it say you are to take over business and make decisions that involve private industry. What you’re doing is Marxist and unconstitutional. I know you are aware of this, but I also know you don’t care. As long as the “means justifies the ends”, you are going to continue your charade. Now, to the point of this letter: I have a question and a request for you that I hope you can take the time to respond to. First the question. Knowing that you have tried to put tax cheats into your cabinet, I was wondering how you would feel if we, your loyal subjects decided not to pay taxes this year. What would you allow us to? A) Hold a press conference, look into the cameras with puppy dog eyes and apologize for our actions and promise to not do it again. And you give us a cabinet position. B) Sick the IRS on us like “the honorable” Tom Daschle says needs to happen to “tax cheats” C) Or, bail us out and give us a check so we can pay our taxes with somebody’s money, other than ours. You’ll notice that I’ve made the question multiple choice. I did this so you wouldn’t have to come up with an original thought. You’re welcome sir.", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "", 
        "reply": "This could get fun... Here's a letter I wrote Obama. Anybody else have one? Mr. President; Sir you have been in office now for around three weeks and I have observed that you are not very good at doing your job. I knew this before you won the election but I am very pleased to see I was correct. The reason why you are having such a hard time handing the presidency is because of your Socialist ideology. It doesn’t work well in a Capitalist society like ours. I understand how proud you are of your past, even though personally it’s disturbing to know my President could not pass a background check to get a conceal carry permit in the state of Texas, but I digress. You obviously believed that you would be able to do what ever you liked to our country. I am so glad to see that your narcissistic views are being challenged at every corner. I understand that the Democrats are behind you because they have become the new “American Socialist Party”. And because of ACORN and few other entities that have been set up and protected in our country, the leftists in our government are feeling empowered. Regardless of all this, you are going to find an opposition to your agenda that will continue to make you feel incompetent, uncomfortable, and you will continue to feel a need to speak to second graders so you can keep a captive audience. Which by the way, I feel wasn’t a very wise thing to do. You being the president you should not have put those children in danger like that. You are the president, not some “Joe the plumber” that can just go around to elementary schools when you like. But that’s a whole other topic for another day. I noticed in the papers the other day, you were quoted as saying “I won”. Like that is some precursor to having everybody bow down to you like you’re some kind of a king, or dare I say “Messiah”. I’ve got a news flash for you sir; the only thing you’ve done is won an election. Just because you won it doesn’t make you a winner. You are part of the executive branch, a branch which is supposed to protect us from enemies, both foreign and domestic. Nowhere in the constitution does it say you are to take over business and make decisions that involve private industry. What you’re doing is Marxist and unconstitutional. I know you are aware of this, but I also know you don’t care. As long as the “means justifies the ends”, you are going to continue your charade. Now, to the point of this letter: I have a question and a request for you that I hope you can take the time to respond to. First the question. Knowing that you have tried to put tax cheats into your cabinet, I was wondering how you would feel if we, your loyal subjects decided not to pay taxes this year. What would you allow us to? A) Hold a press conference, look into the cameras with puppy dog eyes and apologize for our actions and promise to not do it again. And you give us a cabinet position. B) Sick the IRS on us like “the honorable” Tom Daschle says needs to happen to “tax cheats” C) Or, bail us out and give us a check so we can pay our taxes with somebody’s money, other than ours. You’ll notice that I’ve made the question multiple choice. I did this so you wouldn’t have to come up with an original thought. You’re welcome sir.", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 09:46:00", 
        "title": "Letter to President Obama", 
        "userID": "comingofage"
    }, 
    {
        "content": "quote: Originally posted by comingo***e: This could get fun... Here's a letter I wrote Obama. Anybody else have one? Mr. President; Sir you have been in office now for around three weeks and I have observed that you are not very good at doing your job. I knew this before you won the election but I am very pleased to see I was correct. The reason why you are having such a hard time handing the presidency is because of your Socialist ideology. It doesn’t work well in a Capitalist society like ours. I understand how proud you are of your past, even though personally it’s disturbing to know my President could not pass a background check to get a conceal carry permit in the state of Texas, but I digress. You obviously believed that you would be able to do what ever you liked to our country. I am so glad to see that your narcissistic views are being challenged at every corner. I understand that the Democrats are behind you because they have become the new “American Socialist Party”. And because of ACORN and few other entities that have been set up and protected in our country, the leftists in our government are feeling empowered. Regardless of all this, you are going to find an opposition to your agenda that will continue to make you feel incompetent, uncomfortable, and you will continue to feel a need to speak to second graders so you can keep a captive audience. Which by the way, I feel wasn’t a very wise thing to do. You being the president you should not have put those children in danger like that. You are the president, not some “Joe the plumber” that can just go around to elementary schools when you like. But that’s a whole other topic for another day. I noticed in the papers the other day, you were quoted as saying “I won”. Like that is some precursor to having everybody bow down to you like you’re some kind of a king, or dare I say “Messiah”. I’ve got a news flash for you sir; the only thing you’ve done is won an election. Just because you won it doesn’t make you a winner. You are part of the executive branch, a branch which is supposed to protect us from enemies, both foreign and domestic. Nowhere in the constitution does it say you are to take over business and make decisions that involve private industry. What you’re doing is Marxist and unconstitutional. I know you are aware of this, but I also know you don’t care. As long as the “means justifies the ends”, you are going to continue your charade. Now, to the point of this letter: I have a question and a request for you that I hope you can take the time to respond to. First the question. Knowing that you have tried to put tax cheats into your cabinet, I was wondering how you would feel if we, your loyal subjects decided not to pay taxes this year. What would you allow us to? A) Hold a press conference, look into the cameras with puppy dog eyes and apologize for our actions and promise to not do it again. And you give us a cabinet position. B) Sick the IRS on us like “the honorable” Tom Daschle says needs to happen to “tax cheats” C) Or, bail us out and give us a check so we can pay our taxes with somebody’s money, other than ours. You’ll notice that I’ve made the question multiple choice. I did this so you wouldn’t have to come up with an original thought. You’re welcome sir.", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "Originally posted by comingo***e: This could get fun... Here's a letter I wrote Obama. Anybody else have one? Mr. President; Sir you have been in office now for around three weeks and I have observed that you are not very good at doing your job. I knew this before you won the election but I am very pleased to see I was correct. The reason why you are having such a hard time handing the presidency is because of your Socialist ideology. It doesn’t work well in a Capitalist society like ours. I understand how proud you are of your past, even though personally it’s disturbing to know my President could not pass a background check to get a conceal carry permit in the state of Texas, but I digress. You obviously believed that you would be able to do what ever you liked to our country. I am so glad to see that your narcissistic views are being challenged at every corner. I understand that the Democrats are behind you because they have become the new “American Socialist Party”. And because of ACORN and few other entities that have been set up and protected in our country, the leftists in our government are feeling empowered. Regardless of all this, you are going to find an opposition to your agenda that will continue to make you feel incompetent, uncomfortable, and you will continue to feel a need to speak to second graders so you can keep a captive audience. Which by the way, I feel wasn’t a very wise thing to do. You being the president you should not have put those children in danger like that. You are the president, not some “Joe the plumber” that can just go around to elementary schools when you like. But that’s a whole other topic for another day. I noticed in the papers the other day, you were quoted as saying “I won”. Like that is some precursor to having everybody bow down to you like you’re some kind of a king, or dare I say “Messiah”. I’ve got a news flash for you sir; the only thing you’ve done is won an election. Just because you won it doesn’t make you a winner. You are part of the executive branch, a branch which is supposed to protect us from enemies, both foreign and domestic. Nowhere in the constitution does it say you are to take over business and make decisions that involve private industry. What you’re doing is Marxist and unconstitutional. I know you are aware of this, but I also know you don’t care. As long as the “means justifies the ends”, you are going to continue your charade. Now, to the point of this letter: I have a question and a request for you that I hope you can take the time to respond to. First the question. Knowing that you have tried to put tax cheats into your cabinet, I was wondering how you would feel if we, your loyal subjects decided not to pay taxes this year. What would you allow us to? A) Hold a press conference, look into the cameras with puppy dog eyes and apologize for our actions and promise to not do it again. And you give us a cabinet position. B) Sick the IRS on us like “the honorable” Tom Daschle says needs to happen to “tax cheats” C) Or, bail us out and give us a check so we can pay our taxes with somebody’s money, other than ours. You’ll notice that I’ve made the question multiple choice. I did this so you wouldn’t have to come up with an original thought. You’re welcome sir.", 
        "reply": "", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 09:49:00", 
        "title": "Letter to President Obama", 
        "userID": "outlaws93"
    }, 
    {
        "content": "You like that one Outlaw... You'll love my open letter to the government. I sent it to EVERYBODY IN CONGRESS...lol. 12-5-08 Open letter to MY government To Whom It May Concern: The other day when I got home from work there stood a wild hog about eighty yards from my barn. I didn’t ask for this hog to be there, I didn’t coax it. I didn’t do anything for this creature to be on my property. But I can tell you this, he is going to feed my family for a couple of months. I figured the hog was a gift from God since I’ve never actually seen one on my property. So I took its life to benefit mine and the lives my family. I don’t feel any remorse or grief over killing this animal. In fact, I’m proud my father and the Marine Corps gave me the wisdom, skill and ability to do so. I’m humbled that God put this animal on earth and on my property so I could use its life to help mine. In these trying times today, with our economy, Iraq, and liberalism running a muck, I know that this “CHRISTMAS” there will be a lot of people in this country that didn’t have the blessings that I’ve had. There will be some Americans without a “hog” to help them through. I pray for these people and hope that they will be alright until things in this country get back to “normal”. I am a proud Marine Corps veteran that served this country under the Reagan administration. I pride myself on being an honest, hard working taxpayer. I ask nothing of my God, my family, or my country that I would not give back. That includes my life. But I have to tell you something from the heart. You are failing me. You are failing God. You are failing my family. And you are failing my country. You are not the “hog” on my property. He at least gave me something back for my labor. I, as most other Americans are absolutely sick and tired of the incompetence in Washington. You people are acting like a bunch of drunken liberals, spending my money on garbage that doesn’t help this country or its citizens. Your decision making process is that of a two year old. When are you going to stop? Please don’t hand me some crap about “it’s what the people want”. We all know the only reason the elections leaned toward Socialist candidates is because of the bias press on TV and in newspapers. They have an agenda to make this country fail, and you people are going to ride the coat tails all the way to a watery grave. Unfortunately, the coat tails you’re holding onto is ours. And I have no doubt that when we go under, you will be standing on our backs to stay afloat. I am so sick of Congress, and for that matter, all politicians stomping on our Constitution and refusing to run this country like our founding fathers told you to do. You have been chosen to “uphold” the Constitution, not rewrite it and shape it into something “YOU” want it to be or think it should be. When you got voted in, you took an oath. Do you not remember what that oath was? You have become a socialistic tyranny that is eating up everything “we the people” have worked and DIED for. You have become a rude, inconsiderate body of peoples who not only talk down to us in this country but you actually have the gall to speak “at” us like we’re your subjects and we’re to ignorant to understand. You keep information from us as though you have a right to it. You tell us half truths and ignore our pleas for you to operate within the confines of our Constitution. It is you people who are the ignorant ones. We are your boss! You work for us, and to be frank about it, you should all be fired. Unfortunately “we the people” can’t do that. You have your power and I know you will never give it up. You know deep down inside your egos believe that you are better than your constituents. You believe that “we the people” need to be governed. You believe that we need to be directed. You believe that we need to be guided down a path of your choosing. You believe “we the people” need to be controlled. I’ve got even more bad news for you… You are wrong. Here’s what “we the people” did! “We the people” of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America. This is America! We are a strong and independent people! We left a tyrannical government a couple hundred years ago. It’s not your job to over tax us, over burden us, and tell us what we can and can’t do. It’s not your job to have a “robin hood” mentality of taking from the rich and redistributing it to the poor. It’s not your job to thrust us into a world that doesn’t have our Constitution and force us to live under the rule of foreign lands. That’s called Socialism! Are you socialists? It’s your job to uphold the Constitution, the Bill of Rights and its bylaws. It’s your job to protect us from invaders, and it’s your job to protect the borders of our nation. Other than the war, I challenge any of you to tell me where you are meeting your job requirements within the bounds of our Constitution. I’m not expecting a response to this letter because I understand you would like nothing better than for the millions of people who are of the same mind as me to just disappear from your insulated world, never to be heard of again. Sorry, it ain’t gonna happen. People like me founded this country and we are here to stay! We are the real Americans and we believe in the American way, our God, our flag and the Constitution. We are the ones that are funding your little party. Consider us to be your “parents”. We make the rules, not you. And until you break us down and we become nothing but your loyal “subjects”, we will continue to be your “parents”. America didn’t get where we are because of you. You got where you are because of America. You have forgotten that the Constitution that protects you, protects us. You feel as if you’re above the rule of law. You believe that you are above the criteria you place on us, the people of this country. You disgust me, you absolutely disgust me. I have two of my family members serving in this great nation’s military right now. One has served two tours in Iraq and the other will be going to Afghanistan in a while. They like myself and millions of others in the country are willing to lay there lives down for it. I don’t think you care about there willingness to do so. In fact, I think politicians expect us to die for what you believe in. I believe it’s in a politician’s makeup to take, take, and take. You seem to do it with our money, why would I feel our lives are any different? I’m sure that my writing will fall on a deaf ear and a blind eye. But I’m also sure I’m not the only one who’s writing these same words to you. Hopefully one of us out here in the rice fields will be heard. I’m sure when we are, there will be a knock on our door by some government official of some bureaucracy to have a “talk” with us about our “feelings”. And I’m damn sure there will be an tax audit done on us. That’s ok, most of us have nothing to hide, unlike most politicians… But unlike most politicians we have nothing to hide behind. If you haven’t destroyed the country before Christmas, I hope you all have a great Christmas vacation. Be sure and enjoy your time off that you guys voted yourselves and “we the people” are paying for. Now I don’t want you worrying about us hard working, taxpaying, citizens out here. We don’t need a vacation. We will be working through the holiday season to make sure you have enough money to spend on whatever it is you want to spend it on. Also, please make sure you have a safe trip back to Washington after your much needed rest. I’m fully aware that you have a lot more damage you need to do to us, our country and our Constitution before Mr. Obama gains power and rips up our founding documents on the floor of Congress. It will be a fun time by all when you guys finally and completely turn us into a Socialist country. Sincerely; A United States Citizen Matthew Baker PS: I know this is asking way too much, but I’d give one of you a dollar if you had the brass to stand up in front of Congress and read this letter to them. I know it would never happen because it would mean that you are admitting that you are the problem, not us. And to admit failure is not in a politician’s vocabulary. But a guy can dream, can’t he?..... Merry Christmas!", 
        "intTime": 20090422, 
        "postID": 5, 
        "quote": "", 
        "reply": "You like that one Outlaw... You'll love my open letter to the government. I sent it to EVERYBODY IN CONGRESS...lol. 12-5-08 Open letter to MY government To Whom It May Concern: The other day when I got home from work there stood a wild hog about eighty yards from my barn. I didn’t ask for this hog to be there, I didn’t coax it. I didn’t do anything for this creature to be on my property. But I can tell you this, he is going to feed my family for a couple of months. I figured the hog was a gift from God since I’ve never actually seen one on my property. So I took its life to benefit mine and the lives my family. I don’t feel any remorse or grief over killing this animal. In fact, I’m proud my father and the Marine Corps gave me the wisdom, skill and ability to do so. I’m humbled that God put this animal on earth and on my property so I could use its life to help mine. In these trying times today, with our economy, Iraq, and liberalism running a muck, I know that this “CHRISTMAS” there will be a lot of people in this country that didn’t have the blessings that I’ve had. There will be some Americans without a “hog” to help them through. I pray for these people and hope that they will be alright until things in this country get back to “normal”. I am a proud Marine Corps veteran that served this country under the Reagan administration. I pride myself on being an honest, hard working taxpayer. I ask nothing of my God, my family, or my country that I would not give back. That includes my life. But I have to tell you something from the heart. You are failing me. You are failing God. You are failing my family. And you are failing my country. You are not the “hog” on my property. He at least gave me something back for my labor. I, as most other Americans are absolutely sick and tired of the incompetence in Washington. You people are acting like a bunch of drunken liberals, spending my money on garbage that doesn’t help this country or its citizens. Your decision making process is that of a two year old. When are you going to stop? Please don’t hand me some crap about “it’s what the people want”. We all know the only reason the elections leaned toward Socialist candidates is because of the bias press on TV and in newspapers. They have an agenda to make this country fail, and you people are going to ride the coat tails all the way to a watery grave. Unfortunately, the coat tails you’re holding onto is ours. And I have no doubt that when we go under, you will be standing on our backs to stay afloat. I am so sick of Congress, and for that matter, all politicians stomping on our Constitution and refusing to run this country like our founding fathers told you to do. You have been chosen to “uphold” the Constitution, not rewrite it and shape it into something “YOU” want it to be or think it should be. When you got voted in, you took an oath. Do you not remember what that oath was? You have become a socialistic tyranny that is eating up everything “we the people” have worked and DIED for. You have become a rude, inconsiderate body of peoples who not only talk down to us in this country but you actually have the gall to speak “at” us like we’re your subjects and we’re to ignorant to understand. You keep information from us as though you have a right to it. You tell us half truths and ignore our pleas for you to operate within the confines of our Constitution. It is you people who are the ignorant ones. We are your boss! You work for us, and to be frank about it, you should all be fired. Unfortunately “we the people” can’t do that. You have your power and I know you will never give it up. You know deep down inside your egos believe that you are better than your constituents. You believe that “we the people” need to be governed. You believe that we need to be directed. You believe that we need to be guided down a path of your choosing. You believe “we the people” need to be controlled. I’ve got even more bad news for you… You are wrong. Here’s what “we the people” did! “We the people” of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America. This is America! We are a strong and independent people! We left a tyrannical government a couple hundred years ago. It’s not your job to over tax us, over burden us, and tell us what we can and can’t do. It’s not your job to have a “robin hood” mentality of taking from the rich and redistributing it to the poor. It’s not your job to thrust us into a world that doesn’t have our Constitution and force us to live under the rule of foreign lands. That’s called Socialism! Are you socialists? It’s your job to uphold the Constitution, the Bill of Rights and its bylaws. It’s your job to protect us from invaders, and it’s your job to protect the borders of our nation. Other than the war, I challenge any of you to tell me where you are meeting your job requirements within the bounds of our Constitution. I’m not expecting a response to this letter because I understand you would like nothing better than for the millions of people who are of the same mind as me to just disappear from your insulated world, never to be heard of again. Sorry, it ain’t gonna happen. People like me founded this country and we are here to stay! We are the real Americans and we believe in the American way, our God, our flag and the Constitution. We are the ones that are funding your little party. Consider us to be your “parents”. We make the rules, not you. And until you break us down and we become nothing but your loyal “subjects”, we will continue to be your “parents”. America didn’t get where we are because of you. You got where you are because of America. You have forgotten that the Constitution that protects you, protects us. You feel as if you’re above the rule of law. You believe that you are above the criteria you place on us, the people of this country. You disgust me, you absolutely disgust me. I have two of my family members serving in this great nation’s military right now. One has served two tours in Iraq and the other will be going to Afghanistan in a while. They like myself and millions of others in the country are willing to lay there lives down for it. I don’t think you care about there willingness to do so. In fact, I think politicians expect us to die for what you believe in. I believe it’s in a politician’s makeup to take, take, and take. You seem to do it with our money, why would I feel our lives are any different? I’m sure that my writing will fall on a deaf ear and a blind eye. But I’m also sure I’m not the only one who’s writing these same words to you. Hopefully one of us out here in the rice fields will be heard. I’m sure when we are, there will be a knock on our door by some government official of some bureaucracy to have a “talk” with us about our “feelings”. And I’m damn sure there will be an tax audit done on us. That’s ok, most of us have nothing to hide, unlike most politicians… But unlike most politicians we have nothing to hide behind. If you haven’t destroyed the country before Christmas, I hope you all have a great Christmas vacation. Be sure and enjoy your time off that you guys voted yourselves and “we the people” are paying for. Now I don’t want you worrying about us hard working, taxpaying, citizens out here. We don’t need a vacation. We will be working through the holiday season to make sure you have enough money to spend on whatever it is you want to spend it on. Also, please make sure you have a safe trip back to Washington after your much needed rest. I’m fully aware that you have a lot more damage you need to do to us, our country and our Constitution before Mr. Obama gains power and rips up our founding documents on the floor of Congress. It will be a fun time by all when you guys finally and completely turn us into a Socialist country. Sincerely; A United States Citizen Matthew Baker PS: I know this is asking way too much, but I’d give one of you a dollar if you had the brass to stand up in front of Congress and read this letter to them. I know it would never happen because it would mean that you are admitting that you are the problem, not us. And to admit failure is not in a politician’s vocabulary. But a guy can dream, can’t he?..... Merry Christmas!", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 10:02:00", 
        "title": "Letter to President Obama", 
        "userID": "comingofage"
    }, 
    {
        "content": "hehehe <thumbsup>", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "", 
        "reply": "hehehe <thumbsup>", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 10:08:00", 
        "title": "Letter to President Obama", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Dear President Obama, I think you have been playing a very deep game in re these torture memos and Bush Administration criminality. You have repeatedly said, \"We must respect the rule of law, but I prefer to look forward.\" Then you turn around yesterday and say, \"Oh, that is all a matter for the attorney general.\" OH MY GOODNESS! And that is the new game. The Attorney General is the senior law enforcement officer, not the president! You have insulated yourself from the day to day thing on this. You can just let the wheels of justice turn. One thing I saw this morning on TV reinforces my feelings. That was a statement released last night by Admiral Blair, one of the national security guys. He -retracted- a statement he had made about some of the torture being useful and replaced that with a statement saying there was no way of knowing if the information could have been gotten through other means and that the torture of these prisoners had done much to hurt national security. Ouch! So that tells me (I hope) that the (good) fix is in. You have laid the foundation over months that you favor going forward and not looking back. You have also been careful to spread goodwill with the rank and file over at the CIA. But it now seems that there are going to some squealing little piggies with with their ass in a crack. -- Just like Watergate! And that can only lead one place. These little piggies include the torture memo authors Bybee, Yoo and Bradford, right up through Ashcroft, Rice and to the smirking chimp himself. They were again on the Morning Joe show making the point that a couple of months ago it was leaked that the \"Principals\" met on this back in 2002-03. The Principals included Rice, Ashcroft, Tenet, and a couple of others. They discussed torture techniques. They discussed torture of specific people. The talking head this morning was making the point that Tenet led the conversation a certain way -- to cover his butt. Seems like Cheney was at that meeting too. You are doing a great job, Mr. President. Thank you so much. Walt", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "", 
        "reply": "Dear President Obama, I think you have been playing a very deep game in re these torture memos and Bush Administration criminality. You have repeatedly said, \"We must respect the rule of law, but I prefer to look forward.\" Then you turn around yesterday and say, \"Oh, that is all a matter for the attorney general.\" OH MY GOODNESS! And that is the new game. The Attorney General is the senior law enforcement officer, not the president! You have insulated yourself from the day to day thing on this. You can just let the wheels of justice turn. One thing I saw this morning on TV reinforces my feelings. That was a statement released last night by Admiral Blair, one of the national security guys. He -retracted- a statement he had made about some of the torture being useful and replaced that with a statement saying there was no way of knowing if the information could have been gotten through other means and that the torture of these prisoners had done much to hurt national security. Ouch! So that tells me (I hope) that the (good) fix is in. You have laid the foundation over months that you favor going forward and not looking back. You have also been careful to spread goodwill with the rank and file over at the CIA. But it now seems that there are going to some squealing little piggies with with their ass in a crack. -- Just like Watergate! And that can only lead one place. These little piggies include the torture memo authors Bybee, Yoo and Bradford, right up through Ashcroft, Rice and to the smirking chimp himself. They were again on the Morning Joe show making the point that a couple of months ago it was leaked that the \"Principals\" met on this back in 2002-03. The Principals included Rice, Ashcroft, Tenet, and a couple of others. They discussed torture techniques. They discussed torture of specific people. The talking head this morning was making the point that Tenet led the conversation a certain way -- to cover his butt. Seems like Cheney was at that meeting too. You are doing a great job, Mr. President. Thank you so much. Walt", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 10:18:00", 
        "title": "Letter to President Obama", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Moved to point/counterpoint, as requested by OP.", 
        "intTime": 20090422, 
        "postID": 8, 
        "quote": "", 
        "reply": "Moved to point/counterpoint, as requested by OP.", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 11:24:00", 
        "title": "Letter to President Obama", 
        "userID": "mainedawg"
    }, 
    {
        "content": "gmcneill -- I understand your outrage and distress ... but didn't you view the video of him claiming his \"Muslim faith\" ... just prior to election day? That alone said it all. At the end of the day, it's only God's good grace that saves America from internal \"opposing forces.\" If anyone can do that, it's GOD. {hug} \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "intTime": 20090422, 
        "postID": 9, 
        "quote": "", 
        "reply": "gmcneill -- I understand your outrage and distress ... but didn't you view the video of him claiming his \"Muslim faith\" ... just prior to election day? That alone said it all. At the end of the day, it's only God's good grace that saves America from internal \"opposing forces.\" If anyone can do that, it's GOD. {hug} \"Anything easy ain't worth a damn.\" Woody Hayes (RIP)", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 18:08:00", 
        "title": "Letter to President Obama", 
        "userID": "PinkBlossoms"
    }, 
    {
        "content": "quote: Originally posted by gmcneill: I recieved this as an e-mail and wanted to share Washington, DC 20500 Dear Mr. President, I am appalled that you bowed to the King of Saudi Arabia! We are a sovereign nation and bow to no one! The following letter, which I received as an email, expresses my sentiments a lot better than I could. I don’t know who actually wrote it, but he ought to be given an award. You have NO i dea what being an American is. You are tearing my country apart. Dear Mr. President, You don't speak for me. When you go to Europe and say that Americans are \"arrogant, dismissive and derisive\" of our allies, you don't speak for me. When you pander to foreign leaders, presuming to speak on behalf of all Americans, apologizing for the actions of President Bush, you don't speak for me. When you desperately try to surrender to the French and the Germans, the Russians and the Saudis, and even our great friends in the U.K. , just for the sake of maintaining your \"Messiah\" image, you don't speak for me. You and your wife may not be proud of America , but I am, sir. The Europeans seem to have forgotten who saved their collective asses in World War II, but I haven't. I haven't forgotten the tens of thousands of American fighting men who spilled their blood all across Europe to stop a murderous psychopath and his rampaging army. And I haven't forgotten the tens of thousands more who served in theater after that war, when the threat of Soviet advance through the Fulda Gap was ever present. I haven't forgotten, because I was there, for a time, anyway. I saw the obscenity of the Berlin Wall. I saw what happened to people who tried to escape communist Germany by climbing it, or trying to navigate the surrounding mine fields. I occasionally patrolled that border, mirroring Soviet or Czech patrols. And I remember watching on TV, crying as the wall was finally torn down. I love Germany and England ( France , not so much) and was ready to put my life on the line to defend them. So were the men I served with. Many Americ ans continue to serve across Europe in the military uniform of the United States , more willing, apparently, than many Europeans themselves, to preserve the freedom there that we have already paid for with our blood. I spent my money all over Europe , helping those economies flourish and grow, as did many other American servicemen and women who lived and served there. My only thanks was a very small paycheck, some wonderful memories and the knowledge that I was doing something worthwhile that I could be proud of for the rest of my life. I was, until today. And then some pandering politician comes along and apologizes for all of that. You never served your country in military uniform, sir, so you wouldn't know how positively insulting that is. In fact, you've never done anything for this country but run for office. You won the election and still you're running a campaign instead of acting like the leader of our great nation. And I don't like it one bit. I want peace. I want it for my family, for my friends and for my country. I've earned it and will continue to do so until the day I die. I want peace with Russia and China , even Iran and North Korea , if it were somehow p ossible. I want there to be a free exchange of ideas and trade goods and tourism between all of our nations. But the difference between you and I, sir, is that I would never sell out my country to gain their applause. Maybe you think you're earning their respect and admiration by being weak and apologetic, but I know better. The only thing you did was weaken my country. And I won't forget it. I am proud of my country and not even the President of the United States can take that away from me. Sir, you must stop bankrupting my country and taking it down a road to Socialism. You and the Democrats are tearing this country apart. Regards, Theo L. Peebles I know... I know... I know... I miss the republicans to. I really miss their moral compass. Plus something about waking up in the morning and knowing President Bush and OUR man of STEEL Vice President Cheney were protecting us while we were in safe blissful sleep. I yearn for the days past.", 
        "intTime": 20090422, 
        "postID": 10, 
        "quote": "Originally posted by gmcneill: I recieved this as an e-mail and wanted to share Washington, DC 20500 Dear Mr. President, I am appalled that you bowed to the King of Saudi Arabia! We are a sovereign nation and bow to no one! The following letter, which I received as an email, expresses my sentiments a lot better than I could. I don’t know who actually wrote it, but he ought to be given an award. You have NO i dea what being an American is. You are tearing my country apart. Dear Mr. President, You don't speak for me. When you go to Europe and say that Americans are \"arrogant, dismissive and derisive\" of our allies, you don't speak for me. When you pander to foreign leaders, presuming to speak on behalf of all Americans, apologizing for the actions of President Bush, you don't speak for me. When you desperately try to surrender to the French and the Germans, the Russians and the Saudis, and even our great friends in the U.K. , just for the sake of maintaining your \"Messiah\" image, you don't speak for me. You and your wife may not be proud of America , but I am, sir. The Europeans seem to have forgotten who saved their collective asses in World War II, but I haven't. I haven't forgotten the tens of thousands of American fighting men who spilled their blood all across Europe to stop a murderous psychopath and his rampaging army. And I haven't forgotten the tens of thousands more who served in theater after that war, when the threat of Soviet advance through the Fulda Gap was ever present. I haven't forgotten, because I was there, for a time, anyway. I saw the obscenity of the Berlin Wall. I saw what happened to people who tried to escape communist Germany by climbing it, or trying to navigate the surrounding mine fields. I occasionally patrolled that border, mirroring Soviet or Czech patrols. And I remember watching on TV, crying as the wall was finally torn down. I love Germany and England ( France , not so much) and was ready to put my life on the line to defend them. So were the men I served with. Many Americ ans continue to serve across Europe in the military uniform of the United States , more willing, apparently, than many Europeans themselves, to preserve the freedom there that we have already paid for with our blood. I spent my money all over Europe , helping those economies flourish and grow, as did many other American servicemen and women who lived and served there. My only thanks was a very small paycheck, some wonderful memories and the knowledge that I was doing something worthwhile that I could be proud of for the rest of my life. I was, until today. And then some pandering politician comes along and apologizes for all of that. You never served your country in military uniform, sir, so you wouldn't know how positively insulting that is. In fact, you've never done anything for this country but run for office. You won the election and still you're running a campaign instead of acting like the leader of our great nation. And I don't like it one bit. I want peace. I want it for my family, for my friends and for my country. I've earned it and will continue to do so until the day I die. I want peace with Russia and China , even Iran and North Korea , if it were somehow p ossible. I want there to be a free exchange of ideas and trade goods and tourism between all of our nations. But the difference between you and I, sir, is that I would never sell out my country to gain their applause. Maybe you think you're earning their respect and admiration by being weak and apologetic, but I know better. The only thing you did was weaken my country. And I won't forget it. I am proud of my country and not even the President of the United States can take that away from me. Sir, you must stop bankrupting my country and taking it down a road to Socialism. You and the Democrats are tearing this country apart. Regards, Theo L. Peebles", 
        "reply": " I know... I know... I know... I miss the republicans to. I really miss their moral compass. Plus something about waking up in the morning and knowing President Bush and OUR man of STEEL Vice President Cheney were protecting us while we were in safe blissful sleep. I yearn for the days past.", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 18:57:00", 
        "title": "Letter to President Obama", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by gmcneill: I recieved this as an e-mail and wanted to share Washington, DC 20500 Dear Mr. President, I am appalled that you bowed to the King of Saudi Arabia! We are a sovereign nation and bow to no one! The following letter, which I received as an email, expresses my sentiments a lot better than I could. I don’t know who actually wrote it, but he ought to be given an award. You have NO i dea what being an American is. You are tearing my country apart. Dear Mr. President, You don't speak for me. When you go to Europe and say that Americans are \"arrogant, dismissive and derisive\" of our allies, you don't speak for me. When you pander to foreign leaders, presuming to speak on behalf of all Americans, apologizing for the actions of President Bush, you don't speak for me. When you desperately try to surrender to the French and the Germans, the Russians and the Saudis, and even our great friends in the U.K. , just for the sake of maintaining your \"Messiah\" image, you don't speak for me. You and your wife may not be proud of America , but I am, sir. The Europeans seem to have forgotten who saved their collective asses in World War II, but I haven't. I haven't forgotten the tens of thousands of American fighting men who spilled their blood all across Europe to stop a murderous psychopath and his rampaging army. And I haven't forgotten the tens of thousands more who served in theater after that war, when the threat of Soviet advance through the Fulda Gap was ever present. I haven't forgotten, because I was there, for a time, anyway. I saw the obscenity of the Berlin Wall. I saw what happened to people who tried to escape communist Germany by climbing it, or trying to navigate the surrounding mine fields. I occasionally patrolled that border, mirroring Soviet or Czech patrols. And I remember watching on TV, crying as the wall was finally torn down. I love Germany and England ( France , not so much) and was ready to put my life on the line to defend them. So were the men I served with. Many Americ ans continue to serve across Europe in the military uniform of the United States , more willing, apparently, than many Europeans themselves, to preserve the freedom there that we have already paid for with our blood. I spent my money all over Europe , helping those economies flourish and grow, as did many other American servicemen and women who lived and served there. My only thanks was a very small paycheck, some wonderful memories and the knowledge that I was doing something worthwhile that I could be proud of for the rest of my life. I was, until today. And then some pandering politician comes along and apologizes for all of that. You never served your country in military uniform, sir, so you wouldn't know how positively insulting that is. In fact, you've never done anything for this country but run for office. You won the election and still you're running a campaign instead of acting like the leader of our great nation. And I don't like it one bit. I want peace. I want it for my family, for my friends and for my country. I've earned it and will continue to do so until the day I die. I want peace with Russia and China , even Iran and North Korea , if it were somehow p ossible. I want there to be a free exchange of ideas and trade goods and tourism between all of our nations. But the difference between you and I, sir, is that I would never sell out my country to gain their applause. Maybe you think you're earning their respect and admiration by being weak and apologetic, but I know better. The only thing you did was weaken my country. And I won't forget it. I am proud of my country and not even the President of the United States can take that away from me. Sir, you must stop bankrupting my country and taking it down a road to Socialism. You and the Democrats are tearing this country apart. Regards, Theo L. Peebles I know... I know... I know... I miss the republicans to. I really miss their moral compass. Plus something about waking up in the morning and knowing President Bush and OUR man of STEEL Vice President Cheney were protecting us while we were in safe blissful sleep. I yearn for the days past. Were you sleeping blissfully when Bush and Cheney allowed the world trade center to be destroyed? Or when they bumbled and stumbled through the totally unnecessary deaths of over 4,000 U.S. servicemen and women? Walt", 
        "intTime": 20090422, 
        "postID": 11, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by gmcneill: I recieved this as an e-mail and wanted to share Washington, DC 20500 Dear Mr. President, I am appalled that you bowed to the King of Saudi Arabia! We are a sovereign nation and bow to no one! The following letter, which I received as an email, expresses my sentiments a lot better than I could. I don’t know who actually wrote it, but he ought to be given an award. You have NO i dea what being an American is. You are tearing my country apart. Dear Mr. President, You don't speak for me. When you go to Europe and say that Americans are \"arrogant, dismissive and derisive\" of our allies, you don't speak for me. When you pander to foreign leaders, presuming to speak on behalf of all Americans, apologizing for the actions of President Bush, you don't speak for me. When you desperately try to surrender to the French and the Germans, the Russians and the Saudis, and even our great friends in the U.K. , just for the sake of maintaining your \"Messiah\" image, you don't speak for me. You and your wife may not be proud of America , but I am, sir. The Europeans seem to have forgotten who saved their collective asses in World War II, but I haven't. I haven't forgotten the tens of thousands of American fighting men who spilled their blood all across Europe to stop a murderous psychopath and his rampaging army. And I haven't forgotten the tens of thousands more who served in theater after that war, when the threat of Soviet advance through the Fulda Gap was ever present. I haven't forgotten, because I was there, for a time, anyway. I saw the obscenity of the Berlin Wall. I saw what happened to people who tried to escape communist Germany by climbing it, or trying to navigate the surrounding mine fields. I occasionally patrolled that border, mirroring Soviet or Czech patrols. And I remember watching on TV, crying as the wall was finally torn down. I love Germany and England ( France , not so much) and was ready to put my life on the line to defend them. So were the men I served with. Many Americ ans continue to serve across Europe in the military uniform of the United States , more willing, apparently, than many Europeans themselves, to preserve the freedom there that we have already paid for with our blood. I spent my money all over Europe , helping those economies flourish and grow, as did many other American servicemen and women who lived and served there. My only thanks was a very small paycheck, some wonderful memories and the knowledge that I was doing something worthwhile that I could be proud of for the rest of my life. I was, until today. And then some pandering politician comes along and apologizes for all of that. You never served your country in military uniform, sir, so you wouldn't know how positively insulting that is. In fact, you've never done anything for this country but run for office. You won the election and still you're running a campaign instead of acting like the leader of our great nation. And I don't like it one bit. I want peace. I want it for my family, for my friends and for my country. I've earned it and will continue to do so until the day I die. I want peace with Russia and China , even Iran and North Korea , if it were somehow p ossible. I want there to be a free exchange of ideas and trade goods and tourism between all of our nations. But the difference between you and I, sir, is that I would never sell out my country to gain their applause. Maybe you think you're earning their respect and admiration by being weak and apologetic, but I know better. The only thing you did was weaken my country. And I won't forget it. I am proud of my country and not even the President of the United States can take that away from me. Sir, you must stop bankrupting my country and taking it down a road to Socialism. You and the Democrats are tearing this country apart. Regards, Theo L. Peebles I know... I know... I know... I miss the republicans to. I really miss their moral compass. Plus something about waking up in the morning and knowing President Bush and OUR man of STEEL Vice President Cheney were protecting us while we were in safe blissful sleep. I yearn for the days past.", 
        "reply": " Were you sleeping blissfully when Bush and Cheney allowed the world trade center to be destroyed? Or when they bumbled and stumbled through the totally unnecessary deaths of over 4,000 U.S. servicemen and women? Walt", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 20:14:00", 
        "title": "Letter to President Obama", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by scottrj50: quote: Originally posted by gmcneill: I recieved this as an e-mail and wanted to share Washington, DC 20500 Dear Mr. President, I am appalled that you bowed to the King of Saudi Arabia! We are a sovereign nation and bow to no one! The following letter, which I received as an email, expresses my sentiments a lot better than I could. I don’t know who actually wrote it, but he ought to be given an award. You have NO i dea what being an American is. You are tearing my country apart. Dear Mr. President, You don't speak for me. When you go to Europe and say that Americans are \"arrogant, dismissive and derisive\" of our allies, you don't speak for me. When you pander to foreign leaders, presuming to speak on behalf of all Americans, apologizing for the actions of President Bush, you don't speak for me. When you desperately try to surrender to the French and the Germans, the Russians and the Saudis, and even our great friends in the U.K. , just for the sake of maintaining your \"Messiah\" image, you don't speak for me. You and your wife may not be proud of America , but I am, sir. The Europeans seem to have forgotten who saved their collective asses in World War II, but I haven't. I haven't forgotten the tens of thousands of American fighting men who spilled their blood all across Europe to stop a murderous psychopath and his rampaging army. And I haven't forgotten the tens of thousands more who served in theater after that war, when the threat of Soviet advance through the Fulda Gap was ever present. I haven't forgotten, because I was there, for a time, anyway. I saw the obscenity of the Berlin Wall. I saw what happened to people who tried to escape communist Germany by climbing it, or trying to navigate the surrounding mine fields. I occasionally patrolled that border, mirroring Soviet or Czech patrols. And I remember watching on TV, crying as the wall was finally torn down. I love Germany and England ( France , not so much) and was ready to put my life on the line to defend them. So were the men I served with. Many Americ ans continue to serve across Europe in the military uniform of the United States , more willing, apparently, than many Europeans themselves, to preserve the freedom there that we have already paid for with our blood. I spent my money all over Europe , helping those economies flourish and grow, as did many other American servicemen and women who lived and served there. My only thanks was a very small paycheck, some wonderful memories and the knowledge that I was doing something worthwhile that I could be proud of for the rest of my life. I was, until today. And then some pandering politician comes along and apologizes for all of that. You never served your country in military uniform, sir, so you wouldn't know how positively insulting that is. In fact, you've never done anything for this country but run for office. You won the election and still you're running a campaign instead of acting like the leader of our great nation. And I don't like it one bit. I want peace. I want it for my family, for my friends and for my country. I've earned it and will continue to do so until the day I die. I want peace with Russia and China , even Iran and North Korea , if it were somehow p ossible. I want there to be a free exchange of ideas and trade goods and tourism between all of our nations. But the difference between you and I, sir, is that I would never sell out my country to gain their applause. Maybe you think you're earning their respect and admiration by being weak and apologetic, but I know better. The only thing you did was weaken my country. And I won't forget it. I am proud of my country and not even the President of the United States can take that away from me. Sir, you must stop bankrupting my country and taking it down a road to Socialism. You and the Democrats are tearing this country apart. Regards, Theo L. Peebles I know... I know... I know... I miss the republicans to. I really miss their moral compass. Plus something about waking up in the morning and knowing President Bush and OUR man of STEEL Vice President Cheney were protecting us while we were in safe blissful sleep. I yearn for the days past. Were you sleeping blissfully when Bush and Cheney allowed the world trade center to be destroyed? Or when they bumbled and stumbled through the totally unnecessary deaths of over 4,000 U.S. servicemen and women? Walt ok ok ok ok...Walt...I only seem like a republican....I'm actually a spy for the Democratic party...Plus a veteran of the United States Coast Guard 1970-1974....MY CIC Richard M. Nixon...and ten days of Gerald Ford", 
        "intTime": 20090422, 
        "postID": 12, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by scottrj50: quote: Originally posted by gmcneill: I recieved this as an e-mail and wanted to share Washington, DC 20500 Dear Mr. President, I am appalled that you bowed to the King of Saudi Arabia! We are a sovereign nation and bow to no one! The following letter, which I received as an email, expresses my sentiments a lot better than I could. I don’t know who actually wrote it, but he ought to be given an award. You have NO i dea what being an American is. You are tearing my country apart. Dear Mr. President, You don't speak for me. When you go to Europe and say that Americans are \"arrogant, dismissive and derisive\" of our allies, you don't speak for me. When you pander to foreign leaders, presuming to speak on behalf of all Americans, apologizing for the actions of President Bush, you don't speak for me. When you desperately try to surrender to the French and the Germans, the Russians and the Saudis, and even our great friends in the U.K. , just for the sake of maintaining your \"Messiah\" image, you don't speak for me. You and your wife may not be proud of America , but I am, sir. The Europeans seem to have forgotten who saved their collective asses in World War II, but I haven't. I haven't forgotten the tens of thousands of American fighting men who spilled their blood all across Europe to stop a murderous psychopath and his rampaging army. And I haven't forgotten the tens of thousands more who served in theater after that war, when the threat of Soviet advance through the Fulda Gap was ever present. I haven't forgotten, because I was there, for a time, anyway. I saw the obscenity of the Berlin Wall. I saw what happened to people who tried to escape communist Germany by climbing it, or trying to navigate the surrounding mine fields. I occasionally patrolled that border, mirroring Soviet or Czech patrols. And I remember watching on TV, crying as the wall was finally torn down. I love Germany and England ( France , not so much) and was ready to put my life on the line to defend them. So were the men I served with. Many Americ ans continue to serve across Europe in the military uniform of the United States , more willing, apparently, than many Europeans themselves, to preserve the freedom there that we have already paid for with our blood. I spent my money all over Europe , helping those economies flourish and grow, as did many other American servicemen and women who lived and served there. My only thanks was a very small paycheck, some wonderful memories and the knowledge that I was doing something worthwhile that I could be proud of for the rest of my life. I was, until today. And then some pandering politician comes along and apologizes for all of that. You never served your country in military uniform, sir, so you wouldn't know how positively insulting that is. In fact, you've never done anything for this country but run for office. You won the election and still you're running a campaign instead of acting like the leader of our great nation. And I don't like it one bit. I want peace. I want it for my family, for my friends and for my country. I've earned it and will continue to do so until the day I die. I want peace with Russia and China , even Iran and North Korea , if it were somehow p ossible. I want there to be a free exchange of ideas and trade goods and tourism between all of our nations. But the difference between you and I, sir, is that I would never sell out my country to gain their applause. Maybe you think you're earning their respect and admiration by being weak and apologetic, but I know better. The only thing you did was weaken my country. And I won't forget it. I am proud of my country and not even the President of the United States can take that away from me. Sir, you must stop bankrupting my country and taking it down a road to Socialism. You and the Democrats are tearing this country apart. Regards, Theo L. Peebles I know... I know... I know... I miss the republicans to. I really miss their moral compass. Plus something about waking up in the morning and knowing President Bush and OUR man of STEEL Vice President Cheney were protecting us while we were in safe blissful sleep. I yearn for the days past. Were you sleeping blissfully when Bush and Cheney allowed the world trade center to be destroyed? Or when they bumbled and stumbled through the totally unnecessary deaths of over 4,000 U.S. servicemen and women? Walt", 
        "reply": " ok ok ok ok...Walt...I only seem like a republican....I'm actually a spy for the Democratic party...Plus a veteran of the United States Coast Guard 1970-1974....MY CIC Richard M. Nixon...and ten days of Gerald Ford", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-22 20:28:00", 
        "title": "Letter to President Obama", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Were you sleeping blissfully when Bush and Cheney allowed the world trade center to be destroyed? Or when they bumbled and stumbled through the totally unnecessary deaths of over 4,000 U.S. servicemen and women? Walt[/QUOTE] Were you on crack when Clinton didn't kill the terrorists resonsible for planning 9/11 or is your hatred for Bush clouding your memory? Either way I really don't care. I just think its funny.. You and ol Scotty just keep on keep'n on...lol.", 
        "intTime": 20090423, 
        "postID": 13, 
        "quote": "Originally posted by WhiskeyPapa:", 
        "reply": " Were you sleeping blissfully when Bush and Cheney allowed the world trade center to be destroyed? Or when they bumbled and stumbled through the totally unnecessary deaths of over 4,000 U.S. servicemen and women? Walt[/QUOTE] Were you on crack when Clinton didn't kill the terrorists resonsible for planning 9/11 or is your hatred for Bush clouding your memory? Either way I really don't care. I just think its funny.. You and ol Scotty just keep on keep'n on...lol.", 
        "threadID": "409192893_5360054122001", 
        "time": "2009-04-23 05:54:00", 
        "title": "Letter to President Obama", 
        "userID": "comingofage"
    }
]