[
    {
        "content": "Dean Health nurse laid off mid-surgery By DEE J. HALL A Dean Health System manager removed a nurse from a minor surgical procedure last week — in violation of medical protocol — in order to lay her off, a spokesman for the company confirmed Monday. The abrupt removal, which spokesman Paul Pitas said posed no danger to the patient, came after the Madison-based health care provider announced Wednesday that it planned to “immediately” lay off 90 employees. Pitas, director of corporate communications, labeled the action “clearly ... an error in judgment on the part of the manager conducting the layoff.” He declined to name the manager but described her as “an otherwise good employe with more than 30 years of nursing experience who made a regrettable decision.” “This person is very upset and is extremely remorseful over this,” Pitas said, adding that the layoffs created “extraordinary circumstances.” Pitas said the incident occurred at Dean’s West Clinic at 752 N. High Point Road on Wednesday or Thursday as employees were notified of the job cuts. He declined to name the employees involved or what type of procedure the nurse was assisting in when she was summoned from her duties and terminated. “There was a period of time in which an RN was not present during the procedure,” Pitas said. “While there were other clinical staff present, including a physician, the absence of an RN goes against established patient-care procedures at Dean Health System.” He added that the patient, whose name is protected by patient confidentiality laws, is “doing fine.” “We can tell you the physician who performed the procedure reports it went as expected,” he said. Pitas said Dean plans to pursue the matter, but he declined to say what the possible outcomes could be. “Dean will continue to reiterate to its staff the importance of following all patient-care policies,” he said. “Out of respect for the (manager), we cannot discuss specifics. However, we can tell you we are looking into this, and appropriate action will be taken.” The layoff affected 90 of the company’s 4,500 employees and reportedly focused primarily on non-patient-care positions. The terminated employees were given severance packages including job counseling and payments based on years of service. Cheryl Koerwitz, a medical assistant who has worked for Dean for 14 years, described a stressful scene Wednesday at 10 a.m. in which Dean employees at St. Mary’s Hospital were told some were being laid off, and that if a company representative returned later in the day, that meant one or more of them was being terminated. As it turned out, Koerwitz said, no one in her unit was laid off. However, the incident left her feeling “threatened and scared.” Dean Health System runs dozens of area clinics and health-related entities, a health insurance company and a foundation. Of the layoffs, Craig Samitt, Dean Health System president said last week, “We do not feel patients will notice.” madison.com/wsj/mad/top/446920", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "Dean Health nurse laid off mid-surgery By DEE J. HALL A Dean Health System manager removed a nurse from a minor surgical procedure last week — in violation of medical protocol — in order to lay her off, a spokesman for the company confirmed Monday. The abrupt removal, which spokesman Paul Pitas said posed no danger to the patient, came after the Madison-based health care provider announced Wednesday that it planned to “immediately” lay off 90 employees. Pitas, director of corporate communications, labeled the action “clearly ... an error in judgment on the part of the manager conducting the layoff.” He declined to name the manager but described her as “an otherwise good employe with more than 30 years of nursing experience who made a regrettable decision.” “This person is very upset and is extremely remorseful over this,” Pitas said, adding that the layoffs created “extraordinary circumstances.” Pitas said the incident occurred at Dean’s West Clinic at 752 N. High Point Road on Wednesday or Thursday as employees were notified of the job cuts. He declined to name the employees involved or what type of procedure the nurse was assisting in when she was summoned from her duties and terminated. “There was a period of time in which an RN was not present during the procedure,” Pitas said. “While there were other clinical staff present, including a physician, the absence of an RN goes against established patient-care procedures at Dean Health System.” He added that the patient, whose name is protected by patient confidentiality laws, is “doing fine.” “We can tell you the physician who performed the procedure reports it went as expected,” he said. Pitas said Dean plans to pursue the matter, but he declined to say what the possible outcomes could be. “Dean will continue to reiterate to its staff the importance of following all patient-care policies,” he said. “Out of respect for the (manager), we cannot discuss specifics. However, we can tell you we are looking into this, and appropriate action will be taken.” The layoff affected 90 of the company’s 4,500 employees and reportedly focused primarily on non-patient-care positions. The terminated employees were given severance packages including job counseling and payments based on years of service. Cheryl Koerwitz, a medical assistant who has worked for Dean for 14 years, described a stressful scene Wednesday at 10 a.m. in which Dean employees at St. Mary’s Hospital were told some were being laid off, and that if a company representative returned later in the day, that meant one or more of them was being terminated. As it turned out, Koerwitz said, no one in her unit was laid off. However, the incident left her feeling “threatened and scared.” Dean Health System runs dozens of area clinics and health-related entities, a health insurance company and a foundation. Of the layoffs, Craig Samitt, Dean Health System president said last week, “We do not feel patients will notice.” madison.com/wsj/mad/top/446920", 
        "threadID": "409192893_7080037022001", 
        "time": "2009-04-14 15:57:00", 
        "title": "When they say immediate layoffs, they aren't kidding!", 
        "userID": "Boospar"
    }, 
    {
        "content": "quote: Of the layoffs, Craig Samitt, Dean Health System president said last week, “We do not feel patients will notice.” Or, in other words, I hope no patients die from lack of qualified caregivers so that I can afford my vacation home in Barbados.... But if they do, good luck proving it... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "Of the layoffs, Craig Samitt, Dean Health System president said last week, “We do not feel patients will notice.”", 
        "reply": " Or, in other words, I hope no patients die from lack of qualified caregivers so that I can afford my vacation home in Barbados.... But if they do, good luck proving it... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_7080037022001", 
        "time": "2009-04-15 10:57:00", 
        "title": "When they say immediate layoffs, they aren't kidding!", 
        "userID": "mmulder67"
    }
]