[
    {
        "content": "Thomas Joscelyn / Weekly Standard: Welfare for Freed Gitmo Detainees? — Here, from the Associated Press, is a partial account of DNI Dennis Blair's first press conference today (emphasis mine): … Four short questions/comments: — (1) Does this mean that the Obama administration is planning on giving some freed Guantanamo detainees a stipend? \"http://www.memeorandum.com/090327/p10#a090327p10\"", 
        "intTime": 20090327, 
        "postID": 1, 
        "quote": "", 
        "reply": "Thomas Joscelyn / Weekly Standard: Welfare for Freed Gitmo Detainees? — Here, from the Associated Press, is a partial account of DNI Dennis Blair's first press conference today (emphasis mine): … Four short questions/comments: — (1) Does this mean that the Obama administration is planning on giving some freed Guantanamo detainees a stipend? \"http://www.memeorandum.com/090327/p10#a090327p10\"", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 13:38:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "Ira1945"
    }, 
    {
        "content": "MOD HAT ON There's already a thread running on this subject: http://forums.military.com/eve/forums/a/tpc/f/409192893/m/4020090912001/p/1", 
        "intTime": 20090327, 
        "postID": 2, 
        "quote": "", 
        "reply": "MOD HAT ON There's already a thread running on this subject: http://forums.military.com/eve/forums/a/tpc/f/409192893/m/4020090912001/p/1", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 13:51:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "stillkit"
    }, 
    {
        "content": "Like I said in the other thread. Someone held prisoner for 7 years without charges deserves at least a 7 figure settlement, and they should be able to live wherever they want. If they could be charged and convicted that should happen, if not they are innocent (not proven guilty) and the government should be liable for false imprisonment.", 
        "intTime": 20090327, 
        "postID": 3, 
        "quote": "", 
        "reply": "Like I said in the other thread. Someone held prisoner for 7 years without charges deserves at least a 7 figure settlement, and they should be able to live wherever they want. If they could be charged and convicted that should happen, if not they are innocent (not proven guilty) and the government should be liable for false imprisonment.", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 14:37:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "nspreitler"
    }, 
    {
        "content": "bet after that long you would not have to lead em as much from conversations with current combat troops, detainees and prisoners not that much of a problem now", 
        "intTime": 20090327, 
        "postID": 4, 
        "quote": "", 
        "reply": "bet after that long you would not have to lead em as much from conversations with current combat troops, detainees and prisoners not that much of a problem now", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 15:06:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Wonderful. Just capital. Hey nspreitler, why don't you take them in? Since they are all so misunderstood and all. Can you give one good reason why we should deny entry for people that haven't commited any crime and that have been held in prison without charges for over seven years. These are people that we can't send home because they are ethnic Uyghers and they would just go back to prison or be executed by the Chinese. If you were arrested, denied legal counsel, and never actually charged with a crime, and held in prison for years would you feel like some restitution was in order. We didn't categorize these prisoners under Geneva conventions, but we didn't ever charge them as terrorists either. Do some reading on how the Chinese treat Uyghers and you may understand the moral implications of returning them back to China.", 
        "intTime": 20090327, 
        "postID": 5, 
        "quote": "Originally posted by SSgtRobertMorris: Wonderful. Just capital. Hey nspreitler, why don't you take them in? Since they are all so misunderstood and all.", 
        "reply": " Can you give one good reason why we should deny entry for people that haven't commited any crime and that have been held in prison without charges for over seven years. These are people that we can't send home because they are ethnic Uyghers and they would just go back to prison or be executed by the Chinese. If you were arrested, denied legal counsel, and never actually charged with a crime, and held in prison for years would you feel like some restitution was in order. We didn't categorize these prisoners under Geneva conventions, but we didn't ever charge them as terrorists either. Do some reading on how the Chinese treat Uyghers and you may understand the moral implications of returning them back to China.", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 15:13:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "nspreitler"
    }, 
    {
        "content": "shhhhhhhhhhhhhhhh current administration will chastise you for calling them terrorist... who remembers when we could not call a dink a dink?? we had to use the words indigenous personell.. remember once listening to radio about a certain indingenous personell, now dead that had portions of a russian uniform on, when i was once scolded for calling a dink a dink, my first sgt said, son lets just call them dead from now on, fire for effect, surprise what a battery of '05 with good shooters can do", 
        "intTime": 20090327, 
        "postID": 6, 
        "quote": "", 
        "reply": "shhhhhhhhhhhhhhhh current administration will chastise you for calling them terrorist... who remembers when we could not call a dink a dink?? we had to use the words indigenous personell.. remember once listening to radio about a certain indingenous personell, now dead that had portions of a russian uniform on, when i was once scolded for calling a dink a dink, my first sgt said, son lets just call them dead from now on, fire for effect, surprise what a battery of '05 with good shooters can do", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 15:50:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: Bottom line here is this: They were captured by OUR TROOPS, after shooting at OUR TROOPS. You do realize a number of detainees (some who were already released) were literally bought from the local tribal leaders!?", 
        "intTime": 20090327, 
        "postID": 7, 
        "quote": "Originally posted by SSgtRobertMorris: Bottom line here is this: They were captured by OUR TROOPS, after shooting at OUR TROOPS.", 
        "reply": " You do realize a number of detainees (some who were already released) were literally bought from the local tribal leaders!?", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 15:58:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by nspreitler: quote: Originally posted by SSgtRobertMorris: Wonderful. Just capital. Hey nspreitler, why don't you take them in? Since they are all so misunderstood and all. Can you give one good reason why we should deny entry for people that haven't commited any crime and that have been held in prison without charges for over seven years. These are people that we can't send home because they are ethnic Uyghers and they would just go back to prison or be executed by the Chinese. If you were arrested, denied legal counsel, and never actually charged with a crime, and held in prison for years would you feel like some restitution was in order. We didn't categorize these prisoners under Geneva conventions, but we didn't ever charge them as terrorists either. Do some reading on how the Chinese treat Uyghers and you may understand the moral implications of returning them back to China. Your naivete' is astounding. The \"innocent\" ones have already been released. And imagine that! Some of them ended up back on the battlefield. Shooting at Americans. Wonderful. Since they operated outside the Geneva Conventions, you know, TERRORISTS, it's kinda hard to charge them under said rules. Bottom line here is this: They were captured by OUR TROOPS, after shooting at OUR TROOPS. I'm gonna kinda go with our Soldiers and Marines that captured them and guard them that they are the scum of the earth. I think they know. My opinions are based largely on personal experience, not propaganda. My experience of 12 months living and working with Iraqi soldiers gives me the opinion that holding people without cause is a bad thing and causes a lot of anger. Things like Abu Ghraib and Gitmo do nothing but made life more dangerous for those of us that have BTDT. Since the war we are fighting is counterinsurgency, and the last thing we need is more insurgents it is in our best interest to avoid things like holding people without cause for years on end. These people were never charged as terrorists, or as combatants. It is pretty simple, if they were captured in combat they are combatants, if there is evidence they are part of Al Qaeda they are terrorists. Many of them weren't captured by OUR troops while shooting at OUR troops. The ones in question are ethnic Uyghers (from China). Look it up, and maybe you will get a clue on what the Chinese are doing to the Uyghers and why they were likely in Afghanistan.", 
        "intTime": 20090327, 
        "postID": 8, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by nspreitler: quote: Originally posted by SSgtRobertMorris: Wonderful. Just capital. Hey nspreitler, why don't you take them in? Since they are all so misunderstood and all. Can you give one good reason why we should deny entry for people that haven't commited any crime and that have been held in prison without charges for over seven years. These are people that we can't send home because they are ethnic Uyghers and they would just go back to prison or be executed by the Chinese. If you were arrested, denied legal counsel, and never actually charged with a crime, and held in prison for years would you feel like some restitution was in order. We didn't categorize these prisoners under Geneva conventions, but we didn't ever charge them as terrorists either. Do some reading on how the Chinese treat Uyghers and you may understand the moral implications of returning them back to China. Your naivete' is astounding. The \"innocent\" ones have already been released. And imagine that! Some of them ended up back on the battlefield. Shooting at Americans. Wonderful. Since they operated outside the Geneva Conventions, you know, TERRORISTS, it's kinda hard to charge them under said rules. Bottom line here is this: They were captured by OUR TROOPS, after shooting at OUR TROOPS. I'm gonna kinda go with our Soldiers and Marines that captured them and guard them that they are the scum of the earth. I think they know.", 
        "reply": " My opinions are based largely on personal experience, not propaganda. My experience of 12 months living and working with Iraqi soldiers gives me the opinion that holding people without cause is a bad thing and causes a lot of anger. Things like Abu Ghraib and Gitmo do nothing but made life more dangerous for those of us that have BTDT. Since the war we are fighting is counterinsurgency, and the last thing we need is more insurgents it is in our best interest to avoid things like holding people without cause for years on end. These people were never charged as terrorists, or as combatants. It is pretty simple, if they were captured in combat they are combatants, if there is evidence they are part of Al Qaeda they are terrorists. Many of them weren't captured by OUR troops while shooting at OUR troops. The ones in question are ethnic Uyghers (from China). Look it up, and maybe you will get a clue on what the Chinese are doing to the Uyghers and why they were likely in Afghanistan.", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 17:17:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by SSgtRobertMorris: Bottom line here is this: They were captured by OUR TROOPS, after shooting at OUR TROOPS. You do realize a number of detainees (some who were already released) were literally bought from the local tribal leaders!? not as many as you are thinking.. all we know of are the ones we find dead on the battlefield after being released.. how many that havent died that are still fighting?? there are people in dc that have a false sence of who our enemy truly is.... and its going to get people killed..... yea i guess its ok as long as its someone you dont know huh???? like what we have people watching every inmate released and make sure they are living like a normal person and not a terrorist??? no we just wait till they are found dead on the battlefield somewhere ..... never in history has this ever happen.... watch people its going to get a lot of people killed....also lets not forget the new head of the tailban was also a poor innocent gitmo detainee who was wrongly taken off for no reason what so ever and freed because they were innocent....", 
        "intTime": 20090327, 
        "postID": 9, 
        "quote": "Originally posted by Knele: quote: Originally posted by SSgtRobertMorris: Bottom line here is this: They were captured by OUR TROOPS, after shooting at OUR TROOPS. You do realize a number of detainees (some who were already released) were literally bought from the local tribal leaders!?", 
        "reply": " not as many as you are thinking.. all we know of are the ones we find dead on the battlefield after being released.. how many that havent died that are still fighting?? there are people in dc that have a false sence of who our enemy truly is.... and its going to get people killed..... yea i guess its ok as long as its someone you dont know huh???? like what we have people watching every inmate released and make sure they are living like a normal person and not a terrorist??? no we just wait till they are found dead on the battlefield somewhere ..... never in history has this ever happen.... watch people its going to get a lot of people killed....also lets not forget the new head of the tailban was also a poor innocent gitmo detainee who was wrongly taken off for no reason what so ever and freed because they were innocent....", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 18:29:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "outlaws93"
    }, 
    {
        "content": "\"There were once 22 Uighur prisoners in Guantánamo. Muslims from China's oppressed Xinjiang province, they had all been swept up as human debris during \"Operation Enduring Freedom,\" the U.S.-led invasion of Afghanistan that began in October 2001. The majority of these men were seized after fleeing to Pakistan from a run-down settlement in Afghanistan's Tora Bora mountains, which had been hit in a U.S. bombing raid. Initially welcomed by Pakistani villagers, they were then betrayed and sold to U.S. forces, who were offering $5000 a head for \"al-Qaeda and Taliban suspects.\" None of the men had been in Afghanistan to support al-Qaeda or the Taliban, and none had raised arms against U.S. forces. They all maintained that they had only one enemy -- the Chinese government -- and explained that they had ended up at the settlement either in the hope of finding a way of rising up against their oppressors, which was unlikely, as the settlement was dirt-poor and had only one gun, or because they had hoped to travel to other countries in search of work -- primarily Turkey, which has historic connections to the people of East Turkestan (as the Uighurs call their homeland) -- but had been thwarted in their aims.\" These are the people being talked about, refugees from communist China that were turned over by Pakistan, not captured in combat. \"http://www.uyghuramerican.org//articles/2716/1/A-Letter-to-Barack-Obama-from-a-Guantanamo-Uighur/index.html\"", 
        "intTime": 20090327, 
        "postID": 10, 
        "quote": "", 
        "reply": "\"There were once 22 Uighur prisoners in Guantánamo. Muslims from China's oppressed Xinjiang province, they had all been swept up as human debris during \"Operation Enduring Freedom,\" the U.S.-led invasion of Afghanistan that began in October 2001. The majority of these men were seized after fleeing to Pakistan from a run-down settlement in Afghanistan's Tora Bora mountains, which had been hit in a U.S. bombing raid. Initially welcomed by Pakistani villagers, they were then betrayed and sold to U.S. forces, who were offering $5000 a head for \"al-Qaeda and Taliban suspects.\" None of the men had been in Afghanistan to support al-Qaeda or the Taliban, and none had raised arms against U.S. forces. They all maintained that they had only one enemy -- the Chinese government -- and explained that they had ended up at the settlement either in the hope of finding a way of rising up against their oppressors, which was unlikely, as the settlement was dirt-poor and had only one gun, or because they had hoped to travel to other countries in search of work -- primarily Turkey, which has historic connections to the people of East Turkestan (as the Uighurs call their homeland) -- but had been thwarted in their aims.\" These are the people being talked about, refugees from communist China that were turned over by Pakistan, not captured in combat. \"http://www.uyghuramerican.org//articles/2716/1/A-Letter-to-Barack-Obama-from-a-Guantanamo-Uighur/index.html\"", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 19:04:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: BTDT. need help on this one, not familiar with this army acronym, sorry", 
        "intTime": 20090327, 
        "postID": 11, 
        "quote": "BTDT.", 
        "reply": " need help on this one, not familiar with this army acronym, sorry", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 19:58:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Well---- Hell, let's just let 'em go then. Can't hurt anyone can they? Maybe they can run for City Council, or even Mayor. Governor isn't that far of a reach, or even POTUS!!!", 
        "intTime": 20090327, 
        "postID": 12, 
        "quote": "", 
        "reply": "Well---- Hell, let's just let 'em go then. Can't hurt anyone can they? Maybe they can run for City Council, or even Mayor. Governor isn't that far of a reach, or even POTUS!!!", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 21:37:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There Done That", 
        "intTime": 20090327, 
        "postID": 13, 
        "quote": "Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry", 
        "reply": " Been There Done That", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 21:56:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There Done That Been to Gitmo?", 
        "intTime": 20090327, 
        "postID": 14, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There Done That", 
        "reply": " Been to Gitmo?", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-27 22:02:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: quote: Originally posted by nspreitler: quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There Done That Been to Gitmo? I have.....2002-2004! And if I was held for 5-7 years in those dog kennels, you bet your ass I’d be ****ed!", 
        "intTime": 20090328, 
        "postID": 15, 
        "quote": "Originally posted by JustanotherGI: quote: Originally posted by nspreitler: quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There Done That Been to Gitmo?", 
        "reply": " I have.....2002-2004! And if I was held for 5-7 years in those dog kennels, you bet your ass I’d be ****ed!", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-28 05:28:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: quote: Originally posted by nspreitler: quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There Done That Been to Gitmo? yes, however different times, '64 (msg), fourth night there i was walking post number 4 (if i remember right) and i shot a fireplug, it moved and i shot it..... first sgt, only comment was, nice group darn that was a long time ago", 
        "intTime": 20090328, 
        "postID": 16, 
        "quote": "Originally posted by JustanotherGI: quote: Originally posted by nspreitler: quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There Done That Been to Gitmo?", 
        "reply": " yes, however different times, '64 (msg), fourth night there i was walking post number 4 (if i remember right) and i shot a fireplug, it moved and i shot it..... first sgt, only comment was, nice group darn that was a long time ago", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-28 12:31:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There, Done That. Which means you can't comment if you weren't there. If you go back and read things in context my post was about my personal experience in Iraq and the damage caused by things like Gitmo and Abu Ghraib when it came to dealing with an insurgency and even friendly Iraqi forces.", 
        "intTime": 20090328, 
        "postID": 17, 
        "quote": "Originally posted by SSgtRobertMorris: quote: Originally posted by Ira1945: quote: BTDT. need help on this one, not familiar with this army acronym, sorry Been There, Done That. Which means you can't comment if you weren't there.", 
        "reply": " If you go back and read things in context my post was about my personal experience in Iraq and the damage caused by things like Gitmo and Abu Ghraib when it came to dealing with an insurgency and even friendly Iraqi forces.", 
        "threadID": "409192893_3890001912001", 
        "time": "2009-03-28 12:56:00", 
        "title": "Hey Gitmo detainee, here is your Obama welfare check", 
        "userID": "nspreitler"
    }
]