[
    {
        "content": "Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years.. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!) I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen not at this time, nor in the near future either \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time", 
        "intTime": 20090326, 
        "postID": 1, 
        "quote": "", 
        "reply": "Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years.. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!) I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen not at this time, nor in the near future either \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 18:17:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "\"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know?", 
        "intTime": 20090326, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know?", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 18:19:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it", 
        "intTime": 20090326, 
        "postID": 3, 
        "quote": "Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know?", 
        "reply": " was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 18:33:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it OK, but you said this: \"the man has some fundamental flaws\" That's a statement about HIM, personally. And, I'd like to see some proof of this statement, not only about California, but about his plans: \"pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it\"", 
        "intTime": 20090326, 
        "postID": 4, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it", 
        "reply": " OK, but you said this: \"the man has some fundamental flaws\" That's a statement about HIM, personally. And, I'd like to see some proof of this statement, not only about California, but about his plans: \"pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it\"", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 18:35:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "yea just dont ask them to build solar panels or windmills in the dems back yard... they dont want it... pelosi to Arnold in ca...", 
        "intTime": 20090326, 
        "postID": 5, 
        "quote": "", 
        "reply": "yea just dont ask them to build solar panels or windmills in the dems back yard... they dont want it... pelosi to Arnold in ca...", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 20:49:00", 
        "title": "Today, he just fell way short", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by Ira1945: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? i said it and stand by it you prove me wrong, if you can and you can not, if you remember if i find out i made error i am first to identify it, but this is all solid was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it OK, but you said this: \"the man has some fundamental flaws\" That's a statement about HIM, personally. And, I'd like to see some proof of this statement, not only about California, but about his plans: \"pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it\" \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/26/AR2009032603316.html\"", 
        "intTime": 20090327, 
        "postID": 6, 
        "quote": "Originally posted by stillkit: quote: Originally posted by Ira1945: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? i said it and stand by it you prove me wrong, if you can and you can not, if you remember if i find out i made error i am first to identify it, but this is all solid was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it OK, but you said this: \"the man has some fundamental flaws\" That's a statement about HIM, personally. And, I'd like to see some proof of this statement, not only about California, but about his plans: \"pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it\"", 
        "reply": " \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/26/AR2009032603316.html\"", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 04:52:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Does anyone remember California in the 70s, LA especially? The SMOG was so thick that there were days people were told not to leave their homes. California's strict emission laws and other regulations have made a HUGE difference in the air quality here. California is going to lead the way in green jobs. The rest will be playing catch up.", 
        "intTime": 20090327, 
        "postID": 7, 
        "quote": "", 
        "reply": "Does anyone remember California in the 70s, LA especially? The SMOG was so thick that there were days people were told not to leave their homes. California's strict emission laws and other regulations have made a HUGE difference in the air quality here. California is going to lead the way in green jobs. The rest will be playing catch up.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:16:00", 
        "title": "Today, he just fell way short", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "but only if the green jobs only speak spanish", 
        "intTime": 20090327, 
        "postID": 8, 
        "quote": "", 
        "reply": "but only if the green jobs only speak spanish", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:27:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/26/AR2009032603316.html\" Thanks for the link, but I don't see anything in it about Obama. See, here's the thing: California may very well ban black cars (which leads to wondering what the CHP will drive), but that's in no way connected to the President. To make a statment such as the one you made is nothing more than an invalid and unproven link between two disconnected entities. For what purpose? To discredit the President? He may very well get on board with this idea, but how about we hold off condemning him for it until he actually does?", 
        "intTime": 20090327, 
        "postID": 9, 
        "quote": "Originally posted by Ira1945: \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/26/AR2009032603316.html\"", 
        "reply": " Thanks for the link, but I don't see anything in it about Obama. See, here's the thing: California may very well ban black cars (which leads to wondering what the CHP will drive), but that's in no way connected to the President. To make a statment such as the one you made is nothing more than an invalid and unproven link between two disconnected entities. For what purpose? To discredit the President? He may very well get on board with this idea, but how about we hold off condemning him for it until he actually does?", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:44:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Does anyone remember California in the 70s, LA especially? The SMOG was so thick that there were days people were told not to leave their homes. California's strict emission laws and other regulations have made a HUGE difference in the air quality here. California is going to lead the way in green jobs. The rest will be playing catch up. I remember California in the sixties and it was dreadful. I kid you not, but I had been living in Gardena for a month before I saw the San Gabriel mountains! They're just right there, on the north side of the basin, but obscured by haze and pollution. At the time, I worked up on Slauson and driving to work one, clear morning, it took a little while to realize something was different. Oh, WOW! LOOK! There's mountains right there! By the end of the work day, the air down around Signal Hill in Long Beach was downright brown. In fact, it looked like dirt suspended in the air and whole LA basin smelled like rotten fruit, all the time. Yes, California has come a long way since then, and it's been painful, but well worth it.", 
        "intTime": 20090327, 
        "postID": 10, 
        "quote": "Originally posted by SeaWitch1220: Does anyone remember California in the 70s, LA especially? The SMOG was so thick that there were days people were told not to leave their homes. California's strict emission laws and other regulations have made a HUGE difference in the air quality here. California is going to lead the way in green jobs. The rest will be playing catch up.", 
        "reply": " I remember California in the sixties and it was dreadful. I kid you not, but I had been living in Gardena for a month before I saw the San Gabriel mountains! They're just right there, on the north side of the basin, but obscured by haze and pollution. At the time, I worked up on Slauson and driving to work one, clear morning, it took a little while to realize something was different. Oh, WOW! LOOK! There's mountains right there! By the end of the work day, the air down around Signal Hill in Long Beach was downright brown. In fact, it looked like dirt suspended in the air and whole LA basin smelled like rotten fruit, all the time. Yes, California has come a long way since then, and it's been painful, but well worth it.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:48:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: stillkit: OK, but you said this: \"the man has some fundamental flaws\" More lib/socialist diversion. Anyone with rudimentry reading skills were able to grasp the meaning of the post.", 
        "intTime": 20090327, 
        "postID": 11, 
        "quote": "stillkit: OK, but you said this: \"the man has some fundamental flaws\"", 
        "reply": " More lib/socialist diversion. Anyone with rudimentry reading skills were able to grasp the meaning of the post.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:50:00", 
        "title": "Today, he just fell way short", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: To discredit the President? hell, PBHO doing pretty good job all by himself. the man can not even speak in public without a script, short out the teleprompt and he is toast", 
        "intTime": 20090327, 
        "postID": 12, 
        "quote": "To discredit the President?", 
        "reply": " hell, PBHO doing pretty good job all by himself. the man can not even speak in public without a script, short out the teleprompt and he is toast", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:56:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Yes, California has come a long way since then, and it's been painful, but well worth it. Absolutely it has been hard, but the benefits are there for ALL to see (like mountains). We as a country have a VERY hard road ahead of us in developing new ways of doing things and new technologies, but the benefits FAR outweigh the difficulties.", 
        "intTime": 20090327, 
        "postID": 13, 
        "quote": "Originally posted by stillkit: Yes, California has come a long way since then, and it's been painful, but well worth it.", 
        "reply": " Absolutely it has been hard, but the benefits are there for ALL to see (like mountains). We as a country have a VERY hard road ahead of us in developing new ways of doing things and new technologies, but the benefits FAR outweigh the difficulties.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 06:02:00", 
        "title": "Today, he just fell way short", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another...", 
        "intTime": 20090327, 
        "postID": 14, 
        "quote": "Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know?", 
        "reply": " There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another...", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 06:13:00", 
        "title": "Today, he just fell way short", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: Yes, California has come a long way since then, and it's been painful, but well worth it. Absolutely it has been hard, but the benefits are there for ALL to see (like mountains). We as a country have a VERY hard road ahead of us in developing new ways of doing things and new technologies, but the benefits FAR outweigh the difficulties. That SOUNDS nice..but it means very little.", 
        "intTime": 20090327, 
        "postID": 15, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stillkit: Yes, California has come a long way since then, and it's been painful, but well worth it. Absolutely it has been hard, but the benefits are there for ALL to see (like mountains). We as a country have a VERY hard road ahead of us in developing new ways of doing things and new technologies, but the benefits FAR outweigh the difficulties.", 
        "reply": " That SOUNDS nice..but it means very little.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 06:17:00", 
        "title": "Today, he just fell way short", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: That SOUNDS nice..but it means very little. ?? How does it mean very little? California has a proven track record of environmental policies that actually BENEFITS the environment and its inhabitants. That means very little? Reducing our dependence on oil means very little to you? Well, it means a great deal to our country and is most likely the only bootstrap we have to pull ourselves up by.", 
        "intTime": 20090327, 
        "postID": 16, 
        "quote": "Originally posted by threerings: That SOUNDS nice..but it means very little.", 
        "reply": " ?? How does it mean very little? California has a proven track record of environmental policies that actually BENEFITS the environment and its inhabitants. That means very little? Reducing our dependence on oil means very little to you? Well, it means a great deal to our country and is most likely the only bootstrap we have to pull ourselves up by.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 06:23:00", 
        "title": "Today, he just fell way short", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little.", 
        "intTime": 20090327, 
        "postID": 17, 
        "quote": "", 
        "reply": "Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 07:26:00", 
        "title": "Today, he just fell way short", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another... Nice…. Deficit Bush created was in large part to “doing God’s work” ….remember “God told him to liberate Iraq”. Obama spending is aimed at getting us back on track! If you have a better idea on how to fix the economy lets hear it! Here you go: http://www.whitehouse.gov/contact/", 
        "intTime": 20090327, 
        "postID": 18, 
        "quote": "Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another...", 
        "reply": " Nice…. Deficit Bush created was in large part to “doing God’s work” ….remember “God told him to liberate Iraq”. Obama spending is aimed at getting us back on track! If you have a better idea on how to fix the economy lets hear it! Here you go: http://www.whitehouse.gov/contact/", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 07:41:00", 
        "title": "Today, he just fell way short", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)!", 
        "intTime": 20090327, 
        "postID": 19, 
        "quote": "Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little.", 
        "reply": " Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)!", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 07:43:00", 
        "title": "Today, he just fell way short", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)! They also have the highest state population in the country. They also lead the country in wackos. And they are short on water. And they keep rebuilding houses where the fires are. It is a shame. without all the people creating the mess, the land would be beautiful.", 
        "intTime": 20090327, 
        "postID": 20, 
        "quote": "Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)!", 
        "reply": " They also have the highest state population in the country. They also lead the country in wackos. And they are short on water. And they keep rebuilding houses where the fires are. It is a shame. without all the people creating the mess, the land would be beautiful.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 08:48:00", 
        "title": "Today, he just fell way short", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)! With the \"home grown\" alone CA would be at 8th. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090327, 
        "postID": 21, 
        "quote": "Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)!", 
        "reply": " With the \"home grown\" alone CA would be at 8th. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 09:46:00", 
        "title": "Today, he just fell way short", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. Gee threerings, you don't have a bias here do you? If not please provide proof of \"his constant inability to tell the truth\" so that we may see where he fails to tell the truth. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. Well there's the war in Iraq which while he is winding down this war, he still has to pay for the folly and protect his soldiers till they are gone home. He also is trying to win the war in Afghanistan, now both of these were the resposibility of the Republicans who were practicing \"Barrow and spend\" rather than raising taxs for it and taking resposiblity for the costs of these wars. Of course they would have had to raise taxs to actualy pay for it so this also cause us to over spend. With the un-regulation of all the finanical markets so that the markets can regulate themself, we end up in the mess we're in right now. So, yes it is all the Republicans fault since this was on their shift and cause by their wild and reckless spending they crammed into their own budgets. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Trying to jump start a dying economy left to him. Seems that one flaw leands itself to another... Glad you see the flaws are in both party but what would you do to fix the economy with out killing the patient (the country)?", 
        "intTime": 20090327, 
        "postID": 22, 
        "quote": "Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. Gee threerings, you don't have a bias here do you? If not please provide proof of \"his constant inability to tell the truth\" so that we may see where he fails to tell the truth. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. Well there's the war in Iraq which while he is winding down this war, he still has to pay for the folly and protect his soldiers till they are gone home. He also is trying to win the war in Afghanistan, now both of these were the resposibility of the Republicans who were practicing \"Barrow and spend\" rather than raising taxs for it and taking resposiblity for the costs of these wars. Of course they would have had to raise taxs to actualy pay for it so this also cause us to over spend. With the un-regulation of all the finanical markets so that the markets can regulate themself, we end up in the mess we're in right now. So, yes it is all the Republicans fault since this was on their shift and cause by their wild and reckless spending they crammed into their own budgets. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Trying to jump start a dying economy left to him. Seems that one flaw leands itself to another...", 
        "reply": " Glad you see the flaws are in both party but what would you do to fix the economy with out killing the patient (the country)?", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 09:57:00", 
        "title": "Today, he just fell way short", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Glad you see the flaws are in both party but what would you do to fix the economy with out killing the patient (the country)? this would only make people feel good TAR AND FEATHER FRANKS AND DODD,,,, THEY ARE THE ONES THAT STARTED THIS MESS The republican party screwed the pooch and the democratic party ate the pooch", 
        "intTime": 20090327, 
        "postID": 23, 
        "quote": "Glad you see the flaws are in both party but what would you do to fix the economy with out killing the patient (the country)?", 
        "reply": " this would only make people feel good TAR AND FEATHER FRANKS AND DODD,,,, THEY ARE THE ONES THAT STARTED THIS MESS The republican party screwed the pooch and the democratic party ate the pooch", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 10:33:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)! With the \"home grown\" alone CA would be at 8th. Ca also leads in bad mortgages, wonder why that is??", 
        "intTime": 20090327, 
        "postID": 24, 
        "quote": "Originally posted by EngrOpsNCO: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)! With the \"home grown\" alone CA would be at 8th.", 
        "reply": " Ca also leads in bad mortgages, wonder why that is??", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 10:45:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another... I love how y'all like to accuse him of not sticking to his campaign promises. That's disingenous, at best. Why? Because he campaigned for over a year addressing issues based upon the assumption that things would go on about like they were. Then, suddenly, a month before the election, the economy fell apart and everything he'd been addressing went right out the window. It did for ALL the candidates, yet somehow, all the things Obama promised without realizing he'd inherit an economy down the tubes are suddenly sacro-sanct and anything he's done in reaction to that unexpected crisis are \"lies\" if it's not what he was talking about before the collapse.", 
        "intTime": 20090327, 
        "postID": 25, 
        "quote": "Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another...", 
        "reply": " I love how y'all like to accuse him of not sticking to his campaign promises. That's disingenous, at best. Why? Because he campaigned for over a year addressing issues based upon the assumption that things would go on about like they were. Then, suddenly, a month before the election, the economy fell apart and everything he'd been addressing went right out the window. It did for ALL the candidates, yet somehow, all the things Obama promised without realizing he'd inherit an economy down the tubes are suddenly sacro-sanct and anything he's done in reaction to that unexpected crisis are \"lies\" if it's not what he was talking about before the collapse.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 11:04:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another... I love how y'all like to accuse him of not sticking to his campaign promises. That's disingenous, at best. Why? Because he campaigned for over a year addressing issues based upon the assumption that things would go on about like they were. Then, suddenly, a month before the election, the economy fell apart and everything he'd been addressing went right out the window. It did for ALL the candidates, yet somehow, all the things Obama promised without realizing he'd inherit an economy down the tubes are suddenly sacro-sanct and anything he's done in reaction to that unexpected crisis are \"lies\" if it's not what he was talking about before the collapse. Please, you're telling me Obama isn't trying to have things both ways? Day1: I'm going to half the defict.. Day2: hers another 11 trillion in debt!", 
        "intTime": 20090327, 
        "postID": 26, 
        "quote": "Originally posted by stillkit: quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another... I love how y'all like to accuse him of not sticking to his campaign promises. That's disingenous, at best. Why? Because he campaigned for over a year addressing issues based upon the assumption that things would go on about like they were. Then, suddenly, a month before the election, the economy fell apart and everything he'd been addressing went right out the window. It did for ALL the candidates, yet somehow, all the things Obama promised without realizing he'd inherit an economy down the tubes are suddenly sacro-sanct and anything he's done in reaction to that unexpected crisis are \"lies\" if it's not what he was talking about before the collapse.", 
        "reply": " Please, you're telling me Obama isn't trying to have things both ways? Day1: I'm going to half the defict.. Day2: hers another 11 trillion in debt!", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 11:24:00", 
        "title": "Today, he just fell way short", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck.", 
        "intTime": 20090327, 
        "postID": 27, 
        "quote": "Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time", 
        "reply": " Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 11:45:00", 
        "title": "Today, he just fell way short", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck. here is one panel and it cost is 1800.oo us dollars and you need to fill up the roof with them here are the best panels today, you look up the cost \"http://www.nwpwr.com/products/solar_panels/siemens.htm\"", 
        "intTime": 20090327, 
        "postID": 28, 
        "quote": "Originally posted by Tangler: quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck.", 
        "reply": " here is one panel and it cost is 1800.oo us dollars and you need to fill up the roof with them here are the best panels today, you look up the cost \"http://www.nwpwr.com/products/solar_panels/siemens.htm\"", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 13:43:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Tangler: quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck. here is one panel and it cost is 1800.oo us dollars and you need to fill up the roof with them here are the best panels today, you look up the cost \"http://www.nwpwr.com/products/solar_panels/siemens.htm\" Sure and you can do better than that me bucko, I took a small mosy and found 4 places that would sell that same panel for $1,000 to $1,200. As for silly statement on filling roof, est. of a stand. installation is 8 to 12 panels... so about $15,000 plus batterys and inverter adds $25,000, so $35,000. Add a solor water heater to fix the hot water costs, so we end up with $40-50,000. They est. your savings will pay it off in 7 to 10 years. Check out the rebates and you can cut this $7,000 to $20,000 depending on your state and the fed.s. Of course you can save more if you do it yourself.", 
        "intTime": 20090327, 
        "postID": 29, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Tangler: quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck. here is one panel and it cost is 1800.oo us dollars and you need to fill up the roof with them here are the best panels today, you look up the cost \"http://www.nwpwr.com/products/solar_panels/siemens.htm\"", 
        "reply": " Sure and you can do better than that me bucko, I took a small mosy and found 4 places that would sell that same panel for $1,000 to $1,200. As for silly statement on filling roof, est. of a stand. installation is 8 to 12 panels... so about $15,000 plus batterys and inverter adds $25,000, so $35,000. Add a solor water heater to fix the hot water costs, so we end up with $40-50,000. They est. your savings will pay it off in 7 to 10 years. Check out the rebates and you can cut this $7,000 to $20,000 depending on your state and the fed.s. Of course you can save more if you do it yourself.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 16:26:00", 
        "title": "Today, he just fell way short", 
        "userID": "Tangler"
    }, 
    {
        "content": "Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years.. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!) I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen not at this time, nor in the near future either \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time", 
        "intTime": 20090326, 
        "postID": 30, 
        "quote": "", 
        "reply": "Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years.. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!) I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen not at this time, nor in the near future either \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 18:17:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "\"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know?", 
        "intTime": 20090326, 
        "postID": 31, 
        "quote": "", 
        "reply": "\"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know?", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 18:19:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it", 
        "intTime": 20090326, 
        "postID": 32, 
        "quote": "Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know?", 
        "reply": " was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 18:33:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it OK, but you said this: \"the man has some fundamental flaws\" That's a statement about HIM, personally. And, I'd like to see some proof of this statement, not only about California, but about his plans: \"pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it\"", 
        "intTime": 20090326, 
        "postID": 33, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it", 
        "reply": " OK, but you said this: \"the man has some fundamental flaws\" That's a statement about HIM, personally. And, I'd like to see some proof of this statement, not only about California, but about his plans: \"pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it\"", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 18:35:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "yea just dont ask them to build solar panels or windmills in the dems back yard... they dont want it... pelosi to Arnold in ca...", 
        "intTime": 20090326, 
        "postID": 34, 
        "quote": "", 
        "reply": "yea just dont ask them to build solar panels or windmills in the dems back yard... they dont want it... pelosi to Arnold in ca...", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-26 20:49:00", 
        "title": "Today, he just fell way short", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by Ira1945: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? i said it and stand by it you prove me wrong, if you can and you can not, if you remember if i find out i made error i am first to identify it, but this is all solid was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it OK, but you said this: \"the man has some fundamental flaws\" That's a statement about HIM, personally. And, I'd like to see some proof of this statement, not only about California, but about his plans: \"pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it\" \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/26/AR2009032603316.html\"", 
        "intTime": 20090327, 
        "postID": 35, 
        "quote": "Originally posted by stillkit: quote: Originally posted by Ira1945: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? i said it and stand by it you prove me wrong, if you can and you can not, if you remember if i find out i made error i am first to identify it, but this is all solid was referring to his comments on the internet today about electronic devices to monitor excess demand and so forth.... not him personally, although i do not trust him. he is pure politician and will say whatever is needed at the moment, but this post was about specifics. for example one solar to just keep one 80D battery up is almost 22sg ft, and that is with minimum demand on the battery.. i lived on this system for ten years i would support specific research on coming up with a new solar cell that used depth along with sq centimeters per amp, that is not being done now....but label it as that , pure research and not tell people that they are going to sell back surplus pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it OK, but you said this: \"the man has some fundamental flaws\" That's a statement about HIM, personally. And, I'd like to see some proof of this statement, not only about California, but about his plans: \"pretty soon he is going to be like california and they are considering banning the color black for automobiles due to it taking more energy to air condition it\"", 
        "reply": " \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/26/AR2009032603316.html\"", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 04:52:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "Does anyone remember California in the 70s, LA especially? The SMOG was so thick that there were days people were told not to leave their homes. California's strict emission laws and other regulations have made a HUGE difference in the air quality here. California is going to lead the way in green jobs. The rest will be playing catch up.", 
        "intTime": 20090327, 
        "postID": 36, 
        "quote": "", 
        "reply": "Does anyone remember California in the 70s, LA especially? The SMOG was so thick that there were days people were told not to leave their homes. California's strict emission laws and other regulations have made a HUGE difference in the air quality here. California is going to lead the way in green jobs. The rest will be playing catch up.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:16:00", 
        "title": "Today, he just fell way short", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "but only if the green jobs only speak spanish", 
        "intTime": 20090327, 
        "postID": 37, 
        "quote": "", 
        "reply": "but only if the green jobs only speak spanish", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:27:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/26/AR2009032603316.html\" Thanks for the link, but I don't see anything in it about Obama. See, here's the thing: California may very well ban black cars (which leads to wondering what the CHP will drive), but that's in no way connected to the President. To make a statment such as the one you made is nothing more than an invalid and unproven link between two disconnected entities. For what purpose? To discredit the President? He may very well get on board with this idea, but how about we hold off condemning him for it until he actually does?", 
        "intTime": 20090327, 
        "postID": 38, 
        "quote": "Originally posted by Ira1945: \"http://www.washingtonpost.com/wp-dyn/content/article/2009/03/26/AR2009032603316.html\"", 
        "reply": " Thanks for the link, but I don't see anything in it about Obama. See, here's the thing: California may very well ban black cars (which leads to wondering what the CHP will drive), but that's in no way connected to the President. To make a statment such as the one you made is nothing more than an invalid and unproven link between two disconnected entities. For what purpose? To discredit the President? He may very well get on board with this idea, but how about we hold off condemning him for it until he actually does?", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:44:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Does anyone remember California in the 70s, LA especially? The SMOG was so thick that there were days people were told not to leave their homes. California's strict emission laws and other regulations have made a HUGE difference in the air quality here. California is going to lead the way in green jobs. The rest will be playing catch up. I remember California in the sixties and it was dreadful. I kid you not, but I had been living in Gardena for a month before I saw the San Gabriel mountains! They're just right there, on the north side of the basin, but obscured by haze and pollution. At the time, I worked up on Slauson and driving to work one, clear morning, it took a little while to realize something was different. Oh, WOW! LOOK! There's mountains right there! By the end of the work day, the air down around Signal Hill in Long Beach was downright brown. In fact, it looked like dirt suspended in the air and whole LA basin smelled like rotten fruit, all the time. Yes, California has come a long way since then, and it's been painful, but well worth it.", 
        "intTime": 20090327, 
        "postID": 39, 
        "quote": "Originally posted by SeaWitch1220: Does anyone remember California in the 70s, LA especially? The SMOG was so thick that there were days people were told not to leave their homes. California's strict emission laws and other regulations have made a HUGE difference in the air quality here. California is going to lead the way in green jobs. The rest will be playing catch up.", 
        "reply": " I remember California in the sixties and it was dreadful. I kid you not, but I had been living in Gardena for a month before I saw the San Gabriel mountains! They're just right there, on the north side of the basin, but obscured by haze and pollution. At the time, I worked up on Slauson and driving to work one, clear morning, it took a little while to realize something was different. Oh, WOW! LOOK! There's mountains right there! By the end of the work day, the air down around Signal Hill in Long Beach was downright brown. In fact, it looked like dirt suspended in the air and whole LA basin smelled like rotten fruit, all the time. Yes, California has come a long way since then, and it's been painful, but well worth it.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:48:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: stillkit: OK, but you said this: \"the man has some fundamental flaws\" More lib/socialist diversion. Anyone with rudimentry reading skills were able to grasp the meaning of the post.", 
        "intTime": 20090327, 
        "postID": 40, 
        "quote": "stillkit: OK, but you said this: \"the man has some fundamental flaws\"", 
        "reply": " More lib/socialist diversion. Anyone with rudimentry reading skills were able to grasp the meaning of the post.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:50:00", 
        "title": "Today, he just fell way short", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: To discredit the President? hell, PBHO doing pretty good job all by himself. the man can not even speak in public without a script, short out the teleprompt and he is toast", 
        "intTime": 20090327, 
        "postID": 41, 
        "quote": "To discredit the President?", 
        "reply": " hell, PBHO doing pretty good job all by himself. the man can not even speak in public without a script, short out the teleprompt and he is toast", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 05:56:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Yes, California has come a long way since then, and it's been painful, but well worth it. Absolutely it has been hard, but the benefits are there for ALL to see (like mountains). We as a country have a VERY hard road ahead of us in developing new ways of doing things and new technologies, but the benefits FAR outweigh the difficulties.", 
        "intTime": 20090327, 
        "postID": 42, 
        "quote": "Originally posted by stillkit: Yes, California has come a long way since then, and it's been painful, but well worth it.", 
        "reply": " Absolutely it has been hard, but the benefits are there for ALL to see (like mountains). We as a country have a VERY hard road ahead of us in developing new ways of doing things and new technologies, but the benefits FAR outweigh the difficulties.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 06:02:00", 
        "title": "Today, he just fell way short", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another...", 
        "intTime": 20090327, 
        "postID": 43, 
        "quote": "Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know?", 
        "reply": " There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another...", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 06:13:00", 
        "title": "Today, he just fell way short", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stillkit: Yes, California has come a long way since then, and it's been painful, but well worth it. Absolutely it has been hard, but the benefits are there for ALL to see (like mountains). We as a country have a VERY hard road ahead of us in developing new ways of doing things and new technologies, but the benefits FAR outweigh the difficulties. That SOUNDS nice..but it means very little.", 
        "intTime": 20090327, 
        "postID": 44, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stillkit: Yes, California has come a long way since then, and it's been painful, but well worth it. Absolutely it has been hard, but the benefits are there for ALL to see (like mountains). We as a country have a VERY hard road ahead of us in developing new ways of doing things and new technologies, but the benefits FAR outweigh the difficulties.", 
        "reply": " That SOUNDS nice..but it means very little.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 06:17:00", 
        "title": "Today, he just fell way short", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: That SOUNDS nice..but it means very little. ?? How does it mean very little? California has a proven track record of environmental policies that actually BENEFITS the environment and its inhabitants. That means very little? Reducing our dependence on oil means very little to you? Well, it means a great deal to our country and is most likely the only bootstrap we have to pull ourselves up by.", 
        "intTime": 20090327, 
        "postID": 45, 
        "quote": "Originally posted by threerings: That SOUNDS nice..but it means very little.", 
        "reply": " ?? How does it mean very little? California has a proven track record of environmental policies that actually BENEFITS the environment and its inhabitants. That means very little? Reducing our dependence on oil means very little to you? Well, it means a great deal to our country and is most likely the only bootstrap we have to pull ourselves up by.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 06:23:00", 
        "title": "Today, he just fell way short", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little.", 
        "intTime": 20090327, 
        "postID": 46, 
        "quote": "", 
        "reply": "Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 07:26:00", 
        "title": "Today, he just fell way short", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another... Nice…. Deficit Bush created was in large part to “doing God’s work” ….remember “God told him to liberate Iraq”. Obama spending is aimed at getting us back on track! If you have a better idea on how to fix the economy lets hear it! Here you go: http://www.whitehouse.gov/contact/", 
        "intTime": 20090327, 
        "postID": 47, 
        "quote": "Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another...", 
        "reply": " Nice…. Deficit Bush created was in large part to “doing God’s work” ….remember “God told him to liberate Iraq”. Obama spending is aimed at getting us back on track! If you have a better idea on how to fix the economy lets hear it! Here you go: http://www.whitehouse.gov/contact/", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 07:41:00", 
        "title": "Today, he just fell way short", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)!", 
        "intTime": 20090327, 
        "postID": 48, 
        "quote": "Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little.", 
        "reply": " Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)!", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 07:43:00", 
        "title": "Today, he just fell way short", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)! They also have the highest state population in the country. They also lead the country in wackos. And they are short on water. And they keep rebuilding houses where the fires are. It is a shame. without all the people creating the mess, the land would be beautiful.", 
        "intTime": 20090327, 
        "postID": 49, 
        "quote": "Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)!", 
        "reply": " They also have the highest state population in the country. They also lead the country in wackos. And they are short on water. And they keep rebuilding houses where the fires are. It is a shame. without all the people creating the mess, the land would be beautiful.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 08:48:00", 
        "title": "Today, he just fell way short", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)! With the \"home grown\" alone CA would be at 8th. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "intTime": 20090327, 
        "postID": 50, 
        "quote": "Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)!", 
        "reply": " With the \"home grown\" alone CA would be at 8th. \"Diplomacy is utterly useless when there is no force behind it; the diplomat is the servant, not the master of the soldier.\" THEODORE ROOSEVELT", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 09:46:00", 
        "title": "Today, he just fell way short", 
        "userID": "EngrOpsNCO"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. Gee threerings, you don't have a bias here do you? If not please provide proof of \"his constant inability to tell the truth\" so that we may see where he fails to tell the truth. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. Well there's the war in Iraq which while he is winding down this war, he still has to pay for the folly and protect his soldiers till they are gone home. He also is trying to win the war in Afghanistan, now both of these were the resposibility of the Republicans who were practicing \"Barrow and spend\" rather than raising taxs for it and taking resposiblity for the costs of these wars. Of course they would have had to raise taxs to actualy pay for it so this also cause us to over spend. With the un-regulation of all the finanical markets so that the markets can regulate themself, we end up in the mess we're in right now. So, yes it is all the Republicans fault since this was on their shift and cause by their wild and reckless spending they crammed into their own budgets. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Trying to jump start a dying economy left to him. Seems that one flaw leands itself to another... Glad you see the flaws are in both party but what would you do to fix the economy with out killing the patient (the country)?", 
        "intTime": 20090327, 
        "postID": 51, 
        "quote": "Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. Gee threerings, you don't have a bias here do you? If not please provide proof of \"his constant inability to tell the truth\" so that we may see where he fails to tell the truth. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. Well there's the war in Iraq which while he is winding down this war, he still has to pay for the folly and protect his soldiers till they are gone home. He also is trying to win the war in Afghanistan, now both of these were the resposibility of the Republicans who were practicing \"Barrow and spend\" rather than raising taxs for it and taking resposiblity for the costs of these wars. Of course they would have had to raise taxs to actualy pay for it so this also cause us to over spend. With the un-regulation of all the finanical markets so that the markets can regulate themself, we end up in the mess we're in right now. So, yes it is all the Republicans fault since this was on their shift and cause by their wild and reckless spending they crammed into their own budgets. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Trying to jump start a dying economy left to him. Seems that one flaw leands itself to another...", 
        "reply": " Glad you see the flaws are in both party but what would you do to fix the economy with out killing the patient (the country)?", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 09:57:00", 
        "title": "Today, he just fell way short", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Glad you see the flaws are in both party but what would you do to fix the economy with out killing the patient (the country)? this would only make people feel good TAR AND FEATHER FRANKS AND DODD,,,, THEY ARE THE ONES THAT STARTED THIS MESS The republican party screwed the pooch and the democratic party ate the pooch", 
        "intTime": 20090327, 
        "postID": 52, 
        "quote": "Glad you see the flaws are in both party but what would you do to fix the economy with out killing the patient (the country)?", 
        "reply": " this would only make people feel good TAR AND FEATHER FRANKS AND DODD,,,, THEY ARE THE ONES THAT STARTED THIS MESS The republican party screwed the pooch and the democratic party ate the pooch", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 10:33:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by EngrOpsNCO: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)! With the \"home grown\" alone CA would be at 8th. Ca also leads in bad mortgages, wonder why that is??", 
        "intTime": 20090327, 
        "postID": 53, 
        "quote": "Originally posted by EngrOpsNCO: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: Shutting down factories and sending manufacturing to other countries also \"BENEFITS the environment and its inhabitants.\" However it doesn't do much for the economy or standard of living. Without looking at COST as well as benefit the conclusions mean very little. Even with all the green laws CA still has the biggest economy in the US (8th largest in the world)! With the \"home grown\" alone CA would be at 8th.", 
        "reply": " Ca also leads in bad mortgages, wonder why that is??", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 10:45:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another... I love how y'all like to accuse him of not sticking to his campaign promises. That's disingenous, at best. Why? Because he campaigned for over a year addressing issues based upon the assumption that things would go on about like they were. Then, suddenly, a month before the election, the economy fell apart and everything he'd been addressing went right out the window. It did for ALL the candidates, yet somehow, all the things Obama promised without realizing he'd inherit an economy down the tubes are suddenly sacro-sanct and anything he's done in reaction to that unexpected crisis are \"lies\" if it's not what he was talking about before the collapse.", 
        "intTime": 20090327, 
        "postID": 54, 
        "quote": "Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another...", 
        "reply": " I love how y'all like to accuse him of not sticking to his campaign promises. That's disingenous, at best. Why? Because he campaigned for over a year addressing issues based upon the assumption that things would go on about like they were. Then, suddenly, a month before the election, the economy fell apart and everything he'd been addressing went right out the window. It did for ALL the candidates, yet somehow, all the things Obama promised without realizing he'd inherit an economy down the tubes are suddenly sacro-sanct and anything he's done in reaction to that unexpected crisis are \"lies\" if it's not what he was talking about before the collapse.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 11:04:00", 
        "title": "Today, he just fell way short", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another... I love how y'all like to accuse him of not sticking to his campaign promises. That's disingenous, at best. Why? Because he campaigned for over a year addressing issues based upon the assumption that things would go on about like they were. Then, suddenly, a month before the election, the economy fell apart and everything he'd been addressing went right out the window. It did for ALL the candidates, yet somehow, all the things Obama promised without realizing he'd inherit an economy down the tubes are suddenly sacro-sanct and anything he's done in reaction to that unexpected crisis are \"lies\" if it's not what he was talking about before the collapse. Please, you're telling me Obama isn't trying to have things both ways? Day1: I'm going to half the defict.. Day2: hers another 11 trillion in debt!", 
        "intTime": 20090327, 
        "postID": 55, 
        "quote": "Originally posted by stillkit: quote: Originally posted by threerings: quote: Originally posted by stillkit: \"the man has some fundamental flaws\" The MAN has some fundamental flaws, or his POLICIES do? There is a difference, you know? There really isn't a difference. The flaws he has shown, namely his constant inability to tell the truth, have a major impact on his policies. From todays NY POST: FOR a guy who talks so much about wanting a new era of re sponsibility, President Obama spends an awful lot of time blaming Republicans for all the wild and reckless spending he crammed into his own budget. After running a campaign against the $1 trillion deficit he \"inherited\" from President Bush and the Republicans, Obama quickly matched it. During his first 50 days in office, he and his Democratic-controlled Congress spent $1 billion an hour. Seems that one flaw leands itself to another... I love how y'all like to accuse him of not sticking to his campaign promises. That's disingenous, at best. Why? Because he campaigned for over a year addressing issues based upon the assumption that things would go on about like they were. Then, suddenly, a month before the election, the economy fell apart and everything he'd been addressing went right out the window. It did for ALL the candidates, yet somehow, all the things Obama promised without realizing he'd inherit an economy down the tubes are suddenly sacro-sanct and anything he's done in reaction to that unexpected crisis are \"lies\" if it's not what he was talking about before the collapse.", 
        "reply": " Please, you're telling me Obama isn't trying to have things both ways? Day1: I'm going to half the defict.. Day2: hers another 11 trillion in debt!", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 11:24:00", 
        "title": "Today, he just fell way short", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck.", 
        "intTime": 20090327, 
        "postID": 56, 
        "quote": "Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time", 
        "reply": " Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 11:45:00", 
        "title": "Today, he just fell way short", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck. here is one panel and it cost is 1800.oo us dollars and you need to fill up the roof with them here are the best panels today, you look up the cost \"http://www.nwpwr.com/products/solar_panels/siemens.htm\"", 
        "intTime": 20090327, 
        "postID": 57, 
        "quote": "Originally posted by Tangler: quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck.", 
        "reply": " here is one panel and it cost is 1800.oo us dollars and you need to fill up the roof with them here are the best panels today, you look up the cost \"http://www.nwpwr.com/products/solar_panels/siemens.htm\"", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 13:43:00", 
        "title": "Today, he just fell way short", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by Tangler: quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck. here is one panel and it cost is 1800.oo us dollars and you need to fill up the roof with them here are the best panels today, you look up the cost \"http://www.nwpwr.com/products/solar_panels/siemens.htm\" Sure and you can do better than that me bucko, I took a small mosy and found 4 places that would sell that same panel for $1,000 to $1,200. As for silly statement on filling roof, est. of a stand. installation is 8 to 12 panels... so about $15,000 plus batterys and inverter adds $25,000, so $35,000. Add a solor water heater to fix the hot water costs, so we end up with $40-50,000. They est. your savings will pay it off in 7 to 10 years. Check out the rebates and you can cut this $7,000 to $20,000 depending on your state and the fed.s. Of course you can save more if you do it yourself.", 
        "intTime": 20090327, 
        "postID": 58, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by Tangler: quote: Originally posted by Ira1945: Obama and electronic monitor device for energy consumption, and the new industry that it will fuel.. also how people will some day be able to sell electricity back using these devices. Okay with the premise that i am 100 percent behind research into energy creation and efficient utilization; the man has some fundamental flaws If your consumption of energy is too high then there are many things you can do. No not going to list them but the list is large. And electric companies already have utilized this system to control during peak demands. and they on the whole have abandoned the practice. Nope, they haven't. To start with , they're still browning people and bussiness out in most places to lower the load on the system. The also require large users to \"voluntary\" shut off equipment till the load is lower to the point the rest of the grid can stay on. There used to be a system that during peak hours could monitor your heat/air pump and water heater and shut them down or back them off during peak hours. turned out to be pretty expensive to maintain and it just did not work, i had this system in my house for years..The \"new\" systems are cheaper and work better. Obama also said today that people would be able to sell surplus power with the new equipment, does anyone here have any idea how many solar panels are required to do something like this?? Depends on the amount of power your house needs, the number of the new, more efficent solor panels you want. The number of batterys you want and the amount of money you want to spend I do, I lived with solar panels and wind generators for ten years, and remember the system is directly porportional (more requires bigger!!)But the new and improved units mean the systems can make more energy for the same size your use to. I say fund research but dont sell a pipe dream that everyone will have a little magic electronic box, a few solar panels and be energy dependant. aint gonna happen. So, we should just take you word for it... why? not at this time, nor in the near future either. So of coure \"you\" are able to see the future and you feel there's no reson to try to improve the systems or change the system to make us less dependant on the needs we have today? \"http://greenbydesign.com/2009/02/19/are-obama-and-google-stimulating-the-smart-energy-sector/\" here is some more information, this is not new technology and has been around for a long long time Of course this is \"old\" tech, theses are meters,can't really inprove them any more but here's a few links that will lead you to \"new\" tech that will inprove your life and decress your energy bill ++http://greenbydesign.com/2008/11/19/solar-hot-water-its-so-hot-its-cool/++ For hot water using solor. ++http://www.solarhome.org/solarpanelscenter.html++ Here is infoe for those who want to read about the latest teck. here is one panel and it cost is 1800.oo us dollars and you need to fill up the roof with them here are the best panels today, you look up the cost \"http://www.nwpwr.com/products/solar_panels/siemens.htm\"", 
        "reply": " Sure and you can do better than that me bucko, I took a small mosy and found 4 places that would sell that same panel for $1,000 to $1,200. As for silly statement on filling roof, est. of a stand. installation is 8 to 12 panels... so about $15,000 plus batterys and inverter adds $25,000, so $35,000. Add a solor water heater to fix the hot water costs, so we end up with $40-50,000. They est. your savings will pay it off in 7 to 10 years. Check out the rebates and you can cut this $7,000 to $20,000 depending on your state and the fed.s. Of course you can save more if you do it yourself.", 
        "threadID": "409192893_9870020912001", 
        "time": "2009-03-27 16:26:00", 
        "title": "Today, he just fell way short", 
        "userID": "Tangler"
    }
]