[
    {
        "content": "Marine fights to graduate in dress blues EL PASO -- Garrett Miles-McCarthy does not care about donning the traditional navy-blue cap and gown when he graduates from Chapin High School in June. The 18-year-old, who completed his coursework in December and is now a private first class in the Marine Corps, wants to accept his high school diploma in his military uniform. The school principal rejected his request, but the fight has just begun. >http://www.elpasotimes.com/ci_12087109?source=most_viewed&_requestid=7791982 And El Paso is a very strong military town.", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "", 
        "reply": "Marine fights to graduate in dress blues EL PASO -- Garrett Miles-McCarthy does not care about donning the traditional navy-blue cap and gown when he graduates from Chapin High School in June. The 18-year-old, who completed his coursework in December and is now a private first class in the Marine Corps, wants to accept his high school diploma in his military uniform. The school principal rejected his request, but the fight has just begun. >http://www.elpasotimes.com/ci_12087109?source=most_viewed&_requestid=7791982 And El Paso is a very strong military town.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:23:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "intTime": 20090408, 
        "postID": 2, 
        "quote": "", 
        "reply": "What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:35:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "what a shame...", 
        "intTime": 20090408, 
        "postID": 3, 
        "quote": "", 
        "reply": "what a shame...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "intTime": 20090408, 
        "postID": 4, 
        "quote": "Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "reply": " It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "billdawg24"
    }, 
    {
        "content": "PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "intTime": 20090408, 
        "postID": 5, 
        "quote": "", 
        "reply": "PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "While I see the school's point, of where does it stop. I get tired of people making everythign black & white, and never using logic. The whole we can't because it will offend someone or they may want to wear whatever, adn now we can't tell them no, argument is spineless. If you make an exception for military uniforms(which they should), you can tell the next person wanting to wear a kimono, no. It's really that easy.", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "", 
        "reply": "While I see the school's point, of where does it stop. I get tired of people making everythign black & white, and never using logic. The whole we can't because it will offend someone or they may want to wear whatever, adn now we can't tell them no, argument is spineless. If you make an exception for military uniforms(which they should), you can tell the next person wanting to wear a kimono, no. It's really that easy.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "billdawg24"
    }, 
    {
        "content": "I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "intTime": 20090408, 
        "postID": 7, 
        "quote": "", 
        "reply": "I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:49:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I understand the pride this young man has BUT (don't ya hate those buts) he also should be well versed in \"Rules and Regs\"... if it is the school rule that you wear the commencement outfit then \"that is the name of the tune\". The kid should follow the policy set down my the school. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090408, 
        "postID": 8, 
        "quote": "", 
        "reply": "I understand the pride this young man has BUT (don't ya hate those buts) he also should be well versed in \"Rules and Regs\"... if it is the school rule that you wear the commencement outfit then \"that is the name of the tune\". The kid should follow the policy set down my the school. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:51:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "intTime": 20090408, 
        "postID": 9, 
        "quote": "", 
        "reply": "why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:53:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is. It is so rare that you and I agree ... that I have to seize this moment. To the extent that wearing Marine Blues attracts attention to him, it diminishes attention to the other graduates. This is a class graduation ... not an individual graduation.", 
        "intTime": 20090408, 
        "postID": 10, 
        "quote": "Originally posted by PhoenixDark: I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "reply": " It is so rare that you and I agree ... that I have to seize this moment. To the extent that wearing Marine Blues attracts attention to him, it diminishes attention to the other graduates. This is a class graduation ... not an individual graduation.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:06:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown... BS the dress for the Graduation ceremony is Cap and gown HE is demanding special treatment pure and simple. He can wear his uniform under the Cap and Gown, take the Cap and gown off as soon as the ceremony is over and do the rest in his uniform like I've seen others do.", 
        "intTime": 20090408, 
        "postID": 11, 
        "quote": "Originally posted by ELLIOTT1980: PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "reply": " BS the dress for the Graduation ceremony is Cap and gown HE is demanding special treatment pure and simple. He can wear his uniform under the Cap and Gown, take the Cap and gown off as soon as the ceremony is over and do the rest in his uniform like I've seen others do.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:12:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "intTime": 20090408, 
        "postID": 12, 
        "quote": "Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "reply": " The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:23:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks? LOL It has everything to do with attention! You graduate from in High school with a traditional Cap and Gown. If he wanted to be different,he should have been the valedictorian. I worked at McDonald's in High school...Why couldn't I wear my uniform to graduation! Don't set a precedence, because you will ultimately open the flood gates.", 
        "intTime": 20090408, 
        "postID": 13, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "reply": " LOL It has everything to do with attention! You graduate from in High school with a traditional Cap and Gown. If he wanted to be different,he should have been the valedictorian. I worked at McDonald's in High school...Why couldn't I wear my uniform to graduation! Don't set a precedence, because you will ultimately open the flood gates.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:32:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this???", 
        "intTime": 20090408, 
        "postID": 14, 
        "quote": "Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "reply": " last year and the year before that and the year before that has always been political based so why not this???", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:40:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "intTime": 20090408, 
        "postID": 15, 
        "quote": "Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not.", 
        "reply": " In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:42:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this??? For some people, nothing is political, for others some things are, for you EVERYTHING is. Many of us have the ability to separate politics and enjoy life instead of simply hating half the country for having a different political view and thinking the evil \"lefties\" or \"righties\" are out to get us and drive the country into the ground. Those like you who simply b!tch and moan about one leader or blindly follow another contribute nothing as that is exactly what these two parties want. The truth is generally in the middle, not at the polar ends where many people like to align themselves.", 
        "intTime": 20090408, 
        "postID": 16, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this???", 
        "reply": " For some people, nothing is political, for others some things are, for you EVERYTHING is. Many of us have the ability to separate politics and enjoy life instead of simply hating half the country for having a different political view and thinking the evil \"lefties\" or \"righties\" are out to get us and drive the country into the ground. Those like you who simply b!tch and moan about one leader or blindly follow another contribute nothing as that is exactly what these two parties want. The truth is generally in the middle, not at the polar ends where many people like to align themselves.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:43:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "who hates anyone??? you are the only one talking any hating... now back to the topic...", 
        "intTime": 20090408, 
        "postID": 17, 
        "quote": "", 
        "reply": "who hates anyone??? you are the only one talking any hating... now back to the topic...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "intTime": 20090408, 
        "postID": 18, 
        "quote": "Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "reply": " So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:51:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other? Yes... they're both jobs. When I want a big mac, McDonalds is the most significant of any uniform.", 
        "intTime": 20090408, 
        "postID": 19, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "reply": " Yes... they're both jobs. When I want a big mac, McDonalds is the most significant of any uniform.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:58:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: who hates anyone??? you are the only one talking any hating... now back to the topic... When did I mention hate? I pointed out a fact that you are extremely political and will never pass a chance to bash those who disagree with you. Oops, reread my post and yes I did say hate. It's just a matter of perception, the way you carry yourself sure seems like hate to me for those who disagree with you. As far as the topic I apologize because I've seen how you never stray and are so courteous to others on this board.", 
        "intTime": 20090408, 
        "postID": 20, 
        "quote": "Originally posted by commonsense5: quote: Originally posted by outlaws93: who hates anyone??? you are the only one talking any hating... now back to the topic... When did I mention hate? I pointed out a fact that you are extremely political and will never pass a chance to bash those who disagree with you. Oops, reread my post and yes I did say hate. It's just a matter of perception, the way you carry yourself sure seems like hate to me for those who disagree with you. As far as the topic I apologize because I've seen how you never stray and are so courteous to others on this board.", 
        "reply": "", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:00:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also. He can wear it. Under his gown for the ceremony just like anybody else can wear anything they want and take the gown off after they get their diploma.", 
        "intTime": 20090408, 
        "postID": 21, 
        "quote": "Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also.", 
        "reply": " He can wear it. Under his gown for the ceremony just like anybody else can wear anything they want and take the gown off after they get their diploma.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:07:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also. While we're at it lets add the football team, wrestling team, 4h club, FFA, DECA, and the dam cheerleaders as well.", 
        "intTime": 20090408, 
        "postID": 22, 
        "quote": "Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also.", 
        "reply": " While we're at it lets add the football team, wrestling team, 4h club, FFA, DECA, and the dam cheerleaders as well.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:11:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "Every spring this pops up...", 
        "intTime": 20090408, 
        "postID": 23, 
        "quote": "", 
        "reply": "Every spring this pops up...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:22:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: He should wear the uniform under the gown, and after he gets his di plo may he should take off the cap and gown, don the cover, and walk off the stage. Sneak attack. Swift, Silent, and Deadly. +1", 
        "intTime": 20090408, 
        "postID": 24, 
        "quote": "Originally posted by SSgtRobertMorris: He should wear the uniform under the gown, and after he gets his di plo may he should take off the cap and gown, don the cover, and walk off the stage. Sneak attack. Swift, Silent, and Deadly.", 
        "reply": " +1", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:31:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks? Yeh, nobody wants to see a green bus drivers uniform.", 
        "intTime": 20090408, 
        "postID": 25, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "reply": " Yeh, nobody wants to see a green bus drivers uniform.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:32:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Marine fights to graduate in dress blues EL PASO -- Garrett Miles-McCarthy does not care about donning the traditional navy-blue cap and gown when he graduates from Chapin High School in June. The 18-year-old, who completed his coursework in December and is now a private first class in the Marine Corps, wants to accept his high school diploma in his military uniform. The school principal rejected his request, but the fight has just begun. >http://www.elpasotimes.com/ci_12087109?source=most_viewed&_requestid=7791982 And El Paso is a very strong military town.", 
        "intTime": 20090408, 
        "postID": 26, 
        "quote": "", 
        "reply": "Marine fights to graduate in dress blues EL PASO -- Garrett Miles-McCarthy does not care about donning the traditional navy-blue cap and gown when he graduates from Chapin High School in June. The 18-year-old, who completed his coursework in December and is now a private first class in the Marine Corps, wants to accept his high school diploma in his military uniform. The school principal rejected his request, but the fight has just begun. >http://www.elpasotimes.com/ci_12087109?source=most_viewed&_requestid=7791982 And El Paso is a very strong military town.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:23:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "intTime": 20090408, 
        "postID": 27, 
        "quote": "", 
        "reply": "What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:35:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "what a shame...", 
        "intTime": 20090408, 
        "postID": 28, 
        "quote": "", 
        "reply": "what a shame...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "intTime": 20090408, 
        "postID": 29, 
        "quote": "Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "reply": " It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "billdawg24"
    }, 
    {
        "content": "PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "intTime": 20090408, 
        "postID": 30, 
        "quote": "", 
        "reply": "PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "While I see the school's point, of where does it stop. I get tired of people making everythign black & white, and never using logic. The whole we can't because it will offend someone or they may want to wear whatever, adn now we can't tell them no, argument is spineless. If you make an exception for military uniforms(which they should), you can tell the next person wanting to wear a kimono, no. It's really that easy.", 
        "intTime": 20090408, 
        "postID": 31, 
        "quote": "", 
        "reply": "While I see the school's point, of where does it stop. I get tired of people making everythign black & white, and never using logic. The whole we can't because it will offend someone or they may want to wear whatever, adn now we can't tell them no, argument is spineless. If you make an exception for military uniforms(which they should), you can tell the next person wanting to wear a kimono, no. It's really that easy.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "billdawg24"
    }, 
    {
        "content": "I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "intTime": 20090408, 
        "postID": 32, 
        "quote": "", 
        "reply": "I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:49:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I understand the pride this young man has BUT (don't ya hate those buts) he also should be well versed in \"Rules and Regs\"... if it is the school rule that you wear the commencement outfit then \"that is the name of the tune\". The kid should follow the policy set down my the school. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090408, 
        "postID": 33, 
        "quote": "", 
        "reply": "I understand the pride this young man has BUT (don't ya hate those buts) he also should be well versed in \"Rules and Regs\"... if it is the school rule that you wear the commencement outfit then \"that is the name of the tune\". The kid should follow the policy set down my the school. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:51:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "intTime": 20090408, 
        "postID": 34, 
        "quote": "", 
        "reply": "why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:53:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is. It is so rare that you and I agree ... that I have to seize this moment. To the extent that wearing Marine Blues attracts attention to him, it diminishes attention to the other graduates. This is a class graduation ... not an individual graduation.", 
        "intTime": 20090408, 
        "postID": 35, 
        "quote": "Originally posted by PhoenixDark: I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "reply": " It is so rare that you and I agree ... that I have to seize this moment. To the extent that wearing Marine Blues attracts attention to him, it diminishes attention to the other graduates. This is a class graduation ... not an individual graduation.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:06:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown... BS the dress for the Graduation ceremony is Cap and gown HE is demanding special treatment pure and simple. He can wear his uniform under the Cap and Gown, take the Cap and gown off as soon as the ceremony is over and do the rest in his uniform like I've seen others do.", 
        "intTime": 20090408, 
        "postID": 36, 
        "quote": "Originally posted by ELLIOTT1980: PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "reply": " BS the dress for the Graduation ceremony is Cap and gown HE is demanding special treatment pure and simple. He can wear his uniform under the Cap and Gown, take the Cap and gown off as soon as the ceremony is over and do the rest in his uniform like I've seen others do.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:12:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "intTime": 20090408, 
        "postID": 37, 
        "quote": "Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "reply": " The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:23:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks? LOL It has everything to do with attention! You graduate from in High school with a traditional Cap and Gown. If he wanted to be different,he should have been the valedictorian. I worked at McDonald's in High school...Why couldn't I wear my uniform to graduation! Don't set a precedence, because you will ultimately open the flood gates.", 
        "intTime": 20090408, 
        "postID": 38, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "reply": " LOL It has everything to do with attention! You graduate from in High school with a traditional Cap and Gown. If he wanted to be different,he should have been the valedictorian. I worked at McDonald's in High school...Why couldn't I wear my uniform to graduation! Don't set a precedence, because you will ultimately open the flood gates.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:32:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this???", 
        "intTime": 20090408, 
        "postID": 39, 
        "quote": "Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "reply": " last year and the year before that and the year before that has always been political based so why not this???", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:40:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "intTime": 20090408, 
        "postID": 40, 
        "quote": "Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not.", 
        "reply": " In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:42:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this??? For some people, nothing is political, for others some things are, for you EVERYTHING is. Many of us have the ability to separate politics and enjoy life instead of simply hating half the country for having a different political view and thinking the evil \"lefties\" or \"righties\" are out to get us and drive the country into the ground. Those like you who simply b!tch and moan about one leader or blindly follow another contribute nothing as that is exactly what these two parties want. The truth is generally in the middle, not at the polar ends where many people like to align themselves.", 
        "intTime": 20090408, 
        "postID": 41, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this???", 
        "reply": " For some people, nothing is political, for others some things are, for you EVERYTHING is. Many of us have the ability to separate politics and enjoy life instead of simply hating half the country for having a different political view and thinking the evil \"lefties\" or \"righties\" are out to get us and drive the country into the ground. Those like you who simply b!tch and moan about one leader or blindly follow another contribute nothing as that is exactly what these two parties want. The truth is generally in the middle, not at the polar ends where many people like to align themselves.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:43:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "who hates anyone??? you are the only one talking any hating... now back to the topic...", 
        "intTime": 20090408, 
        "postID": 42, 
        "quote": "", 
        "reply": "who hates anyone??? you are the only one talking any hating... now back to the topic...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "intTime": 20090408, 
        "postID": 43, 
        "quote": "Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "reply": " So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:51:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other? Yes... they're both jobs. When I want a big mac, McDonalds is the most significant of any uniform.", 
        "intTime": 20090408, 
        "postID": 44, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "reply": " Yes... they're both jobs. When I want a big mac, McDonalds is the most significant of any uniform.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:58:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: who hates anyone??? you are the only one talking any hating... now back to the topic... When did I mention hate? I pointed out a fact that you are extremely political and will never pass a chance to bash those who disagree with you. Oops, reread my post and yes I did say hate. It's just a matter of perception, the way you carry yourself sure seems like hate to me for those who disagree with you. As far as the topic I apologize because I've seen how you never stray and are so courteous to others on this board.", 
        "intTime": 20090408, 
        "postID": 45, 
        "quote": "Originally posted by commonsense5: quote: Originally posted by outlaws93: who hates anyone??? you are the only one talking any hating... now back to the topic... When did I mention hate? I pointed out a fact that you are extremely political and will never pass a chance to bash those who disagree with you. Oops, reread my post and yes I did say hate. It's just a matter of perception, the way you carry yourself sure seems like hate to me for those who disagree with you. As far as the topic I apologize because I've seen how you never stray and are so courteous to others on this board.", 
        "reply": "", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:00:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also. He can wear it. Under his gown for the ceremony just like anybody else can wear anything they want and take the gown off after they get their diploma.", 
        "intTime": 20090408, 
        "postID": 46, 
        "quote": "Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also.", 
        "reply": " He can wear it. Under his gown for the ceremony just like anybody else can wear anything they want and take the gown off after they get their diploma.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:07:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also. While we're at it lets add the football team, wrestling team, 4h club, FFA, DECA, and the dam cheerleaders as well.", 
        "intTime": 20090408, 
        "postID": 47, 
        "quote": "Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also.", 
        "reply": " While we're at it lets add the football team, wrestling team, 4h club, FFA, DECA, and the dam cheerleaders as well.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:11:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "Every spring this pops up...", 
        "intTime": 20090408, 
        "postID": 48, 
        "quote": "", 
        "reply": "Every spring this pops up...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:22:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: He should wear the uniform under the gown, and after he gets his di plo may he should take off the cap and gown, don the cover, and walk off the stage. Sneak attack. Swift, Silent, and Deadly. +1", 
        "intTime": 20090408, 
        "postID": 49, 
        "quote": "Originally posted by SSgtRobertMorris: He should wear the uniform under the gown, and after he gets his di plo may he should take off the cap and gown, don the cover, and walk off the stage. Sneak attack. Swift, Silent, and Deadly.", 
        "reply": " +1", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:31:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks? Yeh, nobody wants to see a green bus drivers uniform.", 
        "intTime": 20090408, 
        "postID": 50, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "reply": " Yeh, nobody wants to see a green bus drivers uniform.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:32:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Marine fights to graduate in dress blues EL PASO -- Garrett Miles-McCarthy does not care about donning the traditional navy-blue cap and gown when he graduates from Chapin High School in June. The 18-year-old, who completed his coursework in December and is now a private first class in the Marine Corps, wants to accept his high school diploma in his military uniform. The school principal rejected his request, but the fight has just begun. >http://www.elpasotimes.com/ci_12087109?source=most_viewed&_requestid=7791982 And El Paso is a very strong military town.", 
        "intTime": 20090408, 
        "postID": 51, 
        "quote": "", 
        "reply": "Marine fights to graduate in dress blues EL PASO -- Garrett Miles-McCarthy does not care about donning the traditional navy-blue cap and gown when he graduates from Chapin High School in June. The 18-year-old, who completed his coursework in December and is now a private first class in the Marine Corps, wants to accept his high school diploma in his military uniform. The school principal rejected his request, but the fight has just begun. >http://www.elpasotimes.com/ci_12087109?source=most_viewed&_requestid=7791982 And El Paso is a very strong military town.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:23:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "intTime": 20090408, 
        "postID": 52, 
        "quote": "", 
        "reply": "What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:35:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "what a shame...", 
        "intTime": 20090408, 
        "postID": 53, 
        "quote": "", 
        "reply": "what a shame...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "intTime": 20090408, 
        "postID": 54, 
        "quote": "Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "reply": " It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "billdawg24"
    }, 
    {
        "content": "PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "intTime": 20090408, 
        "postID": 55, 
        "quote": "", 
        "reply": "PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "While I see the school's point, of where does it stop. I get tired of people making everythign black & white, and never using logic. The whole we can't because it will offend someone or they may want to wear whatever, adn now we can't tell them no, argument is spineless. If you make an exception for military uniforms(which they should), you can tell the next person wanting to wear a kimono, no. It's really that easy.", 
        "intTime": 20090408, 
        "postID": 56, 
        "quote": "", 
        "reply": "While I see the school's point, of where does it stop. I get tired of people making everythign black & white, and never using logic. The whole we can't because it will offend someone or they may want to wear whatever, adn now we can't tell them no, argument is spineless. If you make an exception for military uniforms(which they should), you can tell the next person wanting to wear a kimono, no. It's really that easy.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "billdawg24"
    }, 
    {
        "content": "I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "intTime": 20090408, 
        "postID": 57, 
        "quote": "", 
        "reply": "I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:49:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I understand the pride this young man has BUT (don't ya hate those buts) he also should be well versed in \"Rules and Regs\"... if it is the school rule that you wear the commencement outfit then \"that is the name of the tune\". The kid should follow the policy set down my the school. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090408, 
        "postID": 58, 
        "quote": "", 
        "reply": "I understand the pride this young man has BUT (don't ya hate those buts) he also should be well versed in \"Rules and Regs\"... if it is the school rule that you wear the commencement outfit then \"that is the name of the tune\". The kid should follow the policy set down my the school. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:51:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "intTime": 20090408, 
        "postID": 59, 
        "quote": "", 
        "reply": "why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:53:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is. It is so rare that you and I agree ... that I have to seize this moment. To the extent that wearing Marine Blues attracts attention to him, it diminishes attention to the other graduates. This is a class graduation ... not an individual graduation.", 
        "intTime": 20090408, 
        "postID": 60, 
        "quote": "Originally posted by PhoenixDark: I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "reply": " It is so rare that you and I agree ... that I have to seize this moment. To the extent that wearing Marine Blues attracts attention to him, it diminishes attention to the other graduates. This is a class graduation ... not an individual graduation.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:06:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown... BS the dress for the Graduation ceremony is Cap and gown HE is demanding special treatment pure and simple. He can wear his uniform under the Cap and Gown, take the Cap and gown off as soon as the ceremony is over and do the rest in his uniform like I've seen others do.", 
        "intTime": 20090408, 
        "postID": 61, 
        "quote": "Originally posted by ELLIOTT1980: PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "reply": " BS the dress for the Graduation ceremony is Cap and gown HE is demanding special treatment pure and simple. He can wear his uniform under the Cap and Gown, take the Cap and gown off as soon as the ceremony is over and do the rest in his uniform like I've seen others do.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:12:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "intTime": 20090408, 
        "postID": 62, 
        "quote": "Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "reply": " The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:23:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks? LOL It has everything to do with attention! You graduate from in High school with a traditional Cap and Gown. If he wanted to be different,he should have been the valedictorian. I worked at McDonald's in High school...Why couldn't I wear my uniform to graduation! Don't set a precedence, because you will ultimately open the flood gates.", 
        "intTime": 20090408, 
        "postID": 63, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "reply": " LOL It has everything to do with attention! You graduate from in High school with a traditional Cap and Gown. If he wanted to be different,he should have been the valedictorian. I worked at McDonald's in High school...Why couldn't I wear my uniform to graduation! Don't set a precedence, because you will ultimately open the flood gates.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:32:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this???", 
        "intTime": 20090408, 
        "postID": 64, 
        "quote": "Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "reply": " last year and the year before that and the year before that has always been political based so why not this???", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:40:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "intTime": 20090408, 
        "postID": 65, 
        "quote": "Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not.", 
        "reply": " In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:42:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this??? For some people, nothing is political, for others some things are, for you EVERYTHING is. Many of us have the ability to separate politics and enjoy life instead of simply hating half the country for having a different political view and thinking the evil \"lefties\" or \"righties\" are out to get us and drive the country into the ground. Those like you who simply b!tch and moan about one leader or blindly follow another contribute nothing as that is exactly what these two parties want. The truth is generally in the middle, not at the polar ends where many people like to align themselves.", 
        "intTime": 20090408, 
        "postID": 66, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this???", 
        "reply": " For some people, nothing is political, for others some things are, for you EVERYTHING is. Many of us have the ability to separate politics and enjoy life instead of simply hating half the country for having a different political view and thinking the evil \"lefties\" or \"righties\" are out to get us and drive the country into the ground. Those like you who simply b!tch and moan about one leader or blindly follow another contribute nothing as that is exactly what these two parties want. The truth is generally in the middle, not at the polar ends where many people like to align themselves.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:43:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "who hates anyone??? you are the only one talking any hating... now back to the topic...", 
        "intTime": 20090408, 
        "postID": 67, 
        "quote": "", 
        "reply": "who hates anyone??? you are the only one talking any hating... now back to the topic...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "intTime": 20090408, 
        "postID": 68, 
        "quote": "Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "reply": " So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:51:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other? Yes... they're both jobs. When I want a big mac, McDonalds is the most significant of any uniform.", 
        "intTime": 20090408, 
        "postID": 69, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "reply": " Yes... they're both jobs. When I want a big mac, McDonalds is the most significant of any uniform.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:58:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: who hates anyone??? you are the only one talking any hating... now back to the topic... When did I mention hate? I pointed out a fact that you are extremely political and will never pass a chance to bash those who disagree with you. Oops, reread my post and yes I did say hate. It's just a matter of perception, the way you carry yourself sure seems like hate to me for those who disagree with you. As far as the topic I apologize because I've seen how you never stray and are so courteous to others on this board.", 
        "intTime": 20090408, 
        "postID": 70, 
        "quote": "Originally posted by commonsense5: quote: Originally posted by outlaws93: who hates anyone??? you are the only one talking any hating... now back to the topic... When did I mention hate? I pointed out a fact that you are extremely political and will never pass a chance to bash those who disagree with you. Oops, reread my post and yes I did say hate. It's just a matter of perception, the way you carry yourself sure seems like hate to me for those who disagree with you. As far as the topic I apologize because I've seen how you never stray and are so courteous to others on this board.", 
        "reply": "", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:00:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also. He can wear it. Under his gown for the ceremony just like anybody else can wear anything they want and take the gown off after they get their diploma.", 
        "intTime": 20090408, 
        "postID": 71, 
        "quote": "Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also.", 
        "reply": " He can wear it. Under his gown for the ceremony just like anybody else can wear anything they want and take the gown off after they get their diploma.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:07:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also. While we're at it lets add the football team, wrestling team, 4h club, FFA, DECA, and the dam cheerleaders as well.", 
        "intTime": 20090408, 
        "postID": 72, 
        "quote": "Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also.", 
        "reply": " While we're at it lets add the football team, wrestling team, 4h club, FFA, DECA, and the dam cheerleaders as well.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:11:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "Every spring this pops up...", 
        "intTime": 20090408, 
        "postID": 73, 
        "quote": "", 
        "reply": "Every spring this pops up...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:22:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: He should wear the uniform under the gown, and after he gets his di plo may he should take off the cap and gown, don the cover, and walk off the stage. Sneak attack. Swift, Silent, and Deadly. +1", 
        "intTime": 20090408, 
        "postID": 74, 
        "quote": "Originally posted by SSgtRobertMorris: He should wear the uniform under the gown, and after he gets his di plo may he should take off the cap and gown, don the cover, and walk off the stage. Sneak attack. Swift, Silent, and Deadly.", 
        "reply": " +1", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:31:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks? Yeh, nobody wants to see a green bus drivers uniform.", 
        "intTime": 20090408, 
        "postID": 75, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "reply": " Yeh, nobody wants to see a green bus drivers uniform.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:32:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Marine fights to graduate in dress blues EL PASO -- Garrett Miles-McCarthy does not care about donning the traditional navy-blue cap and gown when he graduates from Chapin High School in June. The 18-year-old, who completed his coursework in December and is now a private first class in the Marine Corps, wants to accept his high school diploma in his military uniform. The school principal rejected his request, but the fight has just begun. >http://www.elpasotimes.com/ci_12087109?source=most_viewed&_requestid=7791982 And El Paso is a very strong military town.", 
        "intTime": 20090408, 
        "postID": 76, 
        "quote": "", 
        "reply": "Marine fights to graduate in dress blues EL PASO -- Garrett Miles-McCarthy does not care about donning the traditional navy-blue cap and gown when he graduates from Chapin High School in June. The 18-year-old, who completed his coursework in December and is now a private first class in the Marine Corps, wants to accept his high school diploma in his military uniform. The school principal rejected his request, but the fight has just begun. >http://www.elpasotimes.com/ci_12087109?source=most_viewed&_requestid=7791982 And El Paso is a very strong military town.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:23:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "intTime": 20090408, 
        "postID": 77, 
        "quote": "", 
        "reply": "What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:35:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "what a shame...", 
        "intTime": 20090408, 
        "postID": 78, 
        "quote": "", 
        "reply": "what a shame...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "intTime": 20090408, 
        "postID": 79, 
        "quote": "Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore'", 
        "reply": " It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:41:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "billdawg24"
    }, 
    {
        "content": "PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "intTime": 20090408, 
        "postID": 80, 
        "quote": "", 
        "reply": "PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "While I see the school's point, of where does it stop. I get tired of people making everythign black & white, and never using logic. The whole we can't because it will offend someone or they may want to wear whatever, adn now we can't tell them no, argument is spineless. If you make an exception for military uniforms(which they should), you can tell the next person wanting to wear a kimono, no. It's really that easy.", 
        "intTime": 20090408, 
        "postID": 81, 
        "quote": "", 
        "reply": "While I see the school's point, of where does it stop. I get tired of people making everythign black & white, and never using logic. The whole we can't because it will offend someone or they may want to wear whatever, adn now we can't tell them no, argument is spineless. If you make an exception for military uniforms(which they should), you can tell the next person wanting to wear a kimono, no. It's really that easy.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "billdawg24"
    }, 
    {
        "content": "I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "intTime": 20090408, 
        "postID": 82, 
        "quote": "", 
        "reply": "I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:49:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I understand the pride this young man has BUT (don't ya hate those buts) he also should be well versed in \"Rules and Regs\"... if it is the school rule that you wear the commencement outfit then \"that is the name of the tune\". The kid should follow the policy set down my the school. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090408, 
        "postID": 83, 
        "quote": "", 
        "reply": "I understand the pride this young man has BUT (don't ya hate those buts) he also should be well versed in \"Rules and Regs\"... if it is the school rule that you wear the commencement outfit then \"that is the name of the tune\". The kid should follow the policy set down my the school. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:51:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "intTime": 20090408, 
        "postID": 84, 
        "quote": "", 
        "reply": "why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 11:53:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is. It is so rare that you and I agree ... that I have to seize this moment. To the extent that wearing Marine Blues attracts attention to him, it diminishes attention to the other graduates. This is a class graduation ... not an individual graduation.", 
        "intTime": 20090408, 
        "postID": 85, 
        "quote": "Originally posted by PhoenixDark: I know the kid is proud of being a Marine, and understandably so, but this isn't the right fight for him (or rather his Mommy) to be making. Uniform of the day for HS graduation is the cap and gown. The kid needs to get used to that. Enjoy the moment for what it is.", 
        "reply": " It is so rare that you and I agree ... that I have to seize this moment. To the extent that wearing Marine Blues attracts attention to him, it diminishes attention to the other graduates. This is a class graduation ... not an individual graduation.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:06:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown... BS the dress for the Graduation ceremony is Cap and gown HE is demanding special treatment pure and simple. He can wear his uniform under the Cap and Gown, take the Cap and gown off as soon as the ceremony is over and do the rest in his uniform like I've seen others do.", 
        "intTime": 20090408, 
        "postID": 86, 
        "quote": "Originally posted by ELLIOTT1980: PRESS THE FIGHT, MARINE ! ! ! No sense in Libs with their disdain for the uniforms of our magnificent services to have the final decision. Our USMC uniform this young man wears represents everything great about this nation and supercedes precedence over a graduation gown...", 
        "reply": " BS the dress for the Graduation ceremony is Cap and gown HE is demanding special treatment pure and simple. He can wear his uniform under the Cap and Gown, take the Cap and gown off as soon as the ceremony is over and do the rest in his uniform like I've seen others do.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:12:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "intTime": 20090408, 
        "postID": 87, 
        "quote": "Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people...", 
        "reply": " The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:23:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks? LOL It has everything to do with attention! You graduate from in High school with a traditional Cap and Gown. If he wanted to be different,he should have been the valedictorian. I worked at McDonald's in High school...Why couldn't I wear my uniform to graduation! Don't set a precedence, because you will ultimately open the flood gates.", 
        "intTime": 20090408, 
        "postID": 88, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "reply": " LOL It has everything to do with attention! You graduate from in High school with a traditional Cap and Gown. If he wanted to be different,he should have been the valedictorian. I worked at McDonald's in High school...Why couldn't I wear my uniform to graduation! Don't set a precedence, because you will ultimately open the flood gates.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:32:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this???", 
        "intTime": 20090408, 
        "postID": 89, 
        "quote": "Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject?", 
        "reply": " last year and the year before that and the year before that has always been political based so why not this???", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:40:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "intTime": 20090408, 
        "postID": 90, 
        "quote": "Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not.", 
        "reply": " In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:42:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this??? For some people, nothing is political, for others some things are, for you EVERYTHING is. Many of us have the ability to separate politics and enjoy life instead of simply hating half the country for having a different political view and thinking the evil \"lefties\" or \"righties\" are out to get us and drive the country into the ground. Those like you who simply b!tch and moan about one leader or blindly follow another contribute nothing as that is exactly what these two parties want. The truth is generally in the middle, not at the polar ends where many people like to align themselves.", 
        "intTime": 20090408, 
        "postID": 91, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: why not when i was in high school jrotc cadets wore their uniforms so why not a real Marine wear his?? this is nothing more then anti-war people forcing their ways on to people... The strange thing is that people like you have to feel that EVERYTHING is political. It has nothing to do with being anti-war and everything to do with being required to wear the prescribed \"uniform.\" It's interesting you feel the need to comment in a thread on this topic when you've never earned the right to wear either of those honored uniforms. Of course what don't you feel the need to comment on even though you have no knowledge of the subject? last year and the year before that and the year before that has always been political based so why not this???", 
        "reply": " For some people, nothing is political, for others some things are, for you EVERYTHING is. Many of us have the ability to separate politics and enjoy life instead of simply hating half the country for having a different political view and thinking the evil \"lefties\" or \"righties\" are out to get us and drive the country into the ground. Those like you who simply b!tch and moan about one leader or blindly follow another contribute nothing as that is exactly what these two parties want. The truth is generally in the middle, not at the polar ends where many people like to align themselves.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:43:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "who hates anyone??? you are the only one talking any hating... now back to the topic...", 
        "intTime": 20090408, 
        "postID": 92, 
        "quote": "", 
        "reply": "who hates anyone??? you are the only one talking any hating... now back to the topic...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:45:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "intTime": 20090408, 
        "postID": 93, 
        "quote": "Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy!", 
        "reply": " So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:51:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other? Yes... they're both jobs. When I want a big mac, McDonalds is the most significant of any uniform.", 
        "intTime": 20090408, 
        "postID": 94, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by samh32: quote: Originally posted by klassylady25: Compariing a McD's uniform to a uniform of our Country is hardy equal and though you'd like to make the argument for it be so, it's not. In who's eyes? That's why we must be careful when we try to make statements! If he wants to graduate in his uniform, go to the Naval Academy! So.. let me get this straight. Are you equating serving in our military with working at McDonalds?! You don't think that one uniform is just a little more significant and worthy of respect than the other?", 
        "reply": " Yes... they're both jobs. When I want a big mac, McDonalds is the most significant of any uniform.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 12:58:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "quote: Originally posted by commonsense5: quote: Originally posted by outlaws93: who hates anyone??? you are the only one talking any hating... now back to the topic... When did I mention hate? I pointed out a fact that you are extremely political and will never pass a chance to bash those who disagree with you. Oops, reread my post and yes I did say hate. It's just a matter of perception, the way you carry yourself sure seems like hate to me for those who disagree with you. As far as the topic I apologize because I've seen how you never stray and are so courteous to others on this board.", 
        "intTime": 20090408, 
        "postID": 95, 
        "quote": "Originally posted by commonsense5: quote: Originally posted by outlaws93: who hates anyone??? you are the only one talking any hating... now back to the topic... When did I mention hate? I pointed out a fact that you are extremely political and will never pass a chance to bash those who disagree with you. Oops, reread my post and yes I did say hate. It's just a matter of perception, the way you carry yourself sure seems like hate to me for those who disagree with you. As far as the topic I apologize because I've seen how you never stray and are so courteous to others on this board.", 
        "reply": "", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:00:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also. He can wear it. Under his gown for the ceremony just like anybody else can wear anything they want and take the gown off after they get their diploma.", 
        "intTime": 20090408, 
        "postID": 96, 
        "quote": "Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also.", 
        "reply": " He can wear it. Under his gown for the ceremony just like anybody else can wear anything they want and take the gown off after they get their diploma.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:07:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "commonsense5"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also. While we're at it lets add the football team, wrestling team, 4h club, FFA, DECA, and the dam cheerleaders as well.", 
        "intTime": 20090408, 
        "postID": 97, 
        "quote": "Originally posted by klassylady25: The decision will be up to the school. I vote for the young man to be able to wear the uniform of his country. And that goes for ROTC graduates, also.", 
        "reply": " While we're at it lets add the football team, wrestling team, 4h club, FFA, DECA, and the dam cheerleaders as well.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:11:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "samh32"
    }, 
    {
        "content": "Every spring this pops up...", 
        "intTime": 20090408, 
        "postID": 98, 
        "quote": "", 
        "reply": "Every spring this pops up...", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:22:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by SSgtRobertMorris: He should wear the uniform under the gown, and after he gets his di plo may he should take off the cap and gown, don the cover, and walk off the stage. Sneak attack. Swift, Silent, and Deadly. +1", 
        "intTime": 20090408, 
        "postID": 99, 
        "quote": "Originally posted by SSgtRobertMorris: He should wear the uniform under the gown, and after he gets his di plo may he should take off the cap and gown, don the cover, and walk off the stage. Sneak attack. Swift, Silent, and Deadly.", 
        "reply": " +1", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:31:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks? Yeh, nobody wants to see a green bus drivers uniform.", 
        "intTime": 20090408, 
        "postID": 100, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by samh32: What's next...Somebody wants to graduate in their pajamas! Stop being an attention \"ore' It has nothing to do with garnering attention. This kid just got out of Marine boot camp. He is extremely proud of his service branch. Do you have a problem when hundreds of Army kids in uniform at the local bar, trying to score free drinks?", 
        "reply": " Yeh, nobody wants to see a green bus drivers uniform.", 
        "threadID": "409192893_7020081022001", 
        "time": "2009-04-08 13:32:00", 
        "title": "Marine fights to graduate in dress blues", 
        "userID": "GunnyRet03"
    }
]