[
    {
        "content": "Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "", 
        "reply": "Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-05 19:56:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "In Senate, Republicans Block Spending Measure NY Times By DAVID M. HERSZENHORN Published: March 5, 2009 WASHINGTON — Senate Republicans blocked a $410 billion omnibus spending measure on Thursday night, forcing Congressional Democrats to prepare a stopgap budget resolution to keep the federal government from shutting down. The ability of the diminished minority to delay the bill signaled growing unease in Congress, among Democrats and Republicans, over the levels of government spending in recent months and the staggering increase in the federal deficit. The delay of the bill was an embarrassment for Democrats and a striking, if temporary, victory for critics of so-called earmark spending initiatives, who had criticized the bill as bloated with wasteful expenditures. Although Republicans were glad to needle the Democrats by delaying the bill, there are reasons not to scuttle it. Doing so would result in a $8.4 million budget cut for Senate Republican committees, forcing staff layoffs. Also, Republicans, like Democrats, would lose the home-state projects, or earmarks, totaling more than $7 billion in the bill. In all, the bill would provide about $19 billion more than if a stopgap measure were used through the end of the fiscal year.", 
        "intTime": 20090306, 
        "postID": 2, 
        "quote": "", 
        "reply": "In Senate, Republicans Block Spending Measure NY Times By DAVID M. HERSZENHORN Published: March 5, 2009 WASHINGTON — Senate Republicans blocked a $410 billion omnibus spending measure on Thursday night, forcing Congressional Democrats to prepare a stopgap budget resolution to keep the federal government from shutting down. The ability of the diminished minority to delay the bill signaled growing unease in Congress, among Democrats and Republicans, over the levels of government spending in recent months and the staggering increase in the federal deficit. The delay of the bill was an embarrassment for Democrats and a striking, if temporary, victory for critics of so-called earmark spending initiatives, who had criticized the bill as bloated with wasteful expenditures. Although Republicans were glad to needle the Democrats by delaying the bill, there are reasons not to scuttle it. Doing so would result in a $8.4 million budget cut for Senate Republican committees, forcing staff layoffs. Also, Republicans, like Democrats, would lose the home-state projects, or earmarks, totaling more than $7 billion in the bill. In all, the bill would provide about $19 billion more than if a stopgap measure were used through the end of the fiscal year.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:09:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Seems the line in the sand has been drawn.", 
        "intTime": 20090306, 
        "postID": 3, 
        "quote": "", 
        "reply": "Seems the line in the sand has been drawn.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:15:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Seems the line in the sand has been drawn. Good!", 
        "intTime": 20090306, 
        "postID": 4, 
        "quote": "Originally posted by threerings: Seems the line in the sand has been drawn.", 
        "reply": " Good!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:25:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "intTime": 20090306, 
        "postID": 5, 
        "quote": "", 
        "reply": "More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:35:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "intTime": 20090306, 
        "postID": 6, 
        "quote": "Originally posted by FrJohn1123: More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "reply": "", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:48:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "intTime": 20090306, 
        "postID": 7, 
        "quote": "Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "reply": " COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:54:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: NOVAMarine: Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Do something like collect back taxes from Dems along with the fines and penalties they should have paid. Start with Rangle and the Sec. of the Treasury.", 
        "intTime": 20090306, 
        "postID": 8, 
        "quote": "NOVAMarine: Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "reply": " Do something like collect back taxes from Dems along with the fines and penalties they should have paid. Start with Rangle and the Sec. of the Treasury.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:28:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh.", 
        "intTime": 20090306, 
        "postID": 9, 
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "reply": " Make sure you let the WH know they need to get back to work also huh.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:40:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "intTime": 20090306, 
        "postID": 10, 
        "quote": "GunnyRet03: Make sure you let the WH know they need to get back to work also huh.", 
        "reply": " The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:53:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh. The Senator has a valid point. The President is the one who decided to make Limbaugh the new Democratic chew toy and then to have his surrogates continue the battle. On the one hand it's brilliant exercise in political manipulation and in more stable times would probably have had the desired effect. As we are all well aware these are hardly stable times so the ploy of trying to control political emotions and channel them into a focused end goal is, at best, a fools errand. After two years of bitter campaigning the populace is polarized, confused and increasingly frustrated with political antics that lead nowhere other than more partisanship. If the president is to truly lead he needs to do so, and do so soon.", 
        "intTime": 20090306, 
        "postID": 11, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh.", 
        "reply": " The Senator has a valid point. The President is the one who decided to make Limbaugh the new Democratic chew toy and then to have his surrogates continue the battle. On the one hand it's brilliant exercise in political manipulation and in more stable times would probably have had the desired effect. As we are all well aware these are hardly stable times so the ploy of trying to control political emotions and channel them into a focused end goal is, at best, a fools errand. After two years of bitter campaigning the populace is polarized, confused and increasingly frustrated with political antics that lead nowhere other than more partisanship. If the president is to truly lead he needs to do so, and do so soon.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:57:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "", 
        "reply": "Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:00:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon.", 
        "reply": " Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:06:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues. How many limbo threadfs do you need? One, two, three, one hundred? Fact is the so called line in the sand over $5.5 billion out of the $404 billion. Good going guys! That is 1%, DoD is unable to account for that amount of money on a monthly basis. More obstruction from the right.", 
        "intTime": 20090306, 
        "postID": 14, 
        "quote": "Originally posted by bill_kananen: quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "reply": " How many limbo threadfs do you need? One, two, three, one hundred? Fact is the so called line in the sand over $5.5 billion out of the $404 billion. Good going guys! That is 1%, DoD is unable to account for that amount of money on a monthly basis. More obstruction from the right.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:07:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: How many limbo threadfs do you need? Classic liberal froth!", 
        "intTime": 20090306, 
        "postID": 15, 
        "quote": "How many limbo threadfs do you need?", 
        "reply": " Classic liberal froth!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:09:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "soscorpio"
    }, 
    {
        "content": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "intTime": 20090306, 
        "postID": 16, 
        "quote": "", 
        "reply": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:10:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else?", 
        "intTime": 20090306, 
        "postID": 17, 
        "quote": "Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "reply": " So you start a thread about it, but than want to discuss something else?", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:12:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "intTime": 20090306, 
        "postID": 18, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:12:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "intTime": 20090306, 
        "postID": 19, 
        "quote": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:14:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: soscorpio: I have a hard time understanding how washington politicians even have defenders within the masses. What's so hard to understand? Even OBL has defenders within the masses.", 
        "intTime": 20090306, 
        "postID": 20, 
        "quote": "soscorpio: I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "reply": " What's so hard to understand? Even OBL has defenders within the masses.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:16:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "intTime": 20090306, 
        "postID": 21, 
        "quote": "Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "reply": " Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:17:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. SHHHHHH, mustn't point that out to the worshippers of \"THE ONE\" !", 
        "intTime": 20090306, 
        "postID": 22, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " SHHHHHH, mustn't point that out to the worshippers of \"THE ONE\" !", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:30:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater. He may well be in the closet, but not for political reasons.", 
        "intTime": 20090306, 
        "postID": 23, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "reply": " He may well be in the closet, but not for political reasons.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:56:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk. Are you on Hooked-on-Phonics or something? “Incoherent” is in nearly every post of yours, and BTW “gibberish” & “bunk” have the same meaning! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure gibberish bunk.", 
        "intTime": 20090306, 
        "postID": 24, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "reply": " Are you on Hooked-on-Phonics or something? “Incoherent” is in nearly every post of yours, and BTW “gibberish” & “bunk” have the same meaning! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure gibberish bunk.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:57:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Obviously you and McCain can't listen well. The promise made at Oxford was: quote: But let's go back to the original point. John, nobody is denying that $18 billion is important. And, absolutely, we need earmark reform. And when I'm president, I will go line by line to make sure that we are not spending money unwisely. But the fact is that eliminating earmarks alone is not a recipe for how we're going to get the middle class back on track.", 
        "intTime": 20090306, 
        "postID": 25, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " Obviously you and McCain can't listen well. The promise made at Oxford was: quote: But let's go back to the original point. John, nobody is denying that $18 billion is important. And, absolutely, we need earmark reform. And when I'm president, I will go line by line to make sure that we are not spending money unwisely. But the fact is that eliminating earmarks alone is not a recipe for how we're going to get the middle class back on track.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:03:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "intTime": 20090306, 
        "postID": 26, 
        "quote": "Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else?", 
        "reply": " If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:11:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems. It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "intTime": 20090306, 
        "postID": 27, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "reply": " It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:45:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin! When the Administration wastes time on a talk show host & it gives the \"appearance\" of concentrating on Rush, then it IS a distraction. All too often folks have the attention span of a goldfish. As far as Steele & Limbaugh go that is nothing in relation to what is happening to our economy, folks loosing jobs, Mortgage meltdown, the continuing slide of the DOW etc. Again a distraction to what is really important.", 
        "intTime": 20090306, 
        "postID": 28, 
        "quote": "Originally posted by Knele: It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "reply": " When the Administration wastes time on a talk show host & it gives the \"appearance\" of concentrating on Rush, then it IS a distraction. All too often folks have the attention span of a goldfish. As far as Steele & Limbaugh go that is nothing in relation to what is happening to our economy, folks loosing jobs, Mortgage meltdown, the continuing slide of the DOW etc. Again a distraction to what is really important.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:59:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Again a distraction to what is really important. It is a distraction because the republican party is making it that. The administration never said anything derogatory about limbat. This is the extent of WH involvement in the case: quote: White House chief of staff Rahm Emanuel, a former member of the U.S. Congress, told CBS' \"Face the Nation\" on Sunday that Limbaugh \"is the voice and the intellectual force and energy behind the Republican Party.\" White House spokesman Robert Gibbs followed up on Monday, telling reporters they should ask Republicans \"whether they agree with what Rush Limbaugh said....Do they want to see the president's economic agenda fail?\" Molehill becomes mountain.", 
        "intTime": 20090306, 
        "postID": 29, 
        "quote": "Again a distraction to what is really important.", 
        "reply": " It is a distraction because the republican party is making it that. The administration never said anything derogatory about limbat. This is the extent of WH involvement in the case: quote: White House chief of staff Rahm Emanuel, a former member of the U.S. Congress, told CBS' \"Face the Nation\" on Sunday that Limbaugh \"is the voice and the intellectual force and energy behind the Republican Party.\" White House spokesman Robert Gibbs followed up on Monday, telling reporters they should ask Republicans \"whether they agree with what Rush Limbaugh said....Do they want to see the president's economic agenda fail?\" Molehill becomes mountain.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 10:21:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "intTime": 20090305, 
        "postID": 30, 
        "quote": "", 
        "reply": "Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-05 19:56:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "In Senate, Republicans Block Spending Measure NY Times By DAVID M. HERSZENHORN Published: March 5, 2009 WASHINGTON — Senate Republicans blocked a $410 billion omnibus spending measure on Thursday night, forcing Congressional Democrats to prepare a stopgap budget resolution to keep the federal government from shutting down. The ability of the diminished minority to delay the bill signaled growing unease in Congress, among Democrats and Republicans, over the levels of government spending in recent months and the staggering increase in the federal deficit. The delay of the bill was an embarrassment for Democrats and a striking, if temporary, victory for critics of so-called earmark spending initiatives, who had criticized the bill as bloated with wasteful expenditures. Although Republicans were glad to needle the Democrats by delaying the bill, there are reasons not to scuttle it. Doing so would result in a $8.4 million budget cut for Senate Republican committees, forcing staff layoffs. Also, Republicans, like Democrats, would lose the home-state projects, or earmarks, totaling more than $7 billion in the bill. In all, the bill would provide about $19 billion more than if a stopgap measure were used through the end of the fiscal year.", 
        "intTime": 20090306, 
        "postID": 31, 
        "quote": "", 
        "reply": "In Senate, Republicans Block Spending Measure NY Times By DAVID M. HERSZENHORN Published: March 5, 2009 WASHINGTON — Senate Republicans blocked a $410 billion omnibus spending measure on Thursday night, forcing Congressional Democrats to prepare a stopgap budget resolution to keep the federal government from shutting down. The ability of the diminished minority to delay the bill signaled growing unease in Congress, among Democrats and Republicans, over the levels of government spending in recent months and the staggering increase in the federal deficit. The delay of the bill was an embarrassment for Democrats and a striking, if temporary, victory for critics of so-called earmark spending initiatives, who had criticized the bill as bloated with wasteful expenditures. Although Republicans were glad to needle the Democrats by delaying the bill, there are reasons not to scuttle it. Doing so would result in a $8.4 million budget cut for Senate Republican committees, forcing staff layoffs. Also, Republicans, like Democrats, would lose the home-state projects, or earmarks, totaling more than $7 billion in the bill. In all, the bill would provide about $19 billion more than if a stopgap measure were used through the end of the fiscal year.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:09:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Seems the line in the sand has been drawn.", 
        "intTime": 20090306, 
        "postID": 32, 
        "quote": "", 
        "reply": "Seems the line in the sand has been drawn.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:15:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Seems the line in the sand has been drawn. Good!", 
        "intTime": 20090306, 
        "postID": 33, 
        "quote": "Originally posted by threerings: Seems the line in the sand has been drawn.", 
        "reply": " Good!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:25:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "intTime": 20090306, 
        "postID": 34, 
        "quote": "", 
        "reply": "More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:35:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "intTime": 20090306, 
        "postID": 35, 
        "quote": "Originally posted by FrJohn1123: More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "reply": "", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:48:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "intTime": 20090306, 
        "postID": 36, 
        "quote": "Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "reply": " COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:54:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: NOVAMarine: Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Do something like collect back taxes from Dems along with the fines and penalties they should have paid. Start with Rangle and the Sec. of the Treasury.", 
        "intTime": 20090306, 
        "postID": 37, 
        "quote": "NOVAMarine: Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "reply": " Do something like collect back taxes from Dems along with the fines and penalties they should have paid. Start with Rangle and the Sec. of the Treasury.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:28:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh.", 
        "intTime": 20090306, 
        "postID": 38, 
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "reply": " Make sure you let the WH know they need to get back to work also huh.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:40:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "intTime": 20090306, 
        "postID": 39, 
        "quote": "GunnyRet03: Make sure you let the WH know they need to get back to work also huh.", 
        "reply": " The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:53:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh. The Senator has a valid point. The President is the one who decided to make Limbaugh the new Democratic chew toy and then to have his surrogates continue the battle. On the one hand it's brilliant exercise in political manipulation and in more stable times would probably have had the desired effect. As we are all well aware these are hardly stable times so the ploy of trying to control political emotions and channel them into a focused end goal is, at best, a fools errand. After two years of bitter campaigning the populace is polarized, confused and increasingly frustrated with political antics that lead nowhere other than more partisanship. If the president is to truly lead he needs to do so, and do so soon.", 
        "intTime": 20090306, 
        "postID": 40, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh.", 
        "reply": " The Senator has a valid point. The President is the one who decided to make Limbaugh the new Democratic chew toy and then to have his surrogates continue the battle. On the one hand it's brilliant exercise in political manipulation and in more stable times would probably have had the desired effect. As we are all well aware these are hardly stable times so the ploy of trying to control political emotions and channel them into a focused end goal is, at best, a fools errand. After two years of bitter campaigning the populace is polarized, confused and increasingly frustrated with political antics that lead nowhere other than more partisanship. If the president is to truly lead he needs to do so, and do so soon.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:57:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "intTime": 20090306, 
        "postID": 41, 
        "quote": "", 
        "reply": "Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:00:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "intTime": 20090306, 
        "postID": 42, 
        "quote": "Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon.", 
        "reply": " Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:06:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues. How many limbo threadfs do you need? One, two, three, one hundred? Fact is the so called line in the sand over $5.5 billion out of the $404 billion. Good going guys! That is 1%, DoD is unable to account for that amount of money on a monthly basis. More obstruction from the right.", 
        "intTime": 20090306, 
        "postID": 43, 
        "quote": "Originally posted by bill_kananen: quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "reply": " How many limbo threadfs do you need? One, two, three, one hundred? Fact is the so called line in the sand over $5.5 billion out of the $404 billion. Good going guys! That is 1%, DoD is unable to account for that amount of money on a monthly basis. More obstruction from the right.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:07:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: How many limbo threadfs do you need? Classic liberal froth!", 
        "intTime": 20090306, 
        "postID": 44, 
        "quote": "How many limbo threadfs do you need?", 
        "reply": " Classic liberal froth!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:09:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "soscorpio"
    }, 
    {
        "content": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "intTime": 20090306, 
        "postID": 45, 
        "quote": "", 
        "reply": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:10:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else?", 
        "intTime": 20090306, 
        "postID": 46, 
        "quote": "Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "reply": " So you start a thread about it, but than want to discuss something else?", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:12:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "intTime": 20090306, 
        "postID": 47, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:12:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "intTime": 20090306, 
        "postID": 48, 
        "quote": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:14:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: soscorpio: I have a hard time understanding how washington politicians even have defenders within the masses. What's so hard to understand? Even OBL has defenders within the masses.", 
        "intTime": 20090306, 
        "postID": 49, 
        "quote": "soscorpio: I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "reply": " What's so hard to understand? Even OBL has defenders within the masses.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:16:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "intTime": 20090306, 
        "postID": 50, 
        "quote": "Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "reply": " Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:17:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. SHHHHHH, mustn't point that out to the worshippers of \"THE ONE\" !", 
        "intTime": 20090306, 
        "postID": 51, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " SHHHHHH, mustn't point that out to the worshippers of \"THE ONE\" !", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:30:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater. He may well be in the closet, but not for political reasons.", 
        "intTime": 20090306, 
        "postID": 52, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "reply": " He may well be in the closet, but not for political reasons.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:56:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk. Are you on Hooked-on-Phonics or something? “Incoherent” is in nearly every post of yours, and BTW “gibberish” & “bunk” have the same meaning! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure gibberish bunk.", 
        "intTime": 20090306, 
        "postID": 53, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "reply": " Are you on Hooked-on-Phonics or something? “Incoherent” is in nearly every post of yours, and BTW “gibberish” & “bunk” have the same meaning! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure gibberish bunk.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:57:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Obviously you and McCain can't listen well. The promise made at Oxford was: quote: But let's go back to the original point. John, nobody is denying that $18 billion is important. And, absolutely, we need earmark reform. And when I'm president, I will go line by line to make sure that we are not spending money unwisely. But the fact is that eliminating earmarks alone is not a recipe for how we're going to get the middle class back on track.", 
        "intTime": 20090306, 
        "postID": 54, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " Obviously you and McCain can't listen well. The promise made at Oxford was: quote: But let's go back to the original point. John, nobody is denying that $18 billion is important. And, absolutely, we need earmark reform. And when I'm president, I will go line by line to make sure that we are not spending money unwisely. But the fact is that eliminating earmarks alone is not a recipe for how we're going to get the middle class back on track.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:03:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "intTime": 20090306, 
        "postID": 55, 
        "quote": "Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else?", 
        "reply": " If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:11:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems. It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "intTime": 20090306, 
        "postID": 56, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "reply": " It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:45:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin! When the Administration wastes time on a talk show host & it gives the \"appearance\" of concentrating on Rush, then it IS a distraction. All too often folks have the attention span of a goldfish. As far as Steele & Limbaugh go that is nothing in relation to what is happening to our economy, folks loosing jobs, Mortgage meltdown, the continuing slide of the DOW etc. Again a distraction to what is really important.", 
        "intTime": 20090306, 
        "postID": 57, 
        "quote": "Originally posted by Knele: It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "reply": " When the Administration wastes time on a talk show host & it gives the \"appearance\" of concentrating on Rush, then it IS a distraction. All too often folks have the attention span of a goldfish. As far as Steele & Limbaugh go that is nothing in relation to what is happening to our economy, folks loosing jobs, Mortgage meltdown, the continuing slide of the DOW etc. Again a distraction to what is really important.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:59:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Again a distraction to what is really important. It is a distraction because the republican party is making it that. The administration never said anything derogatory about limbat. This is the extent of WH involvement in the case: quote: White House chief of staff Rahm Emanuel, a former member of the U.S. Congress, told CBS' \"Face the Nation\" on Sunday that Limbaugh \"is the voice and the intellectual force and energy behind the Republican Party.\" White House spokesman Robert Gibbs followed up on Monday, telling reporters they should ask Republicans \"whether they agree with what Rush Limbaugh said....Do they want to see the president's economic agenda fail?\" Molehill becomes mountain.", 
        "intTime": 20090306, 
        "postID": 58, 
        "quote": "Again a distraction to what is really important.", 
        "reply": " It is a distraction because the republican party is making it that. The administration never said anything derogatory about limbat. This is the extent of WH involvement in the case: quote: White House chief of staff Rahm Emanuel, a former member of the U.S. Congress, told CBS' \"Face the Nation\" on Sunday that Limbaugh \"is the voice and the intellectual force and energy behind the Republican Party.\" White House spokesman Robert Gibbs followed up on Monday, telling reporters they should ask Republicans \"whether they agree with what Rush Limbaugh said....Do they want to see the president's economic agenda fail?\" Molehill becomes mountain.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 10:21:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "intTime": 20090305, 
        "postID": 59, 
        "quote": "", 
        "reply": "Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-05 19:56:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "In Senate, Republicans Block Spending Measure NY Times By DAVID M. HERSZENHORN Published: March 5, 2009 WASHINGTON — Senate Republicans blocked a $410 billion omnibus spending measure on Thursday night, forcing Congressional Democrats to prepare a stopgap budget resolution to keep the federal government from shutting down. The ability of the diminished minority to delay the bill signaled growing unease in Congress, among Democrats and Republicans, over the levels of government spending in recent months and the staggering increase in the federal deficit. The delay of the bill was an embarrassment for Democrats and a striking, if temporary, victory for critics of so-called earmark spending initiatives, who had criticized the bill as bloated with wasteful expenditures. Although Republicans were glad to needle the Democrats by delaying the bill, there are reasons not to scuttle it. Doing so would result in a $8.4 million budget cut for Senate Republican committees, forcing staff layoffs. Also, Republicans, like Democrats, would lose the home-state projects, or earmarks, totaling more than $7 billion in the bill. In all, the bill would provide about $19 billion more than if a stopgap measure were used through the end of the fiscal year.", 
        "intTime": 20090306, 
        "postID": 60, 
        "quote": "", 
        "reply": "In Senate, Republicans Block Spending Measure NY Times By DAVID M. HERSZENHORN Published: March 5, 2009 WASHINGTON — Senate Republicans blocked a $410 billion omnibus spending measure on Thursday night, forcing Congressional Democrats to prepare a stopgap budget resolution to keep the federal government from shutting down. The ability of the diminished minority to delay the bill signaled growing unease in Congress, among Democrats and Republicans, over the levels of government spending in recent months and the staggering increase in the federal deficit. The delay of the bill was an embarrassment for Democrats and a striking, if temporary, victory for critics of so-called earmark spending initiatives, who had criticized the bill as bloated with wasteful expenditures. Although Republicans were glad to needle the Democrats by delaying the bill, there are reasons not to scuttle it. Doing so would result in a $8.4 million budget cut for Senate Republican committees, forcing staff layoffs. Also, Republicans, like Democrats, would lose the home-state projects, or earmarks, totaling more than $7 billion in the bill. In all, the bill would provide about $19 billion more than if a stopgap measure were used through the end of the fiscal year.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:09:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Seems the line in the sand has been drawn.", 
        "intTime": 20090306, 
        "postID": 61, 
        "quote": "", 
        "reply": "Seems the line in the sand has been drawn.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:15:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by threerings: Seems the line in the sand has been drawn. Good!", 
        "intTime": 20090306, 
        "postID": 62, 
        "quote": "Originally posted by threerings: Seems the line in the sand has been drawn.", 
        "reply": " Good!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:25:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "intTime": 20090306, 
        "postID": 63, 
        "quote": "", 
        "reply": "More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:35:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by FrJohn1123: More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "intTime": 20090306, 
        "postID": 64, 
        "quote": "Originally posted by FrJohn1123: More whining about limbo? As the administration has pointed out, it is clear limbo is \"the\" leader of the republican party.", 
        "reply": "", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:48:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "intTime": 20090306, 
        "postID": 65, 
        "quote": "Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top.", 
        "reply": " COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 06:54:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: NOVAMarine: Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Do something like collect back taxes from Dems along with the fines and penalties they should have paid. Start with Rangle and the Sec. of the Treasury.", 
        "intTime": 20090306, 
        "postID": 66, 
        "quote": "NOVAMarine: Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "reply": " Do something like collect back taxes from Dems along with the fines and penalties they should have paid. Start with Rangle and the Sec. of the Treasury.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:28:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh.", 
        "intTime": 20090306, 
        "postID": 67, 
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans.", 
        "reply": " Make sure you let the WH know they need to get back to work also huh.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:40:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "intTime": 20090306, 
        "postID": 68, 
        "quote": "GunnyRet03: Make sure you let the WH know they need to get back to work also huh.", 
        "reply": " The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:53:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh. The Senator has a valid point. The President is the one who decided to make Limbaugh the new Democratic chew toy and then to have his surrogates continue the battle. On the one hand it's brilliant exercise in political manipulation and in more stable times would probably have had the desired effect. As we are all well aware these are hardly stable times so the ploy of trying to control political emotions and channel them into a focused end goal is, at best, a fools errand. After two years of bitter campaigning the populace is polarized, confused and increasingly frustrated with political antics that lead nowhere other than more partisanship. If the president is to truly lead he needs to do so, and do so soon.", 
        "intTime": 20090306, 
        "postID": 69, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by NOVAMarine: quote: Originally posted by bill_kananen: Dear Republican Supporter, During his campaign last year, President Obama promised to bring a new tone to Washington. He decried partisan politics and in a speech last September said, \"We have real problems in this country right now and the American people are looking to us for answers, not distractions, no diversions, not manipulations.\" Yet, just weeks into his Administration the President's staff has been caught engaging in a coordinated and cynical political attack game - the very diversion and manipulation then-candidate Obama attacked the McCain campaign for last year. The apparent goal of this strategy was to distract public attention from the Democrats' massive spending proposals by depicting Rush Limbaugh as the new face of the Republican Party. Democrats needed the distraction -- over the course of only seven weeks of the current Congressional session, Senate Democrats have passed more spending than the previous Administration spent on Iraq, Afghanistan, and Katrina recovery combined. According to Politico newspaper yesterday, this coordinated strategy began with \"conversations and email exchanges\" taking place \"in and out of the White House\" between former Clinton political operative James Carville, the political team at the Democrat National Committee, and White House staff. The article goes on to note that \"a senior White House aide has been tasked with helping to guide the Limbaugh strategy.\" This is an outrage. It appears the Obama Administration has forgotten that the salaries of White House staff are paid for by you the taxpayer. To say nothing of the fact that this story reeks of hypocrisy coming from a President who campaigned against these very cynical political tactics last fall. President Obama owes the American people an explanation. His staff should apologize to the American people for supporting these tactics and diverting attention to the hard work that needs to be done to get America's economy back on track. Please join me in signing this petition and calling on the Obama White House to come clean on this matter. Join me in asking them to work with Republicans on the critical issues facing our country today. The American people deserve better than diversions and manipulations. Sincerely, Senator John Cornyn Chairman National Republican Senatorial Committee Have you noticed the same distraction here in the discussions. Notice the topics that continue to pop back to the top. COMMENT: This is simultaneously so laughable and so sad ... and so Washington. Mr. Cornyn's efforts are best focused on helping America get out of this economic mess that he, his fellow senators and Congressmen, and the weak, ineffective regulation and oversight allowed to victimize the American public which gets to pay twice for it -- suffering unjustly for it, and now paying for it. Get back to work, Mr. Cornyn ... this time on something meaningful to help Americans. Make sure you let the WH know they need to get back to work also huh.", 
        "reply": " The Senator has a valid point. The President is the one who decided to make Limbaugh the new Democratic chew toy and then to have his surrogates continue the battle. On the one hand it's brilliant exercise in political manipulation and in more stable times would probably have had the desired effect. As we are all well aware these are hardly stable times so the ploy of trying to control political emotions and channel them into a focused end goal is, at best, a fools errand. After two years of bitter campaigning the populace is polarized, confused and increasingly frustrated with political antics that lead nowhere other than more partisanship. If the president is to truly lead he needs to do so, and do so soon.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 07:57:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "intTime": 20090306, 
        "postID": 70, 
        "quote": "", 
        "reply": "Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:00:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "intTime": 20090306, 
        "postID": 71, 
        "quote": "Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon.", 
        "reply": " Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:06:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues. How many limbo threadfs do you need? One, two, three, one hundred? Fact is the so called line in the sand over $5.5 billion out of the $404 billion. Good going guys! That is 1%, DoD is unable to account for that amount of money on a monthly basis. More obstruction from the right.", 
        "intTime": 20090306, 
        "postID": 72, 
        "quote": "Originally posted by bill_kananen: quote: GunnyRet03: Make sure you let the WH know they need to get back to work also huh. The Whitehouse is working.... Working on a dirty tricks campaign to direct attention away from the porkubus spending bill that even some Dems couldn't vote for. Notice how FrJohn1123 is trying to distract people from discussing real issues.", 
        "reply": " How many limbo threadfs do you need? One, two, three, one hundred? Fact is the so called line in the sand over $5.5 billion out of the $404 billion. Good going guys! That is 1%, DoD is unable to account for that amount of money on a monthly basis. More obstruction from the right.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:07:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: How many limbo threadfs do you need? Classic liberal froth!", 
        "intTime": 20090306, 
        "postID": 73, 
        "quote": "How many limbo threadfs do you need?", 
        "reply": " Classic liberal froth!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:09:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "soscorpio"
    }, 
    {
        "content": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "intTime": 20090306, 
        "postID": 74, 
        "quote": "", 
        "reply": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:10:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else?", 
        "intTime": 20090306, 
        "postID": 75, 
        "quote": "Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated?", 
        "reply": " So you start a thread about it, but than want to discuss something else?", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:12:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "intTime": 20090306, 
        "postID": 76, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:12:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "intTime": 20090306, 
        "postID": 77, 
        "quote": "At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:14:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: soscorpio: I have a hard time understanding how washington politicians even have defenders within the masses. What's so hard to understand? Even OBL has defenders within the masses.", 
        "intTime": 20090306, 
        "postID": 78, 
        "quote": "soscorpio: I have a hard time understanding how washington politicians even have defenders within the masses.", 
        "reply": " What's so hard to understand? Even OBL has defenders within the masses.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:16:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "intTime": 20090306, 
        "postID": 79, 
        "quote": "Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see!", 
        "reply": " Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:17:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. SHHHHHH, mustn't point that out to the worshippers of \"THE ONE\" !", 
        "intTime": 20090306, 
        "postID": 80, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " SHHHHHH, mustn't point that out to the worshippers of \"THE ONE\" !", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:30:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater. He may well be in the closet, but not for political reasons.", 
        "intTime": 20090306, 
        "postID": 81, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Even leg tingler was asking that same question. He must be a closet conservative. Or hater.", 
        "reply": " He may well be in the closet, but not for political reasons.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:56:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk. Are you on Hooked-on-Phonics or something? “Incoherent” is in nearly every post of yours, and BTW “gibberish” & “bunk” have the same meaning! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure gibberish bunk.", 
        "intTime": 20090306, 
        "postID": 82, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Still looking for somebody else to blame your problems on I see! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure bunk.", 
        "reply": " Are you on Hooked-on-Phonics or something? “Incoherent” is in nearly every post of yours, and BTW “gibberish” & “bunk” have the same meaning! Wow, that is truly classic incoherent gibberish expressing a detestable load of pure gibberish bunk.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 08:57:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama. Obviously you and McCain can't listen well. The promise made at Oxford was: quote: But let's go back to the original point. John, nobody is denying that $18 billion is important. And, absolutely, we need earmark reform. And when I'm president, I will go line by line to make sure that we are not spending money unwisely. But the fact is that eliminating earmarks alone is not a recipe for how we're going to get the middle class back on track.", 
        "intTime": 20090306, 
        "postID": 83, 
        "quote": "Originally posted by bill_kananen: At what point does one stop and say WTF are you doing? Remember President Obama promised to end earmarks. Not Rush, Not the Republicans... President Obama.", 
        "reply": " Obviously you and McCain can't listen well. The promise made at Oxford was: quote: But let's go back to the original point. John, nobody is denying that $18 billion is important. And, absolutely, we need earmark reform. And when I'm president, I will go line by line to make sure that we are not spending money unwisely. But the fact is that eliminating earmarks alone is not a recipe for how we're going to get the middle class back on track.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:03:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "intTime": 20090306, 
        "postID": 84, 
        "quote": "Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else?", 
        "reply": " If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:11:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems. It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "intTime": 20090306, 
        "postID": 85, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by Knele: quote: Originally posted by bill_kananen: quote: Knele: Right.....its Democrats & Administrations fault your defacto new “leader” it that pill popping, bubbling buffoon. Another disciple of diversion heard from. Why don’t you discus the porkubus spending bill just defeated? So you start a thread about it, but than want to discuss something else? If you reread Sen. Cornyn's letter that is the whole point talk about Rush & you distract so you don't have to talk about the real problems.", 
        "reply": " It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:45:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin! When the Administration wastes time on a talk show host & it gives the \"appearance\" of concentrating on Rush, then it IS a distraction. All too often folks have the attention span of a goldfish. As far as Steele & Limbaugh go that is nothing in relation to what is happening to our economy, folks loosing jobs, Mortgage meltdown, the continuing slide of the DOW etc. Again a distraction to what is really important.", 
        "intTime": 20090306, 
        "postID": 86, 
        "quote": "Originally posted by Knele: It was not Dem (as Sen seems to subtly imply) created nor is it a distraction! The fact that GOP chief begged for forgiveness at some radical disk-jockeys feet is much more newsworthy than Obama not wearing a flag pin!", 
        "reply": " When the Administration wastes time on a talk show host & it gives the \"appearance\" of concentrating on Rush, then it IS a distraction. All too often folks have the attention span of a goldfish. As far as Steele & Limbaugh go that is nothing in relation to what is happening to our economy, folks loosing jobs, Mortgage meltdown, the continuing slide of the DOW etc. Again a distraction to what is really important.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 09:59:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Again a distraction to what is really important. It is a distraction because the republican party is making it that. The administration never said anything derogatory about limbat. This is the extent of WH involvement in the case: quote: White House chief of staff Rahm Emanuel, a former member of the U.S. Congress, told CBS' \"Face the Nation\" on Sunday that Limbaugh \"is the voice and the intellectual force and energy behind the Republican Party.\" White House spokesman Robert Gibbs followed up on Monday, telling reporters they should ask Republicans \"whether they agree with what Rush Limbaugh said....Do they want to see the president's economic agenda fail?\" Molehill becomes mountain.", 
        "intTime": 20090306, 
        "postID": 87, 
        "quote": "Again a distraction to what is really important.", 
        "reply": " It is a distraction because the republican party is making it that. The administration never said anything derogatory about limbat. This is the extent of WH involvement in the case: quote: White House chief of staff Rahm Emanuel, a former member of the U.S. Congress, told CBS' \"Face the Nation\" on Sunday that Limbaugh \"is the voice and the intellectual force and energy behind the Republican Party.\" White House spokesman Robert Gibbs followed up on Monday, telling reporters they should ask Republicans \"whether they agree with what Rush Limbaugh said....Do they want to see the president's economic agenda fail?\" Molehill becomes mountain.", 
        "threadID": "409192893_2460050712001", 
        "time": "2009-03-06 10:21:00", 
        "title": "President Obama owes Americans an explanation‏", 
        "userID": "FrJohn1123"
    }
]