[
    {
        "content": "\"http://arkansasnews.com/2009/05/14/hendren-admits-regrets-referring-to-schumer-as-%E2%80%98jew%E2%80%99/\" quote: A self-professed gaffe-prone Republican state senator who is challenging Democratic U.S. Sen. Blanche Lincoln’s re-election bid said Thursday he regrets referring to Sen. Chuck Schumer, D-N.Y., as “that Jew” at a Pulaski County GOP meeting last week. “I don’t speak with a TelePrompTer, and if I had, that reference would have never made it in there,” Sen. Kim Hendren, R-Gravette, said in an interview with the Arkansas News Bureau. “I know I referred to him as Jew or Jewish, and I should not have done that. I got my foot in my mouth.” The statement was first reported by Jason Tolbert on his conservative political blog, The Tolbert Report, after Hendren admitted to Tolbert he made the remark during his appearance at the GOP gathering. Hendren said Thursday he made the remark in referring to comments Schumer made on the Rachel Maddow show on MSNBC, in which the New York senator said that “American traditional values” were behind them, a point Hendren said he strongly disputes. “I was simply making a point about those two points. I believe in those traditional values like Andy Griffith, Aunt Bea, Barney and Opie. But now all that was lost with this statement,” Hendren said. “I don’t have any issue with Jews or Jewish people or whatever the politically correct term they wish to be identified as,” he said. Wasn't it the Right-wing who, all too recently, claiming that the President wasn't a good public speaker - because he used a teleprompter? Seems the Right shouldn't attack the President for teleprompter use - they should use them more often themselves. Some would find it easier to hide their anti-semitism if they didn't try to speak without notes...", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "A self-professed gaffe-prone Republican state senator who is challenging Democratic U.S. Sen. Blanche Lincoln’s re-election bid said Thursday he regrets referring to Sen. Chuck Schumer, D-N.Y., as “that Jew” at a Pulaski County GOP meeting last week. “I don’t speak with a TelePrompTer, and if I had, that reference would have never made it in there,” Sen. Kim Hendren, R-Gravette, said in an interview with the Arkansas News Bureau. “I know I referred to him as Jew or Jewish, and I should not have done that. I got my foot in my mouth.” The statement was first reported by Jason Tolbert on his conservative political blog, The Tolbert Report, after Hendren admitted to Tolbert he made the remark during his appearance at the GOP gathering. Hendren said Thursday he made the remark in referring to comments Schumer made on the Rachel Maddow show on MSNBC, in which the New York senator said that “American traditional values” were behind them, a point Hendren said he strongly disputes. “I was simply making a point about those two points. I believe in those traditional values like Andy Griffith, Aunt Bea, Barney and Opie. But now all that was lost with this statement,” Hendren said. “I don’t have any issue with Jews or Jewish people or whatever the politically correct term they wish to be identified as,” he said.", 
        "reply": "\"http://arkansasnews.com/2009/05/14/hendren-admits-regrets-referring-to-schumer-as-%E2%80%98jew%E2%80%99/\"  Wasn't it the Right-wing who, all too recently, claiming that the President wasn't a good public speaker - because he used a teleprompter? Seems the Right shouldn't attack the President for teleprompter use - they should use them more often themselves. Some would find it easier to hide their anti-semitism if they didn't try to speak without notes...", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 04:44:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "That's a lousy excuse by a bigot. Not you, FD. Republican, Democrat, or whatever party, if politicians can't speak coherently in public without using a machine to help them, they should sign up for Toastmasters.", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "That's a lousy excuse by a bigot. Not you, FD. Republican, Democrat, or whatever party, if politicians can't speak coherently in public without using a machine to help them, they should sign up for Toastmasters.", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 06:51:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Sen. Kim Hendren, R-GravetteNow there's a name of the GOP that's known across the country! Seems the Right shouldn't attack the President for teleprompter use - they should use them more often themselves. Some would find it easier to hide their anti-semitism if they didn't try to speak without notes... Judging a whole group by the actions of one, isn't that an acceptible definition of prejudice?", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "Originally posted by Fightdirector: Sen. Kim Hendren, R-GravetteNow there's a name of the GOP that's known across the country! Seems the Right shouldn't attack the President for teleprompter use - they should use them more often themselves. Some would find it easier to hide their anti-semitism if they didn't try to speak without notes...", 
        "reply": " Judging a whole group by the actions of one, isn't that an acceptible definition of prejudice?", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 07:03:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: Judging a whole group by the actions of one, isn't that an acceptible definition of prejudice? In today's world, it's apparently relative. To a Right-Winger (or a Fox-News commentator), if someone who is Liberal, Libertarian or moderate makes a gaffe, pointing it out is truth-telling. But if someone who is from the American Right-Wing makes a gaffe, pointing it out is prejudice. In brief: It's only prejudice if your group or a member of your group is being criticized - it's truth-telling when it's a member of the opposing group is criticized.", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "Originally posted by 67NOV: Judging a whole group by the actions of one, isn't that an acceptible definition of prejudice?", 
        "reply": " In today's world, it's apparently relative. To a Right-Winger (or a Fox-News commentator), if someone who is Liberal, Libertarian or moderate makes a gaffe, pointing it out is truth-telling. But if someone who is from the American Right-Wing makes a gaffe, pointing it out is prejudice. In brief: It's only prejudice if your group or a member of your group is being criticized - it's truth-telling when it's a member of the opposing group is criticized.", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 07:16:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: [But if someone who is from the American Right-Wing makes a gaffe, pointing it out is prejudice. When you include the whole group based upon the silliness of one, yes that's prejudging: prejudice.", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "Originally posted by Fightdirector: [But if someone who is from the American Right-Wing makes a gaffe, pointing it out is prejudice.", 
        "reply": " When you include the whole group based upon the silliness of one, yes that's prejudging: prejudice.", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 10:04:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "67NOV"
    }, 
    {
        "content": "OH MY GOD! STOP THE PREESSES, some third rate republican refered to the MIGHTY CHUCKEY-SCHMUCKEY SHUMER AS A JEW! That ANTI-SEMETIC remark cannot go UNPUNISHED!!!BLAH blah blah Well, of course, the can see the similarity to say a US Senator and a State Senator, and anything any one of them applies to all, that's perfectly logical! I'm sure you can find something of less relevence, but you'll have to try hard!", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "", 
        "reply": "OH MY GOD! STOP THE PREESSES, some third rate republican refered to the MIGHTY CHUCKEY-SCHMUCKEY SHUMER AS A JEW! That ANTI-SEMETIC remark cannot go UNPUNISHED!!!BLAH blah blah Well, of course, the can see the similarity to say a US Senator and a State Senator, and anything any one of them applies to all, that's perfectly logical! I'm sure you can find something of less relevence, but you'll have to try hard!", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 12:06:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Wow, are you trying to group ALL GOP in with a STATE SENATOR'S BIGOTTED comment? If so, you are reaching friend. The guy is a bigot, that can not be denied, but labelling all GOP this way is sickning. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 7, 
        "quote": "", 
        "reply": "Wow, are you trying to group ALL GOP in with a STATE SENATOR'S BIGOTTED comment? If so, you are reaching friend. The guy is a bigot, that can not be denied, but labelling all GOP this way is sickning. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 12:10:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Wow, are you trying to group ALL GOP in with a STATE SENATOR'S BIGOTTED comment? If so, you are reaching friend. The guy is a bigot, that can not be denied, but labelling all GOP this way is sickning. I was merely applying the same standard to a Republican that the Right and FOX-News applies to almost all Democrats - indeed as the Right and FOX-News applies to anyone left of Center. I know, because I have seen and heard it before in the media over the past 4 to 5 years, that if this anti-semitic state senator were a Democrat, the Right and FOX-News would run riot for several days about how this was proof positive that all Democrats were anti-Semites. As I said in an earlier response: quote: To a Right-Winger (or a Fox-News commentator), if someone who is a Liberal, Libertarian or moderate and makes a gaffe, pointing it out is truth-telling. And, if you had bothered to read my comments, I never said all Republicans are anti-semites, based on this one Republican state senator's comments - you came to that conclusion yourselves. Methinks you protest too much...what does that say of you? Feeling guilty about something? I merely said that if he hadn't spoken off the cuff and had used a teleprompter instead, he might have avoided having his true feelings exposed to the public.", 
        "intTime": 20090515, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: Wow, are you trying to group ALL GOP in with a STATE SENATOR'S BIGOTTED comment? If so, you are reaching friend. The guy is a bigot, that can not be denied, but labelling all GOP this way is sickning.", 
        "reply": " I was merely applying the same standard to a Republican that the Right and FOX-News applies to almost all Democrats - indeed as the Right and FOX-News applies to anyone left of Center. I know, because I have seen and heard it before in the media over the past 4 to 5 years, that if this anti-semitic state senator were a Democrat, the Right and FOX-News would run riot for several days about how this was proof positive that all Democrats were anti-Semites. As I said in an earlier response: quote: To a Right-Winger (or a Fox-News commentator), if someone who is a Liberal, Libertarian or moderate and makes a gaffe, pointing it out is truth-telling. And, if you had bothered to read my comments, I never said all Republicans are anti-semites, based on this one Republican state senator's comments - you came to that conclusion yourselves. Methinks you protest too much...what does that say of you? Feeling guilty about something? I merely said that if he hadn't spoken off the cuff and had used a teleprompter instead, he might have avoided having his true feelings exposed to the public.", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 12:41:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by L0A1: Wow, are you trying to group ALL GOP in with a STATE SENATOR'S BIGOTTED comment? If so, you are reaching friend. The guy is a bigot, that can not be denied, but labelling all GOP this way is sickning. I was merely applying the same standard to the Repu;icans that the Right and FOX-News applys to the Democrats - indeed as the Right and FOX-News applies to anyone left of Center. I know, because I have seen and heard it before in the media over the past 4 to 5 years, that if this anti-semitic state senator were a Democrat, the Right and FOX-News would run riot for several days about how this was proof positive that all Democrats were anti-Semites. As I said in an earlier response: quote: To a Right-Winger (or a Fox-News commentator), if someone who is a Liberal, Libertarian or moderate and makes a gaffe, pointing it out is truth-telling. And, if you had bothered to read my comments, I never said all Republicans are anti-semites, based on this one Republican state senator's comments - you came to that conclusion yourselves. Methinks you protest too much...what does that say of you? Feeling guilty about something? I merely said that if he hadn't spoken off the cuff and had used a teleprompter instead, he might have avoided having his true feelings exposed to the public. I am neither Republican or Democrat, don't mind me if I am getting sick of the partisan bickering. Sorry if it seemed I was harsh. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090515, 
        "postID": 9, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by L0A1: Wow, are you trying to group ALL GOP in with a STATE SENATOR'S BIGOTTED comment? If so, you are reaching friend. The guy is a bigot, that can not be denied, but labelling all GOP this way is sickning. I was merely applying the same standard to the Repu;icans that the Right and FOX-News applys to the Democrats - indeed as the Right and FOX-News applies to anyone left of Center. I know, because I have seen and heard it before in the media over the past 4 to 5 years, that if this anti-semitic state senator were a Democrat, the Right and FOX-News would run riot for several days about how this was proof positive that all Democrats were anti-Semites. As I said in an earlier response: quote: To a Right-Winger (or a Fox-News commentator), if someone who is a Liberal, Libertarian or moderate and makes a gaffe, pointing it out is truth-telling. And, if you had bothered to read my comments, I never said all Republicans are anti-semites, based on this one Republican state senator's comments - you came to that conclusion yourselves. Methinks you protest too much...what does that say of you? Feeling guilty about something? I merely said that if he hadn't spoken off the cuff and had used a teleprompter instead, he might have avoided having his true feelings exposed to the public.", 
        "reply": " I am neither Republican or Democrat, don't mind me if I am getting sick of the partisan bickering. Sorry if it seemed I was harsh. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_5590053322001", 
        "time": "2009-05-15 12:42:00", 
        "title": "Anti-Semite GOPer blames his comments on lack of teleprompter", 
        "userID": "L0A1"
    }
]