[
    {
        "content": "What a 'http://www.foxnews.com/story/0,2933,515624,00.html' A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. James Kauchis, a government employee of the Broome County Department of Social Services, confirmed that he filed a formal complaint last week seeking the pay, according to the Binghamton Press & Sun-Bulletin. But he wouldn't discuss it with the newspaper. \"That's a matter between me, the administration and the union,\" Kauchis said. The disgruntled accounting clerk was in his office in a nearby building when 41-year-old Jiverly Wong walked into the American Civic Association in Binghamton and opened fire with two handguns, killing 13 people and wounding four others before committing suicide. The Department of Social Services was on lockdown for four hours to protect the 370 workers in the building, Michael Klein, director of the county's personnel department, told the paper. Klein confirmed that Kauchis made the complaint seeking lunch-break pay. Government officials expressed embarrassment and disappointment over the filing. \"A lot of people lost a lot more that day than just one hour,\" said Broome County Executive Barbara J. Fiala, adding that \"99.9 percent of county employees stepped up to the plate.\" Klein reportedly denied Kauchis' complaint because there was no violation of the union contract or of state labor laws. During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper.", 
        "intTime": 20090415, 
        "postID": 1, 
        "quote": "", 
        "reply": "What a 'http://www.foxnews.com/story/0,2933,515624,00.html' A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. James Kauchis, a government employee of the Broome County Department of Social Services, confirmed that he filed a formal complaint last week seeking the pay, according to the Binghamton Press & Sun-Bulletin. But he wouldn't discuss it with the newspaper. \"That's a matter between me, the administration and the union,\" Kauchis said. The disgruntled accounting clerk was in his office in a nearby building when 41-year-old Jiverly Wong walked into the American Civic Association in Binghamton and opened fire with two handguns, killing 13 people and wounding four others before committing suicide. The Department of Social Services was on lockdown for four hours to protect the 370 workers in the building, Michael Klein, director of the county's personnel department, told the paper. Klein confirmed that Kauchis made the complaint seeking lunch-break pay. Government officials expressed embarrassment and disappointment over the filing. \"A lot of people lost a lot more that day than just one hour,\" said Broome County Executive Barbara J. Fiala, adding that \"99.9 percent of county employees stepped up to the plate.\" Klein reportedly denied Kauchis' complaint because there was no violation of the union contract or of state labor laws. During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:08:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Other then showing that a-holes still exist in the world, what is the point you are trying to make?", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "", 
        "reply": "Other then showing that a-holes still exist in the world, what is the point you are trying to make?", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:25:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Ummmm.....I think that was the point!!!", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "", 
        "reply": "Ummmm.....I think that was the point!!!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:50:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "tawodi"
    }, 
    {
        "content": "Just another example why UNIONS should be done away with.", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "", 
        "reply": "Just another example why UNIONS should be done away with.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:53:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "navy8086"
    }, 
    {
        "content": "A good Supervisor, Like the one I was when working in Civil Service would find a way to fire this Scum Bag.", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "", 
        "reply": "A good Supervisor, Like the one I was when working in Civil Service would find a way to fire this Scum Bag.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:54:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "Duster6"
    }, 
    {
        "content": "Selfishness run amok. But such is the attitude reinforced by enforced collectivism.", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "", 
        "reply": "Selfishness run amok. But such is the attitude reinforced by enforced collectivism.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:54:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: navy8086: Just another example why UNIONS should be done away with. What does that solve. What's the difference between a union A-hole and a non-union A-hole? Now if you are talking about the A-hole union I would agree with you. You aren't a card carring member of that one, are you?", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "navy8086: Just another example why UNIONS should be done away with.", 
        "reply": " What does that solve. What's the difference between a union A-hole and a non-union A-hole? Now if you are talking about the A-hole union I would agree with you. You aren't a card carring member of that one, are you?", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:57:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement.", 
        "intTime": 20090415, 
        "postID": 8, 
        "quote": "RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism.", 
        "reply": " Lunch is an entitlement. Can't take away anyone's entitlement.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:59:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Ummmm.....I think that was the point!!! Exactly.", 
        "intTime": 20090415, 
        "postID": 9, 
        "quote": "Originally posted by tawodi: Ummmm.....I think that was the point!!!", 
        "reply": " Exactly.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:59:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Duster6: A good Supervisor, Like the one I was when working in Civil Service would find a way to fire this Scum Bag. Good luck firing him he is union. When my Dad retired from the Army he went civil service after being a contractor at Ft Jackson. He worked his way up the chain and had some lazy fugs that were mostly union, he tried to fire them and all kinds of paperwork was filed against him, didnt matter that he fired non-union lazy fugs too. It basically took the Base CG to come in and fire them. Wasnt easy, but it helped that that CG served with my dad in VN. He knew if my dad was doing this it was for good reason. I have seen the same problem on the base I am on too.", 
        "intTime": 20090415, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: A good Supervisor, Like the one I was when working in Civil Service would find a way to fire this Scum Bag.", 
        "reply": " Good luck firing him he is union. When my Dad retired from the Army he went civil service after being a contractor at Ft Jackson. He worked his way up the chain and had some lazy fugs that were mostly union, he tried to fire them and all kinds of paperwork was filed against him, didnt matter that he fired non-union lazy fugs too. It basically took the Base CG to come in and fire them. Wasnt easy, but it helped that that CG served with my dad in VN. He knew if my dad was doing this it was for good reason. I have seen the same problem on the base I am on too.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:05:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "i'll play *puts on dunce cap* AMERICAN IMPERIALISTS ARE TAKING ADVANTAGE OF LOMRAD WHUTZISNAME PAY HIM HIS LUNCH PAY, THEN SEND HIM PACKING HOME FOR A WEEK...then send Nunzio and Gino to take his lunch money....", 
        "intTime": 20090415, 
        "postID": 11, 
        "quote": "", 
        "reply": "i'll play *puts on dunce cap* AMERICAN IMPERIALISTS ARE TAKING ADVANTAGE OF LOMRAD WHUTZISNAME PAY HIM HIS LUNCH PAY, THEN SEND HIM PACKING HOME FOR A WEEK...then send Nunzio and Gino to take his lunch money....", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:06:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement. quote: During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper. He got his lunch. If that clerk wanted to play that game I would time his azz down to the second on everything he did. The dude was probably already a lazy azzhole the union just emboldened him", 
        "intTime": 20090415, 
        "postID": 12, 
        "quote": "Originally posted by bill_kananen: quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement.", 
        "reply": " quote: During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper. He got his lunch. If that clerk wanted to play that game I would time his azz down to the second on everything he did. The dude was probably already a lazy azzhole the union just emboldened him", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:07:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: GunnyRet03: He got his lunch. What if he didn't like pizza. When a person is ENTITLED to a lunch they shouldn't be forced to eat a lunch they don't like. You have to be tollerant and accepting of people who don't like pizza. That's like asking a welfare reciepient to get their cloths from the Salvation Army Store or the VOA. How degrading. You have to respect the wishes of those with entitlements. What kinda' lib/socialist are you?", 
        "intTime": 20090415, 
        "postID": 13, 
        "quote": "GunnyRet03: He got his lunch.", 
        "reply": " What if he didn't like pizza. When a person is ENTITLED to a lunch they shouldn't be forced to eat a lunch they don't like. You have to be tollerant and accepting of people who don't like pizza. That's like asking a welfare reciepient to get their cloths from the Salvation Army Store or the VOA. How degrading. You have to respect the wishes of those with entitlements. What kinda' lib/socialist are you?", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:17:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: navy8086: Just another example why UNIONS should be done away with. What does that solve. What's the difference between a union A-hole and a non-union A-hole? Now if you are talking about the A-hole union I would agree with you. You aren't a card carring member of that one, are you? I've been in THREE unions in my career, all useless. I've seen union guerilla tactics during a strike that has put patients at SERIOUS risk. I have absolutely NO respect for unions (at least in the health care field)", 
        "intTime": 20090415, 
        "postID": 14, 
        "quote": "Originally posted by bill_kananen: quote: navy8086: Just another example why UNIONS should be done away with. What does that solve. What's the difference between a union A-hole and a non-union A-hole? Now if you are talking about the A-hole union I would agree with you. You aren't a card carring member of that one, are you?", 
        "reply": " I've been in THREE unions in my career, all useless. I've seen union guerilla tactics during a strike that has put patients at SERIOUS risk. I have absolutely NO respect for unions (at least in the health care field)", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:21:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "navy8086"
    }, 
    {
        "content": "Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with.", 
        "intTime": 20090415, 
        "postID": 15, 
        "quote": "", 
        "reply": "Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:31:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "And nobody on this board has ever applied for \"missed meal compensation\" if the MREs weren't delivered for a day or two?? If it is considered part of your pay, as it is for Enlisted Personnel in the Military, why shouldn't you? Should you take a deduction for being shot at?? Then everyone who suffered through combat should return those pay checks, and everyone that got wounded should send back any disability compensation - - Just shows one more example of how shallow emotions get in the way of what's really going on - - Wandering and Wondering", 
        "intTime": 20090415, 
        "postID": 16, 
        "quote": "", 
        "reply": "And nobody on this board has ever applied for \"missed meal compensation\" if the MREs weren't delivered for a day or two?? If it is considered part of your pay, as it is for Enlisted Personnel in the Military, why shouldn't you? Should you take a deduction for being shot at?? Then everyone who suffered through combat should return those pay checks, and everyone that got wounded should send back any disability compensation - - Just shows one more example of how shallow emotions get in the way of what's really going on - - Wandering and Wondering", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:37:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: GunnyRet03: He got his lunch. What if he didn't like pizza. When a person is ENTITLED to a lunch they shouldn't be forced to eat a lunch they don't like. You have to be tollerant and accepting of people who don't like pizza. That's like asking a welfare reciepient to get their cloths from the Salvation Army Store or the VOA. How degrading. You have to respect the wishes of those with entitlements. What kinda' lib/socialist are you? LMAO!", 
        "intTime": 20090415, 
        "postID": 17, 
        "quote": "Originally posted by bill_kananen: quote: GunnyRet03: He got his lunch. What if he didn't like pizza. When a person is ENTITLED to a lunch they shouldn't be forced to eat a lunch they don't like. You have to be tollerant and accepting of people who don't like pizza. That's like asking a welfare reciepient to get their cloths from the Salvation Army Store or the VOA. How degrading. You have to respect the wishes of those with entitlements. What kinda' lib/socialist are you?", 
        "reply": " LMAO!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:50:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. No, just most of them. But they are dying a natural cause and that is why they are fighting for mandatory laws for unions.", 
        "intTime": 20090415, 
        "postID": 18, 
        "quote": "Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with.", 
        "reply": " No, just most of them. But they are dying a natural cause and that is why they are fighting for mandatory laws for unions.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:51:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: And nobody on this board has ever applied for \"missed meal compensation\" if the MREs weren't delivered for a day or two?? If it is considered part of your pay, as it is for Enlisted Personnel in the Military, why shouldn't you? Should you take a deduction for being shot at?? Then everyone who suffered through combat should return those pay checks, and everyone that got wounded should send back any disability compensation - - Just shows one more example of how shallow emotions get in the way of what's really going on - - I never did. You're honestly comparing a clerk having to stay in his office instead of leaving to go to McD's to being in the field and missing a meal(s) that actually have a direct impact on sustainment in a hazardous environment? If the guy was starving he had pizza for crying out loud. Solution: Hand him an F'n MRE and say meal compensated.", 
        "intTime": 20090415, 
        "postID": 19, 
        "quote": "Originally posted by greywolfghost: And nobody on this board has ever applied for \"missed meal compensation\" if the MREs weren't delivered for a day or two?? If it is considered part of your pay, as it is for Enlisted Personnel in the Military, why shouldn't you? Should you take a deduction for being shot at?? Then everyone who suffered through combat should return those pay checks, and everyone that got wounded should send back any disability compensation - - Just shows one more example of how shallow emotions get in the way of what's really going on - -", 
        "reply": " I never did. You're honestly comparing a clerk having to stay in his office instead of leaving to go to McD's to being in the field and missing a meal(s) that actually have a direct impact on sustainment in a hazardous environment? If the guy was starving he had pizza for crying out loud. Solution: Hand him an F'n MRE and say meal compensated.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:58:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement. Life is also an entitlement. This jamoke needs to gain a little perspective on what is imporant. I am certain that the 13 who died would not mind changing places with him.", 
        "intTime": 20090415, 
        "postID": 20, 
        "quote": "Originally posted by bill_kananen: quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement.", 
        "reply": " Life is also an entitlement. This jamoke needs to gain a little perspective on what is imporant. I am certain that the 13 who died would not mind changing places with him.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 09:30:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job!", 
        "intTime": 20090415, 
        "postID": 21, 
        "quote": "Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with.", 
        "reply": " At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:25:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "navy8086"
    }, 
    {
        "content": "My guess is you don't know of any health care facilities that forced nurses to work double shifts for straight time.", 
        "intTime": 20090415, 
        "postID": 22, 
        "quote": "", 
        "reply": "My guess is you don't know of any health care facilities that forced nurses to work double shifts for straight time.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:30:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?) Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090415, 
        "postID": 23, 
        "quote": "Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job!", 
        "reply": " COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?) Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:33:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. Damn, I'd be asking for hazzardous duty pay on top of compensation for my \"missed lunch\". After all, it should be written in the Union Contract! Screw the dead.....where's MY LUNCH!", 
        "intTime": 20090415, 
        "postID": 24, 
        "quote": "A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman.", 
        "reply": " Damn, I'd be asking for hazzardous duty pay on top of compensation for my \"missed lunch\". After all, it should be written in the Union Contract! Screw the dead.....where's MY LUNCH!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:35:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "You know what the biggest oxymoron is? Corporate compassion. How can you expect the people at the bottom to be more understanding then the people at the top? Maybe the management should give everyone a paid day off to compensate them for the stress? Like that's going to happen. Common decency isn't. Not because individuals don't want too, but because it's how business runs. Get as much as you can seems to be the theme of the century....? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090415, 
        "postID": 25, 
        "quote": "", 
        "reply": "You know what the biggest oxymoron is? Corporate compassion. How can you expect the people at the bottom to be more understanding then the people at the top? Maybe the management should give everyone a paid day off to compensate them for the stress? Like that's going to happen. Common decency isn't. Not because individuals don't want too, but because it's how business runs. Get as much as you can seems to be the theme of the century....? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:46:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "mmulder67"
    }, 
    {
        "content": "Ya damned if ya do and damned if ya don't. IF there is a next time, \"Sure Mac, go on out and get lunch(bang bang) an if ya get back bring me a Subway too.\" But then there would be a suit for not caring for his wellbeing to be stupid. But simple solution? Tomorrow the office closes for one hour to make up for the lunch time lost. But nooooo! That is too common scenes.", 
        "intTime": 20090415, 
        "postID": 26, 
        "quote": "", 
        "reply": "Ya damned if ya do and damned if ya don't. IF there is a next time, \"Sure Mac, go on out and get lunch(bang bang) an if ya get back bring me a Subway too.\" But then there would be a suit for not caring for his wellbeing to be stupid. But simple solution? Tomorrow the office closes for one hour to make up for the lunch time lost. But nooooo! That is too common scenes.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:47:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "SGTBJH"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: You know what the biggest oxymoron is? Corporate compassion. How can you expect the people at the bottom to be more understanding then the people at the top? Maybe the management should give everyone a paid day off to compensate them for the stress? Like that's going to happen. Common decency isn't. Not because individuals don't want too, but because it's how business runs. Get as much as you can seems to be the theme of the century....? Just compensate him for his lunch! No need to psychoanalyze his intentions. Pay him and move on!", 
        "intTime": 20090415, 
        "postID": 27, 
        "quote": "Originally posted by mmulder67: You know what the biggest oxymoron is? Corporate compassion. How can you expect the people at the bottom to be more understanding then the people at the top? Maybe the management should give everyone a paid day off to compensate them for the stress? Like that's going to happen. Common decency isn't. Not because individuals don't want too, but because it's how business runs. Get as much as you can seems to be the theme of the century....?", 
        "reply": " Just compensate him for his lunch! No need to psychoanalyze his intentions. Pay him and move on!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:50:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: What a 'http://www.foxnews.com/story/0,2933,515624,00.html' A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. James Kauchis, a government employee of the Broome County Department of Social Services, confirmed that he filed a formal complaint last week seeking the pay, according to the Binghamton Press & Sun-Bulletin. But he wouldn't discuss it with the newspaper. \"That's a matter between me, the administration and the union,\" Kauchis said. The disgruntled accounting clerk was in his office in a nearby building when 41-year-old Jiverly Wong walked into the American Civic Association in Binghamton and opened fire with two handguns, killing 13 people and wounding four others before committing suicide. The Department of Social Services was on lockdown for four hours to protect the 370 workers in the building, Michael Klein, director of the county's personnel department, told the paper. Klein confirmed that Kauchis made the complaint seeking lunch-break pay. Government officials expressed embarrassment and disappointment over the filing. \"A lot of people lost a lot more that day than just one hour,\" said Broome County Executive Barbara J. Fiala, adding that \"99.9 percent of county employees stepped up to the plate.\" Klein reportedly denied Kauchis' complaint because there was no violation of the union contract or of state labor laws. During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper. Interesting read Jimmy...show it to Clark", 
        "intTime": 20090415, 
        "postID": 28, 
        "quote": "Originally posted by GunnyRet03: What a 'http://www.foxnews.com/story/0,2933,515624,00.html' A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. James Kauchis, a government employee of the Broome County Department of Social Services, confirmed that he filed a formal complaint last week seeking the pay, according to the Binghamton Press & Sun-Bulletin. But he wouldn't discuss it with the newspaper. \"That's a matter between me, the administration and the union,\" Kauchis said. The disgruntled accounting clerk was in his office in a nearby building when 41-year-old Jiverly Wong walked into the American Civic Association in Binghamton and opened fire with two handguns, killing 13 people and wounding four others before committing suicide. The Department of Social Services was on lockdown for four hours to protect the 370 workers in the building, Michael Klein, director of the county's personnel department, told the paper. Klein confirmed that Kauchis made the complaint seeking lunch-break pay. Government officials expressed embarrassment and disappointment over the filing. \"A lot of people lost a lot more that day than just one hour,\" said Broome County Executive Barbara J. Fiala, adding that \"99.9 percent of county employees stepped up to the plate.\" Klein reportedly denied Kauchis' complaint because there was no violation of the union contract or of state labor laws. During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper.", 
        "reply": " Interesting read Jimmy...show it to Clark", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 11:19:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?) Obvioisly you've neer seen how the union thugs sabotage and vandalize health care facities before walking off the job. For intance: > giving a brittel diabrtic patient CANDY > taking off the ID bands > Crazy gluing locks > Smearing schidt in shower stalls > Calling to confused patient from the picket lines, hoping to lure them outside. I have ... and thank-you THOSE are the people I DON NOT want anywhere near me. The Unions of course didn't condone this (nod, nod, wink, wink).", 
        "intTime": 20090415, 
        "postID": 29, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?)", 
        "reply": " Obvioisly you've neer seen how the union thugs sabotage and vandalize health care facities before walking off the job. For intance: > giving a brittel diabrtic patient CANDY > taking off the ID bands > Crazy gluing locks > Smearing schidt in shower stalls > Calling to confused patient from the picket lines, hoping to lure them outside. I have ... and thank-you THOSE are the people I DON NOT want anywhere near me. The Unions of course didn't condone this (nod, nod, wink, wink).", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 11:19:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?) There arent any min wage nurses nice strawman.", 
        "intTime": 20090415, 
        "postID": 30, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?)", 
        "reply": " There arent any min wage nurses nice strawman.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 11:29:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "What a 'http://www.foxnews.com/story/0,2933,515624,00.html' A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. James Kauchis, a government employee of the Broome County Department of Social Services, confirmed that he filed a formal complaint last week seeking the pay, according to the Binghamton Press & Sun-Bulletin. But he wouldn't discuss it with the newspaper. \"That's a matter between me, the administration and the union,\" Kauchis said. The disgruntled accounting clerk was in his office in a nearby building when 41-year-old Jiverly Wong walked into the American Civic Association in Binghamton and opened fire with two handguns, killing 13 people and wounding four others before committing suicide. The Department of Social Services was on lockdown for four hours to protect the 370 workers in the building, Michael Klein, director of the county's personnel department, told the paper. Klein confirmed that Kauchis made the complaint seeking lunch-break pay. Government officials expressed embarrassment and disappointment over the filing. \"A lot of people lost a lot more that day than just one hour,\" said Broome County Executive Barbara J. Fiala, adding that \"99.9 percent of county employees stepped up to the plate.\" Klein reportedly denied Kauchis' complaint because there was no violation of the union contract or of state labor laws. During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper.", 
        "intTime": 20090415, 
        "postID": 31, 
        "quote": "", 
        "reply": "What a 'http://www.foxnews.com/story/0,2933,515624,00.html' A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. James Kauchis, a government employee of the Broome County Department of Social Services, confirmed that he filed a formal complaint last week seeking the pay, according to the Binghamton Press & Sun-Bulletin. But he wouldn't discuss it with the newspaper. \"That's a matter between me, the administration and the union,\" Kauchis said. The disgruntled accounting clerk was in his office in a nearby building when 41-year-old Jiverly Wong walked into the American Civic Association in Binghamton and opened fire with two handguns, killing 13 people and wounding four others before committing suicide. The Department of Social Services was on lockdown for four hours to protect the 370 workers in the building, Michael Klein, director of the county's personnel department, told the paper. Klein confirmed that Kauchis made the complaint seeking lunch-break pay. Government officials expressed embarrassment and disappointment over the filing. \"A lot of people lost a lot more that day than just one hour,\" said Broome County Executive Barbara J. Fiala, adding that \"99.9 percent of county employees stepped up to the plate.\" Klein reportedly denied Kauchis' complaint because there was no violation of the union contract or of state labor laws. During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:08:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Other then showing that a-holes still exist in the world, what is the point you are trying to make?", 
        "intTime": 20090415, 
        "postID": 32, 
        "quote": "", 
        "reply": "Other then showing that a-holes still exist in the world, what is the point you are trying to make?", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:25:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Ummmm.....I think that was the point!!!", 
        "intTime": 20090415, 
        "postID": 33, 
        "quote": "", 
        "reply": "Ummmm.....I think that was the point!!!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:50:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "tawodi"
    }, 
    {
        "content": "Just another example why UNIONS should be done away with.", 
        "intTime": 20090415, 
        "postID": 34, 
        "quote": "", 
        "reply": "Just another example why UNIONS should be done away with.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:53:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "navy8086"
    }, 
    {
        "content": "A good Supervisor, Like the one I was when working in Civil Service would find a way to fire this Scum Bag.", 
        "intTime": 20090415, 
        "postID": 35, 
        "quote": "", 
        "reply": "A good Supervisor, Like the one I was when working in Civil Service would find a way to fire this Scum Bag.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:54:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "Duster6"
    }, 
    {
        "content": "Selfishness run amok. But such is the attitude reinforced by enforced collectivism.", 
        "intTime": 20090415, 
        "postID": 36, 
        "quote": "", 
        "reply": "Selfishness run amok. But such is the attitude reinforced by enforced collectivism.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:54:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: navy8086: Just another example why UNIONS should be done away with. What does that solve. What's the difference between a union A-hole and a non-union A-hole? Now if you are talking about the A-hole union I would agree with you. You aren't a card carring member of that one, are you?", 
        "intTime": 20090415, 
        "postID": 37, 
        "quote": "navy8086: Just another example why UNIONS should be done away with.", 
        "reply": " What does that solve. What's the difference between a union A-hole and a non-union A-hole? Now if you are talking about the A-hole union I would agree with you. You aren't a card carring member of that one, are you?", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:57:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement.", 
        "intTime": 20090415, 
        "postID": 38, 
        "quote": "RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism.", 
        "reply": " Lunch is an entitlement. Can't take away anyone's entitlement.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:59:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Ummmm.....I think that was the point!!! Exactly.", 
        "intTime": 20090415, 
        "postID": 39, 
        "quote": "Originally posted by tawodi: Ummmm.....I think that was the point!!!", 
        "reply": " Exactly.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 06:59:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Duster6: A good Supervisor, Like the one I was when working in Civil Service would find a way to fire this Scum Bag. Good luck firing him he is union. When my Dad retired from the Army he went civil service after being a contractor at Ft Jackson. He worked his way up the chain and had some lazy fugs that were mostly union, he tried to fire them and all kinds of paperwork was filed against him, didnt matter that he fired non-union lazy fugs too. It basically took the Base CG to come in and fire them. Wasnt easy, but it helped that that CG served with my dad in VN. He knew if my dad was doing this it was for good reason. I have seen the same problem on the base I am on too.", 
        "intTime": 20090415, 
        "postID": 40, 
        "quote": "Originally posted by Duster6: A good Supervisor, Like the one I was when working in Civil Service would find a way to fire this Scum Bag.", 
        "reply": " Good luck firing him he is union. When my Dad retired from the Army he went civil service after being a contractor at Ft Jackson. He worked his way up the chain and had some lazy fugs that were mostly union, he tried to fire them and all kinds of paperwork was filed against him, didnt matter that he fired non-union lazy fugs too. It basically took the Base CG to come in and fire them. Wasnt easy, but it helped that that CG served with my dad in VN. He knew if my dad was doing this it was for good reason. I have seen the same problem on the base I am on too.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:05:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "i'll play *puts on dunce cap* AMERICAN IMPERIALISTS ARE TAKING ADVANTAGE OF LOMRAD WHUTZISNAME PAY HIM HIS LUNCH PAY, THEN SEND HIM PACKING HOME FOR A WEEK...then send Nunzio and Gino to take his lunch money....", 
        "intTime": 20090415, 
        "postID": 41, 
        "quote": "", 
        "reply": "i'll play *puts on dunce cap* AMERICAN IMPERIALISTS ARE TAKING ADVANTAGE OF LOMRAD WHUTZISNAME PAY HIM HIS LUNCH PAY, THEN SEND HIM PACKING HOME FOR A WEEK...then send Nunzio and Gino to take his lunch money....", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:06:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement. quote: During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper. He got his lunch. If that clerk wanted to play that game I would time his azz down to the second on everything he did. The dude was probably already a lazy azzhole the union just emboldened him", 
        "intTime": 20090415, 
        "postID": 42, 
        "quote": "Originally posted by bill_kananen: quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement.", 
        "reply": " quote: During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper. He got his lunch. If that clerk wanted to play that game I would time his azz down to the second on everything he did. The dude was probably already a lazy azzhole the union just emboldened him", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:07:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: GunnyRet03: He got his lunch. What if he didn't like pizza. When a person is ENTITLED to a lunch they shouldn't be forced to eat a lunch they don't like. You have to be tollerant and accepting of people who don't like pizza. That's like asking a welfare reciepient to get their cloths from the Salvation Army Store or the VOA. How degrading. You have to respect the wishes of those with entitlements. What kinda' lib/socialist are you?", 
        "intTime": 20090415, 
        "postID": 43, 
        "quote": "GunnyRet03: He got his lunch.", 
        "reply": " What if he didn't like pizza. When a person is ENTITLED to a lunch they shouldn't be forced to eat a lunch they don't like. You have to be tollerant and accepting of people who don't like pizza. That's like asking a welfare reciepient to get their cloths from the Salvation Army Store or the VOA. How degrading. You have to respect the wishes of those with entitlements. What kinda' lib/socialist are you?", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:17:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: navy8086: Just another example why UNIONS should be done away with. What does that solve. What's the difference between a union A-hole and a non-union A-hole? Now if you are talking about the A-hole union I would agree with you. You aren't a card carring member of that one, are you? I've been in THREE unions in my career, all useless. I've seen union guerilla tactics during a strike that has put patients at SERIOUS risk. I have absolutely NO respect for unions (at least in the health care field)", 
        "intTime": 20090415, 
        "postID": 44, 
        "quote": "Originally posted by bill_kananen: quote: navy8086: Just another example why UNIONS should be done away with. What does that solve. What's the difference between a union A-hole and a non-union A-hole? Now if you are talking about the A-hole union I would agree with you. You aren't a card carring member of that one, are you?", 
        "reply": " I've been in THREE unions in my career, all useless. I've seen union guerilla tactics during a strike that has put patients at SERIOUS risk. I have absolutely NO respect for unions (at least in the health care field)", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:21:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "navy8086"
    }, 
    {
        "content": "Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with.", 
        "intTime": 20090415, 
        "postID": 45, 
        "quote": "", 
        "reply": "Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:31:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "And nobody on this board has ever applied for \"missed meal compensation\" if the MREs weren't delivered for a day or two?? If it is considered part of your pay, as it is for Enlisted Personnel in the Military, why shouldn't you? Should you take a deduction for being shot at?? Then everyone who suffered through combat should return those pay checks, and everyone that got wounded should send back any disability compensation - - Just shows one more example of how shallow emotions get in the way of what's really going on - - Wandering and Wondering", 
        "intTime": 20090415, 
        "postID": 46, 
        "quote": "", 
        "reply": "And nobody on this board has ever applied for \"missed meal compensation\" if the MREs weren't delivered for a day or two?? If it is considered part of your pay, as it is for Enlisted Personnel in the Military, why shouldn't you? Should you take a deduction for being shot at?? Then everyone who suffered through combat should return those pay checks, and everyone that got wounded should send back any disability compensation - - Just shows one more example of how shallow emotions get in the way of what's really going on - - Wandering and Wondering", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:37:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: GunnyRet03: He got his lunch. What if he didn't like pizza. When a person is ENTITLED to a lunch they shouldn't be forced to eat a lunch they don't like. You have to be tollerant and accepting of people who don't like pizza. That's like asking a welfare reciepient to get their cloths from the Salvation Army Store or the VOA. How degrading. You have to respect the wishes of those with entitlements. What kinda' lib/socialist are you? LMAO!", 
        "intTime": 20090415, 
        "postID": 47, 
        "quote": "Originally posted by bill_kananen: quote: GunnyRet03: He got his lunch. What if he didn't like pizza. When a person is ENTITLED to a lunch they shouldn't be forced to eat a lunch they don't like. You have to be tollerant and accepting of people who don't like pizza. That's like asking a welfare reciepient to get their cloths from the Salvation Army Store or the VOA. How degrading. You have to respect the wishes of those with entitlements. What kinda' lib/socialist are you?", 
        "reply": " LMAO!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:50:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. No, just most of them. But they are dying a natural cause and that is why they are fighting for mandatory laws for unions.", 
        "intTime": 20090415, 
        "postID": 48, 
        "quote": "Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with.", 
        "reply": " No, just most of them. But they are dying a natural cause and that is why they are fighting for mandatory laws for unions.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:51:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: And nobody on this board has ever applied for \"missed meal compensation\" if the MREs weren't delivered for a day or two?? If it is considered part of your pay, as it is for Enlisted Personnel in the Military, why shouldn't you? Should you take a deduction for being shot at?? Then everyone who suffered through combat should return those pay checks, and everyone that got wounded should send back any disability compensation - - Just shows one more example of how shallow emotions get in the way of what's really going on - - I never did. You're honestly comparing a clerk having to stay in his office instead of leaving to go to McD's to being in the field and missing a meal(s) that actually have a direct impact on sustainment in a hazardous environment? If the guy was starving he had pizza for crying out loud. Solution: Hand him an F'n MRE and say meal compensated.", 
        "intTime": 20090415, 
        "postID": 49, 
        "quote": "Originally posted by greywolfghost: And nobody on this board has ever applied for \"missed meal compensation\" if the MREs weren't delivered for a day or two?? If it is considered part of your pay, as it is for Enlisted Personnel in the Military, why shouldn't you? Should you take a deduction for being shot at?? Then everyone who suffered through combat should return those pay checks, and everyone that got wounded should send back any disability compensation - - Just shows one more example of how shallow emotions get in the way of what's really going on - -", 
        "reply": " I never did. You're honestly comparing a clerk having to stay in his office instead of leaving to go to McD's to being in the field and missing a meal(s) that actually have a direct impact on sustainment in a hazardous environment? If the guy was starving he had pizza for crying out loud. Solution: Hand him an F'n MRE and say meal compensated.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 07:58:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement. Life is also an entitlement. This jamoke needs to gain a little perspective on what is imporant. I am certain that the 13 who died would not mind changing places with him.", 
        "intTime": 20090415, 
        "postID": 50, 
        "quote": "Originally posted by bill_kananen: quote: RRR52: Selfishness run amok. But such is the attitude reinforced by enforced collectivism. Lunch is an entitlement. Can't take away anyone's entitlement.", 
        "reply": " Life is also an entitlement. This jamoke needs to gain a little perspective on what is imporant. I am certain that the 13 who died would not mind changing places with him.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 09:30:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job!", 
        "intTime": 20090415, 
        "postID": 51, 
        "quote": "Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with.", 
        "reply": " At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:25:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "navy8086"
    }, 
    {
        "content": "My guess is you don't know of any health care facilities that forced nurses to work double shifts for straight time.", 
        "intTime": 20090415, 
        "postID": 52, 
        "quote": "", 
        "reply": "My guess is you don't know of any health care facilities that forced nurses to work double shifts for straight time.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:30:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?) Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090415, 
        "postID": 53, 
        "quote": "Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job!", 
        "reply": " COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?) Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:33:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. Damn, I'd be asking for hazzardous duty pay on top of compensation for my \"missed lunch\". After all, it should be written in the Union Contract! Screw the dead.....where's MY LUNCH!", 
        "intTime": 20090415, 
        "postID": 54, 
        "quote": "A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman.", 
        "reply": " Damn, I'd be asking for hazzardous duty pay on top of compensation for my \"missed lunch\". After all, it should be written in the Union Contract! Screw the dead.....where's MY LUNCH!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:35:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "You know what the biggest oxymoron is? Corporate compassion. How can you expect the people at the bottom to be more understanding then the people at the top? Maybe the management should give everyone a paid day off to compensate them for the stress? Like that's going to happen. Common decency isn't. Not because individuals don't want too, but because it's how business runs. Get as much as you can seems to be the theme of the century....? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090415, 
        "postID": 55, 
        "quote": "", 
        "reply": "You know what the biggest oxymoron is? Corporate compassion. How can you expect the people at the bottom to be more understanding then the people at the top? Maybe the management should give everyone a paid day off to compensate them for the stress? Like that's going to happen. Common decency isn't. Not because individuals don't want too, but because it's how business runs. Get as much as you can seems to be the theme of the century....? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:46:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "mmulder67"
    }, 
    {
        "content": "Ya damned if ya do and damned if ya don't. IF there is a next time, \"Sure Mac, go on out and get lunch(bang bang) an if ya get back bring me a Subway too.\" But then there would be a suit for not caring for his wellbeing to be stupid. But simple solution? Tomorrow the office closes for one hour to make up for the lunch time lost. But nooooo! That is too common scenes.", 
        "intTime": 20090415, 
        "postID": 56, 
        "quote": "", 
        "reply": "Ya damned if ya do and damned if ya don't. IF there is a next time, \"Sure Mac, go on out and get lunch(bang bang) an if ya get back bring me a Subway too.\" But then there would be a suit for not caring for his wellbeing to be stupid. But simple solution? Tomorrow the office closes for one hour to make up for the lunch time lost. But nooooo! That is too common scenes.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:47:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "SGTBJH"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: You know what the biggest oxymoron is? Corporate compassion. How can you expect the people at the bottom to be more understanding then the people at the top? Maybe the management should give everyone a paid day off to compensate them for the stress? Like that's going to happen. Common decency isn't. Not because individuals don't want too, but because it's how business runs. Get as much as you can seems to be the theme of the century....? Just compensate him for his lunch! No need to psychoanalyze his intentions. Pay him and move on!", 
        "intTime": 20090415, 
        "postID": 57, 
        "quote": "Originally posted by mmulder67: You know what the biggest oxymoron is? Corporate compassion. How can you expect the people at the bottom to be more understanding then the people at the top? Maybe the management should give everyone a paid day off to compensate them for the stress? Like that's going to happen. Common decency isn't. Not because individuals don't want too, but because it's how business runs. Get as much as you can seems to be the theme of the century....?", 
        "reply": " Just compensate him for his lunch! No need to psychoanalyze his intentions. Pay him and move on!", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 10:50:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: What a 'http://www.foxnews.com/story/0,2933,515624,00.html' A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. James Kauchis, a government employee of the Broome County Department of Social Services, confirmed that he filed a formal complaint last week seeking the pay, according to the Binghamton Press & Sun-Bulletin. But he wouldn't discuss it with the newspaper. \"That's a matter between me, the administration and the union,\" Kauchis said. The disgruntled accounting clerk was in his office in a nearby building when 41-year-old Jiverly Wong walked into the American Civic Association in Binghamton and opened fire with two handguns, killing 13 people and wounding four others before committing suicide. The Department of Social Services was on lockdown for four hours to protect the 370 workers in the building, Michael Klein, director of the county's personnel department, told the paper. Klein confirmed that Kauchis made the complaint seeking lunch-break pay. Government officials expressed embarrassment and disappointment over the filing. \"A lot of people lost a lot more that day than just one hour,\" said Broome County Executive Barbara J. Fiala, adding that \"99.9 percent of county employees stepped up to the plate.\" Klein reportedly denied Kauchis' complaint because there was no violation of the union contract or of state labor laws. During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper. Interesting read Jimmy...show it to Clark", 
        "intTime": 20090415, 
        "postID": 58, 
        "quote": "Originally posted by GunnyRet03: What a 'http://www.foxnews.com/story/0,2933,515624,00.html' A social services accounting clerk wants compensation for missing his lunch break on April 3 during a horrific upstate New York immigration center massacre that left 13 dead plus the gunman. James Kauchis, a government employee of the Broome County Department of Social Services, confirmed that he filed a formal complaint last week seeking the pay, according to the Binghamton Press & Sun-Bulletin. But he wouldn't discuss it with the newspaper. \"That's a matter between me, the administration and the union,\" Kauchis said. The disgruntled accounting clerk was in his office in a nearby building when 41-year-old Jiverly Wong walked into the American Civic Association in Binghamton and opened fire with two handguns, killing 13 people and wounding four others before committing suicide. The Department of Social Services was on lockdown for four hours to protect the 370 workers in the building, Michael Klein, director of the county's personnel department, told the paper. Klein confirmed that Kauchis made the complaint seeking lunch-break pay. Government officials expressed embarrassment and disappointment over the filing. \"A lot of people lost a lot more that day than just one hour,\" said Broome County Executive Barbara J. Fiala, adding that \"99.9 percent of county employees stepped up to the plate.\" Klein reportedly denied Kauchis' complaint because there was no violation of the union contract or of state labor laws. During the four hours that social services employees were confined to their building, pizza and beverages were brought in by department bosses, commissioner Arthur Johnson told the newspaper.", 
        "reply": " Interesting read Jimmy...show it to Clark", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 11:19:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?) Obvioisly you've neer seen how the union thugs sabotage and vandalize health care facities before walking off the job. For intance: > giving a brittel diabrtic patient CANDY > taking off the ID bands > Crazy gluing locks > Smearing schidt in shower stalls > Calling to confused patient from the picket lines, hoping to lure them outside. I have ... and thank-you THOSE are the people I DON NOT want anywhere near me. The Unions of course didn't condone this (nod, nod, wink, wink).", 
        "intTime": 20090415, 
        "postID": 59, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?)", 
        "reply": " Obvioisly you've neer seen how the union thugs sabotage and vandalize health care facities before walking off the job. For intance: > giving a brittel diabrtic patient CANDY > taking off the ID bands > Crazy gluing locks > Smearing schidt in shower stalls > Calling to confused patient from the picket lines, hoping to lure them outside. I have ... and thank-you THOSE are the people I DON NOT want anywhere near me. The Unions of course didn't condone this (nod, nod, wink, wink).", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 11:19:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?) There arent any min wage nurses nice strawman.", 
        "intTime": 20090415, 
        "postID": 60, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by navy8086: quote: Originally posted by bill_kananen: Of course you have never seen employers that have put workers at risk. You have never seen employers that exposed workers to dangerous substances without protection. And you have never seen employers that violate labor laws with impunity. So based on your limited and biased view all unions should be done away with. At the VERY least, they should be done away with in the health care field. ANY health care worker that WALKS off the job and ABANDONS thier patients should NOT be in the job! COOL! I want a minimum wage nurse taking care of me....NOT! Let's get rid of the only leverage medical providers have so that corporate executives can squeeze even more PROFIT from sick people. The only thing that's disgusting is someone trying to PROFIT from sick and injured people. ANY health care executive who PROFITS from sick and injured PEOPLE should NOT be in charge! (We all want what's best for everyone...right?)", 
        "reply": " There arent any min wage nurses nice strawman.", 
        "threadID": "409192893_5020097022001", 
        "time": "2009-04-15 11:29:00", 
        "title": "Unionized Clerk Files for Missed lunch Due to Massacre", 
        "userID": "GunnyRet03"
    }
]