[
    {
        "content": "This is one of the best Op-Ed articles I have ever read. It covers a lot of ground and you have to go to the site and fead it in full as I cannot post it all here ... The Culture Warriors Get Laid Off SOMEDAY we’ll learn the whole story of why George W. Bush brushed off that intelligence briefing of Aug. 6, 2001, “Bin Laden Determined to Strike in U.S.” But surely a big distraction was the major speech he was readying for delivery on Aug. 9, his first prime-time address to the nation. The subject — which Bush hyped as “one of the most profound of our time” — was stem cells. For a presidency in thrall to a thriving religious right (and a presidency incapable of multi-tasking), nothing, not even terrorism, could be more urgent. When Barack Obama ended the Bush stem-cell policy last week, there were no such overheated theatrics. No oversold prime-time address. No hysteria from politicians, the news media or the public. The family-values dinosaurs that once stalked the earth — Falwell, Robertson, Dobson and Reed — are now either dead, retired or disgraced. Their less-famous successors pumped out their pro forma e-mail blasts, but to little avail. The Republican National Committee said nothing whatsoever about Obama’s reversal of Bush stem-cell policy. That’s quite a contrast to 2006, when the party’s wild and crazy (and perhaps transitory) new chairman, Michael Steele, likened embryonic stem-cell research to Nazi medical experiments during his failed Senate campaign. Read the full article here > >http://www.nytimes.com/2009/03/15/opinion/15rich.html?_r=2&ref=opinion", 
        "intTime": 20090316, 
        "postID": 1, 
        "quote": "", 
        "reply": "This is one of the best Op-Ed articles I have ever read. It covers a lot of ground and you have to go to the site and fead it in full as I cannot post it all here ... The Culture Warriors Get Laid Off SOMEDAY we’ll learn the whole story of why George W. Bush brushed off that intelligence briefing of Aug. 6, 2001, “Bin Laden Determined to Strike in U.S.” But surely a big distraction was the major speech he was readying for delivery on Aug. 9, his first prime-time address to the nation. The subject — which Bush hyped as “one of the most profound of our time” — was stem cells. For a presidency in thrall to a thriving religious right (and a presidency incapable of multi-tasking), nothing, not even terrorism, could be more urgent. When Barack Obama ended the Bush stem-cell policy last week, there were no such overheated theatrics. No oversold prime-time address. No hysteria from politicians, the news media or the public. The family-values dinosaurs that once stalked the earth — Falwell, Robertson, Dobson and Reed — are now either dead, retired or disgraced. Their less-famous successors pumped out their pro forma e-mail blasts, but to little avail. The Republican National Committee said nothing whatsoever about Obama’s reversal of Bush stem-cell policy. That’s quite a contrast to 2006, when the party’s wild and crazy (and perhaps transitory) new chairman, Michael Steele, likened embryonic stem-cell research to Nazi medical experiments during his failed Senate campaign. Read the full article here > >http://www.nytimes.com/2009/03/15/opinion/15rich.html?_r=2&ref=opinion", 
        "threadID": "409192893_1580020812001", 
        "time": "2009-03-16 13:56:00", 
        "title": "The Culture Warriors Get Laid Off", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: This is one of the best Op-Ed articles I have ever read. It covers a lot of ground and you have to go to the site and fead it in full as I cannot post it all here ... The Culture Warriors Get Laid Off SOMEDAY we’ll learn the whole story of why George W. Bush brushed off that intelligence briefing of Aug. 6, 2001, “Bin Laden Determined to Strike in U.S.” But surely a big distraction was the major speech he was readying for delivery on Aug. 9, his first prime-time address to the nation. The subject — which Bush hyped as “one of the most profound of our time” — was stem cells. For a presidency in thrall to a thriving religious right (and a presidency incapable of multi-tasking), nothing, not even terrorism, could be more urgent. When Barack Obama ended the Bush stem-cell policy last week, there were no such overheated theatrics. No oversold prime-time address. No hysteria from politicians, the news media or the public. The family-values dinosaurs that once stalked the earth — Falwell, Robertson, Dobson and Reed — are now either dead, retired or disgraced. Their less-famous successors pumped out their pro forma e-mail blasts, but to little avail. The Republican National Committee said nothing whatsoever about Obama’s reversal of Bush stem-cell policy. That’s quite a contrast to 2006, when the party’s wild and crazy (and perhaps transitory) new chairman, Michael Steele, likened embryonic stem-cell research to Nazi medical experiments during his failed Senate campaign. Read the full article here > >http://www.nytimes.com/2009/03/15/opinion/15rich.html?_r=2&ref=opinion I'm glad the policy was reversed. Throwing embryos away was the crime as far as I was concerned. However, Bush didn't stop research on stem cells like you'd be led to believe. Only on using fed money. Anyone else was free, and did, go on about their business. The silence you referred to.. Kind of like when we have the coldest weather world wide in decades, and you hear nothing. Al Gore uses massive amounts of electricity yet wants the rest of us to cut back. That he stands to make billions if his plan succeeds. The spotted owl wasn't being decimated by man, but by other predators. The snail darter wasn't only found in one place. That the left has spent more time and energy defending the terrorists at Gitmo than our troops. Giving aid and comfort to the enemy in a time of war is treason. That even if Obama is a real US citizen, he's also a dual citizen which wasn't specifically allowed by our Founders. That much of Obama's fund raising money came from illegal sources. Where legal gun ownership is up, crime is down. No matter how you look at it, Obama's wish list can't be paid off. Giving Biden the win in the VP debates without listing the horrendous number of gaffes he made, including not knowing the job of the VP. That Palin had more exective, business and military experience than Obama, Biden and Cheney put together. That she was the only one that ever took on corrupt members of her own party. That tax cuts actually raise revenue and benefit the American people. That regardless of the sacrifice, keeping the oil lanes open was more important to our country's self interest than any other. That war for oil is a good thing. That John McCain didn't ask for or get special favors from the NVA. That not knowing how many houses he and his wife own is the sign of an honest politician. That when the Daily Kos reported that Palin's handicapped son wasn't hers, it wasn't true, nor should it have been reported. That she never said she could see Russia from her front porch. That Obama was directly in bed with crooks and slumlords, and benefitted from it. That he lied about his relationship with Bill Ayers. That he was part of the economic problem as a US Senator trying to spend billions in pork. That Frank, Waters, and Dodd were the most prominent obsticles to banking reform of anyone. Just a few little things that no one on the left has mentioned. Quiet, like the right wingers. Where are they, see ing how they are so concerned about responsibility and who's to blame? Sure, Bush brushed over the report, because that's about all it said. Not when, not where, not how, or with what. Then again, Clinton was offered Ossama free and clear, and turned it down flat. Sen. Carl Levin (D) held up many of Bush's appointees for months, keeping him from filling his cabinet, thus he had to rely on a lot of Clinton appointees. He had a full cabinet only months before 9-11. How much was that hammered on by the press? Where were all these security experts then, or now? The true story may come out one day, but it won't be the whole story if the left does it.", 
        "intTime": 20090316, 
        "postID": 2, 
        "quote": "Originally posted by IHAWKER: This is one of the best Op-Ed articles I have ever read. It covers a lot of ground and you have to go to the site and fead it in full as I cannot post it all here ... The Culture Warriors Get Laid Off SOMEDAY we’ll learn the whole story of why George W. Bush brushed off that intelligence briefing of Aug. 6, 2001, “Bin Laden Determined to Strike in U.S.” But surely a big distraction was the major speech he was readying for delivery on Aug. 9, his first prime-time address to the nation. The subject — which Bush hyped as “one of the most profound of our time” — was stem cells. For a presidency in thrall to a thriving religious right (and a presidency incapable of multi-tasking), nothing, not even terrorism, could be more urgent. When Barack Obama ended the Bush stem-cell policy last week, there were no such overheated theatrics. No oversold prime-time address. No hysteria from politicians, the news media or the public. The family-values dinosaurs that once stalked the earth — Falwell, Robertson, Dobson and Reed — are now either dead, retired or disgraced. Their less-famous successors pumped out their pro forma e-mail blasts, but to little avail. The Republican National Committee said nothing whatsoever about Obama’s reversal of Bush stem-cell policy. That’s quite a contrast to 2006, when the party’s wild and crazy (and perhaps transitory) new chairman, Michael Steele, likened embryonic stem-cell research to Nazi medical experiments during his failed Senate campaign. Read the full article here > >http://www.nytimes.com/2009/03/15/opinion/15rich.html?_r=2&ref=opinion", 
        "reply": " I'm glad the policy was reversed. Throwing embryos away was the crime as far as I was concerned. However, Bush didn't stop research on stem cells like you'd be led to believe. Only on using fed money. Anyone else was free, and did, go on about their business. The silence you referred to.. Kind of like when we have the coldest weather world wide in decades, and you hear nothing. Al Gore uses massive amounts of electricity yet wants the rest of us to cut back. That he stands to make billions if his plan succeeds. The spotted owl wasn't being decimated by man, but by other predators. The snail darter wasn't only found in one place. That the left has spent more time and energy defending the terrorists at Gitmo than our troops. Giving aid and comfort to the enemy in a time of war is treason. That even if Obama is a real US citizen, he's also a dual citizen which wasn't specifically allowed by our Founders. That much of Obama's fund raising money came from illegal sources. Where legal gun ownership is up, crime is down. No matter how you look at it, Obama's wish list can't be paid off. Giving Biden the win in the VP debates without listing the horrendous number of gaffes he made, including not knowing the job of the VP. That Palin had more exective, business and military experience than Obama, Biden and Cheney put together. That she was the only one that ever took on corrupt members of her own party. That tax cuts actually raise revenue and benefit the American people. That regardless of the sacrifice, keeping the oil lanes open was more important to our country's self interest than any other. That war for oil is a good thing. That John McCain didn't ask for or get special favors from the NVA. That not knowing how many houses he and his wife own is the sign of an honest politician. That when the Daily Kos reported that Palin's handicapped son wasn't hers, it wasn't true, nor should it have been reported. That she never said she could see Russia from her front porch. That Obama was directly in bed with crooks and slumlords, and benefitted from it. That he lied about his relationship with Bill Ayers. That he was part of the economic problem as a US Senator trying to spend billions in pork. That Frank, Waters, and Dodd were the most prominent obsticles to banking reform of anyone. Just a few little things that no one on the left has mentioned. Quiet, like the right wingers. Where are they, see ing how they are so concerned about responsibility and who's to blame? Sure, Bush brushed over the report, because that's about all it said. Not when, not where, not how, or with what. Then again, Clinton was offered Ossama free and clear, and turned it down flat. Sen. Carl Levin (D) held up many of Bush's appointees for months, keeping him from filling his cabinet, thus he had to rely on a lot of Clinton appointees. He had a full cabinet only months before 9-11. How much was that hammered on by the press? Where were all these security experts then, or now? The true story may come out one day, but it won't be the whole story if the left does it.", 
        "threadID": "409192893_1580020812001", 
        "time": "2009-03-16 15:51:00", 
        "title": "The Culture Warriors Get Laid Off", 
        "userID": "herd173"
    }
]