[
    {
        "content": "Ooopsy! Let's see mock outrage, lying, private citizens threatened by politicians and death threats by others. And all smoke and mirrors. Geithner Aides Worked With AIG for Months on Bonuses 'http://online.wsj.com/article/SB123777083390610069.html' <edt>Since the fall, senior aides to Timothy Geithner have closely dealt with American International Group Inc. on compensation issues including bonuses, both from his time as president of the Federal Reserve Bank of New York and as Treasury secretary. The extent of their involvement, which wasn't widely known, raises fresh questions about whether Mr. Geithner could have known earlier about AIG's $165 million in bonus payments. When the bonuses sparked a political firestorm last week, Mr. Geithner said he learned about their full scope in early March, just days before they were paid. First he lied about taxes now this <edt> Treasury officials say the department's staff kept Mr. Geithner in the dark until March 10. \"Secretary Geithner, who has been actively engaged in shaping and executing the president's broad economic agenda, takes full responsibility for not being aware of these programs\" before that date, Treasury spokesman Isaac Baker said Sunday in a written response to questions. yeh ok, the buck stops with him This account of how Mr. Geithner and his aides were apprised of the AIG bonuses was based on interviews with government officials, lawmakers and congressional testimony. As New York Fed president, Mr. Geithner was central to AIG's initial $85 billion bailout in September, which was carried out in a tumultuous four-day period. After Edward Liddy took over as AIG chief executive, the company hired consultants to look at its payment plans around the world. One of Mr. Geithner's top bank supervisors at the New York Fed, Sarah Dahlgren, became the government's lead overseer of AIG. She sat in on AIG board meetings, joined at times by other top Fed staffers, and also participated in compensation-committee meetings. It isn't clear whether the issue rose to the board level until this month. AIG received an expanded government rescue in October and another in November, bringing the total to about $150 billion, including $40 billion in Treasury funds. In early November, the Fed, outside auditor Ernst & Young and AIG officials began examining through a committee the bonuses set to be paid to AIG's financial-products division, including those that sparked last week's furor. The committee concluded that the bonuses, which were in contracts signed before the government takeover, couldn't be legally blocked, according to a person familiar with the matter. The Obama administration has since agreed with that legal interpretation. AIG cited the retention plan in a public filing in early November, and Fed officials were aware AIG planned to pay $55 million in bonuses to financial-products employees the next month. Mr. Geithner remained involved in major AIG matters, seeking updates from Ms. Dahlgren and other top Fed staffers. He recused himself from dealing with aid to specific companies around the time of his Nov. 24 nomination as Treasury secretary. Fed officials declined to make Ms. Dahlgren available to comment on the bonus issue. Lawmakers were also scrutinizing AIG's operations. Some raised the matter of the AIG bonuses at a hearing in December where they grilled Neel Kashkari, a Bush Treasury official who remains at the department. In late January, news outlets reported that AIG planned a total of $450 million in bonuses to help retain employees winding down the complex trades in the unit at the heart of the company's collapse. In the weeks that followed, Mr. Liddy and other AIG officials briefed some lawmakers about the retention payments and other aspects of the AIG rescue. In other words congress knew On Feb. 28, as government officials worked on a fourth AIG bailout, the New York Federal Reserve Bank emailed Stephen Albrecht, a Treasury lawyer, laying out the AIG bonus issues and promising further detail, according to two people familiar with the email. Mr. Albrecht did not return a call seeking comment. It was an intense weekend, as Treasury and Fed officials frantically prepared to close the AIG deal. \"When we heard there was this executive compensation thing floating out there, we thought, 'We'll deal with this later,'\" said one Treasury official. On March 2, AIG announced both record losses and $30 billion in fresh Treasury aid. The following day, Mr. Geithner appeared at a hearing of the House Ways and Means Committee. Rep. Joseph Crowley, a New York Democrat, asked the secretary about more than $160 million in bonuses that AIG would be paying to financial-products employees \"in the coming weeks.\" Treasury officials say the AIG problem didn't register with Mr. Geithner at the hearing amid the other issues he faced. Mr. Baker, the Treasury spokesman, acknowledged that information about the financial-products bonuses was \"in the public arena...for many months.\" But, he said, it wasn't until March 10 -- five days before the big batch of retention payments were due -- that department staff spelled out the situation for the secretary. The following day, March 11, Mr. Geithner, alert to the potential political fallout, called Mr. Liddy to protest the bonus payouts. At a congressional hearing last week, Mr. Liddy described the call as \"open and frank.\" According to Mr. Liddy's sworn testimony from that hearing, Mr. Geithner indicated on the call that he had learned about the bonus \"situation about a week\" earlier. A Treasury spokeswoman said Mr. Liddy was \"wrong.\" An AIG spokeswoman said the CEO was passing on his impression from the conversation. \"If that impression was incorrect, he certainly defers to the Treasury secretary,\" she said. <edit> <edt>", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "Ooopsy! Let's see mock outrage, lying, private citizens threatened by politicians and death threats by others. And all smoke and mirrors. Geithner Aides Worked With AIG for Months on Bonuses 'http://online.wsj.com/article/SB123777083390610069.html' <edt>Since the fall, senior aides to Timothy Geithner have closely dealt with American International Group Inc. on compensation issues including bonuses, both from his time as president of the Federal Reserve Bank of New York and as Treasury secretary. The extent of their involvement, which wasn't widely known, raises fresh questions about whether Mr. Geithner could have known earlier about AIG's $165 million in bonus payments. When the bonuses sparked a political firestorm last week, Mr. Geithner said he learned about their full scope in early March, just days before they were paid. First he lied about taxes now this <edt> Treasury officials say the department's staff kept Mr. Geithner in the dark until March 10. \"Secretary Geithner, who has been actively engaged in shaping and executing the president's broad economic agenda, takes full responsibility for not being aware of these programs\" before that date, Treasury spokesman Isaac Baker said Sunday in a written response to questions. yeh ok, the buck stops with him This account of how Mr. Geithner and his aides were apprised of the AIG bonuses was based on interviews with government officials, lawmakers and congressional testimony. As New York Fed president, Mr. Geithner was central to AIG's initial $85 billion bailout in September, which was carried out in a tumultuous four-day period. After Edward Liddy took over as AIG chief executive, the company hired consultants to look at its payment plans around the world. One of Mr. Geithner's top bank supervisors at the New York Fed, Sarah Dahlgren, became the government's lead overseer of AIG. She sat in on AIG board meetings, joined at times by other top Fed staffers, and also participated in compensation-committee meetings. It isn't clear whether the issue rose to the board level until this month. AIG received an expanded government rescue in October and another in November, bringing the total to about $150 billion, including $40 billion in Treasury funds. In early November, the Fed, outside auditor Ernst & Young and AIG officials began examining through a committee the bonuses set to be paid to AIG's financial-products division, including those that sparked last week's furor. The committee concluded that the bonuses, which were in contracts signed before the government takeover, couldn't be legally blocked, according to a person familiar with the matter. The Obama administration has since agreed with that legal interpretation. AIG cited the retention plan in a public filing in early November, and Fed officials were aware AIG planned to pay $55 million in bonuses to financial-products employees the next month. Mr. Geithner remained involved in major AIG matters, seeking updates from Ms. Dahlgren and other top Fed staffers. He recused himself from dealing with aid to specific companies around the time of his Nov. 24 nomination as Treasury secretary. Fed officials declined to make Ms. Dahlgren available to comment on the bonus issue. Lawmakers were also scrutinizing AIG's operations. Some raised the matter of the AIG bonuses at a hearing in December where they grilled Neel Kashkari, a Bush Treasury official who remains at the department. In late January, news outlets reported that AIG planned a total of $450 million in bonuses to help retain employees winding down the complex trades in the unit at the heart of the company's collapse. In the weeks that followed, Mr. Liddy and other AIG officials briefed some lawmakers about the retention payments and other aspects of the AIG rescue. In other words congress knew On Feb. 28, as government officials worked on a fourth AIG bailout, the New York Federal Reserve Bank emailed Stephen Albrecht, a Treasury lawyer, laying out the AIG bonus issues and promising further detail, according to two people familiar with the email. Mr. Albrecht did not return a call seeking comment. It was an intense weekend, as Treasury and Fed officials frantically prepared to close the AIG deal. \"When we heard there was this executive compensation thing floating out there, we thought, 'We'll deal with this later,'\" said one Treasury official. On March 2, AIG announced both record losses and $30 billion in fresh Treasury aid. The following day, Mr. Geithner appeared at a hearing of the House Ways and Means Committee. Rep. Joseph Crowley, a New York Democrat, asked the secretary about more than $160 million in bonuses that AIG would be paying to financial-products employees \"in the coming weeks.\" Treasury officials say the AIG problem didn't register with Mr. Geithner at the hearing amid the other issues he faced. Mr. Baker, the Treasury spokesman, acknowledged that information about the financial-products bonuses was \"in the public arena...for many months.\" But, he said, it wasn't until March 10 -- five days before the big batch of retention payments were due -- that department staff spelled out the situation for the secretary. The following day, March 11, Mr. Geithner, alert to the potential political fallout, called Mr. Liddy to protest the bonus payouts. At a congressional hearing last week, Mr. Liddy described the call as \"open and frank.\" According to Mr. Liddy's sworn testimony from that hearing, Mr. Geithner indicated on the call that he had learned about the bonus \"situation about a week\" earlier. A Treasury spokeswoman said Mr. Liddy was \"wrong.\" An AIG spokeswoman said the CEO was passing on his impression from the conversation. \"If that impression was incorrect, he certainly defers to the Treasury secretary,\" she said. <edit> <edt>", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 08:13:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss.", 
        "intTime": 20090323, 
        "postID": 2, 
        "quote": "", 
        "reply": "I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 12:22:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss. NOW can we IMPEACH Obama?", 
        "intTime": 20090323, 
        "postID": 3, 
        "quote": "Originally posted by transport1: I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss.", 
        "reply": " NOW can we IMPEACH Obama?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 12:30:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "navy8086"
    }, 
    {
        "content": "I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "intTime": 20090323, 
        "postID": 4, 
        "quote": "", 
        "reply": "I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 12:33:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss. Agreed, but the secretary himself needs to top the list of those grilled. Hell, if he can't manage his staff how can he possibly manage the relationship between the government and the world of finance. His fitness for the position is clearly suspect as he does not have a handle on what is going on. A quote from his own department supports this: \"Treasury officials say the AIG problem didn't register with Mr. Geithner at the hearing amid the other issues he faced.\" He was pushed into the position on a wave of emotion that blurred his less than stellar attention to detail. It seems odd now that he should be expected to act any differently.", 
        "intTime": 20090323, 
        "postID": 5, 
        "quote": "Originally posted by transport1: I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss.", 
        "reply": " Agreed, but the secretary himself needs to top the list of those grilled. Hell, if he can't manage his staff how can he possibly manage the relationship between the government and the world of finance. His fitness for the position is clearly suspect as he does not have a handle on what is going on. A quote from his own department supports this: \"Treasury officials say the AIG problem didn't register with Mr. Geithner at the hearing amid the other issues he faced.\" He was pushed into the position on a wave of emotion that blurred his less than stellar attention to detail. It seems odd now that he should be expected to act any differently.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 13:02:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Unfortuantely were stuck with him for 4 years. There are only 3 ways he'll leave office early. Death (or severe illness). He's relatively young and health so ,,,, Impeachment, Not with all those Dems in charge. They'd NEVER vote to convict. That leaves resignation, and I thinks he's too arrogant for that", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "reply": " Unfortuantely were stuck with him for 4 years. There are only 3 ways he'll leave office early. Death (or severe illness). He's relatively young and health so ,,,, Impeachment, Not with all those Dems in charge. They'd NEVER vote to convict. That leaves resignation, and I thinks he's too arrogant for that", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 13:16:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "navy8086"
    }, 
    {
        "content": "Indeed, he'll never resign. Did you see Mr. Obama giggling like a school girl on 60 Min., prompting the question \"Are you punchdrunk?\" Frankly, I assumed that Mr. Obama, when faced with the realitiies of the world up close and personaal was enough of a pragmatist to adjust to the canter. BOY was I WRONG! Now we are in trouble!", 
        "intTime": 20090323, 
        "postID": 7, 
        "quote": "", 
        "reply": "Indeed, he'll never resign. Did you see Mr. Obama giggling like a school girl on 60 Min., prompting the question \"Are you punchdrunk?\" Frankly, I assumed that Mr. Obama, when faced with the realitiies of the world up close and personaal was enough of a pragmatist to adjust to the canter. BOY was I WRONG! Now we are in trouble!", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 13:25:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Obama?", 
        "intTime": 20090323, 
        "postID": 8, 
        "quote": "Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "reply": " Obama?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:03:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait.", 
        "intTime": 20090323, 
        "postID": 9, 
        "quote": "Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "reply": " Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:41:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Guys better be careful. Big brother is watching. Closer than ever before.", 
        "intTime": 20090323, 
        "postID": 10, 
        "quote": "Originally posted by dmuhler: Guys better be careful. Big brother is watching.", 
        "reply": " Closer than ever before.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:43:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait.", 
        "reply": " Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:45:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom. See my above post. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom.", 
        "reply": " See my above post. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:46:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation.", 
        "intTime": 20090323, 
        "postID": 13, 
        "quote": "", 
        "reply": "The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 15:45:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise.", 
        "intTime": 20090323, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change.", 
        "reply": " Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 15:46:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Guys better be careful. Big brother is watching. I thought that ended with the new eaqr of openness.", 
        "intTime": 20090323, 
        "postID": 15, 
        "quote": "Originally posted by dmuhler: Guys better be careful. Big brother is watching.", 
        "reply": " I thought that ended with the new eaqr of openness.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 15:48:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "threerings"
    }, 
    {
        "content": "The Dow had its 5th highest single point gain ever today, and the 20th highest percentage gain ever. If you aren't in this market you are missing out on the opportunity of a lifetime. I was holding Fannie Mae at an average of .59 a share until Thursday when I got rid of it for over 100% profit at $1.25. I bought it again Friday for .70 and it is back up to .85 at close today. I expect to sell it again this week over $1. Eventually it will level out and my plan is to build up to over 5,000 shares and hold it for a couple of years. That could easily be a $50,000 return on a $600 initial investment in 5 years. I bought Evergreen Energy (a clean coal company) in late January for .48, that has gone up almost every day since and closed at $1.36 today almost a 200% gain.", 
        "intTime": 20090323, 
        "postID": 16, 
        "quote": "", 
        "reply": "The Dow had its 5th highest single point gain ever today, and the 20th highest percentage gain ever. If you aren't in this market you are missing out on the opportunity of a lifetime. I was holding Fannie Mae at an average of .59 a share until Thursday when I got rid of it for over 100% profit at $1.25. I bought it again Friday for .70 and it is back up to .85 at close today. I expect to sell it again this week over $1. Eventually it will level out and my plan is to build up to over 5,000 shares and hold it for a couple of years. That could easily be a $50,000 return on a $600 initial investment in 5 years. I bought Evergreen Energy (a clean coal company) in late January for .48, that has gone up almost every day since and closed at $1.36 today almost a 200% gain.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:01:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by john2x: Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. Who in the pantheon of GOP villainy is \"the Jock sniffer\"?", 
        "intTime": 20090323, 
        "postID": 17, 
        "quote": "Originally posted by john2x: Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise.", 
        "reply": " Who in the pantheon of GOP villainy is \"the Jock sniffer\"?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:26:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. It's a fact that the only reason the market rallied today was because of the BAD investment Geithner is doing with our money. Nothing to do with Stimulus. And when the market is NOT at 10,000 or above, will you not be so partisan and call it like it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 18, 
        "quote": "Originally posted by john2x: quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise.", 
        "reply": " It's a fact that the only reason the market rallied today was because of the BAD investment Geithner is doing with our money. Nothing to do with Stimulus. And when the market is NOT at 10,000 or above, will you not be so partisan and call it like it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:32:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. Exactly, it's only a DAILY indicator. It doesn't predict our economy in the future. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 19, 
        "quote": "Originally posted by 10tenths: The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation.", 
        "reply": " Exactly, it's only a DAILY indicator. It doesn't predict our economy in the future. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:35:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom. It also lost 3 times that in the same time. Gee. People need to stop wanting it both ways. It was either Obama's fault the market tanks and now he is trying to correct it. Or Obama had nothing to do with the market tanking and nothing to do with it's rise as well. YOU can't have it BOTH ways. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 20, 
        "quote": "Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom.", 
        "reply": " It also lost 3 times that in the same time. Gee. People need to stop wanting it both ways. It was either Obama's fault the market tanks and now he is trying to correct it. Or Obama had nothing to do with the market tanking and nothing to do with it's rise as well. YOU can't have it BOTH ways. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:36:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "When it does finally come up (and, I mean a few thousand points and stays there) that is only a small first indicator. This current crisis had nothing to do with the stock market. Our other recessions involved the stock market more than this one is. Shoot, even the crash of '29 was the real cause of the Depression.", 
        "intTime": 20090323, 
        "postID": 21, 
        "quote": "", 
        "reply": "When it does finally come up (and, I mean a few thousand points and stays there) that is only a small first indicator. This current crisis had nothing to do with the stock market. Our other recessions involved the stock market more than this one is. Shoot, even the crash of '29 was the real cause of the Depression.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 17:11:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom. It also lost 3 times that in the same time. Gee. People need to stop wanting it both ways. It was either Obama's fault the market tanks and now he is trying to correct it. Or Obama had nothing to do with the market tanking and nothing to do with it's rise as well. YOU can't have it BOTH ways. Obama's correction much like the stimulus plan is a short sighted, small minded measure that may keep us afloat for a short time..but in the end only moves us deeper into the ocean.", 
        "intTime": 20090323, 
        "postID": 22, 
        "quote": "Originally posted by L0A1: quote: Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom. It also lost 3 times that in the same time. Gee. People need to stop wanting it both ways. It was either Obama's fault the market tanks and now he is trying to correct it. Or Obama had nothing to do with the market tanking and nothing to do with it's rise as well. YOU can't have it BOTH ways.", 
        "reply": " Obama's correction much like the stimulus plan is a short sighted, small minded measure that may keep us afloat for a short time..but in the end only moves us deeper into the ocean.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 17:15:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "threerings"
    }, 
    {
        "content": "10tenths Posted Mon 23 March 2009 03:45 PM The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. It sure does matter if you consider the size and impact on the world economy if we allowed AIG to fail. So now add 29 more companies like that with global tentacles and imagin the impact of the markets globaly. steady Up trends are a positive indicator,wild swings indicate panic and control. Manufactured Wars upset the balance and redistribute the wealth to the greedy.", 
        "intTime": 20090323, 
        "postID": 23, 
        "quote": "", 
        "reply": "10tenths Posted Mon 23 March 2009 03:45 PM The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. It sure does matter if you consider the size and impact on the world economy if we allowed AIG to fail. So now add 29 more companies like that with global tentacles and imagin the impact of the markets globaly. steady Up trends are a positive indicator,wild swings indicate panic and control. Manufactured Wars upset the balance and redistribute the wealth to the greedy.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 19:10:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by john2x: Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. Who in the pantheon of GOP villainy is \"the Jock sniffer\"? GWB commonly refered to at the TANG during his short stay there.", 
        "intTime": 20090323, 
        "postID": 24, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by john2x: Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. Who in the pantheon of GOP villainy is \"the Jock sniffer\"?", 
        "reply": " GWB commonly refered to at the TANG during his short stay there.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 19:16:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. It's a fact that the only reason the market rallied today was because of the BAD investment Geithner is doing with our money. Nothing to do with Stimulus. And when the market is NOT at 10,000 or above, will you not be so partisan and call it like it is? I am not partisan at all I didnt even vote for him Im just seeing whats happening. And it may not be the entire stimulous as described but its got to start some where and Id say the market was stimulated today and for the past few weeks so why look a gift horse in the mouth? Give him a chance othing else seemed to work so maybe hes smarter than all of us?", 
        "intTime": 20090323, 
        "postID": 25, 
        "quote": "Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. It's a fact that the only reason the market rallied today was because of the BAD investment Geithner is doing with our money. Nothing to do with Stimulus. And when the market is NOT at 10,000 or above, will you not be so partisan and call it like it is?", 
        "reply": " I am not partisan at all I didnt even vote for him Im just seeing whats happening. And it may not be the entire stimulous as described but its got to start some where and Id say the market was stimulated today and for the past few weeks so why look a gift horse in the mouth? Give him a chance othing else seemed to work so maybe hes smarter than all of us?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 19:24:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: 10tenths Posted Mon 23 March 2009 03:45 PM The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. It sure does matter if you consider the size and impact on the world economy if we allowed AIG to fail. So now add 29 more companies like that with global tentacles and imagin the impact of the markets globaly. steady Up trends are a positive indicator,wild swings indicate panic and control. Manufactured Wars upset the balance and redistribute the wealth to the greedy. The market and confidence in the market are not what the problem is. It is the fact that banks and financial institutions made a big bet on the housing market that tanked. They lost REAL capital, and they cannot keep their reserve, they have very little capital and their assets are illiquid. The market is a completely separate issue altogether. Stock prices have no impact on what is the real issue. Even the new plan that came out today doesn't do much to help the banks. The reason is that the assets that are going to be sold are still going to be sold at far less a value than what the banks had these things propped up to. So, they will still have that REAL capital loss. Basically, the plan will use taxpayer money to back the Wall Street investors, the hope is that the investors will be more inclined to bid on these assets (the toxic ones) and that will drive up the price. But, these assets are worthless and probably won't want to pay too much. If they do drive the price up we will see the same thing we saw before, artificially overpriced assets. But, this time, if they tank the taxpayer is on the hook. But, this is another issue for another thread. The point is that stocks and stock prices are not going to make the banks fill that void in capital. And, they will still be at 2-3% reserve. And, if their reserve is that low, they will not lend. You need to fix the banks first, then they can lend, then business can flow again. AIG is a totally different matter. The only reason why they matter at all is that they hold all of the CDSs that many of the financial institutions bought to insure their mortgage derivatives. So, if AIG goes down, then just about every major bank on the planet will have negative reserve and cease to exist. This message has been edited. Last edited by: 10Tenths, Mon 23 March 2009 08:45 PM", 
        "intTime": 20090323, 
        "postID": 26, 
        "quote": "Originally posted by john2x: 10tenths Posted Mon 23 March 2009 03:45 PM The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. It sure does matter if you consider the size and impact on the world economy if we allowed AIG to fail. So now add 29 more companies like that with global tentacles and imagin the impact of the markets globaly. steady Up trends are a positive indicator,wild swings indicate panic and control. Manufactured Wars upset the balance and redistribute the wealth to the greedy.", 
        "reply": " The market and confidence in the market are not what the problem is. It is the fact that banks and financial institutions made a big bet on the housing market that tanked. They lost REAL capital, and they cannot keep their reserve, they have very little capital and their assets are illiquid. The market is a completely separate issue altogether. Stock prices have no impact on what is the real issue. Even the new plan that came out today doesn't do much to help the banks. The reason is that the assets that are going to be sold are still going to be sold at far less a value than what the banks had these things propped up to. So, they will still have that REAL capital loss. Basically, the plan will use taxpayer money to back the Wall Street investors, the hope is that the investors will be more inclined to bid on these assets (the toxic ones) and that will drive up the price. But, these assets are worthless and probably won't want to pay too much. If they do drive the price up we will see the same thing we saw before, artificially overpriced assets. But, this time, if they tank the taxpayer is on the hook. But, this is another issue for another thread. The point is that stocks and stock prices are not going to make the banks fill that void in capital. And, they will still be at 2-3% reserve. And, if their reserve is that low, they will not lend. You need to fix the banks first, then they can lend, then business can flow again. AIG is a totally different matter. The only reason why they matter at all is that they hold all of the CDSs that many of the financial institutions bought to insure their mortgage derivatives. So, if AIG goes down, then just about every major bank on the planet will have negative reserve and cease to exist. This message has been edited. Last edited by: 10Tenths, Mon 23 March 2009 08:45 PM", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 20:11:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "10Tenths"
    }, 
    {
        "content": "On this evenings news there was a report, most of the execs at AIG are giving the money back! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090323, 
        "postID": 27, 
        "quote": "", 
        "reply": "On this evenings news there was a report, most of the execs at AIG are giving the money back! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 20:24:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Ooopsy! Let's see mock outrage, lying, private citizens threatened by politicians and death threats by others. And all smoke and mirrors. Geithner Aides Worked With AIG for Months on Bonuses 'http://online.wsj.com/article/SB123777083390610069.html' <edt>Since the fall, senior aides to Timothy Geithner have closely dealt with American International Group Inc. on compensation issues including bonuses, both from his time as president of the Federal Reserve Bank of New York and as Treasury secretary. The extent of their involvement, which wasn't widely known, raises fresh questions about whether Mr. Geithner could have known earlier about AIG's $165 million in bonus payments. When the bonuses sparked a political firestorm last week, Mr. Geithner said he learned about their full scope in early March, just days before they were paid. First he lied about taxes now this <edt> Treasury officials say the department's staff kept Mr. Geithner in the dark until March 10. \"Secretary Geithner, who has been actively engaged in shaping and executing the president's broad economic agenda, takes full responsibility for not being aware of these programs\" before that date, Treasury spokesman Isaac Baker said Sunday in a written response to questions. yeh ok, the buck stops with him This account of how Mr. Geithner and his aides were apprised of the AIG bonuses was based on interviews with government officials, lawmakers and congressional testimony. As New York Fed president, Mr. Geithner was central to AIG's initial $85 billion bailout in September, which was carried out in a tumultuous four-day period. After Edward Liddy took over as AIG chief executive, the company hired consultants to look at its payment plans around the world. One of Mr. Geithner's top bank supervisors at the New York Fed, Sarah Dahlgren, became the government's lead overseer of AIG. She sat in on AIG board meetings, joined at times by other top Fed staffers, and also participated in compensation-committee meetings. It isn't clear whether the issue rose to the board level until this month. AIG received an expanded government rescue in October and another in November, bringing the total to about $150 billion, including $40 billion in Treasury funds. In early November, the Fed, outside auditor Ernst & Young and AIG officials began examining through a committee the bonuses set to be paid to AIG's financial-products division, including those that sparked last week's furor. The committee concluded that the bonuses, which were in contracts signed before the government takeover, couldn't be legally blocked, according to a person familiar with the matter. The Obama administration has since agreed with that legal interpretation. AIG cited the retention plan in a public filing in early November, and Fed officials were aware AIG planned to pay $55 million in bonuses to financial-products employees the next month. Mr. Geithner remained involved in major AIG matters, seeking updates from Ms. Dahlgren and other top Fed staffers. He recused himself from dealing with aid to specific companies around the time of his Nov. 24 nomination as Treasury secretary. Fed officials declined to make Ms. Dahlgren available to comment on the bonus issue. Lawmakers were also scrutinizing AIG's operations. Some raised the matter of the AIG bonuses at a hearing in December where they grilled Neel Kashkari, a Bush Treasury official who remains at the department. In late January, news outlets reported that AIG planned a total of $450 million in bonuses to help retain employees winding down the complex trades in the unit at the heart of the company's collapse. In the weeks that followed, Mr. Liddy and other AIG officials briefed some lawmakers about the retention payments and other aspects of the AIG rescue. In other words congress knew On Feb. 28, as government officials worked on a fourth AIG bailout, the New York Federal Reserve Bank emailed Stephen Albrecht, a Treasury lawyer, laying out the AIG bonus issues and promising further detail, according to two people familiar with the email. Mr. Albrecht did not return a call seeking comment. It was an intense weekend, as Treasury and Fed officials frantically prepared to close the AIG deal. \"When we heard there was this executive compensation thing floating out there, we thought, 'We'll deal with this later,'\" said one Treasury official. On March 2, AIG announced both record losses and $30 billion in fresh Treasury aid. The following day, Mr. Geithner appeared at a hearing of the House Ways and Means Committee. Rep. Joseph Crowley, a New York Democrat, asked the secretary about more than $160 million in bonuses that AIG would be paying to financial-products employees \"in the coming weeks.\" Treasury officials say the AIG problem didn't register with Mr. Geithner at the hearing amid the other issues he faced. Mr. Baker, the Treasury spokesman, acknowledged that information about the financial-products bonuses was \"in the public arena...for many months.\" But, he said, it wasn't until March 10 -- five days before the big batch of retention payments were due -- that department staff spelled out the situation for the secretary. The following day, March 11, Mr. Geithner, alert to the potential political fallout, called Mr. Liddy to protest the bonus payouts. At a congressional hearing last week, Mr. Liddy described the call as \"open and frank.\" According to Mr. Liddy's sworn testimony from that hearing, Mr. Geithner indicated on the call that he had learned about the bonus \"situation about a week\" earlier. A Treasury spokeswoman said Mr. Liddy was \"wrong.\" An AIG spokeswoman said the CEO was passing on his impression from the conversation. \"If that impression was incorrect, he certainly defers to the Treasury secretary,\" she said. <edit> <edt>", 
        "intTime": 20090323, 
        "postID": 28, 
        "quote": "", 
        "reply": "Ooopsy! Let's see mock outrage, lying, private citizens threatened by politicians and death threats by others. And all smoke and mirrors. Geithner Aides Worked With AIG for Months on Bonuses 'http://online.wsj.com/article/SB123777083390610069.html' <edt>Since the fall, senior aides to Timothy Geithner have closely dealt with American International Group Inc. on compensation issues including bonuses, both from his time as president of the Federal Reserve Bank of New York and as Treasury secretary. The extent of their involvement, which wasn't widely known, raises fresh questions about whether Mr. Geithner could have known earlier about AIG's $165 million in bonus payments. When the bonuses sparked a political firestorm last week, Mr. Geithner said he learned about their full scope in early March, just days before they were paid. First he lied about taxes now this <edt> Treasury officials say the department's staff kept Mr. Geithner in the dark until March 10. \"Secretary Geithner, who has been actively engaged in shaping and executing the president's broad economic agenda, takes full responsibility for not being aware of these programs\" before that date, Treasury spokesman Isaac Baker said Sunday in a written response to questions. yeh ok, the buck stops with him This account of how Mr. Geithner and his aides were apprised of the AIG bonuses was based on interviews with government officials, lawmakers and congressional testimony. As New York Fed president, Mr. Geithner was central to AIG's initial $85 billion bailout in September, which was carried out in a tumultuous four-day period. After Edward Liddy took over as AIG chief executive, the company hired consultants to look at its payment plans around the world. One of Mr. Geithner's top bank supervisors at the New York Fed, Sarah Dahlgren, became the government's lead overseer of AIG. She sat in on AIG board meetings, joined at times by other top Fed staffers, and also participated in compensation-committee meetings. It isn't clear whether the issue rose to the board level until this month. AIG received an expanded government rescue in October and another in November, bringing the total to about $150 billion, including $40 billion in Treasury funds. In early November, the Fed, outside auditor Ernst & Young and AIG officials began examining through a committee the bonuses set to be paid to AIG's financial-products division, including those that sparked last week's furor. The committee concluded that the bonuses, which were in contracts signed before the government takeover, couldn't be legally blocked, according to a person familiar with the matter. The Obama administration has since agreed with that legal interpretation. AIG cited the retention plan in a public filing in early November, and Fed officials were aware AIG planned to pay $55 million in bonuses to financial-products employees the next month. Mr. Geithner remained involved in major AIG matters, seeking updates from Ms. Dahlgren and other top Fed staffers. He recused himself from dealing with aid to specific companies around the time of his Nov. 24 nomination as Treasury secretary. Fed officials declined to make Ms. Dahlgren available to comment on the bonus issue. Lawmakers were also scrutinizing AIG's operations. Some raised the matter of the AIG bonuses at a hearing in December where they grilled Neel Kashkari, a Bush Treasury official who remains at the department. In late January, news outlets reported that AIG planned a total of $450 million in bonuses to help retain employees winding down the complex trades in the unit at the heart of the company's collapse. In the weeks that followed, Mr. Liddy and other AIG officials briefed some lawmakers about the retention payments and other aspects of the AIG rescue. In other words congress knew On Feb. 28, as government officials worked on a fourth AIG bailout, the New York Federal Reserve Bank emailed Stephen Albrecht, a Treasury lawyer, laying out the AIG bonus issues and promising further detail, according to two people familiar with the email. Mr. Albrecht did not return a call seeking comment. It was an intense weekend, as Treasury and Fed officials frantically prepared to close the AIG deal. \"When we heard there was this executive compensation thing floating out there, we thought, 'We'll deal with this later,'\" said one Treasury official. On March 2, AIG announced both record losses and $30 billion in fresh Treasury aid. The following day, Mr. Geithner appeared at a hearing of the House Ways and Means Committee. Rep. Joseph Crowley, a New York Democrat, asked the secretary about more than $160 million in bonuses that AIG would be paying to financial-products employees \"in the coming weeks.\" Treasury officials say the AIG problem didn't register with Mr. Geithner at the hearing amid the other issues he faced. Mr. Baker, the Treasury spokesman, acknowledged that information about the financial-products bonuses was \"in the public arena...for many months.\" But, he said, it wasn't until March 10 -- five days before the big batch of retention payments were due -- that department staff spelled out the situation for the secretary. The following day, March 11, Mr. Geithner, alert to the potential political fallout, called Mr. Liddy to protest the bonus payouts. At a congressional hearing last week, Mr. Liddy described the call as \"open and frank.\" According to Mr. Liddy's sworn testimony from that hearing, Mr. Geithner indicated on the call that he had learned about the bonus \"situation about a week\" earlier. A Treasury spokeswoman said Mr. Liddy was \"wrong.\" An AIG spokeswoman said the CEO was passing on his impression from the conversation. \"If that impression was incorrect, he certainly defers to the Treasury secretary,\" she said. <edit> <edt>", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 08:13:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss.", 
        "intTime": 20090323, 
        "postID": 29, 
        "quote": "", 
        "reply": "I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 12:22:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss. NOW can we IMPEACH Obama?", 
        "intTime": 20090323, 
        "postID": 30, 
        "quote": "Originally posted by transport1: I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss.", 
        "reply": " NOW can we IMPEACH Obama?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 12:30:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "navy8086"
    }, 
    {
        "content": "I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "intTime": 20090323, 
        "postID": 31, 
        "quote": "", 
        "reply": "I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 12:33:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by transport1: I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss. Agreed, but the secretary himself needs to top the list of those grilled. Hell, if he can't manage his staff how can he possibly manage the relationship between the government and the world of finance. His fitness for the position is clearly suspect as he does not have a handle on what is going on. A quote from his own department supports this: \"Treasury officials say the AIG problem didn't register with Mr. Geithner at the hearing amid the other issues he faced.\" He was pushed into the position on a wave of emotion that blurred his less than stellar attention to detail. It seems odd now that he should be expected to act any differently.", 
        "intTime": 20090323, 
        "postID": 32, 
        "quote": "Originally posted by transport1: I think these aides, who worked all hush hush on this and didn't inform thier boss, needs to be grilled by congress. Then we could find out how they went without telling their boss.", 
        "reply": " Agreed, but the secretary himself needs to top the list of those grilled. Hell, if he can't manage his staff how can he possibly manage the relationship between the government and the world of finance. His fitness for the position is clearly suspect as he does not have a handle on what is going on. A quote from his own department supports this: \"Treasury officials say the AIG problem didn't register with Mr. Geithner at the hearing amid the other issues he faced.\" He was pushed into the position on a wave of emotion that blurred his less than stellar attention to detail. It seems odd now that he should be expected to act any differently.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 13:02:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Unfortuantely were stuck with him for 4 years. There are only 3 ways he'll leave office early. Death (or severe illness). He's relatively young and health so ,,,, Impeachment, Not with all those Dems in charge. They'd NEVER vote to convict. That leaves resignation, and I thinks he's too arrogant for that", 
        "intTime": 20090323, 
        "postID": 33, 
        "quote": "Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "reply": " Unfortuantely were stuck with him for 4 years. There are only 3 ways he'll leave office early. Death (or severe illness). He's relatively young and health so ,,,, Impeachment, Not with all those Dems in charge. They'd NEVER vote to convict. That leaves resignation, and I thinks he's too arrogant for that", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 13:16:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "navy8086"
    }, 
    {
        "content": "Indeed, he'll never resign. Did you see Mr. Obama giggling like a school girl on 60 Min., prompting the question \"Are you punchdrunk?\" Frankly, I assumed that Mr. Obama, when faced with the realitiies of the world up close and personaal was enough of a pragmatist to adjust to the canter. BOY was I WRONG! Now we are in trouble!", 
        "intTime": 20090323, 
        "postID": 34, 
        "quote": "", 
        "reply": "Indeed, he'll never resign. Did you see Mr. Obama giggling like a school girl on 60 Min., prompting the question \"Are you punchdrunk?\" Frankly, I assumed that Mr. Obama, when faced with the realitiies of the world up close and personaal was enough of a pragmatist to adjust to the canter. BOY was I WRONG! Now we are in trouble!", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 13:25:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Obama?", 
        "intTime": 20090323, 
        "postID": 35, 
        "quote": "Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "reply": " Obama?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:03:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait.", 
        "intTime": 20090323, 
        "postID": 36, 
        "quote": "Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office?", 
        "reply": " Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:41:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Guys better be careful. Big brother is watching. Closer than ever before.", 
        "intTime": 20090323, 
        "postID": 37, 
        "quote": "Originally posted by dmuhler: Guys better be careful. Big brother is watching.", 
        "reply": " Closer than ever before.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:43:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 38, 
        "quote": "Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait.", 
        "reply": " Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:45:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom. See my above post. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 39, 
        "quote": "Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom.", 
        "reply": " See my above post. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 14:46:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation.", 
        "intTime": 20090323, 
        "postID": 40, 
        "quote": "", 
        "reply": "The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 15:45:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise.", 
        "intTime": 20090323, 
        "postID": 41, 
        "quote": "Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change.", 
        "reply": " Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 15:46:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Guys better be careful. Big brother is watching. I thought that ended with the new eaqr of openness.", 
        "intTime": 20090323, 
        "postID": 42, 
        "quote": "Originally posted by dmuhler: Guys better be careful. Big brother is watching.", 
        "reply": " I thought that ended with the new eaqr of openness.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 15:48:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "threerings"
    }, 
    {
        "content": "The Dow had its 5th highest single point gain ever today, and the 20th highest percentage gain ever. If you aren't in this market you are missing out on the opportunity of a lifetime. I was holding Fannie Mae at an average of .59 a share until Thursday when I got rid of it for over 100% profit at $1.25. I bought it again Friday for .70 and it is back up to .85 at close today. I expect to sell it again this week over $1. Eventually it will level out and my plan is to build up to over 5,000 shares and hold it for a couple of years. That could easily be a $50,000 return on a $600 initial investment in 5 years. I bought Evergreen Energy (a clean coal company) in late January for .48, that has gone up almost every day since and closed at $1.36 today almost a 200% gain.", 
        "intTime": 20090323, 
        "postID": 43, 
        "quote": "", 
        "reply": "The Dow had its 5th highest single point gain ever today, and the 20th highest percentage gain ever. If you aren't in this market you are missing out on the opportunity of a lifetime. I was holding Fannie Mae at an average of .59 a share until Thursday when I got rid of it for over 100% profit at $1.25. I bought it again Friday for .70 and it is back up to .85 at close today. I expect to sell it again this week over $1. Eventually it will level out and my plan is to build up to over 5,000 shares and hold it for a couple of years. That could easily be a $50,000 return on a $600 initial investment in 5 years. I bought Evergreen Energy (a clean coal company) in late January for .48, that has gone up almost every day since and closed at $1.36 today almost a 200% gain.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:01:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by john2x: Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. Who in the pantheon of GOP villainy is \"the Jock sniffer\"?", 
        "intTime": 20090323, 
        "postID": 44, 
        "quote": "Originally posted by john2x: Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise.", 
        "reply": " Who in the pantheon of GOP villainy is \"the Jock sniffer\"?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:26:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by john2x: quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. It's a fact that the only reason the market rallied today was because of the BAD investment Geithner is doing with our money. Nothing to do with Stimulus. And when the market is NOT at 10,000 or above, will you not be so partisan and call it like it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 45, 
        "quote": "Originally posted by john2x: quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise.", 
        "reply": " It's a fact that the only reason the market rallied today was because of the BAD investment Geithner is doing with our money. Nothing to do with Stimulus. And when the market is NOT at 10,000 or above, will you not be so partisan and call it like it is? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:32:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. Exactly, it's only a DAILY indicator. It doesn't predict our economy in the future. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 46, 
        "quote": "Originally posted by 10tenths: The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation.", 
        "reply": " Exactly, it's only a DAILY indicator. It doesn't predict our economy in the future. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:35:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom. It also lost 3 times that in the same time. Gee. People need to stop wanting it both ways. It was either Obama's fault the market tanks and now he is trying to correct it. Or Obama had nothing to do with the market tanking and nothing to do with it's rise as well. YOU can't have it BOTH ways. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 47, 
        "quote": "Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom.", 
        "reply": " It also lost 3 times that in the same time. Gee. People need to stop wanting it both ways. It was either Obama's fault the market tanks and now he is trying to correct it. Or Obama had nothing to do with the market tanking and nothing to do with it's rise as well. YOU can't have it BOTH ways. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 16:36:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "L0A1"
    }, 
    {
        "content": "When it does finally come up (and, I mean a few thousand points and stays there) that is only a small first indicator. This current crisis had nothing to do with the stock market. Our other recessions involved the stock market more than this one is. Shoot, even the crash of '29 was the real cause of the Depression.", 
        "intTime": 20090323, 
        "postID": 48, 
        "quote": "", 
        "reply": "When it does finally come up (and, I mean a few thousand points and stays there) that is only a small first indicator. This current crisis had nothing to do with the stock market. Our other recessions involved the stock market more than this one is. Shoot, even the crash of '29 was the real cause of the Depression.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 17:11:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom. It also lost 3 times that in the same time. Gee. People need to stop wanting it both ways. It was either Obama's fault the market tanks and now he is trying to correct it. Or Obama had nothing to do with the market tanking and nothing to do with it's rise as well. YOU can't have it BOTH ways. Obama's correction much like the stimulus plan is a short sighted, small minded measure that may keep us afloat for a short time..but in the end only moves us deeper into the ocean.", 
        "intTime": 20090323, 
        "postID": 49, 
        "quote": "Originally posted by L0A1: quote: Originally posted by dmuhler: Over 1000 points in just a few weeks. Looks like no one is listening to the party of Doom. It also lost 3 times that in the same time. Gee. People need to stop wanting it both ways. It was either Obama's fault the market tanks and now he is trying to correct it. Or Obama had nothing to do with the market tanking and nothing to do with it's rise as well. YOU can't have it BOTH ways.", 
        "reply": " Obama's correction much like the stimulus plan is a short sighted, small minded measure that may keep us afloat for a short time..but in the end only moves us deeper into the ocean.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 17:15:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "threerings"
    }, 
    {
        "content": "10tenths Posted Mon 23 March 2009 03:45 PM The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. It sure does matter if you consider the size and impact on the world economy if we allowed AIG to fail. So now add 29 more companies like that with global tentacles and imagin the impact of the markets globaly. steady Up trends are a positive indicator,wild swings indicate panic and control. Manufactured Wars upset the balance and redistribute the wealth to the greedy.", 
        "intTime": 20090323, 
        "postID": 50, 
        "quote": "", 
        "reply": "10tenths Posted Mon 23 March 2009 03:45 PM The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. It sure does matter if you consider the size and impact on the world economy if we allowed AIG to fail. So now add 29 more companies like that with global tentacles and imagin the impact of the markets globaly. steady Up trends are a positive indicator,wild swings indicate panic and control. Manufactured Wars upset the balance and redistribute the wealth to the greedy.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 19:10:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by john2x: Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. Who in the pantheon of GOP villainy is \"the Jock sniffer\"? GWB commonly refered to at the TANG during his short stay there.", 
        "intTime": 20090323, 
        "postID": 51, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by john2x: Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. Who in the pantheon of GOP villainy is \"the Jock sniffer\"?", 
        "reply": " GWB commonly refered to at the TANG during his short stay there.", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 19:16:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. It's a fact that the only reason the market rallied today was because of the BAD investment Geithner is doing with our money. Nothing to do with Stimulus. And when the market is NOT at 10,000 or above, will you not be so partisan and call it like it is? I am not partisan at all I didnt even vote for him Im just seeing whats happening. And it may not be the entire stimulous as described but its got to start some where and Id say the market was stimulated today and for the past few weeks so why look a gift horse in the mouth? Give him a chance othing else seemed to work so maybe hes smarter than all of us?", 
        "intTime": 20090323, 
        "postID": 52, 
        "quote": "Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by L0A1: quote: Originally posted by john2x: quote: Originally posted by transport1: I said it before, I'll ask it again - anybody think he's gonna make it past his second year in office? Sure looked like there was a lot of confidence in his plan today as the investors got back in the game and drove the market up big time. Now tommorow will tell better if we see a steep sell off from the profit takers. I dont think so a small one would be expected and normal a large one would indicate the fear is still there. So now we wait. Oh you mean the same market the President Obama and Geithner said they don't care about? LOL, wow. I guess some can have it both ways. Don't take credit when it dumps, take credit when the market does well. BTW: Of course the market is going to react positively if we the people are about to buy toxic assests that will never make money. That will open up the greed in Wall Street to go back to exactly what they were doing before the recession. AGAIN, so much for Change. Well if they didnt have confidence why would the people buy the bad debt? Just cant accept the fact that a Dem is making it happen and a lot faster then we thought. People are gaining the confidence that will lead us out of the mess No matter how unconventional it appears in these unconventional times. This time next year the market will be over 10,000 points and the arrogant repbs will be licking thier wounds, wondering if they will ever get back in power. And they can thank the Jock sniffer for thier demise. It's a fact that the only reason the market rallied today was because of the BAD investment Geithner is doing with our money. Nothing to do with Stimulus. And when the market is NOT at 10,000 or above, will you not be so partisan and call it like it is?", 
        "reply": " I am not partisan at all I didnt even vote for him Im just seeing whats happening. And it may not be the entire stimulous as described but its got to start some where and Id say the market was stimulated today and for the past few weeks so why look a gift horse in the mouth? Give him a chance othing else seemed to work so maybe hes smarter than all of us?", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 19:24:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: 10tenths Posted Mon 23 March 2009 03:45 PM The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. It sure does matter if you consider the size and impact on the world economy if we allowed AIG to fail. So now add 29 more companies like that with global tentacles and imagin the impact of the markets globaly. steady Up trends are a positive indicator,wild swings indicate panic and control. Manufactured Wars upset the balance and redistribute the wealth to the greedy. The market and confidence in the market are not what the problem is. It is the fact that banks and financial institutions made a big bet on the housing market that tanked. They lost REAL capital, and they cannot keep their reserve, they have very little capital and their assets are illiquid. The market is a completely separate issue altogether. Stock prices have no impact on what is the real issue. Even the new plan that came out today doesn't do much to help the banks. The reason is that the assets that are going to be sold are still going to be sold at far less a value than what the banks had these things propped up to. So, they will still have that REAL capital loss. Basically, the plan will use taxpayer money to back the Wall Street investors, the hope is that the investors will be more inclined to bid on these assets (the toxic ones) and that will drive up the price. But, these assets are worthless and probably won't want to pay too much. If they do drive the price up we will see the same thing we saw before, artificially overpriced assets. But, this time, if they tank the taxpayer is on the hook. But, this is another issue for another thread. The point is that stocks and stock prices are not going to make the banks fill that void in capital. And, they will still be at 2-3% reserve. And, if their reserve is that low, they will not lend. You need to fix the banks first, then they can lend, then business can flow again. AIG is a totally different matter. The only reason why they matter at all is that they hold all of the CDSs that many of the financial institutions bought to insure their mortgage derivatives. So, if AIG goes down, then just about every major bank on the planet will have negative reserve and cease to exist. This message has been edited. Last edited by: 10Tenths, Mon 23 March 2009 08:45 PM", 
        "intTime": 20090323, 
        "postID": 53, 
        "quote": "Originally posted by john2x: 10tenths Posted Mon 23 March 2009 03:45 PM The Dow is only a tiny portion of our entire economy. It is only a composite of 30 companies. Also, the market isn't the cause, it was only one of the many symptoms of our current situation. I am happy it went up, but I am also realistic in that it is not a significant indicator of anything in regard to our economy in our current situation. It sure does matter if you consider the size and impact on the world economy if we allowed AIG to fail. So now add 29 more companies like that with global tentacles and imagin the impact of the markets globaly. steady Up trends are a positive indicator,wild swings indicate panic and control. Manufactured Wars upset the balance and redistribute the wealth to the greedy.", 
        "reply": " The market and confidence in the market are not what the problem is. It is the fact that banks and financial institutions made a big bet on the housing market that tanked. They lost REAL capital, and they cannot keep their reserve, they have very little capital and their assets are illiquid. The market is a completely separate issue altogether. Stock prices have no impact on what is the real issue. Even the new plan that came out today doesn't do much to help the banks. The reason is that the assets that are going to be sold are still going to be sold at far less a value than what the banks had these things propped up to. So, they will still have that REAL capital loss. Basically, the plan will use taxpayer money to back the Wall Street investors, the hope is that the investors will be more inclined to bid on these assets (the toxic ones) and that will drive up the price. But, these assets are worthless and probably won't want to pay too much. If they do drive the price up we will see the same thing we saw before, artificially overpriced assets. But, this time, if they tank the taxpayer is on the hook. But, this is another issue for another thread. The point is that stocks and stock prices are not going to make the banks fill that void in capital. And, they will still be at 2-3% reserve. And, if their reserve is that low, they will not lend. You need to fix the banks first, then they can lend, then business can flow again. AIG is a totally different matter. The only reason why they matter at all is that they hold all of the CDSs that many of the financial institutions bought to insure their mortgage derivatives. So, if AIG goes down, then just about every major bank on the planet will have negative reserve and cease to exist. This message has been edited. Last edited by: 10Tenths, Mon 23 March 2009 08:45 PM", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 20:11:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "10Tenths"
    }, 
    {
        "content": "On this evenings news there was a report, most of the execs at AIG are giving the money back! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090323, 
        "postID": 54, 
        "quote": "", 
        "reply": "On this evenings news there was a report, most of the execs at AIG are giving the money back! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "409192893_7600056812001", 
        "time": "2009-03-23 20:24:00", 
        "title": "Geithner Aides Worked With AIG for Months on Bonuses", 
        "userID": "Bergy46"
    }
]