[
    {
        "content": "quote: (CNN) — Has public opinion shifted on gun control? Yes. And in a very surprising way. Binghamton . . . Pittsburgh . . . Oakland . . . Samson, Alabama . . . Carthage, North Carolina . . . sensational incidents of gun violence all over the country. Are we seeing an impact on public opinion? Since 2001, a majority of Americans has favored stricter gun laws. Though support has been trending slightly down. Eight years ago, 54 percent of Americans wanted stricter gun laws compared to 50 percent in 2007, according to a Gallup poll. And now? A sharp, sudden drop. Only 39 percent of Americans now favor stricter gun laws. Gun control should still be enforced, however, we need to expand concealed weapons rights, thats the key. Let qualified people carry weapons if they choose too. In california the Police Unions have ruined everyones right to carry weapons. They keep on crying about how they volunteered for a dangerous job", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "(CNN) — Has public opinion shifted on gun control? Yes. And in a very surprising way. Binghamton . . . Pittsburgh . . . Oakland . . . Samson, Alabama . . . Carthage, North Carolina . . . sensational incidents of gun violence all over the country. Are we seeing an impact on public opinion? Since 2001, a majority of Americans has favored stricter gun laws. Though support has been trending slightly down. Eight years ago, 54 percent of Americans wanted stricter gun laws compared to 50 percent in 2007, according to a Gallup poll. And now? A sharp, sudden drop. Only 39 percent of Americans now favor stricter gun laws.", 
        "reply": " Gun control should still be enforced, however, we need to expand concealed weapons rights, thats the key. Let qualified people carry weapons if they choose too. In california the Police Unions have ruined everyones right to carry weapons. They keep on crying about how they volunteered for a dangerous job", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 15:54:00", 
        "title": "They took my guns!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma", 
        "intTime": 20090408, 
        "postID": 2, 
        "quote": "", 
        "reply": "Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 16:56:00", 
        "title": "They took my guns!!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "\"The right of the people to keep and bear arms shall not be infringed.\" (2A) \"The Second Amendment extends prima facie to all instruments that constitute bearable arms. The Amendment recognizes the pre-existance of the right and declares only that it shall not be infringed.\" (SCJ Anthony Scalia 2008) Open Carry is recognized in 44 States. Arizona being among them. Rights do not require permit, license or qualifications. \"An armed society is a polite society\" (Robt A. Heinlien)", 
        "intTime": 20090408, 
        "postID": 3, 
        "quote": "", 
        "reply": "\"The right of the people to keep and bear arms shall not be infringed.\" (2A) \"The Second Amendment extends prima facie to all instruments that constitute bearable arms. The Amendment recognizes the pre-existance of the right and declares only that it shall not be infringed.\" (SCJ Anthony Scalia 2008) Open Carry is recognized in 44 States. Arizona being among them. Rights do not require permit, license or qualifications. \"An armed society is a polite society\" (Robt A. Heinlien)", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 17:09:00", 
        "title": "They took my guns!!", 
        "userID": "RoofRatOrdie"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time", 
        "intTime": 20090408, 
        "postID": 4, 
        "quote": "Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma", 
        "reply": " Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 17:26:00", 
        "title": "They took my guns!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Take guns away from everyone. Then when ever a crime is committed using a gun it will be an automatic beheading shown on Fox news.", 
        "intTime": 20090408, 
        "postID": 5, 
        "quote": "", 
        "reply": "Take guns away from everyone. Then when ever a crime is committed using a gun it will be an automatic beheading shown on Fox news.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 17:26:00", 
        "title": "They took my guns!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Take guns away from everyone. Then when ever a crime is committed using a gun it will be an automatic beheading shown on Fox news. Thanks Duster... I just had Bud Lite Lime spewing out my nose!!!!! You BASTAGE!!!! LOL", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "Originally posted by Duster6: Take guns away from everyone. Then when ever a crime is committed using a gun it will be an automatic beheading shown on Fox news.", 
        "reply": " Thanks Duster... I just had Bud Lite Lime spewing out my nose!!!!! You BASTAGE!!!! LOL", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 17:38:00", 
        "title": "They took my guns!!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Hi Woody, Sorry. You take care now. Be well.", 
        "intTime": 20090408, 
        "postID": 7, 
        "quote": "", 
        "reply": "Hi Woody, Sorry. You take care now. Be well.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 19:58:00", 
        "title": "They took my guns!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "Duster: Your punishment doen't extend to the criminals does it? The poor misunderstood dudes who have 2 murders and ag assaults to their credit, they shouldn't be punished they are only the product of a horrible society. Punish only those who are trying to defend themselves or others. The new order cometh.", 
        "intTime": 20090408, 
        "postID": 8, 
        "quote": "", 
        "reply": "Duster: Your punishment doen't extend to the criminals does it? The poor misunderstood dudes who have 2 murders and ag assaults to their credit, they shouldn't be punished they are only the product of a horrible society. Punish only those who are trying to defend themselves or others. The new order cometh.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 19:59:00", 
        "title": "They took my guns!!", 
        "userID": "OldDoc"
    }, 
    {
        "content": "Granades !!....They took my Wille Pete..He`s been my friend For eva !!...It`s not a firearm.... Sure it`s conceled but If no-one knows I have it...How can I be a Threat ?? I tried to get a gun but they saw my Howitzer and said that I might not be able to handle myself when a criminal pulled his knife. As stupid as that sounds,...You`ve got to be even more stupid if you think that not allowing law abiding citizens to carry, own, and regulate the use of the one thing that gives the common criminal an extreme edge over societys` security,...is justifiable !! If you don`t agree,..You`re prolly part of a long, and on going plan to through a coup` against America !!", 
        "intTime": 20090408, 
        "postID": 9, 
        "quote": "", 
        "reply": "Granades !!....They took my Wille Pete..He`s been my friend For eva !!...It`s not a firearm.... Sure it`s conceled but If no-one knows I have it...How can I be a Threat ?? I tried to get a gun but they saw my Howitzer and said that I might not be able to handle myself when a criminal pulled his knife. As stupid as that sounds,...You`ve got to be even more stupid if you think that not allowing law abiding citizens to carry, own, and regulate the use of the one thing that gives the common criminal an extreme edge over societys` security,...is justifiable !! If you don`t agree,..You`re prolly part of a long, and on going plan to through a coup` against America !!", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 21:27:00", 
        "title": "They took my guns!!", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "Duster I like beheading in my driveway? How about you?", 
        "intTime": 20090408, 
        "postID": 10, 
        "quote": "", 
        "reply": "Duster I like beheading in my driveway? How about you?", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 22:57:00", 
        "title": "They took my guns!!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "---http://www.youtube.com/watch?v=Q2fGl9587X8", 
        "intTime": 20090409, 
        "postID": 11, 
        "quote": "", 
        "reply": "---http://www.youtube.com/watch?v=Q2fGl9587X8", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 04:28:00", 
        "title": "They took my guns!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Duster I like beheading in my driveway? How about you? Not in my driveway. Too messy. Once blood clots and dries it is a mess to clean up. I like the way the Saudi's did it in Riyadh. Marble floor that tilted down towards a drain and Pakistani's to wash it up after the show was over. Clean as a whistle.", 
        "intTime": 20090409, 
        "postID": 12, 
        "quote": "Originally posted by dragonflyer04: Duster I like beheading in my driveway? How about you?", 
        "reply": " Not in my driveway. Too messy. Once blood clots and dries it is a mess to clean up. I like the way the Saudi's did it in Riyadh. Marble floor that tilted down towards a drain and Pakistani's to wash it up after the show was over. Clean as a whistle.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 04:32:00", 
        "title": "They took my guns!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by dragonflyer04: Duster I like beheading in my driveway? How about you? Not in my driveway. Too messy. Once blood clots and dries it is a mess to clean up. I like the way the Saudi's did it in Riyadh. Marble floor that tilted down towards a drain and Pakistani's to wash it up after the show was over. Clean as a whistle. What about one of those new-fangled polymer type materials that don't stain. they make some good cuttin' boards out of 'em. But seriously, if a little discoloration bugs ya', use Clorox. It even kills the germs that caused the perp's mind to shrivel and twist as it did. These are my opinions. Yours may differ.", 
        "intTime": 20090409, 
        "postID": 13, 
        "quote": "Originally posted by Duster6: quote: Originally posted by dragonflyer04: Duster I like beheading in my driveway? How about you? Not in my driveway. Too messy. Once blood clots and dries it is a mess to clean up. I like the way the Saudi's did it in Riyadh. Marble floor that tilted down towards a drain and Pakistani's to wash it up after the show was over. Clean as a whistle.", 
        "reply": " What about one of those new-fangled polymer type materials that don't stain. they make some good cuttin' boards out of 'em. But seriously, if a little discoloration bugs ya', use Clorox. It even kills the germs that caused the perp's mind to shrivel and twist as it did. These are my opinions. Yours may differ.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 07:27:00", 
        "title": "They took my guns!!", 
        "userID": "4403771"
    }, 
    {
        "content": "quote: Originally posted by _cash_: quote: Originally posted by RoofRatOrdie: \"The right of the people to keep and bear arms shall not be infringed.\" (2A) \"The Second Amendment extends prima facie to all instruments that constitute bearable arms. The Amendment recognizes the pre-existance of the right and declares only that it shall not be infringed.\" (SCJ Anthony Scalia 2008) Open Carry is recognized in 44 States. Arizona being among them. Rights do not require permit, license or qualifications. \"An armed society is a polite society\" (Robt A. Heinlien) It's when folks tweek and tamper with these rights......that we have problems. The Second Amendment does much to promote peace among us. as the old west saying goes an armed population is a polite one...", 
        "intTime": 20090409, 
        "postID": 14, 
        "quote": "Originally posted by _cash_: quote: Originally posted by RoofRatOrdie: \"The right of the people to keep and bear arms shall not be infringed.\" (2A) \"The Second Amendment extends prima facie to all instruments that constitute bearable arms. The Amendment recognizes the pre-existance of the right and declares only that it shall not be infringed.\" (SCJ Anthony Scalia 2008) Open Carry is recognized in 44 States. Arizona being among them. Rights do not require permit, license or qualifications. \"An armed society is a polite society\" (Robt A. Heinlien) It's when folks tweek and tamper with these rights......that we have problems. The Second Amendment does much to promote peace among us.", 
        "reply": " as the old west saying goes an armed population is a polite one...", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 07:49:00", 
        "title": "They took my guns!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The Second Amendment exists to ensure the security and protection of the rest of the Constitution and Bill of Rights. 'Rights' are not 'given or granted or permitted' by government. Rights are inalienable. Rights are either recognized and protected by government or denied. All of these agenda driven politicians (and most of us) took the oath to Support and Defend the Constitution (all of it). They do not. Those of you who live and work in those areas which deny the Right to self defense endure tyranny. Some of you were born into that culture (as I was) where the right has been denied or tampered with for so long it's 'normal'. You have been inculcated/indoctrinated with propaganda from both the government and the running dog media that firearms are evil. That firearms are only to be held by the 'Police' and 'Military'. Neither of which have any duty to protect the individual. The media automatically screams 'Wild West' alarms whenever those areas previously restricting or forbidding the free exercise of the Right finally abide by the Constitution. \"There will be shoot-outs in the streets!!!!\" It doesn't happen. This is merely alarmist projection. Alaska and New Hampshire abide by 'Constitutional Carry'. No permits or such to bear arms either openly or concealed. The media never mentions that. Amazing how many people are completely ignorant of their own State's gun rights. No amount of legislation will control criminal behaviour. Denial of citizen's rights to self defense... particularly with 'Gun Free Zones' ensures a free ride for anyone with criminal intent w/o fear of armed resistance. Yet... the sheep willl continue to huddle and bleat in unison when they are attacked... unwilling or unable to defend themselves.", 
        "intTime": 20090409, 
        "postID": 15, 
        "quote": "", 
        "reply": "The Second Amendment exists to ensure the security and protection of the rest of the Constitution and Bill of Rights. 'Rights' are not 'given or granted or permitted' by government. Rights are inalienable. Rights are either recognized and protected by government or denied. All of these agenda driven politicians (and most of us) took the oath to Support and Defend the Constitution (all of it). They do not. Those of you who live and work in those areas which deny the Right to self defense endure tyranny. Some of you were born into that culture (as I was) where the right has been denied or tampered with for so long it's 'normal'. You have been inculcated/indoctrinated with propaganda from both the government and the running dog media that firearms are evil. That firearms are only to be held by the 'Police' and 'Military'. Neither of which have any duty to protect the individual. The media automatically screams 'Wild West' alarms whenever those areas previously restricting or forbidding the free exercise of the Right finally abide by the Constitution. \"There will be shoot-outs in the streets!!!!\" It doesn't happen. This is merely alarmist projection. Alaska and New Hampshire abide by 'Constitutional Carry'. No permits or such to bear arms either openly or concealed. The media never mentions that. Amazing how many people are completely ignorant of their own State's gun rights. No amount of legislation will control criminal behaviour. Denial of citizen's rights to self defense... particularly with 'Gun Free Zones' ensures a free ride for anyone with criminal intent w/o fear of armed resistance. Yet... the sheep willl continue to huddle and bleat in unison when they are attacked... unwilling or unable to defend themselves.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 08:11:00", 
        "title": "They took my guns!!", 
        "userID": "RoofRatOrdie"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety.", 
        "intTime": 20090409, 
        "postID": 16, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time", 
        "reply": " Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 09:21:00", 
        "title": "They took my guns!!", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot.", 
        "intTime": 20090409, 
        "postID": 17, 
        "quote": "Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety.", 
        "reply": " I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 12:51:00", 
        "title": "They took my guns!!", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090409, 
        "postID": 18, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time", 
        "reply": " Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 13:05:00", 
        "title": "They took my guns!!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot. ______________________________________________- Unfortunate, but it isn't enough to violate a constitutional right because unfortunate things happen. The cops I know, when questioned about what they'd do, if they were ordered to confiscate citizen's firearms, answeres ranged from \"quit\" to saying they'd be too busy hiding their own guns to do anything. Too many cops have a real \"feel sorry for me cause I have a dangerous job\" attitude. Not the majority, but too many. When I'm working on a 500,000 volt line, not one cop has ever ask to trade professions when he saw that looooong electrical arc.", 
        "intTime": 20090409, 
        "postID": 19, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot.", 
        "reply": " ______________________________________________- Unfortunate, but it isn't enough to violate a constitutional right because unfortunate things happen. The cops I know, when questioned about what they'd do, if they were ordered to confiscate citizen's firearms, answeres ranged from \"quit\" to saying they'd be too busy hiding their own guns to do anything. Too many cops have a real \"feel sorry for me cause I have a dangerous job\" attitude. Not the majority, but too many. When I'm working on a 500,000 volt line, not one cop has ever ask to trade professions when he saw that looooong electrical arc.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 21:47:00", 
        "title": "They took my guns!!", 
        "userID": "herd173"
    }, 
    {
        "content": "Personally, I have known police \"officers\" who admitted they joined the force because it was the only gang they could get into. They can stay out all night, go crusing, and have \"fun.\" I was with my brother in law one night(he was working grave shift for a police tow company) when we ran into a bunch of cars cruising. I was looking to my right when all of a sudden I heard the roar of a motorcycle, I looked forward and the damn thing look like it was coming into the windshield. The idiot crashed into the front of the truck and ended up under the front end. We rushed out side to be greeted by a badge, \"Is there a problem?\" Some random guy walked up and said \"I don't give a **** who you are.\" The look on the cops face was priceless because he was screwed either way....The guy took the keys out of the bike and kept them away from the so-called cop...lol Eventually the highway patrol handled the situation, and presumably that individuals violation of public trust.", 
        "intTime": 20090409, 
        "postID": 20, 
        "quote": "", 
        "reply": "Personally, I have known police \"officers\" who admitted they joined the force because it was the only gang they could get into. They can stay out all night, go crusing, and have \"fun.\" I was with my brother in law one night(he was working grave shift for a police tow company) when we ran into a bunch of cars cruising. I was looking to my right when all of a sudden I heard the roar of a motorcycle, I looked forward and the damn thing look like it was coming into the windshield. The idiot crashed into the front of the truck and ended up under the front end. We rushed out side to be greeted by a badge, \"Is there a problem?\" Some random guy walked up and said \"I don't give a **** who you are.\" The look on the cops face was priceless because he was screwed either way....The guy took the keys out of the bike and kept them away from the so-called cop...lol Eventually the highway patrol handled the situation, and presumably that individuals violation of public trust.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 22:51:00", 
        "title": "They took my guns!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "BTW: The cop was off-duty, doing wheelies in his crotch rocket..", 
        "intTime": 20090409, 
        "postID": 21, 
        "quote": "", 
        "reply": "BTW: The cop was off-duty, doing wheelies in his crotch rocket..", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 22:53:00", 
        "title": "They took my guns!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Personally, I have known police \"officers\" who admitted they joined the force because it was the only gang they could get into. They can stay out all night, go crusing, and have \"fun.\" dosent mean all cops are like that... ive met nice ones and bad ones... but not all are bad just because a few are....sounds like you should go to internal affairs and make a report with them......", 
        "intTime": 20090410, 
        "postID": 22, 
        "quote": "Personally, I have known police \"officers\" who admitted they joined the force because it was the only gang they could get into. They can stay out all night, go crusing, and have \"fun.\"", 
        "reply": " dosent mean all cops are like that... ive met nice ones and bad ones... but not all are bad just because a few are....sounds like you should go to internal affairs and make a report with them......", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-10 01:48:00", 
        "title": "They took my guns!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by RoofRatOrdie: The Second Amendment exists to ensure the security and protection of the rest of the Constitution and Bill of Rights. 'Rights' are not 'given or granted or permitted' by government. Rights are inalienable. Rights are either recognized and protected by government or denied. All of these agenda driven politicians (and most of us) took the oath to Support and Defend the Constitution (all of it). They do not. Those of you who live and work in those areas which deny the Right to self defense endure tyranny. Some of you were born into that culture (as I was) where the right has been denied or tampered with for so long it's 'normal'. You have been inculcated/indoctrinated with propaganda from both the government and the running dog media that firearms are evil. That firearms are only to be held by the 'Police' and 'Military'. Neither of which have any duty to protect the individual. The media automatically screams 'Wild West' alarms whenever those areas previously restricting or forbidding the free exercise of the Right finally abide by the Constitution. \"There will be shoot-outs in the streets!!!!\" It doesn't happen. This is merely alarmist projection. Alaska and New Hampshire abide by 'Constitutional Carry'. No permits or such to bear arms either openly or concealed. The media never mentions that. Amazing how many people are completely ignorant of their own State's gun rights. No amount of legislation will control criminal behaviour. Denial of citizen's rights to self defense... particularly with 'Gun Free Zones' ensures a free ride for anyone with criminal intent w/o fear of armed resistance. Yet... the sheep willl continue to huddle and bleat in unison when they are attacked... unwilling or unable to defend themselves. Well said Sir!", 
        "intTime": 20090410, 
        "postID": 23, 
        "quote": "Originally posted by RoofRatOrdie: The Second Amendment exists to ensure the security and protection of the rest of the Constitution and Bill of Rights. 'Rights' are not 'given or granted or permitted' by government. Rights are inalienable. Rights are either recognized and protected by government or denied. All of these agenda driven politicians (and most of us) took the oath to Support and Defend the Constitution (all of it). They do not. Those of you who live and work in those areas which deny the Right to self defense endure tyranny. Some of you were born into that culture (as I was) where the right has been denied or tampered with for so long it's 'normal'. You have been inculcated/indoctrinated with propaganda from both the government and the running dog media that firearms are evil. That firearms are only to be held by the 'Police' and 'Military'. Neither of which have any duty to protect the individual. The media automatically screams 'Wild West' alarms whenever those areas previously restricting or forbidding the free exercise of the Right finally abide by the Constitution. \"There will be shoot-outs in the streets!!!!\" It doesn't happen. This is merely alarmist projection. Alaska and New Hampshire abide by 'Constitutional Carry'. No permits or such to bear arms either openly or concealed. The media never mentions that. Amazing how many people are completely ignorant of their own State's gun rights. No amount of legislation will control criminal behaviour. Denial of citizen's rights to self defense... particularly with 'Gun Free Zones' ensures a free ride for anyone with criminal intent w/o fear of armed resistance. Yet... the sheep willl continue to huddle and bleat in unison when they are attacked... unwilling or unable to defend themselves.", 
        "reply": " Well said Sir!", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-10 23:12:00", 
        "title": "They took my guns!!", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "As an aside to topic:I have cop's in my family and as friend's,I would not want to do they're job! Granted there are \"good and bad\" in every area of life,the police have to deal with regular folk's,dregg's of society,and all in between.God bless them all,even the \"bad\".", 
        "intTime": 20090410, 
        "postID": 24, 
        "quote": "", 
        "reply": "As an aside to topic:I have cop's in my family and as friend's,I would not want to do they're job! Granted there are \"good and bad\" in every area of life,the police have to deal with regular folk's,dregg's of society,and all in between.God bless them all,even the \"bad\".", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-10 23:19:00", 
        "title": "They took my guns!!", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave.", 
        "intTime": 20090411, 
        "postID": 25, 
        "quote": "", 
        "reply": "Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 04:33:00", 
        "title": "They took my guns!!", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. and just why do they feel they have to do all of that? If it is dept policy then it is DUMB. A criminal is not going to say anything about the gun in the first place.", 
        "intTime": 20090411, 
        "postID": 26, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation.", 
        "reply": " and just why do they feel they have to do all of that? If it is dept policy then it is DUMB. A criminal is not going to say anything about the gun in the first place.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 06:17:00", 
        "title": "They took my guns!!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by herd173: quote: Originally posted by cosmicfish: quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot. ______________________________________________- Unfortunate, but it isn't enough to violate a constitutional right because unfortunate things happen. The cops I know, when questioned about what they'd do, if they were ordered to confiscate citizen's firearms, answeres ranged from \"quit\" to saying they'd be too busy hiding their own guns to do anything. Too many cops have a real \"feel sorry for me cause I have a dangerous job\" attitude. Not the majority, but too many. When I'm working on a 500,000 volt line, not one cop has ever ask to trade professions when he saw that looooong electrical arc. You got that right, I saw some arc flash kill videos, not a pretty sight.", 
        "intTime": 20090411, 
        "postID": 27, 
        "quote": "Originally posted by herd173: quote: Originally posted by cosmicfish: quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot. ______________________________________________- Unfortunate, but it isn't enough to violate a constitutional right because unfortunate things happen. The cops I know, when questioned about what they'd do, if they were ordered to confiscate citizen's firearms, answeres ranged from \"quit\" to saying they'd be too busy hiding their own guns to do anything. Too many cops have a real \"feel sorry for me cause I have a dangerous job\" attitude. Not the majority, but too many. When I'm working on a 500,000 volt line, not one cop has ever ask to trade professions when he saw that looooong electrical arc.", 
        "reply": " You got that right, I saw some arc flash kill videos, not a pretty sight.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 06:19:00", 
        "title": "They took my guns!!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave. ive been to a town in missouri where you have to check your gun in with the bartender when you go into the bar... they had a sign that said to and people did a lot.... small small town to where you can get a cwp from the town sheriff and only 2 bars...", 
        "intTime": 20090411, 
        "postID": 28, 
        "quote": "Originally posted by Fightdirector: Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave.", 
        "reply": " ive been to a town in missouri where you have to check your gun in with the bartender when you go into the bar... they had a sign that said to and people did a lot.... small small town to where you can get a cwp from the town sheriff and only 2 bars...", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 06:20:00", 
        "title": "They took my guns!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave. I think your kidding on this, but the outlaws never turned them in anyway. All it boils down to is holding people accountable. If they commit a robbery with a gun then that should be treated in a manner in which that person does not see the light of day for a very long time. Not to mention cleaning up the joke of prison system we have, make it punishment like it should be.", 
        "intTime": 20090411, 
        "postID": 29, 
        "quote": "Originally posted by Fightdirector: Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave.", 
        "reply": " I think your kidding on this, but the outlaws never turned them in anyway. All it boils down to is holding people accountable. If they commit a robbery with a gun then that should be treated in a manner in which that person does not see the light of day for a very long time. Not to mention cleaning up the joke of prison system we have, make it punishment like it should be.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 06:28:00", 
        "title": "They took my guns!!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. and just why do they feel they have to do all of that? If it is dept policy then it is DUMB. A criminal is not going to say anything about the gun in the first place. My point was not about criminals, it was about how the Police do respect law abiding citizens rights to bear arms. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090411, 
        "postID": 30, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. and just why do they feel they have to do all of that? If it is dept policy then it is DUMB. A criminal is not going to say anything about the gun in the first place.", 
        "reply": " My point was not about criminals, it was about how the Police do respect law abiding citizens rights to bear arms. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 07:36:00", 
        "title": "They took my guns!!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: (CNN) — Has public opinion shifted on gun control? Yes. And in a very surprising way. Binghamton . . . Pittsburgh . . . Oakland . . . Samson, Alabama . . . Carthage, North Carolina . . . sensational incidents of gun violence all over the country. Are we seeing an impact on public opinion? Since 2001, a majority of Americans has favored stricter gun laws. Though support has been trending slightly down. Eight years ago, 54 percent of Americans wanted stricter gun laws compared to 50 percent in 2007, according to a Gallup poll. And now? A sharp, sudden drop. Only 39 percent of Americans now favor stricter gun laws. Gun control should still be enforced, however, we need to expand concealed weapons rights, thats the key. Let qualified people carry weapons if they choose too. In california the Police Unions have ruined everyones right to carry weapons. They keep on crying about how they volunteered for a dangerous job", 
        "intTime": 20090408, 
        "postID": 31, 
        "quote": "(CNN) — Has public opinion shifted on gun control? Yes. And in a very surprising way. Binghamton . . . Pittsburgh . . . Oakland . . . Samson, Alabama . . . Carthage, North Carolina . . . sensational incidents of gun violence all over the country. Are we seeing an impact on public opinion? Since 2001, a majority of Americans has favored stricter gun laws. Though support has been trending slightly down. Eight years ago, 54 percent of Americans wanted stricter gun laws compared to 50 percent in 2007, according to a Gallup poll. And now? A sharp, sudden drop. Only 39 percent of Americans now favor stricter gun laws.", 
        "reply": " Gun control should still be enforced, however, we need to expand concealed weapons rights, thats the key. Let qualified people carry weapons if they choose too. In california the Police Unions have ruined everyones right to carry weapons. They keep on crying about how they volunteered for a dangerous job", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 15:54:00", 
        "title": "They took my guns!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma", 
        "intTime": 20090408, 
        "postID": 32, 
        "quote": "", 
        "reply": "Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 16:56:00", 
        "title": "They took my guns!!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "\"The right of the people to keep and bear arms shall not be infringed.\" (2A) \"The Second Amendment extends prima facie to all instruments that constitute bearable arms. The Amendment recognizes the pre-existance of the right and declares only that it shall not be infringed.\" (SCJ Anthony Scalia 2008) Open Carry is recognized in 44 States. Arizona being among them. Rights do not require permit, license or qualifications. \"An armed society is a polite society\" (Robt A. Heinlien)", 
        "intTime": 20090408, 
        "postID": 33, 
        "quote": "", 
        "reply": "\"The right of the people to keep and bear arms shall not be infringed.\" (2A) \"The Second Amendment extends prima facie to all instruments that constitute bearable arms. The Amendment recognizes the pre-existance of the right and declares only that it shall not be infringed.\" (SCJ Anthony Scalia 2008) Open Carry is recognized in 44 States. Arizona being among them. Rights do not require permit, license or qualifications. \"An armed society is a polite society\" (Robt A. Heinlien)", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 17:09:00", 
        "title": "They took my guns!!", 
        "userID": "RoofRatOrdie"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time", 
        "intTime": 20090408, 
        "postID": 34, 
        "quote": "Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma", 
        "reply": " Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 17:26:00", 
        "title": "They took my guns!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Take guns away from everyone. Then when ever a crime is committed using a gun it will be an automatic beheading shown on Fox news.", 
        "intTime": 20090408, 
        "postID": 35, 
        "quote": "", 
        "reply": "Take guns away from everyone. Then when ever a crime is committed using a gun it will be an automatic beheading shown on Fox news.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 17:26:00", 
        "title": "They took my guns!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Take guns away from everyone. Then when ever a crime is committed using a gun it will be an automatic beheading shown on Fox news. Thanks Duster... I just had Bud Lite Lime spewing out my nose!!!!! You BASTAGE!!!! LOL", 
        "intTime": 20090408, 
        "postID": 36, 
        "quote": "Originally posted by Duster6: Take guns away from everyone. Then when ever a crime is committed using a gun it will be an automatic beheading shown on Fox news.", 
        "reply": " Thanks Duster... I just had Bud Lite Lime spewing out my nose!!!!! You BASTAGE!!!! LOL", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 17:38:00", 
        "title": "They took my guns!!", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Hi Woody, Sorry. You take care now. Be well.", 
        "intTime": 20090408, 
        "postID": 37, 
        "quote": "", 
        "reply": "Hi Woody, Sorry. You take care now. Be well.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 19:58:00", 
        "title": "They took my guns!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "Duster: Your punishment doen't extend to the criminals does it? The poor misunderstood dudes who have 2 murders and ag assaults to their credit, they shouldn't be punished they are only the product of a horrible society. Punish only those who are trying to defend themselves or others. The new order cometh.", 
        "intTime": 20090408, 
        "postID": 38, 
        "quote": "", 
        "reply": "Duster: Your punishment doen't extend to the criminals does it? The poor misunderstood dudes who have 2 murders and ag assaults to their credit, they shouldn't be punished they are only the product of a horrible society. Punish only those who are trying to defend themselves or others. The new order cometh.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 19:59:00", 
        "title": "They took my guns!!", 
        "userID": "OldDoc"
    }, 
    {
        "content": "Granades !!....They took my Wille Pete..He`s been my friend For eva !!...It`s not a firearm.... Sure it`s conceled but If no-one knows I have it...How can I be a Threat ?? I tried to get a gun but they saw my Howitzer and said that I might not be able to handle myself when a criminal pulled his knife. As stupid as that sounds,...You`ve got to be even more stupid if you think that not allowing law abiding citizens to carry, own, and regulate the use of the one thing that gives the common criminal an extreme edge over societys` security,...is justifiable !! If you don`t agree,..You`re prolly part of a long, and on going plan to through a coup` against America !!", 
        "intTime": 20090408, 
        "postID": 39, 
        "quote": "", 
        "reply": "Granades !!....They took my Wille Pete..He`s been my friend For eva !!...It`s not a firearm.... Sure it`s conceled but If no-one knows I have it...How can I be a Threat ?? I tried to get a gun but they saw my Howitzer and said that I might not be able to handle myself when a criminal pulled his knife. As stupid as that sounds,...You`ve got to be even more stupid if you think that not allowing law abiding citizens to carry, own, and regulate the use of the one thing that gives the common criminal an extreme edge over societys` security,...is justifiable !! If you don`t agree,..You`re prolly part of a long, and on going plan to through a coup` against America !!", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 21:27:00", 
        "title": "They took my guns!!", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "Duster I like beheading in my driveway? How about you?", 
        "intTime": 20090408, 
        "postID": 40, 
        "quote": "", 
        "reply": "Duster I like beheading in my driveway? How about you?", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-08 22:57:00", 
        "title": "They took my guns!!", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "---http://www.youtube.com/watch?v=Q2fGl9587X8", 
        "intTime": 20090409, 
        "postID": 41, 
        "quote": "", 
        "reply": "---http://www.youtube.com/watch?v=Q2fGl9587X8", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 04:28:00", 
        "title": "They took my guns!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: Duster I like beheading in my driveway? How about you? Not in my driveway. Too messy. Once blood clots and dries it is a mess to clean up. I like the way the Saudi's did it in Riyadh. Marble floor that tilted down towards a drain and Pakistani's to wash it up after the show was over. Clean as a whistle.", 
        "intTime": 20090409, 
        "postID": 42, 
        "quote": "Originally posted by dragonflyer04: Duster I like beheading in my driveway? How about you?", 
        "reply": " Not in my driveway. Too messy. Once blood clots and dries it is a mess to clean up. I like the way the Saudi's did it in Riyadh. Marble floor that tilted down towards a drain and Pakistani's to wash it up after the show was over. Clean as a whistle.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 04:32:00", 
        "title": "They took my guns!!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by dragonflyer04: Duster I like beheading in my driveway? How about you? Not in my driveway. Too messy. Once blood clots and dries it is a mess to clean up. I like the way the Saudi's did it in Riyadh. Marble floor that tilted down towards a drain and Pakistani's to wash it up after the show was over. Clean as a whistle. What about one of those new-fangled polymer type materials that don't stain. they make some good cuttin' boards out of 'em. But seriously, if a little discoloration bugs ya', use Clorox. It even kills the germs that caused the perp's mind to shrivel and twist as it did. These are my opinions. Yours may differ.", 
        "intTime": 20090409, 
        "postID": 43, 
        "quote": "Originally posted by Duster6: quote: Originally posted by dragonflyer04: Duster I like beheading in my driveway? How about you? Not in my driveway. Too messy. Once blood clots and dries it is a mess to clean up. I like the way the Saudi's did it in Riyadh. Marble floor that tilted down towards a drain and Pakistani's to wash it up after the show was over. Clean as a whistle.", 
        "reply": " What about one of those new-fangled polymer type materials that don't stain. they make some good cuttin' boards out of 'em. But seriously, if a little discoloration bugs ya', use Clorox. It even kills the germs that caused the perp's mind to shrivel and twist as it did. These are my opinions. Yours may differ.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 07:27:00", 
        "title": "They took my guns!!", 
        "userID": "4403771"
    }, 
    {
        "content": "quote: Originally posted by _cash_: quote: Originally posted by RoofRatOrdie: \"The right of the people to keep and bear arms shall not be infringed.\" (2A) \"The Second Amendment extends prima facie to all instruments that constitute bearable arms. The Amendment recognizes the pre-existance of the right and declares only that it shall not be infringed.\" (SCJ Anthony Scalia 2008) Open Carry is recognized in 44 States. Arizona being among them. Rights do not require permit, license or qualifications. \"An armed society is a polite society\" (Robt A. Heinlien) It's when folks tweek and tamper with these rights......that we have problems. The Second Amendment does much to promote peace among us. as the old west saying goes an armed population is a polite one...", 
        "intTime": 20090409, 
        "postID": 44, 
        "quote": "Originally posted by _cash_: quote: Originally posted by RoofRatOrdie: \"The right of the people to keep and bear arms shall not be infringed.\" (2A) \"The Second Amendment extends prima facie to all instruments that constitute bearable arms. The Amendment recognizes the pre-existance of the right and declares only that it shall not be infringed.\" (SCJ Anthony Scalia 2008) Open Carry is recognized in 44 States. Arizona being among them. Rights do not require permit, license or qualifications. \"An armed society is a polite society\" (Robt A. Heinlien) It's when folks tweek and tamper with these rights......that we have problems. The Second Amendment does much to promote peace among us.", 
        "reply": " as the old west saying goes an armed population is a polite one...", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 07:49:00", 
        "title": "They took my guns!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "The Second Amendment exists to ensure the security and protection of the rest of the Constitution and Bill of Rights. 'Rights' are not 'given or granted or permitted' by government. Rights are inalienable. Rights are either recognized and protected by government or denied. All of these agenda driven politicians (and most of us) took the oath to Support and Defend the Constitution (all of it). They do not. Those of you who live and work in those areas which deny the Right to self defense endure tyranny. Some of you were born into that culture (as I was) where the right has been denied or tampered with for so long it's 'normal'. You have been inculcated/indoctrinated with propaganda from both the government and the running dog media that firearms are evil. That firearms are only to be held by the 'Police' and 'Military'. Neither of which have any duty to protect the individual. The media automatically screams 'Wild West' alarms whenever those areas previously restricting or forbidding the free exercise of the Right finally abide by the Constitution. \"There will be shoot-outs in the streets!!!!\" It doesn't happen. This is merely alarmist projection. Alaska and New Hampshire abide by 'Constitutional Carry'. No permits or such to bear arms either openly or concealed. The media never mentions that. Amazing how many people are completely ignorant of their own State's gun rights. No amount of legislation will control criminal behaviour. Denial of citizen's rights to self defense... particularly with 'Gun Free Zones' ensures a free ride for anyone with criminal intent w/o fear of armed resistance. Yet... the sheep willl continue to huddle and bleat in unison when they are attacked... unwilling or unable to defend themselves.", 
        "intTime": 20090409, 
        "postID": 45, 
        "quote": "", 
        "reply": "The Second Amendment exists to ensure the security and protection of the rest of the Constitution and Bill of Rights. 'Rights' are not 'given or granted or permitted' by government. Rights are inalienable. Rights are either recognized and protected by government or denied. All of these agenda driven politicians (and most of us) took the oath to Support and Defend the Constitution (all of it). They do not. Those of you who live and work in those areas which deny the Right to self defense endure tyranny. Some of you were born into that culture (as I was) where the right has been denied or tampered with for so long it's 'normal'. You have been inculcated/indoctrinated with propaganda from both the government and the running dog media that firearms are evil. That firearms are only to be held by the 'Police' and 'Military'. Neither of which have any duty to protect the individual. The media automatically screams 'Wild West' alarms whenever those areas previously restricting or forbidding the free exercise of the Right finally abide by the Constitution. \"There will be shoot-outs in the streets!!!!\" It doesn't happen. This is merely alarmist projection. Alaska and New Hampshire abide by 'Constitutional Carry'. No permits or such to bear arms either openly or concealed. The media never mentions that. Amazing how many people are completely ignorant of their own State's gun rights. No amount of legislation will control criminal behaviour. Denial of citizen's rights to self defense... particularly with 'Gun Free Zones' ensures a free ride for anyone with criminal intent w/o fear of armed resistance. Yet... the sheep willl continue to huddle and bleat in unison when they are attacked... unwilling or unable to defend themselves.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 08:11:00", 
        "title": "They took my guns!!", 
        "userID": "RoofRatOrdie"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety.", 
        "intTime": 20090409, 
        "postID": 46, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time", 
        "reply": " Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 09:21:00", 
        "title": "They took my guns!!", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot.", 
        "intTime": 20090409, 
        "postID": 47, 
        "quote": "Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety.", 
        "reply": " I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 12:51:00", 
        "title": "They took my guns!!", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090409, 
        "postID": 48, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time", 
        "reply": " Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 13:05:00", 
        "title": "They took my guns!!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot. ______________________________________________- Unfortunate, but it isn't enough to violate a constitutional right because unfortunate things happen. The cops I know, when questioned about what they'd do, if they were ordered to confiscate citizen's firearms, answeres ranged from \"quit\" to saying they'd be too busy hiding their own guns to do anything. Too many cops have a real \"feel sorry for me cause I have a dangerous job\" attitude. Not the majority, but too many. When I'm working on a 500,000 volt line, not one cop has ever ask to trade professions when he saw that looooong electrical arc.", 
        "intTime": 20090409, 
        "postID": 49, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot.", 
        "reply": " ______________________________________________- Unfortunate, but it isn't enough to violate a constitutional right because unfortunate things happen. The cops I know, when questioned about what they'd do, if they were ordered to confiscate citizen's firearms, answeres ranged from \"quit\" to saying they'd be too busy hiding their own guns to do anything. Too many cops have a real \"feel sorry for me cause I have a dangerous job\" attitude. Not the majority, but too many. When I'm working on a 500,000 volt line, not one cop has ever ask to trade professions when he saw that looooong electrical arc.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 21:47:00", 
        "title": "They took my guns!!", 
        "userID": "herd173"
    }, 
    {
        "content": "Personally, I have known police \"officers\" who admitted they joined the force because it was the only gang they could get into. They can stay out all night, go crusing, and have \"fun.\" I was with my brother in law one night(he was working grave shift for a police tow company) when we ran into a bunch of cars cruising. I was looking to my right when all of a sudden I heard the roar of a motorcycle, I looked forward and the damn thing look like it was coming into the windshield. The idiot crashed into the front of the truck and ended up under the front end. We rushed out side to be greeted by a badge, \"Is there a problem?\" Some random guy walked up and said \"I don't give a **** who you are.\" The look on the cops face was priceless because he was screwed either way....The guy took the keys out of the bike and kept them away from the so-called cop...lol Eventually the highway patrol handled the situation, and presumably that individuals violation of public trust.", 
        "intTime": 20090409, 
        "postID": 50, 
        "quote": "", 
        "reply": "Personally, I have known police \"officers\" who admitted they joined the force because it was the only gang they could get into. They can stay out all night, go crusing, and have \"fun.\" I was with my brother in law one night(he was working grave shift for a police tow company) when we ran into a bunch of cars cruising. I was looking to my right when all of a sudden I heard the roar of a motorcycle, I looked forward and the damn thing look like it was coming into the windshield. The idiot crashed into the front of the truck and ended up under the front end. We rushed out side to be greeted by a badge, \"Is there a problem?\" Some random guy walked up and said \"I don't give a **** who you are.\" The look on the cops face was priceless because he was screwed either way....The guy took the keys out of the bike and kept them away from the so-called cop...lol Eventually the highway patrol handled the situation, and presumably that individuals violation of public trust.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 22:51:00", 
        "title": "They took my guns!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "BTW: The cop was off-duty, doing wheelies in his crotch rocket..", 
        "intTime": 20090409, 
        "postID": 51, 
        "quote": "", 
        "reply": "BTW: The cop was off-duty, doing wheelies in his crotch rocket..", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-09 22:53:00", 
        "title": "They took my guns!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Personally, I have known police \"officers\" who admitted they joined the force because it was the only gang they could get into. They can stay out all night, go crusing, and have \"fun.\" dosent mean all cops are like that... ive met nice ones and bad ones... but not all are bad just because a few are....sounds like you should go to internal affairs and make a report with them......", 
        "intTime": 20090410, 
        "postID": 52, 
        "quote": "Personally, I have known police \"officers\" who admitted they joined the force because it was the only gang they could get into. They can stay out all night, go crusing, and have \"fun.\"", 
        "reply": " dosent mean all cops are like that... ive met nice ones and bad ones... but not all are bad just because a few are....sounds like you should go to internal affairs and make a report with them......", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-10 01:48:00", 
        "title": "They took my guns!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by RoofRatOrdie: The Second Amendment exists to ensure the security and protection of the rest of the Constitution and Bill of Rights. 'Rights' are not 'given or granted or permitted' by government. Rights are inalienable. Rights are either recognized and protected by government or denied. All of these agenda driven politicians (and most of us) took the oath to Support and Defend the Constitution (all of it). They do not. Those of you who live and work in those areas which deny the Right to self defense endure tyranny. Some of you were born into that culture (as I was) where the right has been denied or tampered with for so long it's 'normal'. You have been inculcated/indoctrinated with propaganda from both the government and the running dog media that firearms are evil. That firearms are only to be held by the 'Police' and 'Military'. Neither of which have any duty to protect the individual. The media automatically screams 'Wild West' alarms whenever those areas previously restricting or forbidding the free exercise of the Right finally abide by the Constitution. \"There will be shoot-outs in the streets!!!!\" It doesn't happen. This is merely alarmist projection. Alaska and New Hampshire abide by 'Constitutional Carry'. No permits or such to bear arms either openly or concealed. The media never mentions that. Amazing how many people are completely ignorant of their own State's gun rights. No amount of legislation will control criminal behaviour. Denial of citizen's rights to self defense... particularly with 'Gun Free Zones' ensures a free ride for anyone with criminal intent w/o fear of armed resistance. Yet... the sheep willl continue to huddle and bleat in unison when they are attacked... unwilling or unable to defend themselves. Well said Sir!", 
        "intTime": 20090410, 
        "postID": 53, 
        "quote": "Originally posted by RoofRatOrdie: The Second Amendment exists to ensure the security and protection of the rest of the Constitution and Bill of Rights. 'Rights' are not 'given or granted or permitted' by government. Rights are inalienable. Rights are either recognized and protected by government or denied. All of these agenda driven politicians (and most of us) took the oath to Support and Defend the Constitution (all of it). They do not. Those of you who live and work in those areas which deny the Right to self defense endure tyranny. Some of you were born into that culture (as I was) where the right has been denied or tampered with for so long it's 'normal'. You have been inculcated/indoctrinated with propaganda from both the government and the running dog media that firearms are evil. That firearms are only to be held by the 'Police' and 'Military'. Neither of which have any duty to protect the individual. The media automatically screams 'Wild West' alarms whenever those areas previously restricting or forbidding the free exercise of the Right finally abide by the Constitution. \"There will be shoot-outs in the streets!!!!\" It doesn't happen. This is merely alarmist projection. Alaska and New Hampshire abide by 'Constitutional Carry'. No permits or such to bear arms either openly or concealed. The media never mentions that. Amazing how many people are completely ignorant of their own State's gun rights. No amount of legislation will control criminal behaviour. Denial of citizen's rights to self defense... particularly with 'Gun Free Zones' ensures a free ride for anyone with criminal intent w/o fear of armed resistance. Yet... the sheep willl continue to huddle and bleat in unison when they are attacked... unwilling or unable to defend themselves.", 
        "reply": " Well said Sir!", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-10 23:12:00", 
        "title": "They took my guns!!", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "As an aside to topic:I have cop's in my family and as friend's,I would not want to do they're job! Granted there are \"good and bad\" in every area of life,the police have to deal with regular folk's,dregg's of society,and all in between.God bless them all,even the \"bad\".", 
        "intTime": 20090410, 
        "postID": 54, 
        "quote": "", 
        "reply": "As an aside to topic:I have cop's in my family and as friend's,I would not want to do they're job! Granted there are \"good and bad\" in every area of life,the police have to deal with regular folk's,dregg's of society,and all in between.God bless them all,even the \"bad\".", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-10 23:19:00", 
        "title": "They took my guns!!", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave.", 
        "intTime": 20090411, 
        "postID": 55, 
        "quote": "", 
        "reply": "Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 04:33:00", 
        "title": "They took my guns!!", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. and just why do they feel they have to do all of that? If it is dept policy then it is DUMB. A criminal is not going to say anything about the gun in the first place.", 
        "intTime": 20090411, 
        "postID": 56, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation.", 
        "reply": " and just why do they feel they have to do all of that? If it is dept policy then it is DUMB. A criminal is not going to say anything about the gun in the first place.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 06:17:00", 
        "title": "They took my guns!!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by herd173: quote: Originally posted by cosmicfish: quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot. ______________________________________________- Unfortunate, but it isn't enough to violate a constitutional right because unfortunate things happen. The cops I know, when questioned about what they'd do, if they were ordered to confiscate citizen's firearms, answeres ranged from \"quit\" to saying they'd be too busy hiding their own guns to do anything. Too many cops have a real \"feel sorry for me cause I have a dangerous job\" attitude. Not the majority, but too many. When I'm working on a 500,000 volt line, not one cop has ever ask to trade professions when he saw that looooong electrical arc. You got that right, I saw some arc flash kill videos, not a pretty sight.", 
        "intTime": 20090411, 
        "postID": 57, 
        "quote": "Originally posted by herd173: quote: Originally posted by cosmicfish: quote: Originally posted by jwr6: Police (as an arm of the local/state/federal government) don't rail against concealed carry and private gun ownership to make citizens \"less safe\" or themsleves \"more safe\". It is to maintain a superior position vis-a-vis the rest of the population. It isn't about \"officer safety\", it's about control. Personally, I think any chief LEO that campaigns against gun rights should be stripped of his position on the spot. Unfortunately, in too many states, the citizens are more than willing to accept an oppressive police state in a misguided sense of safety. I won't argue that some cops are real *******s - I know some of the cops where I grew up, and they could all point to the guys on the force who got into the business so they could beat up on people \"legally\". Most of those guys gravitate to the night shift - more action, and drunks are less likely to fight back or press charges. But most of the rest don't like armed civilians either. Nothing about power in it - they just don't want to get shot. They never know if the guy with the 9mm is a drug dealer, a cult member, someone looking for \"suicide by cop\", or someone just trying to protect themself. They never know if that person is looking to take a shot at them. Make them nervous. One of the guys I knew (family friend, my old cubmaster from when I was a kid) was nearly killed by a homeowner - he was responding to a home invasion report, guy decided that the burgler had come back (apparently missing the flashing lights) and decided to shoot first and skip the questions. Luckily he was a bad shot. ______________________________________________- Unfortunate, but it isn't enough to violate a constitutional right because unfortunate things happen. The cops I know, when questioned about what they'd do, if they were ordered to confiscate citizen's firearms, answeres ranged from \"quit\" to saying they'd be too busy hiding their own guns to do anything. Too many cops have a real \"feel sorry for me cause I have a dangerous job\" attitude. Not the majority, but too many. When I'm working on a 500,000 volt line, not one cop has ever ask to trade professions when he saw that looooong electrical arc.", 
        "reply": " You got that right, I saw some arc flash kill videos, not a pretty sight.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 06:19:00", 
        "title": "They took my guns!!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave. ive been to a town in missouri where you have to check your gun in with the bartender when you go into the bar... they had a sign that said to and people did a lot.... small small town to where you can get a cwp from the town sheriff and only 2 bars...", 
        "intTime": 20090411, 
        "postID": 58, 
        "quote": "Originally posted by Fightdirector: Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave.", 
        "reply": " ive been to a town in missouri where you have to check your gun in with the bartender when you go into the bar... they had a sign that said to and people did a lot.... small small town to where you can get a cwp from the town sheriff and only 2 bars...", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 06:20:00", 
        "title": "They took my guns!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave. I think your kidding on this, but the outlaws never turned them in anyway. All it boils down to is holding people accountable. If they commit a robbery with a gun then that should be treated in a manner in which that person does not see the light of day for a very long time. Not to mention cleaning up the joke of prison system we have, make it punishment like it should be.", 
        "intTime": 20090411, 
        "postID": 59, 
        "quote": "Originally posted by Fightdirector: Maybe we should put back into place the old Wyatt Earp/Dodge City policy: All firearms have to be turned in to the local police whenever you go into the city or town limits and picked up again when you leave.", 
        "reply": " I think your kidding on this, but the outlaws never turned them in anyway. All it boils down to is holding people accountable. If they commit a robbery with a gun then that should be treated in a manner in which that person does not see the light of day for a very long time. Not to mention cleaning up the joke of prison system we have, make it punishment like it should be.", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 06:28:00", 
        "title": "They took my guns!!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. and just why do they feel they have to do all of that? If it is dept policy then it is DUMB. A criminal is not going to say anything about the gun in the first place. My point was not about criminals, it was about how the Police do respect law abiding citizens rights to bear arms. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090411, 
        "postID": 60, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Hoffy1951: Why do you need a weapon, anyhoo? You're just a run-of-the-mill tax lawyer in the Tacoma area... If you need a weapon that bad...see my 3d cousin...he's a Sergeant with the PCSO and works at the City-County Building in Tacoma Why would I want to see your cousin? What would he know, he's a cop. Its ironic, the police are actually making us less safe by railing against gun rights...By denying our right to carry concealed weapons they are making us more vulnerable to horrible crimes... No crime = No over time Anytime I have been pulled over, I tell the officer I have a gun and it's loaded. I tell them where it is and all. They have ALWAYS been polite, yes they take it out, unload and and leave the upper reciever locked to the rear until they are done with their \"processing.\" Then they reload it the way I had it and thank me for disclosing the information. Then they let me go on my way. If you ask me, they seemed very satisfied with the way I handled the situation. and just why do they feel they have to do all of that? If it is dept policy then it is DUMB. A criminal is not going to say anything about the gun in the first place.", 
        "reply": " My point was not about criminals, it was about how the Police do respect law abiding citizens rights to bear arms. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_8310012022001", 
        "time": "2009-04-11 07:36:00", 
        "title": "They took my guns!!", 
        "userID": "L0A1"
    }
]