[
    {
        "content": "quote: Our president came bearing a basketful of mea culpas. With varying degrees of directness or obliqueness, Obama indicted his own people for arrogance, for dismissiveness and derisiveness, for genocide, for torture, for Hiroshima, for Guantanamo and for insufficient respect for the Muslim world. And what did he get for this obsessive denigration of his own country? He wanted more NATO combat troops in Afghanistan to match the surge of 17,000 Americans. He was rudely rebuffed. He wanted more stimulus spending from Europe. He got nothing. From Russia, he got no help on Iran. From China, he got the blocking of any action on North Korea. And what did he get for Guantanamo? France, pop. 64 million, will take one prisoner. One! (Sadly, he’ll have to leave his swim buddy behind.) The Austrians said they would take none. As Interior Minister Maria Fekter explained with impeccable Germanic logic, if they’re not dangerous, why not just keep them in America? When Austria is mocking you, you’re having a bad week. Yet who can blame Frau Fekter, considering the disdain Obama showed his own country while on foreign soil, acting the philosopher-king who hovers above the fray mediating between his renegade homeland and an otherwise warm and welcoming world? Me: I bet y'all didnt know Austrians speak Austrian. It must be true Obama said it quote: So The One retired triumphant, having secured a massive contribution of 5,000 extra troops - all of them non-combatant, of course - which must really have put the wind up the Taliban, at the prospect of 5,000 more infidel cooks and bottle-washers swarming into the less hazardous regions of Afghanistan. Then came the dramatic bit, the authentic West Wing script, with the President wakened in the middle of the night in Prague to be told that Kim Jong-il had just launched a Taepodong-2 missile. America had Aegis destroyers tracking the missile and could have shot it down. But Uncle Sam had a sterner reprisal in store for l’il ole Kim (as Dame Edna might call him): a multi-megaton strike of Obama hot air. … President Pantywaist is hopping mad and he has a strategy to cut Kim down to size: he is going to slice $1.4bn off America’s missile defence programme, presumably on the calculation that Kim would feel it unsporting to hit a sitting duck, so that will spoil his fun. Watch out, France and Co, there is a new surrender monkey on the block and, over the next four years, he will spectacularly sell out the interests of the West with every kind of liberal-delusionist initiative on nuclear disarmament and sitting down to negotiate with any power freak who wants to buy time to get a good ICBM fix on San Francisco, or wherever. If you thought the world was a tad unsafe with Dubya around, just wait until President Pantywaist gets into his stride. 'http://hotair.com/archives/2009/04/10/president-pantywaist/'", 
        "intTime": 20090410, 
        "postID": 1, 
        "quote": "Our president came bearing a basketful of mea culpas. With varying degrees of directness or obliqueness, Obama indicted his own people for arrogance, for dismissiveness and derisiveness, for genocide, for torture, for Hiroshima, for Guantanamo and for insufficient respect for the Muslim world. And what did he get for this obsessive denigration of his own country? He wanted more NATO combat troops in Afghanistan to match the surge of 17,000 Americans. He was rudely rebuffed. He wanted more stimulus spending from Europe. He got nothing. From Russia, he got no help on Iran. From China, he got the blocking of any action on North Korea. And what did he get for Guantanamo? France, pop. 64 million, will take one prisoner. One! (Sadly, he’ll have to leave his swim buddy behind.) The Austrians said they would take none. As Interior Minister Maria Fekter explained with impeccable Germanic logic, if they’re not dangerous, why not just keep them in America? When Austria is mocking you, you’re having a bad week. Yet who can blame Frau Fekter, considering the disdain Obama showed his own country while on foreign soil, acting the philosopher-king who hovers above the fray mediating between his renegade homeland and an otherwise warm and welcoming world?", 
        "reply": " Me: I bet y'all didnt know Austrians speak Austrian. It must be true Obama said it quote: So The One retired triumphant, having secured a massive contribution of 5,000 extra troops - all of them non-combatant, of course - which must really have put the wind up the Taliban, at the prospect of 5,000 more infidel cooks and bottle-washers swarming into the less hazardous regions of Afghanistan. Then came the dramatic bit, the authentic West Wing script, with the President wakened in the middle of the night in Prague to be told that Kim Jong-il had just launched a Taepodong-2 missile. America had Aegis destroyers tracking the missile and could have shot it down. But Uncle Sam had a sterner reprisal in store for l’il ole Kim (as Dame Edna might call him): a multi-megaton strike of Obama hot air. … President Pantywaist is hopping mad and he has a strategy to cut Kim down to size: he is going to slice $1.4bn off America’s missile defence programme, presumably on the calculation that Kim would feel it unsporting to hit a sitting duck, so that will spoil his fun. Watch out, France and Co, there is a new surrender monkey on the block and, over the next four years, he will spectacularly sell out the interests of the West with every kind of liberal-delusionist initiative on nuclear disarmament and sitting down to negotiate with any power freak who wants to buy time to get a good ICBM fix on San Francisco, or wherever. If you thought the world was a tad unsafe with Dubya around, just wait until President Pantywaist gets into his stride. 'http://hotair.com/archives/2009/04/10/president-pantywaist/'", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 10:43:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "'Bout sums it up nicely!", 
        "intTime": 20090410, 
        "postID": 2, 
        "quote": "", 
        "reply": "'Bout sums it up nicely!", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 10:47:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "navy8086"
    }, 
    {
        "content": "Just more change you can believe in!", 
        "intTime": 20090410, 
        "postID": 3, 
        "quote": "", 
        "reply": "Just more change you can believe in!", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 10:49:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Our president came bearing a basketful of mea culpas. With varying degrees of directness or obliqueness, Obama indicted his own people for arrogance, for dismissiveness and derisiveness, for genocide, for torture, for Hiroshima, for Guantanamo and for insufficient respect for the Muslim world. And what did he get for this obsessive denigration of his own country? He wanted more NATO combat troops in Afghanistan to match the surge of 17,000 Americans. He was rudely rebuffed. He wanted more stimulus spending from Europe. He got nothing. From Russia, he got no help on Iran. From China, he got the blocking of any action on North Korea. And what did he get for Guantanamo? France, pop. 64 million, will take one prisoner. One! (Sadly, he’ll have to leave his swim buddy behind.) The Austrians said they would take none. As Interior Minister Maria Fekter explained with impeccable Germanic logic, if they’re not dangerous, why not just keep them in America? When Austria is mocking you, you’re having a bad week. Yet who can blame Frau Fekter, considering the disdain Obama showed his own country while on foreign soil, acting the philosopher-king who hovers above the fray mediating between his renegade homeland and an otherwise warm and welcoming world? Me: I bet y'all didnt know Austrians speak Austrian. It must be true Obama said it quote: So The One retired triumphant, having secured a massive contribution of 5,000 extra troops - all of them non-combatant, of course - which must really have put the wind up the Taliban, at the prospect of 5,000 more infidel cooks and bottle-washers swarming into the less hazardous regions of Afghanistan. Then came the dramatic bit, the authentic West Wing script, with the President wakened in the middle of the night in Prague to be told that Kim Jong-il had just launched a Taepodong-2 missile. America had Aegis destroyers tracking the missile and could have shot it down. But Uncle Sam had a sterner reprisal in store for l’il ole Kim (as Dame Edna might call him): a multi-megaton strike of Obama hot air. … President Pantywaist is hopping mad and he has a strategy to cut Kim down to size: he is going to slice $1.4bn off America’s missile defence programme, presumably on the calculation that Kim would feel it unsporting to hit a sitting duck, so that will spoil his fun. Watch out, France and Co, there is a new surrender monkey on the block and, over the next four years, he will spectacularly sell out the interests of the West with every kind of liberal-delusionist initiative on nuclear disarmament and sitting down to negotiate with any power freak who wants to buy time to get a good ICBM fix on San Francisco, or wherever. If you thought the world was a tad unsafe with Dubya around, just wait until President Pantywaist gets into his stride. 'http://hotair.com/archives/2009/04/10/president-pantywaist/' NEWS FLASH!!! ATTN: DAILY PLANET, Perry White", 
        "intTime": 20090410, 
        "postID": 4, 
        "quote": "Originally posted by GunnyRet03: quote: Our president came bearing a basketful of mea culpas. With varying degrees of directness or obliqueness, Obama indicted his own people for arrogance, for dismissiveness and derisiveness, for genocide, for torture, for Hiroshima, for Guantanamo and for insufficient respect for the Muslim world. And what did he get for this obsessive denigration of his own country? He wanted more NATO combat troops in Afghanistan to match the surge of 17,000 Americans. He was rudely rebuffed. He wanted more stimulus spending from Europe. He got nothing. From Russia, he got no help on Iran. From China, he got the blocking of any action on North Korea. And what did he get for Guantanamo? France, pop. 64 million, will take one prisoner. One! (Sadly, he’ll have to leave his swim buddy behind.) The Austrians said they would take none. As Interior Minister Maria Fekter explained with impeccable Germanic logic, if they’re not dangerous, why not just keep them in America? When Austria is mocking you, you’re having a bad week. Yet who can blame Frau Fekter, considering the disdain Obama showed his own country while on foreign soil, acting the philosopher-king who hovers above the fray mediating between his renegade homeland and an otherwise warm and welcoming world? Me: I bet y'all didnt know Austrians speak Austrian. It must be true Obama said it quote: So The One retired triumphant, having secured a massive contribution of 5,000 extra troops - all of them non-combatant, of course - which must really have put the wind up the Taliban, at the prospect of 5,000 more infidel cooks and bottle-washers swarming into the less hazardous regions of Afghanistan. Then came the dramatic bit, the authentic West Wing script, with the President wakened in the middle of the night in Prague to be told that Kim Jong-il had just launched a Taepodong-2 missile. America had Aegis destroyers tracking the missile and could have shot it down. But Uncle Sam had a sterner reprisal in store for l’il ole Kim (as Dame Edna might call him): a multi-megaton strike of Obama hot air. … President Pantywaist is hopping mad and he has a strategy to cut Kim down to size: he is going to slice $1.4bn off America’s missile defence programme, presumably on the calculation that Kim would feel it unsporting to hit a sitting duck, so that will spoil his fun. Watch out, France and Co, there is a new surrender monkey on the block and, over the next four years, he will spectacularly sell out the interests of the West with every kind of liberal-delusionist initiative on nuclear disarmament and sitting down to negotiate with any power freak who wants to buy time to get a good ICBM fix on San Francisco, or wherever. If you thought the world was a tad unsafe with Dubya around, just wait until President Pantywaist gets into his stride. 'http://hotair.com/archives/2009/04/10/president-pantywaist/'", 
        "reply": " NEWS FLASH!!! ATTN: DAILY PLANET, Perry White", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 10:57:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Our president came bearing a basketful of mea culpas. With varying degrees of directness or obliqueness, Obama indicted his own people for arrogance, for dismissiveness and derisiveness, for genocide, for torture, for Hiroshima, for Guantanamo and for insufficient respect for the Muslim world. You will note him mentioning Hiroshima. Sounds like Wright did have influence on him. I guess Truman's a war criminal.", 
        "intTime": 20090410, 
        "postID": 5, 
        "quote": "Our president came bearing a basketful of mea culpas. With varying degrees of directness or obliqueness, Obama indicted his own people for arrogance, for dismissiveness and derisiveness, for genocide, for torture, for Hiroshima, for Guantanamo and for insufficient respect for the Muslim world.", 
        "reply": " You will note him mentioning Hiroshima. Sounds like Wright did have influence on him. I guess Truman's a war criminal.", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 11:00:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by GunnyRet03: NEWS FLASH!!! ATTN: DAILY PLANET, Perry White Right on cue! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090410, 
        "postID": 6, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by GunnyRet03: NEWS FLASH!!! ATTN: DAILY PLANET, Perry White", 
        "reply": " Right on cue! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 11:00:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "L0A1"
    }, 
    {
        "content": "From the UK Telegraph: quote: \"President Barack Obama has recently completed the most successful foreign policy tour since Napoleon's retreat from Moscow.\" The British press doing the job the American press won't do... \"The World's Finest\"", 
        "intTime": 20090410, 
        "postID": 7, 
        "quote": "\"President Barack Obama has recently completed the most successful foreign policy tour since Napoleon's retreat from Moscow.\"", 
        "reply": "From the UK Telegraph:  The British press doing the job the American press won't do... \"The World's Finest\"", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 11:02:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: quote: Originally posted by GunnyRet03: quote: Our president came bearing a basketful of mea culpas. With varying degrees of directness or obliqueness, Obama indicted his own people for arrogance, for dismissiveness and derisiveness, for genocide, for torture, for Hiroshima, for Guantanamo and for insufficient respect for the Muslim world. And what did he get for this obsessive denigration of his own country? He wanted more NATO combat troops in Afghanistan to match the surge of 17,000 Americans. He was rudely rebuffed. He wanted more stimulus spending from Europe. He got nothing. From Russia, he got no help on Iran. From China, he got the blocking of any action on North Korea. And what did he get for Guantanamo? France, pop. 64 million, will take one prisoner. One! (Sadly, he’ll have to leave his swim buddy behind.) The Austrians said they would take none. As Interior Minister Maria Fekter explained with impeccable Germanic logic, if they’re not dangerous, why not just keep them in America? When Austria is mocking you, you’re having a bad week. Yet who can blame Frau Fekter, considering the disdain Obama showed his own country while on foreign soil, acting the philosopher-king who hovers above the fray mediating between his renegade homeland and an otherwise warm and welcoming world? Me: I bet y'all didnt know Austrians speak Austrian. It must be true Obama said it quote: So The One retired triumphant, having secured a massive contribution of 5,000 extra troops - all of them non-combatant, of course - which must really have put the wind up the Taliban, at the prospect of 5,000 more infidel cooks and bottle-washers swarming into the less hazardous regions of Afghanistan. Then came the dramatic bit, the authentic West Wing script, with the President wakened in the middle of the night in Prague to be told that Kim Jong-il had just launched a Taepodong-2 missile. America had Aegis destroyers tracking the missile and could have shot it down. But Uncle Sam had a sterner reprisal in store for l’il ole Kim (as Dame Edna might call him): a multi-megaton strike of Obama hot air. … President Pantywaist is hopping mad and he has a strategy to cut Kim down to size: he is going to slice $1.4bn off America’s missile defence programme, presumably on the calculation that Kim would feel it unsporting to hit a sitting duck, so that will spoil his fun. Watch out, France and Co, there is a new surrender monkey on the block and, over the next four years, he will spectacularly sell out the interests of the West with every kind of liberal-delusionist initiative on nuclear disarmament and sitting down to negotiate with any power freak who wants to buy time to get a good ICBM fix on San Francisco, or wherever. If you thought the world was a tad unsafe with Dubya around, just wait until President Pantywaist gets into his stride. 'http://hotair.com/archives/2009/04/10/president-pantywaist/' NEWS FLASH!!! ATTN: DAILY PLANET, Perry White", 
        "intTime": 20090410, 
        "postID": 8, 
        "quote": "Originally posted by scottrj50: quote: Originally posted by GunnyRet03: quote: Our president came bearing a basketful of mea culpas. With varying degrees of directness or obliqueness, Obama indicted his own people for arrogance, for dismissiveness and derisiveness, for genocide, for torture, for Hiroshima, for Guantanamo and for insufficient respect for the Muslim world. And what did he get for this obsessive denigration of his own country? He wanted more NATO combat troops in Afghanistan to match the surge of 17,000 Americans. He was rudely rebuffed. He wanted more stimulus spending from Europe. He got nothing. From Russia, he got no help on Iran. From China, he got the blocking of any action on North Korea. And what did he get for Guantanamo? France, pop. 64 million, will take one prisoner. One! (Sadly, he’ll have to leave his swim buddy behind.) The Austrians said they would take none. As Interior Minister Maria Fekter explained with impeccable Germanic logic, if they’re not dangerous, why not just keep them in America? When Austria is mocking you, you’re having a bad week. Yet who can blame Frau Fekter, considering the disdain Obama showed his own country while on foreign soil, acting the philosopher-king who hovers above the fray mediating between his renegade homeland and an otherwise warm and welcoming world? Me: I bet y'all didnt know Austrians speak Austrian. It must be true Obama said it quote: So The One retired triumphant, having secured a massive contribution of 5,000 extra troops - all of them non-combatant, of course - which must really have put the wind up the Taliban, at the prospect of 5,000 more infidel cooks and bottle-washers swarming into the less hazardous regions of Afghanistan. Then came the dramatic bit, the authentic West Wing script, with the President wakened in the middle of the night in Prague to be told that Kim Jong-il had just launched a Taepodong-2 missile. America had Aegis destroyers tracking the missile and could have shot it down. But Uncle Sam had a sterner reprisal in store for l’il ole Kim (as Dame Edna might call him): a multi-megaton strike of Obama hot air. … President Pantywaist is hopping mad and he has a strategy to cut Kim down to size: he is going to slice $1.4bn off America’s missile defence programme, presumably on the calculation that Kim would feel it unsporting to hit a sitting duck, so that will spoil his fun. Watch out, France and Co, there is a new surrender monkey on the block and, over the next four years, he will spectacularly sell out the interests of the West with every kind of liberal-delusionist initiative on nuclear disarmament and sitting down to negotiate with any power freak who wants to buy time to get a good ICBM fix on San Francisco, or wherever. If you thought the world was a tad unsafe with Dubya around, just wait until President Pantywaist gets into his stride. 'http://hotair.com/archives/2009/04/10/president-pantywaist/' NEWS FLASH!!! ATTN: DAILY PLANET, Perry White", 
        "reply": "", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 11:05:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "scottrj50"
    }, 
    {
        "content": "You guys make it seem that if he had showed up and said, \"What up mutha****as, This is how the shiz is going down, don't like it? oh well\" and everything would have swung our way... I mean, when Bush was dictating to the world they lined up to support us in Iraq, and even if they didn't everyone in the US rallied behind him Lets say he had done the opposite of what he did, what would we have gained and from who??", 
        "intTime": 20090410, 
        "postID": 9, 
        "quote": "", 
        "reply": "You guys make it seem that if he had showed up and said, \"What up mutha****as, This is how the shiz is going down, don't like it? oh well\" and everything would have swung our way... I mean, when Bush was dictating to the world they lined up to support us in Iraq, and even if they didn't everyone in the US rallied behind him Lets say he had done the opposite of what he did, what would we have gained and from who??", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-10 11:09:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The results for this sojourn were indeed paltry. If this is an example of what his hyped advocacy for diplomacy shall provide us, we will be hurting from this administration. This leftist crap that dwells on appearances and niceness and good intentions doesn't mean much when it comes time to cut nuts and confront power politics in the world, since he is perceived to not be willing to stand tall and alone to do what's good for his own nation. The absurd, highly risky nonsense of cutting missile defense as Iran and NKorea develop missiles that can reach the US in the next few years is a prime example to other nations of the innate weakness of this administration.", 
        "intTime": 20090415, 
        "postID": 10, 
        "quote": "", 
        "reply": "The results for this sojourn were indeed paltry. If this is an example of what his hyped advocacy for diplomacy shall provide us, we will be hurting from this administration. This leftist crap that dwells on appearances and niceness and good intentions doesn't mean much when it comes time to cut nuts and confront power politics in the world, since he is perceived to not be willing to stand tall and alone to do what's good for his own nation. The absurd, highly risky nonsense of cutting missile defense as Iran and NKorea develop missiles that can reach the US in the next few years is a prime example to other nations of the innate weakness of this administration.", 
        "threadID": "409192893_4700073022001", 
        "time": "2009-04-15 15:25:00", 
        "title": "Analysis of Obamas 2nd world tour", 
        "userID": "RRR52"
    }
]