[
    {
        "content": "Fairly long and involved... +++http://online.wsj.com/article/SB123993446103128041.html By MICHAEL HAYDEN and MICHAEL B. MUKASEY The Obama administration has declassified and released opinions of the Justice Department's Office of Legal Counsel (OLC) given in 2005 and earlier that analyze the legality of interrogation techniques authorized for use by the CIA. Those techniques were applied only when expressly permitted by the director, and are described in these opinions in detail, along with their limits and the safeguards applied to them. AP 9/11 mastermind Khalid Sheikh Mohammed. The release of these opinions was unnecessary as a legal matter, and is unsound as a matter of policy. Its effect will be to invite the kind of institutional timidity and fear of recrimination that weakened intelligence gathering in the past, and that we came sorely to regret on Sept. 11, 2001. Proponents of the release have argued that the techniques have been abandoned and thus there is no point in keeping them secret any longer; that they were in any event ineffective; that their disclosure was somehow legally compelled; and that they cost us more in the coin of world opinion than they were worth. None of these claims survives scrutiny. Soon after he was sworn in, President Barack Obama signed an executive order that suspended use of these techniques and confined not only the military but all U.S. agencies -- including the CIA -- to the interrogation limits set in the Army Field Manual. This suspension was accompanied by a commitment to further study the interrogation program, and government personnel were cautioned that they could no longer rely on earlier opinions of the OLC. Although evidence shows that the Army Field Manual, which is available online, is already used by al Qaeda for training purposes, it was certainly the president's right to suspend use of any technique. However, public disclosure of the OLC opinions, and thus of the techniques themselves, assures that terrorists are now aware of the absolute limit of what the U.S. government could do to extract information from them, and can supplement their training accordingly and thus diminish the effectiveness of these techniques as they have the ones in the Army Field Manual. Moreover, disclosure of the details of the program pre-empts the study of the president's task force and assures that the suspension imposed by the president's executive order is effectively permanent. There would be little point in the president authorizing measures whose nature and precise limits have already been disclosed in detail to those whose resolve we hope to overcome. This conflicts with the sworn promise of the current director of the CIA, Leon Panetta, who testified in aid of securing Senate confirmation that if he thought he needed additional authority to conduct interrogation to get necessary information, he would seek it from the president. By allowing this disclosure, President Obama has tied not only his own hands but also the hands of any future administration faced with the prospect of attack. Disclosure of the techniques is likely to be met by faux outrage, and is perfectly packaged for media consumption. It will also incur the utter contempt of our enemies. Somehow, it seems unlikely that the people who beheaded Nicholas Berg and Daniel Pearl, and have tortured and slain other American captives, are likely to be shamed into giving up violence by the news that the U.S. will no longer interrupt the sleep cycle of captured terrorists even to help elicit intelligence that could save the lives of its citizens. Which brings us to the next of the justifications for disclosing and thus abandoning these measures: that they don't work anyway, and that those who are subjected to them will simply make up information in order to end their ordeal. This ignorant view of how interrogations are conducted is belied by both experience and common sense. If coercive interrogation had been administered to obtain confessions, one might understand the argument. Khalid Sheikh Mohammed (KSM), who organized the Sept. 11, 2001 attacks, among others, and who has boasted of having beheaded Daniel Pearl, could eventually have felt pressed to provide a false confession. But confessions aren't the point. Intelligence is. Interrogation is conducted by using such obvious approaches as asking questions whose correct answers are already known and only when truthful information is provided proceeding to what may not be known. Moreover, intelligence can be verified, correlated and used to get information from other detainees, and has been; none of this information is used in isolation. The terrorist Abu Zubaydah (sometimes derided as a low-level operative of questionable reliability, but who was in fact close to KSM and other senior al Qaeda leaders) disclosed some information voluntarily. But he was coerced into disclosing information that led to the capture of Ramzi bin al Shibh, another of the planners of Sept. 11, who in turn disclosed information which -- when combined with what was learned from Abu Zubaydah -- helped lead to the capture of KSM and other senior terrorists, and the disruption of follow-on plots aimed at both Europe and the U.S. Details of these successes, and the methods used to obtain them, were disclosed repeatedly in more than 30 congressional briefings and hearings beginning in 2002, and open to all members of the Intelligence Committees of both Houses of Congress beginning in September 2006. Any protestation of ignorance of those details, particularly by members of those committees, is pretense. The techniques themselves were used selectively against only a small number of hard-core prisoners who successfully resisted other forms of interrogation, and then only with the explicit authorization of the director of the CIA. Of the thousands of unlawful combatants captured by the U.S., fewer than 100 were detained and questioned in the CIA program. Of those, fewer than one-third were subjected to any of the techniques discussed in these opinions. As already disclosed by Director Hayden, as late as 2006, even with the growing success of other intelligence tools, fully half of the government's knowledge about the structure and activities of al Qaeda came from those interrogations. Nor was there any legal reason compelling such disclosure. To be sure, the American Civil Liberties Union has sued under the Freedom of Information Act to obtain copies of these and other memoranda, but the government until now has successfully resisted such lawsuits. Even when the government disclosed that three members of al Qaeda had been subjected to waterboarding but that the technique was no longer part of the CIA interrogation program, the court sustained the government's argument that the precise details of how it was done, including limits and safeguards, could remain classified against the possibility that some future president may authorize its use. Therefore, notwithstanding the suggestion that disclosure was somehow legally compelled, there was no legal impediment to the Justice Department making the same argument even with respect to any techniques that remained in the CIA program until last January. There is something of the self-fulfilling prophecy in the claim that our interrogation of some unlawful combatants beyond the limits set in the Army Field Manual has disgraced us before the world. Such a claim often conflates interrogation with the sadism engaged in by some soldiers at Abu Ghraib, an incident that had nothing whatever to do with intelligence gathering. The limits of the Army Field Manual are entirely appropriate for young soldiers, for the conditions in which they operate, for the detainees they routinely question, and for the kinds of tactically relevant information they pursue. Those limits are not appropriate, however, for more experienced people in controlled circumstances with high-value detainees. Indeed, the Army Field Manual was created with awareness that there was an alternative protocol for high-value detainees. In addition, there were those who believed that the U.S. deserved what it got on Sept. 11, 2001. Such people, and many who purport to speak for world opinion, were resourceful both before and after the Sept. 11 attacks in crafting reasons to resent America's role as a superpower. Recall also that the first World Trade Center bombing in 1993, the attacks on our embassies in Kenya and Tanzania, the punctiliously correct trials of defendants in connection with those incidents, and the bombing of the USS Cole took place long before the advent of CIA interrogations, the invasion of Saddam Hussein's Iraq, or the many other purported grievances asserted over the past eight years. The effect of this disclosure on the morale and effectiveness of many in the intelligence community is not hard to predict. Those charged with the responsibility of gathering potentially lifesaving information from unwilling captives are now told essentially that any legal opinion they get as to the lawfulness of their activity is only as durable as political fashion permits. Even with a seemingly binding opinion in hand, which future CIA operations personnel would take the risk? There would be no wink, no nod, no handshake that would convince them that legal guidance is durable. Any president who wants to apply such techniques without such a binding and durable legal opinion had better be prepared to apply them himself. Beyond that, anyone in government who seeks an opinion from the OLC as to the propriety of any action, or who authors an opinion for the OLC, is on notice henceforth that such a request for advice, and the advice itself, is now more likely than before to be subject after the fact to public and partisan criticism. It is hard to see how that will promote candor either from those who should be encouraged to ask for advice before they act, or from those who must give it. This message has been edited. Last edited by: <NEMESIS1960>, Fri 17 April 2009 05:23 AM", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": "Fairly long and involved... +++http://online.wsj.com/article/SB123993446103128041.html By MICHAEL HAYDEN and MICHAEL B. MUKASEY The Obama administration has declassified and released opinions of the Justice Department's Office of Legal Counsel (OLC) given in 2005 and earlier that analyze the legality of interrogation techniques authorized for use by the CIA. Those techniques were applied only when expressly permitted by the director, and are described in these opinions in detail, along with their limits and the safeguards applied to them. AP 9/11 mastermind Khalid Sheikh Mohammed. The release of these opinions was unnecessary as a legal matter, and is unsound as a matter of policy. Its effect will be to invite the kind of institutional timidity and fear of recrimination that weakened intelligence gathering in the past, and that we came sorely to regret on Sept. 11, 2001. Proponents of the release have argued that the techniques have been abandoned and thus there is no point in keeping them secret any longer; that they were in any event ineffective; that their disclosure was somehow legally compelled; and that they cost us more in the coin of world opinion than they were worth. None of these claims survives scrutiny. Soon after he was sworn in, President Barack Obama signed an executive order that suspended use of these techniques and confined not only the military but all U.S. agencies -- including the CIA -- to the interrogation limits set in the Army Field Manual. This suspension was accompanied by a commitment to further study the interrogation program, and government personnel were cautioned that they could no longer rely on earlier opinions of the OLC. Although evidence shows that the Army Field Manual, which is available online, is already used by al Qaeda for training purposes, it was certainly the president's right to suspend use of any technique. However, public disclosure of the OLC opinions, and thus of the techniques themselves, assures that terrorists are now aware of the absolute limit of what the U.S. government could do to extract information from them, and can supplement their training accordingly and thus diminish the effectiveness of these techniques as they have the ones in the Army Field Manual. Moreover, disclosure of the details of the program pre-empts the study of the president's task force and assures that the suspension imposed by the president's executive order is effectively permanent. There would be little point in the president authorizing measures whose nature and precise limits have already been disclosed in detail to those whose resolve we hope to overcome. This conflicts with the sworn promise of the current director of the CIA, Leon Panetta, who testified in aid of securing Senate confirmation that if he thought he needed additional authority to conduct interrogation to get necessary information, he would seek it from the president. By allowing this disclosure, President Obama has tied not only his own hands but also the hands of any future administration faced with the prospect of attack. Disclosure of the techniques is likely to be met by faux outrage, and is perfectly packaged for media consumption. It will also incur the utter contempt of our enemies. Somehow, it seems unlikely that the people who beheaded Nicholas Berg and Daniel Pearl, and have tortured and slain other American captives, are likely to be shamed into giving up violence by the news that the U.S. will no longer interrupt the sleep cycle of captured terrorists even to help elicit intelligence that could save the lives of its citizens. Which brings us to the next of the justifications for disclosing and thus abandoning these measures: that they don't work anyway, and that those who are subjected to them will simply make up information in order to end their ordeal. This ignorant view of how interrogations are conducted is belied by both experience and common sense. If coercive interrogation had been administered to obtain confessions, one might understand the argument. Khalid Sheikh Mohammed (KSM), who organized the Sept. 11, 2001 attacks, among others, and who has boasted of having beheaded Daniel Pearl, could eventually have felt pressed to provide a false confession. But confessions aren't the point. Intelligence is. Interrogation is conducted by using such obvious approaches as asking questions whose correct answers are already known and only when truthful information is provided proceeding to what may not be known. Moreover, intelligence can be verified, correlated and used to get information from other detainees, and has been; none of this information is used in isolation. The terrorist Abu Zubaydah (sometimes derided as a low-level operative of questionable reliability, but who was in fact close to KSM and other senior al Qaeda leaders) disclosed some information voluntarily. But he was coerced into disclosing information that led to the capture of Ramzi bin al Shibh, another of the planners of Sept. 11, who in turn disclosed information which -- when combined with what was learned from Abu Zubaydah -- helped lead to the capture of KSM and other senior terrorists, and the disruption of follow-on plots aimed at both Europe and the U.S. Details of these successes, and the methods used to obtain them, were disclosed repeatedly in more than 30 congressional briefings and hearings beginning in 2002, and open to all members of the Intelligence Committees of both Houses of Congress beginning in September 2006. Any protestation of ignorance of those details, particularly by members of those committees, is pretense. The techniques themselves were used selectively against only a small number of hard-core prisoners who successfully resisted other forms of interrogation, and then only with the explicit authorization of the director of the CIA. Of the thousands of unlawful combatants captured by the U.S., fewer than 100 were detained and questioned in the CIA program. Of those, fewer than one-third were subjected to any of the techniques discussed in these opinions. As already disclosed by Director Hayden, as late as 2006, even with the growing success of other intelligence tools, fully half of the government's knowledge about the structure and activities of al Qaeda came from those interrogations. Nor was there any legal reason compelling such disclosure. To be sure, the American Civil Liberties Union has sued under the Freedom of Information Act to obtain copies of these and other memoranda, but the government until now has successfully resisted such lawsuits. Even when the government disclosed that three members of al Qaeda had been subjected to waterboarding but that the technique was no longer part of the CIA interrogation program, the court sustained the government's argument that the precise details of how it was done, including limits and safeguards, could remain classified against the possibility that some future president may authorize its use. Therefore, notwithstanding the suggestion that disclosure was somehow legally compelled, there was no legal impediment to the Justice Department making the same argument even with respect to any techniques that remained in the CIA program until last January. There is something of the self-fulfilling prophecy in the claim that our interrogation of some unlawful combatants beyond the limits set in the Army Field Manual has disgraced us before the world. Such a claim often conflates interrogation with the sadism engaged in by some soldiers at Abu Ghraib, an incident that had nothing whatever to do with intelligence gathering. The limits of the Army Field Manual are entirely appropriate for young soldiers, for the conditions in which they operate, for the detainees they routinely question, and for the kinds of tactically relevant information they pursue. Those limits are not appropriate, however, for more experienced people in controlled circumstances with high-value detainees. Indeed, the Army Field Manual was created with awareness that there was an alternative protocol for high-value detainees. In addition, there were those who believed that the U.S. deserved what it got on Sept. 11, 2001. Such people, and many who purport to speak for world opinion, were resourceful both before and after the Sept. 11 attacks in crafting reasons to resent America's role as a superpower. Recall also that the first World Trade Center bombing in 1993, the attacks on our embassies in Kenya and Tanzania, the punctiliously correct trials of defendants in connection with those incidents, and the bombing of the USS Cole took place long before the advent of CIA interrogations, the invasion of Saddam Hussein's Iraq, or the many other purported grievances asserted over the past eight years. The effect of this disclosure on the morale and effectiveness of many in the intelligence community is not hard to predict. Those charged with the responsibility of gathering potentially lifesaving information from unwilling captives are now told essentially that any legal opinion they get as to the lawfulness of their activity is only as durable as political fashion permits. Even with a seemingly binding opinion in hand, which future CIA operations personnel would take the risk? There would be no wink, no nod, no handshake that would convince them that legal guidance is durable. Any president who wants to apply such techniques without such a binding and durable legal opinion had better be prepared to apply them himself. Beyond that, anyone in government who seeks an opinion from the OLC as to the propriety of any action, or who authors an opinion for the OLC, is on notice henceforth that such a request for advice, and the advice itself, is now more likely than before to be subject after the fact to public and partisan criticism. It is hard to see how that will promote candor either from those who should be encouraged to ask for advice before they act, or from those who must give it. This message has been edited. Last edited by: <NEMESIS1960>, Fri 17 April 2009 05:23 AM", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 04:00:00", 
        "title": "Obama keeping us safe...", 
        "userID": "threerings"
    }, 
    {
        "content": "Yeah, the Adm can release top secret material but wouldnt release their own memos.", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yeah, the Adm can release top secret material but wouldnt release their own memos.", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 06:10:00", 
        "title": "Obama keeping us safe...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Yeah, the Adm can release top secret material but wouldnt release their own memos. Which memos?", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "Originally posted by GunnyRet03: Yeah, the Adm can release top secret material but wouldnt release their own memos.", 
        "reply": " Which memos?", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 06:22:00", 
        "title": "Obama keeping us safe...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Yeah, the Adm can release top secret material but wouldnt release their own memos. dems have been doing that for the whole time we were at war.. the first i seen was way back in 03 from nytime spying supertramps was the name of the article...it was about how we have spies who pose as homeless people...the article was pulled with in a week... but just one of the many examples..", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "Originally posted by GunnyRet03: Yeah, the Adm can release top secret material but wouldnt release their own memos.", 
        "reply": " dems have been doing that for the whole time we were at war.. the first i seen was way back in 03 from nytime spying supertramps was the name of the article...it was about how we have spies who pose as homeless people...the article was pulled with in a week... but just one of the many examples..", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 07:55:00", 
        "title": "Obama keeping us safe...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "yea thats stuff saddam use to use...a blow torch.... we dont do that... saddam did tho... alqueda does everyone but us do\\did ....", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "", 
        "reply": "yea thats stuff saddam use to use...a blow torch.... we dont do that... saddam did tho... alqueda does everyone but us do\\did ....", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 08:54:00", 
        "title": "Obama keeping us safe...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Just change the name from \"torture\" to \"Freedom Tickles\" and everyone can be happy.", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "", 
        "reply": "Just change the name from \"torture\" to \"Freedom Tickles\" and everyone can be happy.", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 09:00:00", 
        "title": "Obama keeping us safe...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Yeah, the Adm can release top secret material but wouldnt release their own memos. Or release items such as BHO's birth certificate BHO's health records BHO's college transcripts Michelle's \"doctoral thesis\" Yup, REAL FREAKIN' TRANSPARENCY..... Unless it's a National Secret, (which according to this President, is A O.K. to release, as long as it makes us look bad) Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: Yeah, the Adm can release top secret material but wouldnt release their own memos.", 
        "reply": " Or release items such as BHO's birth certificate BHO's health records BHO's college transcripts Michelle's \"doctoral thesis\" Yup, REAL FREAKIN' TRANSPARENCY..... Unless it's a National Secret, (which according to this President, is A O.K. to release, as long as it makes us look bad) Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 11:38:00", 
        "title": "Obama keeping us safe...", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: RINGS YOU CANT POST THE ENTIRE ARTICLE DUE TO COPY RIGHT. Thanks...I could swear I was told TO do so... Wont happen again.", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "Originally posted by NEMESIS1960: RINGS YOU CANT POST THE ENTIRE ARTICLE DUE TO COPY RIGHT.", 
        "reply": " Thanks...I could swear I was told TO do so... Wont happen again.", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 11:40:00", 
        "title": "Obama keeping us safe...", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: release top secret They don't release top secret material. They released material that was previously deemed top secret and is no longer. Every administration in resent memory has done that. To the topic: Our safety is not a function nor dependent of our use of torcher as an interrogation technique. Depends on how you define it..", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "Originally posted by dmuhler: quote: release top secret They don't release top secret material. They released material that was previously deemed top secret and is no longer. Every administration in resent memory has done that. To the topic: Our safety is not a function nor dependent of our use of torcher as an interrogation technique.", 
        "reply": " Depends on how you define it..", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 11:42:00", 
        "title": "Obama keeping us safe...", 
        "userID": "threerings"
    }, 
    {
        "content": "What torture? Slaps to the head, loud noises, insects, waterboarding, standing..... Torture? As a Marine told me, that sounds like a typical day in Parris Island. It is insane how some people consider those activities torture. Some clowns really do want lawyers to be present for these interrogations don't they?", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "", 
        "reply": "What torture? Slaps to the head, loud noises, insects, waterboarding, standing..... Torture? As a Marine told me, that sounds like a typical day in Parris Island. It is insane how some people consider those activities torture. Some clowns really do want lawyers to be present for these interrogations don't they?", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 12:55:00", 
        "title": "Obama keeping us safe...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Which is another reason why elections do matter", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "", 
        "reply": "Which is another reason why elections do matter", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-17 21:46:00", 
        "title": "Obama keeping us safe...", 
        "userID": "ACR26"
    }, 
    {
        "content": "...besides they outlawed my zippo", 
        "intTime": 20090420, 
        "postID": 12, 
        "quote": "", 
        "reply": "...besides they outlawed my zippo", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-20 19:21:00", 
        "title": "Obama keeping us safe...", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "if obama can release top secret material, detramental to the security of this country, why can't he release his birth certificate?", 
        "intTime": 20090421, 
        "postID": 13, 
        "quote": "", 
        "reply": "if obama can release top secret material, detramental to the security of this country, why can't he release his birth certificate?", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-21 05:15:00", 
        "title": "Obama keeping us safe...", 
        "userID": "blane"
    }, 
    {
        "content": "In a PIGS EYE, he is.", 
        "intTime": 20090421, 
        "postID": 14, 
        "quote": "", 
        "reply": "In a PIGS EYE, he is.", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-21 05:29:00", 
        "title": "Obama keeping us safe...", 
        "userID": "Migbuster"
    }, 
    {
        "content": "I feel safer with Obama in the Whitehouse. He appologized to just about everyone. They don't hate us anymore.", 
        "intTime": 20090421, 
        "postID": 15, 
        "quote": "", 
        "reply": "I feel safer with Obama in the Whitehouse. He appologized to just about everyone. They don't hate us anymore.", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-21 05:56:00", 
        "title": "Obama keeping us safe...", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: I feel safer with Obama in the Whitehouse. He appologized to just about everyone. They don't hate us anymore. And not having countries hate is is a bad thing right?", 
        "intTime": 20090421, 
        "postID": 16, 
        "quote": "Originally posted by bill_kananen: I feel safer with Obama in the Whitehouse. He appologized to just about everyone. They don't hate us anymore.", 
        "reply": " And not having countries hate is is a bad thing right?", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-21 06:04:00", 
        "title": "Obama keeping us safe...", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "No, that's a good thing. They won't attack us anymore.", 
        "intTime": 20090421, 
        "postID": 17, 
        "quote": "", 
        "reply": "No, that's a good thing. They won't attack us anymore.", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-21 06:15:00", 
        "title": "Obama keeping us safe...", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: I feel safer with Obama in the Whitehouse. He appologized to just about everyone. They don't hate us anymore. Yup. I could just feel the waves of brotherly and sisterly luv flooding the planet. It is so noble of Obama, to gaily flirt with the scumbags who despise the US and will always do so. The minute they start to like the US, you KNOW that we have lost the freedom of the Constitution and that we can no longer provide the stability for many people of the world as we have in times past. So Carteresque!", 
        "intTime": 20090421, 
        "postID": 18, 
        "quote": "Originally posted by bill_kananen: I feel safer with Obama in the Whitehouse. He appologized to just about everyone. They don't hate us anymore.", 
        "reply": " Yup. I could just feel the waves of brotherly and sisterly luv flooding the planet. It is so noble of Obama, to gaily flirt with the scumbags who despise the US and will always do so. The minute they start to like the US, you KNOW that we have lost the freedom of the Constitution and that we can no longer provide the stability for many people of the world as we have in times past. So Carteresque!", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-21 07:37:00", 
        "title": "Obama keeping us safe...", 
        "userID": "RRR52"
    }, 
    {
        "content": "Obama keeping us safe???? hahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahhahahahahahahahaha. I darn near fell off my chair laughing so hard...hahahahahahahahahahahahahahahahahahahahaha.", 
        "intTime": 20090421, 
        "postID": 19, 
        "quote": "", 
        "reply": "Obama keeping us safe???? hahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahhahahahahahahahaha. I darn near fell off my chair laughing so hard...hahahahahahahahahahahahahahahahahahahahaha.", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-21 11:15:00", 
        "title": "Obama keeping us safe...", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: I feel safer with Obama in the Whitehouse. He appologized to just about everyone. They don't hate us anymore. all part of that \"One World Government\" thing he likes. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 20, 
        "quote": "Originally posted by bill_kananen: I feel safer with Obama in the Whitehouse. He appologized to just about everyone. They don't hate us anymore.", 
        "reply": " all part of that \"One World Government\" thing he likes. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_1810000122001", 
        "time": "2009-04-21 11:52:00", 
        "title": "Obama keeping us safe...", 
        "userID": "m551sheridan"
    }
]